[
    {
        "title": "中有成就秘笈 (中有闻教得度释义)",
        "author": "元音老人",
        "date": "2014-11-29",
        "html": "<div class=\"B1_text\">\n<p>　　中有成就秘笈 (中有闻教得度释义)</p>\n<p>　　<a href=\"/fjrw/jsrw/yylr/\" class=\"keylink\" target=\"_blank\">元音老人</a>述</p>\n<p>　　第一部分、绪说</p>\n<p>　　一、翻译缘起</p>\n<p>　　二、卷头语</p>\n<p>　　第二部分、正文</p>\n<p>　　一、颇哇法</p>\n<p>　　二、诵法须知</p>\n<p>　　三、诵法实施</p>\n<p>　　四、行法须知</p>\n<p>　　五、行法实施</p>\n<p>　　结归</p>\n<p>　　附编：汉文咒音表</p>\n<p>　　◎第一部分 绪说</p>\n<p>　　今天，有无上胜缘，和诸上善人共同研究<a href=\"/remen/fofa.html\" class=\"keylink\" target=\"_blank\">佛法</a>。诸位切莫看轻自己，因为一切<a href=\"/remen/zhongsheng.html\" class=\"keylink\" target=\"_blank\">众生</a>均具如来<a href=\"/remen/zhihui.html\" class=\"keylink\" target=\"_blank\">智慧</a>德相，只要我们<a href=\"/remen/faxin.html\" class=\"keylink\" target=\"_blank\">发心</a>、修法，知道<a href=\"/remen/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>一切相都是假的，都不可得，不去追求，回心向善，自度度他，就是大菩萨。我们平常说：‘人身难得，佛法难闻。’是呀，试看六合之内、宇宙之中的芸芸众生，得人身者能有多少啊？！胎、卵、湿、化四生不知道有多少，就像大地的土那么多，得人身者只如一指甲里的土，真是少得可怜；可那些昆虫、蚂蚁遍地都是，还有我们平常喂鱼的鱼虫，用网一兜不知道有多少。所以说‘人身难得’真是不错！而既得人身又能听到佛法的人有多少呢？那就更少了。整个世界这么多人，没有多少人能听到佛法，即或能听到佛法，而能听到大乘了义的经文就更少了；听到大乘佛法而又能发心实修，<a href=\"/remen/zhengde.html\" class=\"keylink\" target=\"_blank\">证得</a>本性的又更少了！大部分信佛者只是接触佛法的边缘，烧<a href=\"/remen/shaoxiang.html\" class=\"keylink\" target=\"_blank\">烧香</a>，拜<a href=\"/remen/baifo.html\" class=\"keylink\" target=\"_blank\">拜佛</a>，求点<a href=\"/remen/fubao.html\" class=\"keylink\" target=\"_blank\">福报</a>，种点善根，只能作为将来修法成道的资粮。真正能了解佛法的真义，又能按之实修的，真是凤毛麟角了。今天我们讲的这部《中有教授听闻<a href=\"/remen/jietuo.html\" class=\"keylink\" target=\"_blank\">解脱</a>密法》，是密教中的密中密，是不轻传的秘密法宝，是不需要经过<a href=\"/remen/xiuxing.html\" class=\"keylink\" target=\"_blank\">修行</a>就能成就的大法。一般<a href=\"/remen/jingtuzong.html\" class=\"keylink\" target=\"_blank\">净土宗</a>、<a href=\"/remen/chanzong.html\" class=\"keylink\" target=\"_blank\">禅宗</a>、<a href=\"/remen/mizong.html\" class=\"keylink\" target=\"_blank\">密宗</a>，都要经过修禅观、<a href=\"/remen/dazuo.html\" class=\"keylink\" target=\"_blank\">打坐</a>、入定才能把<a href=\"/remen/wangxiang.html\" class=\"keylink\" target=\"_blank\">妄想</a>歇下来，打开本来亲见<a href=\"/remen/foxing.html\" class=\"keylink\" target=\"_blank\">佛性</a>，而这部法，不需要这样修行，你只要懂得<a href=\"/remen/chengfo.html\" class=\"keylink\" target=\"_blank\">成佛</a>了<a href=\"/remen/shengsi.html\" class=\"keylink\" target=\"_blank\">生死</a>是怎么一回事，得到这个秘诀之后，到<a href=\"/remen/linzhong.html\" class=\"keylink\" target=\"_blank\">临终</a>时就可以解脱了。所以这是密中密的无上大法。</p>\n<p>　　我们今天能有幸听到这个法，真是多生历劫所种善根得的福报。在未讲此法之前，我们先看看‘翻译缘起’和‘卷头语’。了解一下这个法的流传经过和修习本法所必需具备的基本知识，我们明白之后，就会知道它的珍贵之处。</p>\n<p>　　中有成就秘笈</p>\n<p>　　一、翻译缘起</p>\n<p>　　(一)</p>\n<p>　　我们大家活在这个世上，天天有<a href=\"/remen/rensheng.html\" class=\"keylink\" target=\"_blank\">人生</a>，天天有人死。长寿者一百多岁，短寿者十几年，还有的生下来就死了。人的一生一世，虽有些长短不同，但都是一转眼就过去了。那么，人生从什么地方来？死了又到什么地方去了呢？大家都不知道。所以生死是个大事！佛就为这个大事<a href=\"/remen/yinyuan1.html\" class=\"keylink\" target=\"_blank\">因缘</a>出生于世，指点我们的迷津。让我们知道生从何来，死往何去，打破这个迷闷的疑团，打破这个哑谜。</p>\n<p>　　没有智慧的人，他也不知生从何处来，死到何处去。他既不管，也不会去研究这个问题。他以为生到这个世上来，就是穿衣吃饭、娶妻生子的，就这样糊里糊涂的混过了一生。从前梁启超曾就这个问题问大家：‘人生到这个世上来究竟是为什么？’是叫你来穿衣吃饭的吗？难道这个世上的饭太多衣太多，没人吃无人穿，叫你来吃来穿的吗？可见不是！是要你来娶妻生子繁衍后代吗？要是只为娶妻生子的话，那等于粪坑里的蛆一样，又有什么意义！显然不是那么一回事。那究竟是为什么呢？但愚者无知，也不知研究。就这么从梦中来，到梦中去。糊里糊涂转眼几十岁、乃至一百岁，人生一世就这样昏昏沉沉地混过去了。</p>\n<p>　　在我们人类，想研究人生宇宙真理，打破这生死迷团的人，确是少数。大部分人只知道升官发财、赚钞票、娶老婆、<a href=\"/remen/shenghuo.html\" class=\"keylink\" target=\"_blank\">生活</a>过得舒服一点；能享受，就满足了。从不知研究人生宇宙的真理和人生于世的价值所在！有智慧的人就不甘迷闷，要研究研究我们人究竟是从什么地方来的？死了又到什么地方去？这个宇宙又是怎样形成的？他要得出一个正确的答案，所以就产生了哲学。古今中外很多杰出之士纷纷研究这个世界、人生的由来。但是他们费尽心机、竭尽脑力，得不到一个真实正确的答案。有的说<a href=\"/remen/weixin.html\" class=\"keylink\" target=\"_blank\">唯心</a>，有的说唯物；有的说一元，有的说二元。但究竟是怎么一回事？得不到真实的结论。只有<a href=\"/remen/fotuo.html\" class=\"keylink\" target=\"_blank\">佛陀</a>能指点迷津，能打破这个哑谜，能正确地告诉我们人生宇宙之由来。今天我们能听到这大乘了义的<a href=\"/\" class=\"keylink\" target=\"_blank\">佛教</a>秘密经典，真是无上的福报。这个福报不是世间的洪福可比的，所谓洪福，就是地位高一些，收入多一些，生活得舒服一些。但是你生活得再好，也离不了生、老、病、死。到时还是赤裸裸地去了。钞票再多，一分钱也带不走。只有研究佛法之后，明白了这个真理，明白了人究竟是怎么一回事，从而脱出这生死的圈套，这才是了义的大福报。</p>\n<p>　　很多聪明人在做学问上走不通，得不到答案时，就在<a href=\"/remen/zongjiao.html\" class=\"keylink\" target=\"_blank\">宗教</a>上来研究，看看是不是能得到一个真实的答案。‘人究竟是从什么地方来的？’不同的宗教<a href=\"/remen/shuofa.html\" class=\"keylink\" target=\"_blank\">说法</a>各别。基督教说：‘是上帝创造的。’伊斯兰教说：‘是真主创造的’。但是要真正再深究一下，上帝创造了我们大家，那么上帝又是谁创造的呢？就无法解答了。所以，只有佛法说的透彻，不是谁创造谁。佛法告诉我们：无始以来就有这个佛性(无始就是没有开头)。这个佛性是什么呢？就是我们见闻觉知的能量，就是我们见闻觉知的性能。我们以六根(眼、耳、鼻、舌、身、意)对六尘(色、声、香、味、触、法)，根尘相对，就起知觉。所以眼见色、耳闻声、鼻嗅香臭、舌尝味道、身体就是对外边环境的触觉、第六<a href=\"/remen/yishi.html\" class=\"keylink\" target=\"_blank\">意识</a>大脑就起知觉和分别。所以说意属知、身属觉、眼属见、耳属闻、鼻属嗅、舌属尝，这些就是见闻觉知的性能。这就是我们的本性。这个本性人们看不见，就以为没有。其实这个性能就像电，我们把电线接好，电灯泡装好，开关一开，灯就亮了。但这个电看不见，我们的大脑神经就像电线一样，靠这个性能来起作用。假如我们一口气不来，就是气断了，大脑神经还在，但它却不能起作用了。所以禅宗人在修法的时候就参：‘<a href=\"/remen/nianfo.html\" class=\"keylink\" target=\"_blank\">念佛</a>是谁？’，这个佛究竟是谁念的呢？是你念的，把什么东西称作你呢？把身体称作你还是把思想称作你？这个身体不是你，因为身体只是你住的房子。佛性一走，离开身体以后，你的身体就不会念了。那么，思想也不是你，因为思想是外界客观环境在人脑中的反映。没有外界的客观环境，就没这个思想了。身体不是，思想也不是，那么究竟是谁呢？把这个话头在心里思索，就起了疑情，就把你的<a href=\"/remen/wangnian.html\" class=\"keylink\" target=\"_blank\">妄念</a>割断了。就在能所双亡的时候，回光自见，就看到这个<a href=\"/remen/wuxiang.html\" class=\"keylink\" target=\"_blank\">无相</a>的佛性。这个佛性虽然是无相，但是它有功能。还是有啊！所以我们研究来研究去还是佛法讲的是真理。为什么呢？因为它必须经过实证，才得真实受用。我们做功夫做到妄想断了，妄念绝了，即前念已断，后念未起的真空时，它一丝不挂，一尘不染，但是了了分明，非同木石。这个‘了了分明’的是什么？这就是我们的知觉性，就是我们无所不能的性能！也就是大家时刻想念明心见性的佛性呀！我们如果在这上面著眼，明悟了，体会了，再能在境上锻炼，顺境不喜，<a href=\"/remen/nijing.html\" class=\"keylink\" target=\"_blank\">逆境</a>不恼，对境无粘染、爱嗔、取舍之情，就叫‘开悟’！因佛法有办法叫我们打开迷团，亲自见到这人生宇宙的本性，所以佛法是人生唯一正确的指南。</p>\n<p>　　佛教是无神论者，和其它宗教讲的不同。佛教不讲上帝或神来创造、支配我们，而是自己支配自己，自己创造自己，所以叫‘一切唯心造’。而其它宗教都有个至高无上的真神或真主来支配你。有不明白的人说：‘佛教不是说人死了之后有十殿阎罗吗？由阎罗王来判决你，那不就是由阎罗王来支配、发落你了吗？’不是！那是误会了。实际上是我们自己支配自己。造善业的有善报，到好的地方去。造恶业的，就要受恶报，到坏苦的地方去。并不是阎罗王来支配你。阎罗王就等于我们的公安局。比如我们没做犯法的事情，公安局能来干预我们吗？假如你做了犯罪的事情，公安局就对你不客气，要来抓你判刑了。所以一切都是自己支配自己，不是谁来支配你的。我们说造十善就生天，贪嗔痴具足造恶就下<a href=\"/remen/diyu.html\" class=\"keylink\" target=\"_blank\">地狱</a>。都是你自己造的。十法界就是一心。十法界是指四圣六凡(四圣：即佛、菩萨、辟支佛、罗汉；六凡：即<a href=\"/remen/tianren.html\" class=\"keylink\" target=\"_blank\">天人</a>、人、修罗、地狱、饿鬼、畜牲)。这十法界都是我们一心创造的。佛教讲的‘<a href=\"/remen/yinguo.html\" class=\"keylink\" target=\"_blank\">因果</a><a href=\"/remen/lunhui.html\" class=\"keylink\" target=\"_blank\">轮回</a>’就是告诉我们：要懂得‘种瓜得瓜，种豆得豆’的因果律，要怕受<a href=\"/remen/guobao.html\" class=\"keylink\" target=\"_blank\">果报</a>，首先在因地上不要造业。凡夫是不怕造因，只怕受果。菩萨是只怕造因。他不造因，就不会受果。比如我们现在做了犯法的事情，就造了恶因，那就一定要吃官司，受审判坐监牢。我们没有干坏事，就不会受这个恶果了。凡夫不是这样，他只怕受果，不怕造因，为了达到他享受的目的，不择手段造恶业，所以社会上就有许多犯法的事情。于是就有了《刑法》、《民法》等等的法律制裁手段。实际上人们就是因为执著这个色身为我，才要尽情享受。尤其现在这个世界，科学昌明，物质丰富，有很多的享受，而人的物欲高涨、欲壑难填，有了这样，还要那样，都是高消费。自己没有这个收入，就免不了要做犯法的事情。因此社会上犯法的事件层出不穷，皆由于此。由于我们错误地认这个色身为我，于是就产生了造业的因，生出了妄情。又因为这个虚妄的情见，就随情造业，随业受报，生死轮回，无有了期。可见佛教讲的‘因果轮回’是颠扑不破的真理。与科学家研究出来的‘因果律’一样，是真实可信颠扑不破的。</p>\n<p>　　佛教讲的‘<a href=\"/remen/wuchang.html\" class=\"keylink\" target=\"_blank\">无常</a>迅速’，就是告诉我们，人生如朝露，短暂得很。活一百岁，看是长寿了，其实一眨眼就过去了。比如我们现在都几十岁了，回想当初，就好像刚发生一样，几十年一下就过去了。所以快的很。佛看我们就好像朝生暮死一样。我们这里一百年，在天人看来，只是一会儿工夫。假如我们在兜率天，那里的一天，就是我们这里的三百多年。我们这里一个人能活四百岁吗？假如有，也很少，不过在他们看来，也只有一天哪！人生苦短，很快就要走了，我们该怎么办呢？不好好用功修法，以期了生脱死，对得住自己来这个世上走一遭吗？！佛讲的种种警策的话，都是给我们敲警钟，让我们赶快用功，不要错过这难得的人生！因此，不要再执著这个色身，这个色身不是我们自己，它只不过是我们住的房子，真人是我们的佛性。佛性就是我们刚才讲的见闻觉知的性能。要保护这个性能不被客尘<a href=\"/remen/fannao.html\" class=\"keylink\" target=\"_blank\">烦恼</a>所粘染。客尘烦恼，就是我们刚才讲的‘色、声、香、味、触、法’。‘客尘’就等于是灰尘，它不是主人，所以叫客。我们粘在上面，要享受，要达到满足欲望的目的而不择手段，那就坏了。所以佛教就是要我们明白‘因果轮回’、‘无常迅速’的道理，从而改造人生，做一个真实的人，做一个符合人格的人，更由此而超越人成佛。人生是不久长的，须赶快<a href=\"/remen/fangxia.html\" class=\"keylink\" target=\"_blank\">放下</a>来，不要追逐物境，让我们回归原来的一丝不挂、净裸裸、赤洒洒的净境，以免枉受生死轮回之苦。我们现在都是颠倒妄想而不<a href=\"/remen/zijue.html\" class=\"keylink\" target=\"_blank\">自觉</a>。佛在腊月初八，夜睹明星悟道之后说：‘奇哉！奇哉！一切众生都具如来智慧德相’。为什么不自见呢？都是因为妄想颠倒执著之故而迷盖了本来。我们现在都是在妄想、颠倒、执著之中。佛警策我们要一切放下，等于当头敲我们一棒，叫我们赶快梦醒。</p>\n<p>　　我们人一生的过程，就是连续不断的苦。所谓生、老、病、死、苦，生下来的苦大家可能忘记了。试看小孩生出来都是‘哇’的一声哭叫著，没有哈哈笑的。为什么没有笑的呢？因为他在母胎的时候，都是暖烘烘的，皮肤很嫩，不接触外境。一出娘胎，冷空气一刺激他，像针戳一样的痛。他在母胎里本来是头朝上的，要生出来的时候，头要先下来，翻一个颠倒，从母亲的骨盆里挤出来，像在两座大山的夹缝中挤出来一样，孩子很<a href=\"/remen/tongku.html\" class=\"keylink\" target=\"_blank\">痛苦</a>，所以都是哭著出来。小孩苦，大人也是苦。在产房里母亲也都叫啊，痛得要死。老了也是苦，眼睛花了，看不见了；耳朵聋了，听不清了；牙齿落了，吃东西咬不动了。身体老化，精力衰颓，要依靠别人来扶侍，就不自由，不<a href=\"/remen/zizai.html\" class=\"keylink\" target=\"_blank\">自在</a>了。一旦生了病，就更苦了。大家都知道生个小小的牙病都疼得不得了。俗语说：‘牙痛不是病，疼起来要性命！’何况是别的大病呢？要是生了<a href=\"/remen/aizheng.html\" class=\"keylink\" target=\"_blank\">癌症</a>什么的，那就更痛得不得了了！我曾看到一个生癌症的人，最后痛的满床滚，所以病是人生最苦的事。讲到死，那就更苦了。死的时候是四大分散，犹如生龟剥壳，苦不堪言。我们人的身体，是以地、水、火、风四大相聚而成的。死的时候，先是地大分散。地大分散时，像泰山压到身上一样，沉重气闷得透不出气来，因之家人搬他都搬不动；水大分散像整个人浸到水里面一样，潮湿得难受；火大分散时人浑身发烧，临死的人两个颧骨都烧得通红，这是火大分散的征兆；风大分散就更苦了，犹如大风把地皮一层层吹掉了一样，病人的感觉就像用刀把皮肉一层层削掉一样的痛苦，到后来呼吸要断时，只有出气，没有进气，而且有一口海底痰闷在喉咙里，使呼吸不得，最后这口痰一落就断气了，痛苦的很。所以人的一生，生、老、病、死都很苦啊！当然，我们还有其它的苦，什么‘求不得苦’、‘爱别离苦’、‘怨憎会苦’等等，就不去讲它了。</p>\n<p>　　孙景风<a href=\"/fjrw/jsrw/\" class=\"keylink\" target=\"_blank\">居士</a>说：‘有些人专为怖畏生死而<a href=\"/remen/xuefo.html\" class=\"keylink\" target=\"_blank\">学佛</a>的。又有一类发大心学佛的人，体会到<a href=\"/remen/liudao.html\" class=\"keylink\" target=\"_blank\">六道</a>众生，都是我过去的父母，沉沦<a href=\"/remen/kuhai.html\" class=\"keylink\" target=\"_blank\">苦海</a>，头出头没，无有出期。因而要依大乘教义，<a href=\"/remen/wuwo.html\" class=\"keylink\" target=\"_blank\">无我</a>精神，由观无常，了生死，进一步发现四无量心，学<a href=\"/remen/liudu.html\" class=\"keylink\" target=\"_blank\">六度</a>万行，行<a href=\"/remen/pusadao.html\" class=\"keylink\" target=\"_blank\">菩萨道</a>，愿众生都成佛，’(见原文三十四页)。这里就讲到我们发心学佛，是有种种不同的原因。有的是害怕生死来学佛的，现在活著将来死的时候要痛苦，死了以后要到什么地方去呢？也不知道，还是来学佛吧，找个归宿。比如现在修<a href=\"/remen/jingtu.html\" class=\"keylink\" target=\"_blank\">净土</a>宗，将来可以<a href=\"/remen/wangsheng.html\" class=\"keylink\" target=\"_blank\">往生</a>到西方<a href=\"/remen/jileshijie.html\" class=\"keylink\" target=\"_blank\">极乐世界</a>。有的人是为了救度众生而发心的。所以，佛教有五乘的区别：第一是凡夫乘，他只知道做好事，不做坏事，也不想了生死，也不知道怎样了生死。比如庙里面初一、十五烧香拜佛的人很多，他们没有真正了解佛法是怎么一回事，也不知道了生死，只沾了点佛法的边，这就叫凡夫乘，也叫人天乘。第二就是罗汉乘，有的人是专为自己了生死而修行的，知道生死可怖，无常迅速，为赶快脱离六道轮回而发心修行，这就是罗汉乘。第三是辟支佛乘(或缘觉乘)，与罗汉一样，只顾自了，但比罗汉聪明，见微知著，从因悟果，所以他们修的法是<a href=\"/remen/shieryinyuan.html\" class=\"keylink\" target=\"_blank\">十二因缘</a>，不像罗汉修<a href=\"/remen/sidi.html\" class=\"keylink\" target=\"_blank\">四谛</a>法门由果究因。他们在无佛出世时，见花开花落即悟空苦无常而证道，所以较罗汉略胜一筹。第四就是菩萨乘，是为救度众生而发心修行的，因看到世间大众都是生、老、病、死、苦，为使大众都能解脱，先发心自己修行，自己先解脱出来，然后再救大众。比如有人掉到黄浦江里，你想救他，可自己又不会游泳，怎么救？所以要先学会游泳，再学会救生术。光会游泳不会救生术还不行，你救他的时候，他会把你拚命抱住，你自己就游不动了。是故佛法有六度万行，就是讲怎样救度众生的，让人知道度人的方法。先自度再度他，这就是菩萨乘。第五是佛乘，明白一切众生都有这个无漏智性，和佛无二无别。同释迦牟尼佛、药师佛、阿弥陀佛等都一样没有分别。我们只因妄想执著，误认色身为我，不知道这个知觉性就是我们的法身。现在应赶快回头，一切放下，恢复自己本有的智慧德相，圆成<a href=\"/remen/foguo.html\" class=\"keylink\" target=\"_blank\">佛果</a>，这就是佛乘。所谓佛教有五乘区别，实则都是一心所造，就是由于大家发心程度不同，佛教才分为五乘。</p>\n<p>　　佛教育我们只有一真法界—佛性是真，其它一切都是虚假，都是无常的。我们住的这个地球也不例外，它在成、住、坏、空四个劫中轮回生灭。成、住、坏、空各是一个中劫，一个中劫合二十个小劫而成。四个中劫为一个大劫，一个大劫一过，地球就要坏了。科学家也说，将来地球要和别的行星相撞，发生大火被烧毁。<a href=\"/fojing/\" class=\"keylink\" target=\"_blank\">佛经</a>也讲到是大火烧坏地球。现在就不去讲它了。总而言之，一切无常，无可执取。所以学佛就是‘观无常’，也就是叫我们一切放下，不要执著，根本没有长久的、真实的东西。我们生在这个世界上，长寿者一百多岁，转眼就过去了，何况长寿并不多见，又何必斤斤计较于声、色、货、利，而不宽恕对人呢？！比如我们乘汽车，被别人踫一下就吵起来了。人家不是有意踫你的，不要这么斤斤计较。我见报上有一段记载，很发人深思：一位体育记者去国外彩访，因为走路走的太急，不小心，一脚踩在一位外国老者的脚上。这位外国老者反过来向他道歉：‘对不起、对不起，是我走的慢，阻碍了你，假如我走快点，你就踩不著我的脚了。’这位记者直觉得脸红。因为是他踩了别人，人家反而向他道歉。看！人家有这么高的修养。假如我们都有这样的精神，这个社会就安宁了，就不会发生争吵了。学佛就是教育我们做个符合人格的人，更向上，做个超人，大家都有高尚的情操，时时处处都能退己让人。这样社会安宁，国家富强，世界也不会发生战争了。所以佛教对整个世界都是有好处的。因此，时时刻刻要观我无常，我们都是到这个世界上来做客的。诗人李白说：‘夫天地者，万物之逆旅；光阴者，百代之过客。’天地是个大旅馆，我们不过在里面住一下就要离去了，为什么不讲礼貌，执著不放，不宽待别人呢？！所以学佛要退己让人，把自己的一切执著、贪、嗔、痴、慢、疑消尽，才能成道。我们之所以有贪心，就是因为误认色身为我，要享受，想长寿。秦始皇当了皇帝之后，想长寿，永远享受做皇帝的乐趣，派人觅仙丹，正是贪心的幻现。现在社会不安宁，贪污、贿赂风盛，也是贪心在作崇。我们假如醒悟了一切皆幻，不可得，还贪什么？还是尽一己之力，为大众谋福利，积点德吧。俗语说的好：‘留万金于子，不如积德贻子一经。’这是告诫后人留金钱给子孙不好，不如教诫后人造福积德好。如我们知道一切虚幻无常就不贪取执著了，不执著就放下了，放下就心空了，心空本性就现前了，也就了生死了。这是很简单的道理。懂得这个道理很容易，但做起来就不那么简单了。因为执著的习气太深了！让你放，你放不下来。所以我们时时刻刻要学习锻炼，与自己作斗争，才能慢慢地将这执著的旧习渐渐消尽。</p>\n<p>　　<a href=\"/foxue/zhishi/74029.html\" class=\"keylink\" target=\"_blank\">大乘佛教</a>的四弘誓愿就是：法门无量誓愿学；烦恼无尽誓愿断；众生无边誓愿度；佛道无上誓愿成。要发这四弘誓愿，时时刻刻、兢兢业业的督促自己用功。不只是为自了。六度万行就是施、戒、忍、精、禅、慧。</p>\n<p>　　第一个就是<a href=\"/remen/bushi.html\" class=\"keylink\" target=\"_blank\">布施</a>。为什么要修布施呢？就是要断掉我们的吝啬心，执著心。我们都执著吝啬得很，不肯舍。肯舍那么心量就大了。</p>\n<p>　　第二是持戒，是指戒心不动。如果你心常常在动，妄念丛生就不行。</p>\n<p>　　第三是忍辱，并不是说我们要发火了，硬压制自己把这股火气捺下去。不是！那样肝火旺会生病的。那怎么办呢？要观空，一切都不可得，连‘我’也没有。既无我，那有辱呢？没有我谁来受这个污辱？如此观察，即如《<a href=\"/fojing/jingangjing/39210.html\" class=\"keylink\" target=\"_blank\">金刚经</a>》所说：‘无我相、无人相、无众生相、无寿者相’。无人、我，辱从何来？既无辱又何须忍呢？不忍之忍，是为大忍。因为一切都没有，一切色相都是因缘合成。‘因缘所生法，我说即是空’。因为一切事物本身没有，都是因缘相聚之后才有的。所以就不要再著相了，不著相，那么你心就空了，心空了辱也就没有了。</p>\n<p>　　第四，是要<a href=\"/remen/jingjin.html\" class=\"keylink\" target=\"_blank\">精进</a>。修法、学佛就是要精进。如何精进呢？就是勤除自己的妄习。所以净土宗一天要念几万遍<a href=\"/remen/fohao.html\" class=\"keylink\" target=\"_blank\">佛号</a>。就是为扫除我们的妄想、妄念。因为我们妄想不停，妄念多端。一天到晚妄念在脑筋里转，没有停的时候。只有坐下来念佛的时候才看见妄念。这个念头起了，那个念头来了。当你忙忙碌碌的时候，看不见妄念，还以为没有妄念。实际是妄念不停，你没有看见。这就犹如一杯浑水，浑的时候，你看不见泥沙，待泥沙沉淀下去，上面水清了，才能看见泥沙。所以，当我们妄念、妄心清静下来，才能看见妄念在不停的动。我们打坐，念佛看见妄念是好事。因为心逐渐清静了。有人说他打坐时看见妄念不好，还是不打坐好。不打坐看不见妄念，看不见妄念他以为就没有。不是！妄念永远不会息，不会停。所以我们做功夫要精进不懈，朝于斯，夕于斯，流离于斯，颠沛于斯。时时刻刻观照，念头一起就看见它，不跟它跑。我们果真能这样精进不懈地做功夫，不过三、五年，就能打开来，见到自己的本性。有人修行许多年也不行，这是什么缘故？就是时时刻刻还在动念头，没有看住它，没有精进。假如时时刻刻看住它，只要三、五年就一定会把念头歇下来，一定会把身、心、世界化空，再经不断地在事境中锻炼，勤除习气，最后定能打成一片。肯定的！所以我们说修<a href=\"/remen/xinzhongxinfa.html\" class=\"keylink\" target=\"_blank\">心中心法</a>的人，要时时刻刻打坐。并不是打坐两小时后，下坐就放野马，任妄念蠢动，而须绵密观照，看住妄念不跟它跑。‘打坐’打什么？打是打妄念，要看见念头起处不跟它走，坐就是见本性。要时时刻刻见本性才行。这个性能如影随形，要离也离不开。傅大士说：‘夜夜抱佛眠，朝朝还共起。’夜夜睡觉是抱著佛，早上也是抱著佛一起起来。说明<a href=\"/remen/zixing.html\" class=\"keylink\" target=\"_blank\">自性</a>离不开啊！只要我们真肯用功，精进不懈，三、五年保你们成就。假如不是这么精进，有修无修的，高兴的时候打一坐，不高兴的时候，就不坐了。或者打坐时胡思乱想，一面念佛持咒，一面脑筋里妄念不停地转，那有何用？！我们打坐，必须死心塌地的放下一切，如大死人一样，只‘心念耳闻’地绵密持咒，才有入处。心念，不是嘴巴念，而是大脑思想在念。耳朵要听清楚你<a href=\"/fozhou/\" class=\"keylink\" target=\"_blank\">念咒</a>念佛的声音。要盯住这个声音。憨山大师说：‘我们念佛持咒时，要像推重车上山，极力追顶’。推重车上山，不是轻车下山！推轻车下山，你不用费力气，‘呼’就滚下去了。车子装上很重的东西要往山上推，你不用力气能推上去吗？推不上去呀！所以念佛持咒，要像推重车上山一样用力顶。光是两个小时打坐不算数，下坐要时时观照，念起不随，三、五年保你见性。如果你们这样用功不成就，你来骂我！这句话也不是我说的，是大祖师们讲的。是经过实践证明的。</p>\n<p>　　第五是<a href=\"/remen/chanding.html\" class=\"keylink\" target=\"_blank\">禅定</a>。因精进不懈之故而得禅定。禅定是指对一切境界不迷惑，心不动摇，看见好的不爱，不是看见好的，心就‘呼呼’乱动，想得到它，据为己有。看见不好的，逆己的事情就烦恼。心真空了，就常摄在定，遇事不惑了。说到定并不是坐在那里死了不动，更不是不能担任大事，而须照常的讲话，照样的工作，照样的走路。只是虽做一切而心不动摇。等于镜子照东西一样。镜子里面显现各种影相，但镜子不动。镜子没有说这个好我要，那个不好我不要。镜子它不分别，只是照物，什么东西来了就照什么。东西是长的就现长相，是短的就现短相，是方的就现方相，是红的就现红色，是蓝的就现蓝色，它不取不舍，毫无分别，这就叫‘<a href=\"/remen/xianliang.html\" class=\"keylink\" target=\"_blank\">现量</a>境’。这个现量境，就是我们的本来面目！大家修行，都为了要见性，要见本来面目。这尊贵的性—本来面目究竟在什么地方呢？它不在别处，就在当人面前放光。我们只‘啪’！一切放下，虽一念不生，而非如木石无知，而是了了分明。这了了分明的灵知，就是大家的本来面目啊！！我们于明见此性后，须时时刻刻保护这个本来面目，在荣誉或毁谤面前不动心，不理睬它，保护这个现量心。等保护纯熟了、<a href=\"/remen/yuanman.html\" class=\"keylink\" target=\"_blank\">圆满</a>了，就不要保了，任它<a href=\"/remen/suiyuan.html\" class=\"keylink\" target=\"_blank\">随缘</a>自在，就成就大道了。所以，佛法讲起来并不难，只要我们肯做，肯放下一切，不懈地与自己斗争下去，必定能成就。</p>\n<p>　　第六个就是慧。就是指由禅定而开的大智慧，明白一切事物的前因后果，明白一切众生生来死去的由来。讲到生死，我们本来不生不灭，没有生死，为什么现在生死偏偏不断地现前呢？这都是<a href=\"/remen/shixin.html\" class=\"keylink\" target=\"_blank\">识心</a>妄动的缘故。假如我们能对境不生心动念，不趣境，就无生死，所以生死是虚幻的。现在许多修佛法的人，执著死时要有个去处，还要预知去处。其实我们真悟道了，是没有去处的，因为我们未曾死，只随遇而安，随缘度生，逍遥自在，游戏<a href=\"/remen/sanmei.html\" class=\"keylink\" target=\"_blank\">三昧</a>，用何去处！有人说：‘你假如开悟了，应该知道死后到什么地方去，叫预知去处。假如不知去处，那就是没有悟道’。这句话听起来好像非常正确，其实还须好好商量。因为真正悟道了，佛性是遍<a href=\"/remen/xukong.html\" class=\"keylink\" target=\"_blank\">虚空</a>，周法界，不动不摇，无有来去，事事都是它的显现，处处都是它的幻化。要到什么地方去呢？没有地方可去啊！假如有个地方去，岂不是未曾悟道吗？</p>\n<p>　　在本书的后面讲到有两种成就：一种是在死位中有放大光时，如能认识这个光和佛放的光，一体无二，没有两样，这就是我们的本性，那我们当下就解脱了，不需要到什么地方去。另一种是我们心量小，不敢承当，不知道这就是佛性，这就是和诸佛一样的体性，那你可以往生东方或西方去修持，因未悟道还有地方可去。我们真正悟道成就了，是毋须到什么地方去的。</p>\n<p>　　关于<a href=\"/remen/niepan.html\" class=\"keylink\" target=\"_blank\">涅槃</a>有四种不同的说法。第一种是自性涅槃，我们的佛性本来是不生不灭的，不是因身体生而生，因身体死而死。一切众生的自性，法尔如是，本不生灭，亘古长存，叫自性涅槃。第二种是小乘人所证的有余涅槃，就是他们只了分段生死(分段生死就是六道轮回的生死，变易生死就是思想的一生一灭)，法见未除，还有尾巴未了。还执著法性的地、水、火、风四大种性为我，思想还没净，还有生死，所以叫有余涅槃。第三种是佛所证的圣果，叫无余涅槃。既除了人<a href=\"/remen/wozhi.html\" class=\"keylink\" target=\"_blank\">我执</a>，又除了法我见，人、法双空，无一毫可得。这种人、法都了，二死齐捐，变易生死，分段生死都了了，就是无余涅槃。第四种是无所住处涅槃。无所住处，就没有住的地方。无处不是，处处都是。所以释迦牟尼佛离开的时候说：‘我没有离开你们，我常在你们面前，眼清净的人就看见我了。眼浑浊的人是看不见的’。我们还有烦恼执著，就是眼不清净。假如烦恼执著都了了，妄念不生，就是清净<a href=\"/remen/fayan.html\" class=\"keylink\" target=\"_blank\">法眼</a>，处处都能见佛。所以我们不要执著于有个方所，有个地方，这才是开大智慧。大智慧云涌，这就是六度万行。</p>\n<p>　　我们要成佛，一定要行菩萨道，广度众生，积累福德，才能圆满圣果。不然，福德不全，功行不满，不能成佛。行菩萨道就是自度度他，自觉觉他。‘<a href=\"/remen/puti.html\" class=\"keylink\" target=\"_blank\">菩提</a>萨埵’是梵文，简称为‘菩萨’。中文意译就是‘觉有情’。就是要把自己的情见觉破，并使有情人都能<a href=\"/remen/juewu.html\" class=\"keylink\" target=\"_blank\">觉悟</a>。我们人都有情见，自己的父母、<a href=\"/remen/zinv.html\" class=\"keylink\" target=\"_blank\">子女</a>，就尊重爱护。别人的父母、子女就不睬不顾了，这都是私情作怪。尤其是男女<a href=\"/remen/aiqing.html\" class=\"keylink\" target=\"_blank\">爱情</a>，更是生死的根本。我们人为什么有这个身体？就是因为爱欲，即男女的情欲浓厚，才有这个臭皮囊的。这个爱欲不断，生死就不断。‘觉有情’即自觉觉他，自度度他，这就是菩萨道。光成菩萨道还不行，还要历劫修行，向上升进，愿众生都成佛，才能圆证佛果。菩萨里面还有很多等级。十信、十住、十行、十<a href=\"/remen/huixiang.html\" class=\"keylink\" target=\"_blank\">回向</a>、十地等等。大菩萨—十地菩萨和佛还差一级。作个比方，度众生时，菩萨还有出没六道之见，还有进彼道、出此道之见未断。佛呢？是尽管出入而未出入，尽管度尽众生而未度。佛与大菩萨就相差这么一点。所以觉行圆满即福德智慧圆满是佛，故又称佛为‘两足尊’，两足即福德、智慧圆满具足。觉就是大智慧，行就是救度众生的福德，觉、行都圆满才能成佛。</p>\n<p>　　佛是具足三身四智的。所谓三身者，第一是法身，第二是报身，第三是<a href=\"/remen/huashen.html\" class=\"keylink\" target=\"_blank\">化身</a>。现在我们所修的，都是修法身，就是要打开我们的本来面目，见到法身，所以净土宗也好，禅宗也好，密宗也好，都是为证见法身修行。报身要怎样证得呢？证得报身叫后得智，就是要度众生积累<a href=\"/remen/gongde.html\" class=\"keylink\" target=\"_blank\">功德</a>。我们现在打开本来面目，见到法身，这是根本智，根本如此。后得智就是度众生而得的。众生习性不同，就比如有人喜欢吃辣的，有人喜欢吃甜的，有人喜欢吃酸的，口味不同。同样学佛也有凡夫禅、小乘禅、菩萨禅、大乘禅等种种的不同。众生根性不同，愿望也不同。那么学的法也不同。度众生的时候，我们把这一切法门都学会了，就能应机随缘，就能得心应手而不致格格不入了。因广结善缘，尽做好事，我们福德圆满就感得报身了。假如不为众生做事情，我们的福德从何而来呢？不为人类造福，光为自己，那是自了汉，没有福德。谚云：‘罗汉供应薄’，光为自己了，是不能成佛的。所以报身是因地发心，福德圆满后得的果报。《<a href=\"/fojing/huayanjing/yuanwen.html\" class=\"keylink\" target=\"_blank\">华严经</a>》说得很清楚，善财童子看见<a href=\"/remen/mile.html\" class=\"keylink\" target=\"_blank\">弥勒</a>菩萨(就是我们说的兜率天的弥勒菩萨)的报身时感叹：多么<a href=\"/remen/zhuangyan.html\" class=\"keylink\" target=\"_blank\">庄严</a>，多么美好！弥勒菩萨对善财童子讲：‘你根本智是得到了，后得智还没有得到，报身还没有。我呢？就是度众生的缘故，才福德圆满，感召弥勒阁，感召这个光明报身‘。报身也有两种，一种是自受用报身，一种是他受用报身。自受用报身就是功德巍巍所感得的大身，他受用报身就是吸引菩萨向上用功的，大小不一定，小菩萨现小报身，大菩萨现大报身。菩萨看到这光明美满的报身，会激发勇猛精进心，更加努力用功，以希早日也证到这美好的报身。以前，释迦牟尼佛看见另外一尊佛，入光明三昧叫火光三昧，身相好得不得了，非常羡慕，心想，我也要有这个报身！他精进用功，不懈的努力，于是提前七劫成就。所以，一个人成佛时间的长短，不是一个定数。我们说‘三大阿僧祗’劫成佛，这个阿僧祗，就是不可知之时，时间长短不是一定的，就看我们怎么做功夫，我们用功勇猛精进，时间就短，如果懈<a href=\"/remen/xiedai.html\" class=\"keylink\" target=\"_blank\">懈怠</a>怠，因因循循，时间就长。最好的例子就是阿难尊者，他和释迦牟尼佛是同时发心学佛的，等到释迦牟尼佛已经成了果地佛了，阿难尊者还未开悟呢！你们看相差多大。《<a href=\"/fojing/lengyanjing/quanwen.html\" class=\"keylink\" target=\"_blank\">楞严经</a>》就是度阿难的。可见成就早晚，就看我们怎么用功，懈懈怠怠的不行！阿难尊者是多闻第一，他只喜欢听这个佛如何讲，那个佛如何讲，听了很多很多，他知识很丰富，但没有用功，所以不行。我们要勇猛用功，勇猛精进时间就短了。要证得报身，要得后得智，就要度众生，不然只成个罗汉果，不得报身。化身呢？化身圆满自在，变化无碍，是应众生之机缘而显现的，就像《<a href=\"/fojing/pumenpin/yuanwen.html\" class=\"keylink\" target=\"_blank\">观世音菩萨普门品</a>》里所说：‘应以居士身得而度者，即现居士身而为说法；应以宰官身得度者，即现宰官身而为说法’。如何证得化身呢？就是功夫要做到微细流注断灭，什么叫微细流注呢？就是<a href=\"/remen/faxiang.html\" class=\"keylink\" target=\"_blank\">法相</a>宗所说的五遍行心所(就是作意、触、受、想、思)中的意，即作意。这个作意最坏，时刻在分别，什么事情它都要分别，而且它像潜水员一样，在深水底下动，不在上面动，看不见，动得快的很，要到我们最后做到金刚萨埵定，也就是大定，才能把这个微细流注斩断。那我们就能现百千万亿化身，度百千万亿众生了。要圆成佛果，就是要成就这三身。‘四智’呢？就是由<a href=\"/remen/bashi.html\" class=\"keylink\" target=\"_blank\">八识</a>转的，叫转识成智，即转第八识为大圆镜智，转第七识为平等性智，转<a href=\"/remen/diliushi.html\" class=\"keylink\" target=\"_blank\">第六识</a>为妙观察智，转前五识为成所作智。八识转为四智，要分四步：就是‘六、七因中转，八、五果上圆’。我们现在在事境中做断除习气的功夫，就是转六识、七识。转第六识就是把我们的分别心，转成不分别而只观察的心。我们生来就喜欢分别，这个怎么样？那个怎么样？好的要，坏的就不要，人我是非太多，一天到晚都在分别当中生活，所以妄念纷飞，生死不了。第七识是传送室，等于我们单位的门房，把六识送来的信息都传到第八识里去。第八识是储藏识，等于我们的仓库，接受第七识的信息，把它藏到里面。第八识的种子多得不得了，多生历劫的种子都在里面。要把这些种子都断掉，这可不容易，要到十地菩萨才能断光。所以我们要加紧做功夫。‘六、七因中转’，就是现在因地修行时须著力转换，才能进而转八、五识，圆成佛果。也就是说，第八识和前五识要到后来才能转成大圆镜智而圆证佛果。现在一切众生的第八识是昏啊，它什么东西都要，不论好坏，它都抓住不放。到大圆镜智时，它就只照不动了，就不要了。前五识就是眼、耳、鼻、舌、身。它是对外的。我们平常说：‘兄弟八个一个痴’，第八识是痴，不管好坏它都接受。‘五个门前做买卖’，就是我们的眼、耳、鼻、舌、身。眼贪色，耳闻声，鼻嗅香，舌尝味，身触境，都是对外的。‘一个往来传消息’就是第七识，接受前面六识传给它的信息，送往第八识里藏起来。‘其中一个最灵利’就是第六识，势力最强。所以要圆成三身四智才能成佛，不是一悟道就成了，还差得远呢！要好好用功才行。</p>\n<p>　　佛教的根本是大乘教义，不是小乘教。小乘教是为自己，大乘教是为大家。‘愿众生先我成佛’，是大心菩萨。你们大家都先成佛，我最后成佛。就要这样发心。现在的人不是这样想，别说成佛了，就是一点小利益，都争先恐后往前抢，哎哟！我第一个，我第一个，排队我站第一个，他要捷足先登，这就是凡夫心。所以学<a href=\"/remen/foxin.html\" class=\"keylink\" target=\"_blank\">佛心</a>量要大，越大越先成佛。要发大心，才合乎佛教为法为人的精神。</p>\n<p>　　前面这些道理，都是佛教徒容易知道的，但是生死问题如何解决呢？学佛从何处下手呢？使很多学佛人都感到茫然。有一些老太公、老太太只知道念佛烧香，对这个问题并不知道。还有一些人用功打坐得到点境界和消息，去向某些大师请教，大师说：‘抱歉，我不知道，不敢瞎说’。他不敢讲，因为他自己未修法，没有功夫，怎么知道生死问题如何解决呢？实际上佛教把这些道理讲的很清楚。一个是竖出<a href=\"/remen/sanjie.html\" class=\"keylink\" target=\"_blank\">三界</a>(欲界、<a href=\"/remen/sejie.html\" class=\"keylink\" target=\"_blank\">色界</a>、<a href=\"/remen/wusejie.html\" class=\"keylink\" target=\"_blank\">无色界</a>)，就是通过学禅、学密，把我们执著的习气，贪、嗔、痴都消了，就出去了。一个是横超三界，就是学净土宗—念佛。求佛慈悲接引往生西方极乐世界。所以很多人学禅、学净、学密等，这些人知道从何处入手，但对于成佛有什么把握？他们没有深入理解佛教的深懊道理，当然就不知道了。至于有没有把握，其实是有办法测验的，就是两头取证：一个是顺境得意头，一切都顺当符合自己心意的时候；另一个是逆境烦恼头，任何事情都不遂心，处处倒霉、失败。顺境时，心能不动，不喜而忘形，还是佛念当前；逆境烦恼时，也不忧忿难当，仍是佛念当前。这两样能做到，念佛人临命终时，往生西方就有十足把握。假如处顺境就得意忘形，忘乎所以，佛号一点也提不起，只知道开心、快活；处逆境烦恼时，又是痛苦不堪，提不起佛号，那么生西就没有把握了。可能有人会问：‘恐怕不对吧！我们死后中阴身出来，佛要接引我们的，不是就有把握了吗？’唉！要知道佛是不说谎话、假话、不打<a href=\"/remen/wangyu.html\" class=\"keylink\" target=\"_blank\">妄语</a>的。佛是一定要来接引我们的。但是由于我们颠倒烦恼执著的缘故，就像喝醉了老酒，昏昏迷迷的，佛来接引我们，我们却看不见，那我们怎么去呢？所以<a href=\"/fjrw/hcrw/lcds/\" class=\"keylink\" target=\"_blank\">莲池大师</a>说：‘念佛者多，生西者少’。莲池大师是净土宗的大德，他是不会说谎话吓人的。为什么‘念佛者多，生西者少’呢？就是念佛心不痛切故。嘴上念佛，脑筋、思想却在不断地乱转，想这想那，我们看见很多老太太、老太公一面念佛，一面还在说张家长，李家短，这样念佛能起什么作用？没有一心念佛，思想还很乱。所以，释迦牟尼佛教导我们：执持名号，若一日、若二日乃至七日，一心不乱，彼佛现前。我们若能一心不乱，就看见佛现在我们面前了，我们心乱糟糟的，佛即使来了也看不见哪！永明寿禅师说得很清楚：‘念佛人的心，好比一盆水，佛就等于天上的月亮。水清净了，月亮就现在里面了。我们心乱，即如这盆水浑浊，月亮就现不出来。我们也看不见佛。佛是无所从来，亦无所从去的，只不过在我们心中现出形像叫如来。净土宗的行人，净业成熟，快要往生时，佛就在他心中现起形像，我们念阿弥陀佛，佛就在西方现形应我们，故名<a href=\"/remen/ganying.html\" class=\"keylink\" target=\"_blank\">感应</a>道交。说到佛现像接引众生也有等级，因为功夫不同，所见相就不同。所以往生西方分九品。下品人只能见到化身佛，中品人看见报身佛，上品人才能见到法身佛，也就是常寂光佛。</p>\n<p>　　修法、了生死，有三种实证功夫。第一种我们真能做到念起不随，念头一起就化去，毫不停滞，就像水上画图一样，在水上一划，水就合拢了。没有一点影子，没有一点痕迹。如鸟过长空，无有行迹，就能于生死岸头得自在，要到那里就能到那里，不为业力所支配，就是受生自在。第二种，我们能够于前面讲过的两种境界，好的一头，坏的一头，都是平平常常，一点也不波动。我们的心没有好的喜欢，不好的就烦恼，那么分段生死就了了。所以说，<a href=\"/remen/canchan.html\" class=\"keylink\" target=\"_blank\">参禅</a>刚开悟的人分段生死并没有了。为什么呢？因为习气重，还未消除，心还不能不逐境生情，教下说为思惑未除，分段生死未了，所以净土宗的人批评禅宗，说禅宗人虽然开悟了，但分段生死未了，不如净土稳妥，即是这思惑未断之故。教下将粗分无明为见惑与思惑。思惑就是思想对境而生心；见惑就是知见。认识了什么是正路，什么是邪路；什么是真，什么是妄，再不走错路，再不颠倒执著，就是见惑断了。见惑容易断，思惑难断哪！人的习气总是见到好的爱，见到坏的就厌恶、烦恼，心不平衡，总在妄动，住执难舍，所以生死不能了，还是要在六道中轮回，出不了生死。做到第一种，念起不随，就能做到受生自在。‘受生’，就是投胎能作主了，要到那里就到那里，要到西方就到西方，要到东方就到东方，不受业力的牵缠，自己能作主了。做到第二种，心不随境牵，即能变化自在，了脱生死了。第三种是微细流注断灭，一切化空，唯有圆觉大智现前，就能现百千万亿化身，度百千万亿众生了。这就是一切用功人修法证道的真实验证。我们修心中心法和参禅一样，都是从第八识下手，在心地上用功。这和其它密法不同，所以称为禅密，只和禅宗同一鼻孔出气，但在入手修法时略有不同。心密是用六个手印一个咒打开本来，然后再用禅宗的保任方法，勤除习气，时时观心，处处觉照，而与禅合辙。一俟观照圆熟，证成寂而常照，照而常寂，归家稳坐，就不用觉，不要观了。这方是做一切功夫的真正最后把握。这样的功夫，讲起来容易，要真正做到，还是要费点力气的。不费点力气你也做不到。说到做不到，只懂理，事上做不到，没有用处。所以在修法的途程上，分事法界、理法界、理事无碍法界和事事无碍法界四个不同的过程。事事无碍法界，就是任何事情都无妨碍，不管那里都能去得，还要更进一步，连事事无碍的意境也不立！这样才是真正的禅和子，真正的明心见性者。这就是解决生死问题的根本，成佛的关键！</p>\n<p>　　(二)</p>\n<p>　　前面我们讲了，成佛了生死不外有两种方法：一种是竖出三界，一种是横超三界。三界就是指欲界、色界和无色界。</p>\n<p>　　欲界就是指有淫欲心的世界。主要包括：天人、修罗、人、畜牲、饿鬼、地狱这六道，欲界众生有<a href=\"/remen/shengming.html\" class=\"keylink\" target=\"_blank\">生命</a>，有肉体就是因为有淫欲心。中阴身(就是我们平常说的灵魂)看见男女同房，淫欲心起充当了第三者(谈恋爱也有第三者，不过这儿是指中阴身)。因为中阴身是以风大为主，同房的男女看不见，在男子射精时就把中阴身冲进女子的子宫里，于是他就投胎了。所以要了生死，必须要断除淫欲心。现在大家都讲开放，也讲‘性开放’，乱得很。我看淫欲心还是不能开放，我们不能像西方国家一样搞性开放，弄乱了不好。还是中国的性保守要好一些。欲界越高，淫欲心越淡。欲界仅天界就有六层，亦称六欲天。淫欲心相应也有六种，即：受欲、交、抱、握、笑、视。第一层是四天王天，四天王天在佛经说来是在须弥山腰。须弥山是个大山，这是形像说法，只是打个比方。太阳和月亮都在须弥山腰转。四天王天分东南西北四天王。这里的天人还是有淫欲心，即‘受欲’。受欲就是接受淫欲心，和我们人差不多，淫欲心还很浓，只是稍微淡一些。第二层是忉利天。忉利天就是玉皇大帝住的地方。‘忉利’两个字翻成中文就是三十三，所以也叫三十三天。这层天不是说有三十三层，而是分东南西北中五方。东南西北每一方横向有八天，四乘八得三十二，加中央一方就是三十三。玉皇大帝就住在中央一方统治东南西北四方，也管理我们人间。这层天的淫欲心比四天王天又减少了，但男女还是要相交的，即‘交’。太阳在四天王天(即须弥山腰)下照人间，上照忉利天。在这些地方太阳升起来是白天，落下去是黑夜，一升一落就是一天，时间较短。第三层是夜摩天，在夜摩天不论日夜都是亮的，它是以莲花开了做为白天，莲花合起来做为黑夜，所以这里的一天就很长。夜摩天的淫欲心比前两层天又减少了，少到什么程度呢？只是拥抱一下就行了，即‘抱’。就像西方人要好，见面拥抱一下。第四层是兜率天，淫欲心又淡了一些。男女两人只需拉拉手就行了，即‘握’。就像我们见面握手一样，抱也不用抱了。第五层是化乐天，淫欲心就更淡了，只是相对一笑就行了，即‘笑’。男女两人相对一笑，踫都不用踫，手也不用拉了。第六层是他化自在天。他化自在天是天顶，这地方男女两人笑也不用笑了，只是相对一看就好了，即‘视’。所以受欲、交、抱、握、笑、视都是淫欲心。这些淫欲心都断了就生色界天了。</p>\n<p>　　色界比欲界要好，有很妙的色相，只是形像稀薄，我们肉眼看不见。色界有四禅天：即初禅、二禅、三禅和四禅。在<a href=\"/fjrw/hcrw/dmzs/\" class=\"keylink\" target=\"_blank\">达摩祖师</a>未来之前，中国禅宗讲的都是‘四禅八定’。在初禅天就能升腾放光；到二禅天就是喜悦无穷，即人们所说的法喜充满；三禅天则快乐无比，这个快乐是世间任何事情都无法比拟的。功夫做得好就可以尝到这个味道，快乐得很；四禅天叫舍念清净地，就是禅定功夫深了，乐也没有了。西方极乐世界中的‘极乐’就是指都化空了，乐也不可得。假如你还有乐在，还是有心，还是有妄想妄念，还是没有成道。到了四禅天就连色也不住了。有的人说，我淫欲心没有了，但踫到好看的人还是想看一看。这就是色心还在。所以淫欲心是粗妄，色比较微细。我们除习气要先断淫欲，后断色相。假如没有什么美，没有什么丑，都平等了，那么我们就出色界到无色界了。</p>\n<p>　　无色界并不是什么形像都没有，只是越高越微妙。越高越微薄。无色界即四空天，就是空无边处，识无边处，无所有处，非想非非想处。如果我们认为有空可得，住在空上还是出不了空界。所以要无所住，空也不可得，那么就出了空界，即出无色界了。</p>\n<p>　　假如欲断了，色断了，空也不住了，这样就竖出三界了。由于竖出三界很难，因此有一个方便法门净土宗可以横超三界。不用这么一层层地竖出。比如破竹子，竹节很多，竖著一节一节地破开很难。横著只要破一层就行了。修净土就是要破开这一层，横超到西方极乐世界去。我们不论竖出三界还是横超三界，都要做功夫。即使是一层也要破开才行，不然还是出不了三界的牢狱。现在的净宗行人不好好用功，以为敲敲唱唱就行了。连这一层也破不开怎么能生西方，出三界呢？所以修净土的人还是要做到‘一心不乱’，要得‘念佛三昧’才行。佛在《<a href=\"/fojing/emituojing/41135.html\" class=\"keylink\" target=\"_blank\">阿弥陀经</a>》中讲得很清楚：‘执持名号，若一日，若二日，若三日，若四日，若五日，若六日，若七日，一心不乱。其人临命终时，阿弥陀佛与诸圣众现在其前。’这样才能往生啊！另外密宗的‘颇哇法’也是教我们横超的。它是假<a href=\"/remen/foli.html\" class=\"keylink\" target=\"_blank\">佛力</a>加持的一个方便法，比较简单，只要我们把脉管明点观想成功就行了(关于‘颇哇法’在本书54页作了详细介绍)。修‘颇哇法’用心痛切的人七天就能修成。假使我们不好好用功，七十天也不行。所以要好好用功才行。</p>\n<p>　　假如功夫做得好就应当有空、乐、明三种妙明境界现前。但是我们不能著相，如果著空相就不能出空界，著乐相就不能出欲界(这个乐就是淫欲心的乐)，著光明相就不能出色界。禅宗有个公案讲：一个和尚修法修的很好，时时刻刻如朗月当头。就是时时刻刻头上像有一个明亮的月亮大放光明。他去请教曹山祖师(洞山的徒弟叫曹山—即曹洞宗)：‘朗月当头如何？’曹山祖师答道：‘犹是阶下汉’。就是说他还在色界之下。他又请求曹山说：‘请师父慈悲接引我上阶’。曹山答道：‘月落时相见’。这个公案讲得很好。那么‘月落时’，是不是指月亮没有了，黑暗了呢？不是！而是说我们在光中要不觉得有光。就像鱼在水里不觉得有水，我们人在空气当中不觉得有空气一样，就是要求我们既不住著身体化空，也不住著快乐无比，更不住著大放光明。如果事事无住，那就成就了。一有住著就落窠臼而不能圆证佛果。</p>\n<p>　　佛在《金刚经》中讲：‘凡所有相，皆是虚妄’，有人理解为凡所有相都是空。其实空并不是没有相，这一点大家要注意。对于空的理解有很多种：凡夫认为是相对空，也叫顽空；外道认为是断灭空；二乘认为是析法真空，也叫偏空；初入门菩萨认为是体法真空；而佛所证得的是妙有真空。下面我们分别解释：</p>\n<p>　　凡夫认为空是针对有来讲的。杯子放在这里是有，拿走了就是空；杯子里装水是有，水倒掉了就是空；人活著就是有，人死了就是空。机械地将空和有对立起来，这就是凡夫对空的理解，就是相对空。外道认为凡有相的都是虚妄，任何相都不要，认为这就是空，死在那里了。要是这样的话，房子不要烧掉算了，衣裳不穿脱掉算了，连饭也不用吃了，都空掉好了。所以这样理解是错误的，这就是断灭空。二乘人所证的空是析法真空(析就是分析)。他们经过分析认为：所有事相都是假的，只有我们的法身是真的。离开了相另外有个法我在，这样就把色法和心法分成两个部分。认为色法是色法，心法是心法，要证成妙体，就要离开色相。这就好比镜子和影子，他们要避开影子而执取镜光，实际是偏空了。我们知道色法有形体、颜色、有相可见，心法没有形体无相可见(比如我们的思想)。两者可以分别，但不可分开。他们不知道色法就是心法所显现的，偏执心法，执取法我，这样就偏空了。所以二乘人逃避世法，躲到深山里修行，这样就不能圆满。初地菩萨(又称初入门菩萨。<a href=\"/remen/tiantaizong.html\" class=\"keylink\" target=\"_blank\">天台宗</a>和<a href=\"/remen/huayanzong.html\" class=\"keylink\" target=\"_blank\">华严宗</a>均分五教。天台宗分：藏、通、别、圆、小乘；华严宗分：始、终、顿、圆、小乘。天台宗的通教和华严宗的始教都是指初地菩萨。)认识到任何事相本来没有自体，当下即空。不用离开事相就是空。杯子放在这里，不需要把杯子拿掉就是空。因这这个杯子本身并没有，它是由因缘合和而成。比如这个保温杯是由塑料壳和玻璃胆合起来做成的。杯子本身并没有，房子本身也没有，就连我们的身体本身也没有(也是地、水、火、风四大假合)，一切相都是因缘合成的。所以不用离开事相方能修行，事相本身就是空。虽然理解了这一点，就不需要离开世间就能修行圆满，但他们还不知道这个色相妙用无边，这就叫体法真空。佛所证得的是妙有真空。初入门菩萨虽然知道色法与心法不二，但还不知道有妙用。如能知道色相妙用无边，利用色相就是真空妙有了，比如<a href=\"/remen/wuyun.html\" class=\"keylink\" target=\"_blank\">五蕴</a>(色、受、想、行、识)是遮蔽我们本性光明的坏东西，所以要‘照见五蕴皆空’。但反过来五蕴又是妙用。成所作智就是利用五蕴来成就一切事业。比如，释迦牟尼佛降生，投胎王子，现了一个妙相—三十二相八十种好的色身(这就是色)。他为救度众生，不离开众生，不放手众生，就要摄受广大众生(这就是受)。众生的根基不同，要说不同的法，所以他要思考怎样说法能才对机(这就是想)。什么时候、在什么地方、用什么方法去度脱众生，就要具体去做。还有的众生与佛<a href=\"/remen/wuyuan.html\" class=\"keylink\" target=\"_blank\">无缘</a>，佛就让另外有缘的众生与他说法。有一个城东老母，佛给她说法(佛说法说的最好)，她却不听。还把耳朵捂起来说：‘不听，不听’。佛说：‘那我现<a href=\"/remen/shentong.html\" class=\"keylink\" target=\"_blank\">神通</a>给你看’。她把眼睛闭起来说：‘不看，不看’。佛知道与她无缘，就叫一个同她有缘的童子来给她说法，她倒接受了。所以佛为救度众生行持也有所不同(这就是行)。识就是知识，积累的经验，对我们来说就是要转识成智，识和智其实是一个东西，就好比水起波浪，水就是波浪，波浪就是水。波浪就像识，水就像智。佛的智慧最圆满，知识最渊博，他识得各种众生的根基(这就是识)。佛正是利用色、受、想、行、识来度脱众生，这样五蕴反过来就成妙用了。初入门菩萨对空的理悟上还差这么一层，所以还不究竟。要到佛所证得的妙有真空，真空妙有，有就是空，空就是有，这才究竟。</p>\n<p>　　真空妙有就是说既然有佛性，就应该起妙用，妙用就是指所现的各种差别相；妙有真空就是说这些相都是由法身所显现的，本身并没有，本身就是空。所以体(佛性)、相(色相)、用(妙用)三者不可分割，有体必现相，有相必起用。比如，没有房子我们怎么遮蔽风雨呢？没有相，法性又在什么地方体现呢？所以理体(法性身)是成就万物的根本，也是成佛的根本。这就叫‘事以理成(理体成功其事相)，理以事显(理体由事相显现出来)’。所以《金刚经》说：‘凡所有相，皆是虚妄’，即是真空；而《弥陀经》讲西方极乐世界的庄严妙相，即是妙有。有人不懂就认为这不是矛盾吗？其实并不矛盾。真空者正是妙有，妙有者正是真空。镜子里总是有影子，没有影子就不称其为镜子。不能现相起用就不是佛性，所以，佛性有种种的妙用。双身、饮血、裸体、愤怒等形像都是我们的心所显现的，不是心外另有的。心外无法，法外<a href=\"/remen/wuxin.html\" class=\"keylink\" target=\"_blank\">无心</a>。我们的佛性本来就具足一切妙用，既不是从什么地方生出来的，也不会在什么地方灭掉。它无始无终，本来如此。就是因为我们不知道而迷于色相，向外追求，造业受报，而枉受六道轮回无有了期。我们现在应该马上觉醒，不要再迷误了。既然我们本性有如此广大之妙用，为什么只捞取外面一点点假相而忘记我们博大的佛性呢？明白这个道理之后，大家就不要再去追求外面的境界，应随缘任运就好。由于前世造的因不同，这一世所受的果就不同。这就是‘欲知前世因，今生受者是。欲知来世果，今生做者是’。都逃不脱因果法则。所以现在我们每个人的缘份、业力、身体条件等等都不相同。只要我们随缘度日就好，今天的因缘如此，今天就这样过。明天的因缘如彼，明天就那样过。心里不要有芥蒂，不要去追求，不要著实惠，做一个‘绝学无为闲道人’。只要能一切放下，就一切无碍了，那就是佛了！六祖<a href=\"/fjrw/hcrw/hnds/\" class=\"keylink\" target=\"_blank\">慧能大师</a>讲的很清楚：我们前念著相、前念迷就是凡夫，后念觉悟了就是佛。就这么快，不需要怎么修，只要能觉悟、一切放下、不著相就行了。所以绍国师做的一首四句偈就很好。他说：‘通玄峰顶不识人间，心外无法满目青山’。通玄峰顶，就是说又妙又高的山，表示我们的佛性。不识人间，就是说人间万物都是假象，都不可得，不要著相。我们坏就坏在著相，物欲高涨没有满足的时候。心外无法(佛教里的法字用的很广，可以说一切事事物物乃至于抽象的思想都属于法)，就是说法就是心，心就是法。一切事事物物都是我的心所显现的，都是我自己。所以‘会万物归己者，其为<a href=\"/remen/shengren.html\" class=\"keylink\" target=\"_blank\">圣人</a>乎？’一切都是我，一切都是佛。桌子也是佛，椅子也是佛，房子也是佛……无一不是佛。因为都是我们自性所显现的。明白这个道理就不要再追逐色相了。放下来随缘度日，这样很轻松，很愉快，很自在。该多好啊！所以说：‘君子坦荡荡，小人常戚戚’。小人就是常常患得患失：哎哟，这下我不成功，万一失败了怎么办？整日忧愁啊，烦恼啊。所以学佛就有这个好处，能使我们快乐轻安，能使我们得大自在，可见佛教对于我们人类真是太好了！</p>\n<p>　　在佛教经典上讲：‘三界唯心，万法<a href=\"/remen/weishi.html\" class=\"keylink\" target=\"_blank\">唯识</a>’。三界我们前面讲了，就是指欲界、色界，无色界。因为我们有淫欲心所以有欲界，欲界里有六欲天，淫欲心就有六种：受欲、交、抱、握、笑、视。天界越高淫欲心越淡。到了笑也不用笑，看也不用看的时候，淫欲心就完全没有了。这样就到了色界，色比欲要微细一些。这时虽没有淫欲心，但仍然执著在色相上。好看的就喜欢，不好看的就厌恶，这就没有出色界。假如没有什么美，也没有什么丑都平等就出色界到了空界。如果住在空界上认为有空可得那么就出不了空界。所以‘三界唯心’就是说三界都是由我们的心所创造的。万法唯识就是说一切事事物物、思想都是我们的识所变现的。一切事事物物、思想就是法，我们的分别心就是识。从前憨山大师入定到兜率内院问弥勒菩萨：‘什么是识？什么是智？’(智是智慧，识是知识。)弥勒菩萨说：‘分别是识，无分别是智’。讲得既简单又清楚。我们人总是在分别这个好那个坏，这个大那个小，这就是识。所以一切事事物物、思想都是‘唯心所现，唯识所变’。只要我们能‘舍染归净，转识成智’(此语见法相宗《唯识论》)就能成佛了。‘舍染归净’就是说把染过的东西(即著相的东西)都舍弃掉，都放下，归无所得。净是指无所得，而不是指清净。有个清净在还是有所得。所以这里的‘净’就是大势至菩萨教导我们的：‘都摄六根，净念相继’(此语在本书46页作了详细说明)。‘转识成智’就是要把我们的八识转成四智，转第八识成大圆镜智，转第七识为平等性智，转第六识为妙观察智，转前五识为成所作智。只要能转识成智，就能恢复我们的本来面目，重现我们的明妙真心。这个妙明真心不是我们胸腔里的肉团心，而是我们能起见闻觉知的性能。这就是佛！所以说：‘是心作佛，是心是佛’。我们只要修心，时时处处不著相，就必定能成就。净土宗的念佛也是指念心。净宗行人应明白土就是心，心就是土；心外无土，土外无心。要‘阿弥陀佛，阿弥陀佛……’用心去念这句佛号。正如莲池大师所说：‘声声唤醒主人公’。就是用这句佛号来唤醒我们的心。从前净土宗的一位大祖师先是敲木鱼念：‘阿弥陀佛，阿弥陀佛……’。后来他心空净明白了，就念：‘我的阿弥陀佛，我的阿弥陀佛……’。这就是‘是心作佛，是心是佛’。佛就是我们的心，我们的心就是佛，不要再去求心外之佛。这样往生净土就是上品上生。如果你著相，心外求佛，心外求土，顶多下品下生。所以我们应该做到心、佛、众生三无差别，心佛道交打成一片。就是说我们的心，成就的佛，广大的众生都是一体，都是平等平等又平等，毫无分别。释迦牟尼佛就是阿弥陀佛，阿弥陀佛就是<a href=\"/remen/milefo.html\" class=\"keylink\" target=\"_blank\">弥勒佛</a>，也就是众生。因诸佛与众生具有同样的知觉性。只是大家不知道，迷了，就是众生。一旦觉悟不再著相就是佛。所以成佛并不是难事，因为我们本来是佛，并不是后天修成的。只要肯放下，就能返本还原恢复我们的本来面目，就能成就。所以说：‘放下屠刀，立地成佛’。</p>\n<p>　　我们本来是佛，还向外去求，还不肯放，那就成就不了。就好比我们煮米饭，用大米来煮一煮就成，如果用砂子来煮，再煮也煮不成。所以说：‘外道练身终必坏’。因为身体不是佛，终究要坏掉。现在练气功的人执著在身体上就走岔路了，永远也不能成就。有人说：‘佛教、道教中不是也讲气功吗？！’说的没错。但那仅仅是初步，主要是以气来摄心的(净土宗也讲摄气念佛法)。就是用气把你的心抓住，但不是住在气上。而气功搞的小周天，大周天是住在气上，住在身体上，那就完全错了。他们不知道是心是佛，不知道我们灵活的思想就是佛。身体就好比是房子，灵妙真心是房子里的主人。外道不知练心只练身体，所以大错特错而不能成就。比如吕洞宾修练的功夫很好，已大丹成就。他身背宝剑，云游四方。当来到黄龙山时，只见山顶紫云覆盖，就知道山上有成道的人。此人正是黄龙玄机禅师，他是个悟道的大禅师。吕洞宾决定上山去看看。正好黄龙禅师的<a href=\"/remen/dizi.html\" class=\"keylink\" target=\"_blank\">弟子</a>们请他上堂讲法。黄龙禅师往法座上一坐，一拍桌子说：‘今天不讲法，有人盗法！’吕洞宾想：那肯定是指我了。因为你们都是和尚，而我是道士。我已经成道了，难道还怕你们吗？！他是艺高人胆大，立刻站出来说：‘和尚，我请教你一个问题：‘如何是一粒粟中藏世界，半升裆内煮山川？’一粒粟就是一粒米。这么小的一粒米要把整个世界都藏在里面，看你如何藏得进去？半升裆，就是指很小的锅，只能煮半升米，要把高山大河都放在里面煮，看你怎么煮？他想：我已成道，能变现神通，看你黄龙禅师会不会？黄龙禅师用手一指他，说：‘你这个守尸鬼！’因为外道都是练身体，要长生不老，所以说他是守尸鬼。吕洞宾哈哈一笑，反驳说：‘奈何我囊中有不死之药’。囊是口袋，这里是指身体，臭皮囊。意思是说他采大药、炼金丹，已炼成阳神，已有不死之药，可以不要这个身体了。黄龙禅师答道：‘纵然百万劫，依旧落空亡’。就是说他只不过比别人能多活百万劫(劫是指时间。一个大劫是四个中劫，一个中劫是二十个小劫。一个小劫是人从八万四千岁过一百年减一岁，减到十岁，这叫减劫；然后再反过来过一百年长一岁，再长到八万四千岁，这叫增劫。这么一个增劫和一个减劫就是一小劫。有人计算了一下，一小劫是十三万三千四百四拾三万年)，但是到最后还是完蛋。吕洞宾这时不耐烦发火了，飞剑取黄龙。黄龙禅师用佛尘一掸，把他的剑敲到了地上，这是什么缘故呢？并不是黄龙禅师用神通与之斗法，把剑掸掉了。在这还是用来表法的，就是指把吕洞宾的知见打掉了。所以吕洞宾就<a href=\"/remen/dl.html\" class=\"keylink\" target=\"_blank\">顶礼</a>黄龙禅师，请黄龙禅师为他开示。黄龙禅师对他讲：‘你练的阳神，不过是第七识所化的身体。还是假的。凡属有相终必败坏。只有认取真空妙有的佛性，才是真实的’。后来，吕洞宾就归依了<a href=\"/remen/fomen.html\" class=\"keylink\" target=\"_blank\">佛门</a>。所以，只有佛教才是最彻底、最究竟的。</p>\n<p>　　我们要明白以上讲的这些道理，要知道一切境相都是我们的自性所变现的。正如《<a href=\"/fojing/xinjing/yuanwen.html\" class=\"keylink\" target=\"_blank\">心经</a>》所说：‘色即是空，空即是色’。色是指一切色相，空是指我们的本性。也就是说一切色相就是我们的本性，即所谓‘青青翠竹无非<a href=\"/remen/banruo.html\" class=\"keylink\" target=\"_blank\">般若</a>，郁郁黄花皆是法性’。我们通达空性后就知道一切色法都是由我们的空性升起的，没有我们的空性也就没有色法。色法就是我们的男女老少、山河大地，它就是由我们的空性产生的。因为无相可得叫空性，因空之故才能生万法。如果不空，有个实体就不能再生别的法了。比如：这个杯子在没有做成之前，它所用的材料可以做成其他各种各样的东西。一旦用这些材料做成这个杯子后，就再也做不成其它东西了。所以本性空才能生万法，就是这个道理。</p>\n<p>　　通达空性后，明白我们本身就是佛，才能懂得‘中阴救度法’而不至怀疑。因为本法是教我们一下证成报身佛的，假如我们不明白，当<a href=\"/remen/foguang.html\" class=\"keylink\" target=\"_blank\">佛光</a>显现时就会有疑虑：‘我是佛吗？我是凡夫，怎么能成佛呢？’把自己看成是凡夫不能成佛，那就变成外三乘了。有些人甚至惧怕佛光的强烈还躲避，那就更糟了。所以大家要明白并记住这些道理，在中阴阶段佛光显现时与之合上去，就能证成报身佛了。不只是升到西方极乐世界而已，到西方极乐世界已是次一等了。明白了这些道理之后还要按这些道理去做，证成理事无碍才行(理即理体无相可见，事即事相有相可见)。有人说：‘《金刚经》不是讲“凡所有相，皆是虚妄”吗？所以我看这事相是假的，不是真的’。这种看法就不对了，这样就是理事相碍，一方面所有事相都是本性所显现的妙用，事就是理，理就是事，理事不二，怎么是假的呢？另一方面，如果执著于事相，把事相当成真的也不对，也是理事相碍。所以佛教是<a href=\"/remen/buerfamen.html\" class=\"keylink\" target=\"_blank\">不二法门</a>。其实没有真也没有假，就像天台宗讲的空、假、中。空是指没有色相，但有假相在，假相就是妙用。空、假相都不住即是中，中也不立就是中道义。所以假就是真，真就是假，不要分！分也分不清。事相现前都是我们的心所显现的，比如看见茶杯，茶杯就是佛，看见桌子，桌子就是佛。没有我们的理体，那里会有这些事相呢？！所以明白了这个道理做事的时候就不会有妨碍了。我们的缺点就是著相，追逐物欲，贪求享受，同别人攀比，别人有的他就要有，为达到享受的目的不择手段。所以不要执著于事相，追逐虚假的外境而忘记了理体，既使是做了皇帝也是假相，不可得，转眼就完了。我们的心真空净不著相就时时见性了。有人说：‘我就是时时见性，烦恼一来就能照破它’。这是时时见性吗？真时时见性就没有烦恼了。烦恼来的时候就没有见性。可见这都是说大话，说假话。所以我们要时时刻刻在事境中磨炼自己才行。因为道理说得再对没有用，一遇到事情就不行了。这种人被大慧杲禅师呵为：‘药水汞，遇火即飞’。只会说道理就像水银一样，一遇到火就挥发了，那就不行。所以要时时督促自己，捶练自己，才要住相就赶快放下，归于本来，归无所得。</p>\n<p>　　(三)</p>\n<p>　　释迦牟尼佛和孔子差不多都是出生在周朝时期，佛教是在东汉时传到中国来的。经、律、论被誉为佛教的<a href=\"/remen/sanzang.html\" class=\"keylink\" target=\"_blank\">三藏</a>经典。经是由佛讲述后人记载下来的；论是菩萨根据自己修行的心得编写的，如《<a href=\"/fojing/dachenqixinlun/yuanwen.html\" class=\"keylink\" target=\"_blank\">大乘起信论</a>》、《大智度论》等；律就是<a href=\"/remen/jielv.html\" class=\"keylink\" target=\"_blank\">戒律</a>，如<a href=\"/remen/biqiujie.html\" class=\"keylink\" target=\"_blank\">比丘戒</a>、<a href=\"/remen/shani.html\" class=\"keylink\" target=\"_blank\">沙弥</a>戒、<a href=\"/remen/biqiuni.html\" class=\"keylink\" target=\"_blank\">比丘尼</a>戒等。三藏经典博大渊深，像海洋一样难于探测。</p>\n<p>　　佛教最初传到中国的是禅宗(禅宗是佛教至高无上的<a href=\"/remen/zhengfa.html\" class=\"keylink\" target=\"_blank\">正法</a>门，净土宗是横超三界的方便法门)。禅宗可分为外道禅、小乘禅、世间禅和大乘禅。比如现在做气功的人，为把身体气脉打通，练气打坐，目的在气上。这样带异计而修者就是外道禅。‘异计’就是不是为了了生死，而是求其他的目的。比如：让我们的身体<a href=\"/remen/jiankang.html\" class=\"keylink\" target=\"_blank\">健康</a>些，长寿些。更有甚者是为了得到神通，来炫耀自己，获得点名闻利养等等。这些都是带异计而修的，都是外道禅。如果是为了了生死，但只懂得色身无我，以偏空之理而修的是小乘禅。因为他法执未除，执著佛性七大种性(地、水、火、风、空、根、识)当中的地、水、火、风四大种性为我，是为法我，叫做法见未除。这种以偏空真理而修者，是为小乘禅(‘偏空真理’有的字典称为‘偏真空理’，即偏执我空之真理而不知法亦空，若悟我、法二空，无可执取，则空有双融而代偏空矣。此种偏见亦可说为‘我空偏真’之理)。以四禅八定的禅法而修者，是为世间禅。假如明白了人法俱空，人我没有了，法我也没有了，以此而修者，是为大乘禅。当然没有法我，不是说没有法身，而是说法身的四大种性也不执著。就像我们人有眼睛、耳朵、鼻子、嘴巴，既不执著局部的感官，也不住执整个身体。我们的法身本来就具足地、水、火、风这四大种性，但不可执著这四大种性为我，一有所住，就是法有我。学大乘禅的人悟人、法双空，毫无偏执。了人无我，可了分段生死；了法无我，则了变易生死。分段生死就是六道轮回的生死。以每次生死皆有个身形，在世上生存一段时间。人有人身，马有马身，狗有狗身。这个身体生存就是生，坏了就是死，这就叫分段生死；变易生死就是我们的思想一生一灭，变化无穷。了了六道轮回的生死，叫了分段生死。了了思想变易的生死，叫了变易生死。一切法根本不可得，认为有法可得，法有真实受用，那就是法见未除。就是法有我，就不能了变易生死。所以罗汉是证偏空真理。而证入人法都空的真理就是菩萨。再进一步，就是认识到我们的法身(就是能够见、能够闻、能够嗅、能够触、能够知的觉性)与诸佛无二无别，用这个真理来修的，就是最上乘禅。修此禅者，须时时刻刻观照，一点妄念都不起。妄念一起，就把它化空，不跟著它跑，任何境界变现在前也不为所动，久久地这样锻炼下去，就会将身心、世界化空，而亲证本来佛性。当然一下子做不到，这个念头才息下来，那个念头又来了，须要不停的与它斗争下去。在起念时，我们要看见它，不跟它跑，不理睬它，它有一百个起，我有一百零一个不理不睬，在这样不理不睬的斗争当中，念头就不期然而然的化掉了。当你一念不生时，忽然‘唰—’的一下，就能所双亡，根尘脱开了。当下身心(就是思想)、世界与虚空，一齐消殒无存，天真的佛性也就历然现前而亲证本来了。如此修习，就是无上的、最高的‘大乘禅’！达摩祖师传给我们的就是这种禅。前面几种禅，趣入虽有门户次第，然如能一门深入，虔诚修习，皆得功用，不可轻视蔑弃也。达摩未来之前，<a href=\"/remen/xingzhe.html\" class=\"keylink\" target=\"_blank\">行者</a>都是修‘四禅八定’的禅法，成道的人很多。唐、宋以来，大都修达摩祖师的所传的祖师禅，因我国固有的儒教与道教的高深文化，集合达摩所传的禅法，酿成独特的禅风，因之证道的人更多。这些都有历代相续的，真实的历<a href=\"/ctwh/shi/24s/shiji.html\" class=\"keylink\" target=\"_blank\">史记</a>载，可以追踪查考。</p>\n<p>　　达摩所传的祖师禅不立文字，直指人心，见性成佛。就是直接告诉我们什么是佛。那时候人的根性好，只怕不知道，一旦知道了什么是佛，就会绵密保护，不让习气沾染上去。时时观空不再著相，用不了几年就能成就，快得很。所以达摩祖师所传的顿悟禅非常好，用不著怎么修法，因为我们本来是佛，就是我们不知道。比如六祖大师指示惠明说：‘不思善，不思恶’一切放下，什么念头都不动。‘惠明良久’，就是停到那儿不动了。不动的时候一念不生，六祖大师就直接指示他：‘正与么时，那个是你明上座本来面目。’就是正在这个一念不生的时候，你不是木头石头(木头石头没有知觉)而是了了分明，‘那个’就是你的本来面目。这就是直接指示，多好啊！后来人不明白这个道理，‘那个’就变成了‘哪个’了。‘哪一个是你明上座本来面目？’就成问话叫你去参了。就像猜谜一样：哪一个？哪一个？其实六祖大师不是这样问的，他是直接指示。就像于岫大夫问紫玉禅师：‘如何是佛？’禅师就喊他：‘于岫大夫！’大夫答应道：‘唉’。‘即此是！’紫玉禅师说。就是答应的这个就是。于是于岫大夫就开悟了。多么简单痛快啊！那么于岫大夫是不是真正开悟了呢？脚跟是否点地呢？后来药山禅师(即石头希迁的徒弟)想考考于岫大夫就说：‘哎哟，恐怕大夫埋到紫玉山中去了。’于岫大夫听到之后想：是不是我悟错了？赶快又去参拜药山说：‘请大师开示？如何是佛？’药山也是这样喊他：‘大夫！’于岫大夫答应道：‘唉！’这回药山换了一句话问：‘是什么？’于岫大夫，‘噢—’这次他真的开悟了。紫玉禅师说：‘即此是！’就是告诉于岫大夫这就是佛。药山反问：‘是什么？’也是告诉于岫大夫这就是佛了。这些都是直接指示。后来就不行了，因为后来人根陋劣，你这样直接告诉他，他反而不以为奇。就像祖上遗下的财产一样，不是自己血汗挣来的就不当一回事，滥花滥用。如果直接指示他，他还说：‘这就是佛呀？那怎么没有神通，没有辩才呢？恐怕不是吧。’他就不能承当，更谈不上保任。所以禅宗到后来就变成起疑情参话头了，直到现在就参一句死话头：‘念佛是谁？’参几十年都得不到消息。因为根本起不了疑情。参话头是要起疑情：念佛究竟是谁念的呢？是我念的，那么什么是我呢？身体是我吗？身体是地、水、火、风四大假合，假如我们一口气不来了，肉身实体没有烂掉，那时为什么不能念了？所以身体不是我。思想是我吗？思想是外界客观环境在人脑中的反映。没有外界客观环境就没有思想，所以思想也不是我。那么‘阿弥陀佛’这句佛号究竟是谁念的？要把这个问题的答案找出来，就要起疑情。因为疑情一起，一直思索这个问题，究竟是谁？这样就把思想妄念割断了。思想被这个疑情抓住，就不会胡思乱想了。不然我们妄念多端，一分一秒都没有停止过。即使是睡著了也没有停止的时候，还是妄念多端，乱梦横生。所以禅宗人说的：‘大疑大悟，小疑小悟，不疑不悟。’就是这个道理。因为疑情不起，思想总是在动，就抓不住，就不能深入禅定，妄心就息不下来，本性就不能现前。因为真心都被妄念包裹著看不见了。我到过几个寺院，看他们在那里念念有词：念佛是谁，念佛是谁，……。哎！真糟糕，他们没有起疑情，在那里念‘念佛是谁？’还不如念阿弥陀佛好呢！念阿弥陀佛还有佛号的果地感应，还有佛所有因地发心功德的加持，比念‘念佛是谁’要得力的多。</p>\n<p>　　现在是末法时代，佛法衰微，大家都不肯好好的用功修法。现在的禅宗说起来真凄惨，所传之法，都不是自己亲自证到本性后，再传给他人，而以法卷代传。就像我们画图画的画卷一样，用一张长长的画纸，在上面写上四个大字：‘正法眼藏’。然后写第一代祖师是谁，第二代祖师是谁，第三、第四……传到我这儿现在是第三十四代，我传给了你，就写第三十五代，把这卷子传给你，就算是把法传给你了。传的人既没有悟道，受的人也没有悟道，大家就这样糊里糊涂地把卷子传下去，就算悟道了，就算法有传承了，这样的传接法，禅宗那得不扫地？！</p>\n<p>　　禅宗产生很长时间后，才出现了净土宗。净土宗是在东晋时，由庐山东林寺的慧远法师设立的。当时，慧远法师看很多人参禅不对机，就设了两个佛堂：一个是禅堂，一个是依据三经(即《阿弥陀经》《<a href=\"/fojing/wuliangshoujing/40729.html\" class=\"keylink\" target=\"_blank\">无量寿经</a>》《观无量寿佛经》)设立的念佛堂。让参禅不对机的人入念佛堂，于是就产生了净土宗。净土宗比较方便，借佛的慈悲力量接引，横超三界，往生西方极乐世界。但要真正做到一心不乱才行。关于一心不乱在净土宗里横起纷争。有些人说：‘我们全仗佛力，不要一心不乱，散心念佛就行了(散心念佛就是一面嘴上念，一面思想乱动)。’还有的说：‘恐怕不行吧！佛说要直持名号一心不乱，才能彼佛现前接引往生。’所以净宗行人也有分歧。是不是要一心不乱呢？假如马马虎虎念佛就能往生，为什么憨山大师还说：‘口念弥陀心散乱，喉咙喊破也徒然’呢？！所以我看还是需要一心不乱的。关于一心不乱也有深浅，分起来很详细：有事一心，理一心，理事一心，事事一心。我们不讲深的，讲最简单的，就是佛号要时时刻刻在心中念：阿弥陀佛，阿弥陀佛……。遇到再好的境界也不乐而忘形，还是阿弥陀佛，阿弥陀佛……；遇到再坏再烦恼的境界也不烦恼，还是阿弥陀佛，阿弥陀佛……，心不动摇。这是事一心不乱。要能做到这样才行。假如连这个也做不到我看生西方就很困难。因为佛不是跑到你面前来接引你。永明寿禅师曾在《宗镜录》中讲：佛就好比是天上的月亮，在千江万水中都显现，我们的心就好比是千江万水。一心不乱就像清水，阿弥陀佛只能在清水中显现。假如我们的心污七八糟就像一潭浑水，佛就是来了你也见不到。因为大家都不肯好好用功，所以在现在的末法时代，连‘普遍通行的净土宗<a href=\"/remen/nianfofamen.html\" class=\"keylink\" target=\"_blank\">念佛法门</a>也难方便实行了。’(见原文五十三页)。净土宗其实是很容易方便实行的，就是念一句佛号：‘阿弥陀佛’。但为什么又说：‘难以实行’呢？因为现在的修行人不肯用功念佛，都是在装模作样，上上早殿，上上晚殿，敲敲唱唱就算功课做好了。这还是比较好的，差一些的，连殿也不上，只想做经忏挣钱。这样修行有用处吗？一点用处也没有！念佛求生西方，要念到一心不乱才行。佛说：‘欲净其土，先净其心；随其心净，即佛土净。’心不清净，与净土不相应，是不能往生净土的。佛在《观经》中讲，念佛法门有十六种观法，最后一观叫念佛观。应该怎么观呢？就是念佛时，须‘心念耳闻’，就是说念佛时，耳朵能够清清楚楚地倾听自己的念佛声音。这种观法，不是用眼睛看，而是用耳朵来观照我们念佛的声音。以耳根摄定意根，使其不生妄念而达到进入念佛三昧的目的。我们真能证入念佛三昧，当腊月三十日到来时，绝定能生西。否则，就很难说了。因此，念佛须一切放下，静静地念：‘阿弥陀佛、阿弥陀佛……’同时用耳朵静听自己念佛的声音，才能摄心入观。现在的人念佛不入观，不肯照佛教导的方法来切实实行，所以收效甚微。大势至菩萨教导我们：‘都摄六根，净念相继。’就是教导我们念佛，须把眼、耳、鼻、舌、身、意这六根，都摄在这一句佛号上。眼睛不看别的东西，耳朵不听别的声音(只听我念佛的声音)，鼻子不闻什么香臭，舌头也不尝什么味道，不说话。竭尽心力，‘阿弥陀佛、阿弥陀佛……’静静地一直念下去，自然渐渐息下妄心而安然入定。可惜现在净宗行人不肯这样做。说到‘净念相继’这句话，意义深长，确实很难做到。因为不是照字面看起来那么简单，不是只静静地念这句佛号，就叫净念相继，而是很深的，像禅宗开悟后保任到家的功夫一样。所谓净者，要能所双亡，根尘脱落才叫净。就是念佛时能念的心、和所念的佛号，一时脱落，无能无所，廓尔清净，才是一念净。有念佛的心和所念的佛号，有能有所，这是相对的。相对的都是虚妄不实的。绝对的才是真的。唯有我们的佛性是绝对的。你现在念佛，心、法、佛号都是相对的，所以这不是净念！要等念佛念得入定了，念得能所脱掉了，就像我们修心中心法一样，持咒持到最后，‘啪—’脱掉了，法没有了，人也没有了，心也没有了，世界也没有了，都空净了，但灵知了了，这才是一念净！一念净就是一念相应，这一念就是佛。一念相应一念佛，念念相应念念佛。念念都是如此不动，念念都是佛，这才叫做相继不断！你们看这是何等的功夫啊！讲到‘相应’，还有静中的相应和动中的相应不同。静中相应，就是我们打坐的时候，能所双亡，打开了本来，与佛相应。但下座动中又忘记了，跟著外境跑了，就不相应了。所以这只是静中相应，动中不相应还是不行。功夫须做到动静一如，动中不跟境界转，仍然是了了分明，如静中一样才行。‘相继’就更难了。相继就是继续不断，就是不问动静，时时如此，不只是一时如此，而他时如彼。因为我们旧习深重，打坐用功，常是今天能脱开，明天又脱不开，要等多少天后才脱一次，以后不再脱开，那是瞎猫踫著死老鼠，非但不是相继的功夫，也不算开悟。纵然功夫增进，静中能相继了，动中有走著，还不能算相继成片的功夫。真正的相继，须动中也如静中一样相继。就是在做事时尽管在做，却等于没做，丝毫不住著。做过之后，更没有丝毫做的痕迹。做到这样动静一如的相继，才叫净念相继。禅宗功夫也是要做到这个地步才叫打成一片。参禅打开本来之后要进一步保任，长养圣胎，使他发育长大。保任功夫是两个阶段。保就是保护，就是当我们打开本来了，认识了法身，要严密地保护他，不让他粘染物境而停滞不前，须时时照看他而不忘记。等保护圆熟了，就不须再保。放任他，独立自主而无犯触，以法性本来如此，非有意做作。功夫做到动静一如的相继功夫，非但净就是禅，禅就是净，禅净不分家。就是儒教孔夫子最后也说：‘七十从心所欲而不逾矩。’可见功夫到家，是不分什么宗派的。有些不懂佛教真理的人，总在分别说：‘你是禅宗，我是净土。’其实不相干。又有些人分别说：‘净土好，稳妥；禅宗不好，危险！’不知道都是一样的。你说禅宗危险，是你不竭尽心力修行故。你不专心致志的念佛，净土也一样危险。不见莲池大师道：‘念佛者多，生西者少’吗！你说净土好，禅宗也一样好，六祖大师以来，见性了道的人，不是也很多吗？！所以大家不要互相诽谤了，法都是好的。就看这个法是否适合你的<a href=\"/remen/genqi.html\" class=\"keylink\" target=\"_blank\">根器</a>，适合根器就是好法。另外，人们之所以有分别，是法没有修圆满，死守在一门，著在一点上，才生出差别见。如真正打开来，见到本性，就圆满了，就知道各宗都相同而无异议了。所以说我们心中心密法，就是禅宗，就是净土，和中国的十大宗派，没有点滴分别，只是在下手用功时有些不同罢了。我们心中心密法所讲的道理，和禅宗完全一致，也讲打开来见到本性后，了见、思二惑，圆满三身四智，更讲心净佛土净，发愿往生西方极乐世界，并且更进一步，可随愿往生其他诸方净土，不是只能往生一个净土。所以我们心中心法既是禅，又是净土。但真正实行起来是要专心致志的用功，不是说说即能办到的。其实净土宗也是如此，也须一心精念佛号，不可懈怠。但现在人讲的净土宗与净土原意大相径庭，非但念佛不入定，连念佛三昧也不要，甚至说不念佛也不要紧，只要耳闻一句佛号，即能往生西方。把净土宗糟蹋、破坏得体无完肤，真是披著佛衣的逆种、魔子，这种人不下地狱、受刀山油锅之苦才怪！净土宗本有‘十六观’、‘念佛三昧’、‘般舟三昧’等等修法，可见须行人认真修习的。修‘般舟三昧’要一天到晚走著或站著念佛。不许坐，不许睡。这是很辛苦的，很难做到。所以本书说：‘普遍通行的“净土宗”念佛法门，也难方便实行。’这话讲得很有道理，是很难实行。所以到临命终时都是乱七八糟。舍报安详，一心不乱，更是做不到，因为他没有好好修行。能够安安稳稳的，一点无挂碍走掉的人，当然是有，不能说一个都没有，只是很少很少了。我曾见过一位老太太，她是接受救济的，生活很苦没有钱。那时候，政府每个月只给她八块钱。她只有到菜市场拾一点菜叶吃。在热水瓶里放点剩米饭，到开水房要点开水一胀，变成稀饭喝喝。她一天到晚念佛：‘阿弥陀佛，阿弥陀佛……’，提前一个星期就知道自己要走了，这就是预知时至。她告诉那个开水房的人说：‘今天我泡过了，明天就不来了。’开水房的人问她：‘你要到哪里去呢？’她说：‘唉，我要出远门了。’以后一个星期大家都没有再看见她。有人说，这个老太太晚上进屋，就没有见她出来过。于是，把她的房门破开一看，老太太已坐在床上坐化了。这就很好啊！</p>\n<p>　　由此可见，净宗行人还是需要一心不乱才能往生西方极乐世界，而禅宗人要做到断惑证真才能证成佛，才能了脱生死。断惑证真就是要把见惑、思惑、无明惑都断除而证见本性。开悟就是已经见到本性，但只是刚到法身边，了了见惑(就是知见)。知见正了心就不会再动摇了，但思惑(就是思想)还未了，对境还要生心，分段生死就不能了。所以净土宗常说禅宗这一点不好：‘禅宗人参禅虽然开悟了，也不能了生死。还是净土宗稳妥，‘但得见弥陀，何愁不开悟’，往生西方极乐世界就证到阿鞞跋致，一生补处(就是证成等觉菩萨)，不再六道轮回了。’禅宗是有很多人得到一点知解就以为开悟了，实际功夫并没有跟上去。有些人用功打开本来见到本性，那也只是初到法身边。就像刚刚登上舞台的边缘，还没有到舞台的中间呢！要继续努力用功，心里彻底空净了，才能真正证悟。所以要在境界中锻炼身心，达摩所传第二代祖师神光大师，就是在妓院酒楼里锻炼身心。别人说他：‘你是个和尚，怎么还往妓院酒楼里跑？’他说：‘我到这里是来炼心的，看看我的心还动不动。’所以这才是炼真功夫。当然净土宗人把禅宗说的这么不好也不对，因为这样一说别人就无心学禅宗了。其实禅宗的立足点和净土宗不同。禅宗假如真的见到本性，纵然习气未了，也只需七升天上七到人间就能了了。他会上向上升进，不会再到三恶道中，这就很好啊！现在有人讲：‘五祖戒，草堂青。’意思是说五祖山的戒禅师虽然开悟了，但并没有了生死，再投胎就是苏东坡。并说苏东坡娶了几个老婆，也不能<a href=\"/remen/chujia.html\" class=\"keylink\" target=\"_blank\">出家</a>修行。其实苏东坡还是不错的，他并没有忘记修行。他是又<a href=\"/remen/xiudao.html\" class=\"keylink\" target=\"_blank\">修道</a>又修佛，也很用功啊！他做了很多诗词歌赋都是与佛法有关的。据说他再转身投胎就是憨山大师了，这不是很好吗？！所以禅宗有禅宗的不同，不要再彼此诽谤，应当互相赞叹才好，因为各有各的缘份，各有各的根基。就像我们吃东西，你喜欢吃甜的，他喜欢吃辣的，各有所好。所以说是法平等无有高下。</p>\n<p>　　佛在世时就预示，末法时代只有净土宗和密宗最应机。禅宗门风高峻，要上上根人才能相应，中下根人就不行了。现在禅宗都是法卷传法，不是开悟传法，有其名而无其实。真是遗憾、太可惜了！其实禅宗是佛教的正法门，其他都是方便法门。净土宗简易方便，横超三界。密宗法门很多，但真正修大法的人很少，都是修求神通的法，来眩耀自己。例如，海灯法师在学佛前，是和他舅舅一起炼武的，他舅舅是四川青城山的剑客。有一天，海灯法师在四川边境看见两个小<a href=\"/remen/lama.html\" class=\"keylink\" target=\"_blank\">喇嘛</a>抽鸦片，就对他们说：‘哎！你们还是和尚呢，怎么抽鸦片，不学好！’一个小喇嘛说：‘你别看不起我们。别看你有刀，有剑，我们念一个咒，你这刀剑就砍不破我们的手臂。’海灯法师摇摇头表示不相信。小喇嘛说：‘你不相信？等我抽完，让你试试。’这个小喇嘛‘呼呼呼’地把鸦片抽完，精神足了，嘴里嘟嘟嘟念个咒，然后把袖子卷起来让海灯法师砍。海灯法师开始不敢砍，只是用刀背轻轻一踫，‘啪’刀被弹起来了。他又用了一点力，刀又被弹起来了。海灯法师想：咦？还管点用！小喇嘛说：‘嗨，你用刀刃使劲砍，我这个法很灵的。’这次海灯法师用刀刃轻轻的一踫，‘啪’刀又弹起来了。小喇嘛说：‘你用劲砍，没关系。’海灯法师这回用力一砍，‘啪’刀又被弹起来了。这下海灯法师信服了，开始发心学佛法。海灯法师讲他学佛的因缘就是这么来的。所以宗喀巴大师看到密宗日久弊生，红教的弟子们尽弄这些小神通，而不修习正法，把红教弄得乌烟瘴气。于是他去其糟粕，取其精华，整理教规，穿黄衣，另立黄教。现在密宗的派别很多，有红教、黄教、白教、花教等。但目前学密法的人大部分都是为求神通，不是想了生死，走到斜路上去了，真可惜！其实我们修行到一定程度，自然会显发神通，自然会六通具足。外道也有神通，但只有天耳通、天眼通、神足通、他心通和<a href=\"/remen/suming.html\" class=\"keylink\" target=\"_blank\">宿命</a>通这五通。没有漏尽通。漏尽通称为道通，就是一点都不著相，烦恼都光净了。只有佛才是六通具足，比如<a href=\"/remen/lianhuasheng.html\" class=\"keylink\" target=\"_blank\">莲花生</a>大士就是肉体飞升成佛，威力神通不可思议。还有大势至菩萨也是威力神通很大。就像我们心中心法修到一定程度就会有神通，但还不知道是从什么地方来的。因为神通是我们本来具足的，本来就没有来处。只要不著相，一切放下，神通就会自然显发，要去求反而求不到。</p>\n<p>　　针对本密法，孙景风居士讲：‘听闻的人，至少要明白“九乘教义”，具有瑜伽初步的智解，才能心印相合，融会贯通，事理无碍。’(见原文三十八页)这就要求听到这个法的人要有相当的智慧才行(并不是阿猫阿狗都能听得懂)所以在这里我们先讲一下密宗的‘九乘教义’。‘九乘’就是指外三乘，内三乘和密三乘(见下图)：</p>\n<p>　　┌声闻乘</p>\n<p>　　┌外三乘—┼辟支佛乘</p>\n<p>　　│　└菩萨乘</p>\n<p>　　│</p>\n<p>　　│　┌事业部</p>\n<p>　　九乘次第—┼内三乘—┼行持部</p>\n<p>　　│　└瑜伽部</p>\n<p>　　│</p>\n<p>　　│　┌玛哈约嘎(大瑜伽，即大相应)</p>\n<p>　　└密三乘—┼阿努约嘎(随瑜伽，即圆满相应)</p>\n<p>　　└阿底约嘎(极瑜伽，即大圆满相应)</p>\n<p>　　外三乘就是显教的声闻、辟支佛和菩萨。主要讲的是教理，让我们明白怎样才能修成罗汉？怎样才能修成辟支佛？怎样才能修成菩萨？如何才能证成佛？先要知道这些教理，然后才能精修密法。假如我们在修密法前，一点教理都不懂，修起来就很困难。就像我们要去一个地方，先要问清楚路该怎么走，乘什么车，然后才能出发。这样就不会兜圈子走弯路。</p>\n<p>　　内三乘就是事业部、行持部和瑜伽部，讲的是实修的一些具体方法。事业部(又叫作部)，就是一些息灾增益的法。现在世上的灾难很多，息灾法可以帮我们息止灾难(比如地震、火山爆发、水灾、旱灾等)。增益法可以帮我们得到某些利益：比如身体健康长寿，减少疾病，财产丰富，五谷丰登等。行持部就是指修初步的观想法。修密法一般开始就是修观想法。比如修‘嗡、阿、吽’，就是用白光、红光、蓝光分别观想顶部、喉部、心部。还有‘颇哇法’，首先要从我们的下丹田观想一个两月坛城(像月牙一样的叫两月，月牙是向上弯，不是朝下弯，非常明亮)。从这个基础上起一个脉管，下面小上面大，像一个喇叭口，直通我们头顶的梵穴。要把这个脉管观亮，看著像日光灯一样亮，从会阴直通梵穴。这个脉管底下有一个明点，这个明点就像绿豆大小，比黄豆稍为小一些。月牙、脉管、明点观亮以后，再用三字诀来修。先用‘嘿’字。这个‘嘿’字是从下丹田里喊出来的。一喊‘嘿’就把下丹田的气都往上提，肛门自然就提起来了。所以密咒就起这个作用，字音鼓气；把气鼓上来，明点就由下面升到顶上了。但不能出去，一出去命就没有了。这个明点就是第八识。这时候要观想阿弥陀佛的一只脚(这就叫阿弥陀佛颇哇法)或者<a href=\"/fojiaogushi/ganying/gsyps.html\" class=\"keylink\" target=\"_blank\">观世音菩萨</a>的一只脚(这就叫观音颇哇法)踏在我们顶门梵穴上，明点就出不去了。‘嘿’气到了顶上，再用‘嘎’字。‘嘎’气就下来了。大家可以试一试，‘嘿’气就上去了，‘嘎’气就落下来了。到最后要走的时候，就用第三个字，‘啪’就出去了。比如，临终要走时，先用‘嘿’字把明点升到顶门，然后把阿弥陀佛(或观音菩萨)踏在头顶上的脚拿掉。最后‘啪’顶开了，这个明点出去，就到阿弥陀佛或观音菩萨的心中，就升到西方极乐世界了。这就是‘颇哇法’。净土宗里面也有观想法，在《十六观经》中就讲了十六种观想法。瑜伽部就是指相应。就是说我们的心要和佛的心相应，心佛道交打成一片，做功夫要言行一致，就是相应。不是说的很多，做的很少，贪嗔痴还是重得很，那就不行。所以要上与佛，下与众生，慈悲喜舍时时刻刻都相应才行。</p>\n<p>　　密三乘就是指玛哈约嘎，阿努约嘎，阿底约嘎。玛哈约嘎(玛哈是大，约嘎是瑜伽)是指通过持<a href=\"/remen/zhenyan.html\" class=\"keylink\" target=\"_blank\">真言</a>(即念咒)入定证入妙明境界。这个妙明境界就是指空、乐、明。空就是把身体化空，乐就是乐趣无比，明就是放大光明。按‘四禅八定’的修法，到第二禅天是喜，到第三禅天就是乐，这种快乐是一种轻安宁喜，是世间的任何快乐都无法相比的。证入妙明境界，出现空乐明之后不能有所住著。住在空上就不能出空界，住在乐上就不能出欲界，住在明上就不能出色界。所以尽管证到妙明境界也不能住相，要归无所得。阿努约嘎就是圆满相应(阿努是圆满之意)，就是说佛性本来如此，本来就是妙明境界，任何众生本来都具足空、乐、明，而不是由修法证得的，当一悟到：‘噢！佛不是我们修法修成的，而是本来如此！’就开悟了。所以说道不是修，而是悟。阿努约嘎比玛哈约嘎更高了一层。阿底约嘎就是大圆满相应(阿底就是大圆满)。就是说我们本身是佛，本来具足一切妙用，这就是大圆满心要。虹光法，大手印法，还有我们的心中心法等都是大圆满法。</p>\n<p>　　‘大圆满’是密宗红教最高的法，和‘大手印’是一个法。‘大手印’是修‘大圆满’的前行，藏文译为‘彻却’(意为‘立断’)。大手印把我们的本性比做一个大手，尽虚空遍法界。比如孙悟空一个跟头可以翻十万八千里，但翻来翻去还是跳不出如来佛的手掌心。我们的心量就是如此之大，这就是我们的佛性。修‘大手印’就是要证成三空相应，也就是要明心见性。三空就是指内虚空、外虚空和密虚空。内虚空就是指要把我们的身体化空。所以我们常说：修心中心法，身体没有化空还有身体在就不行。外虚空就是指身体外的空间。密虚空就是指我们的本性，即佛性。我们的佛性本来是空，本来就没有东西。没有什么男女老少，青黄赤白。但它又不是断灭空，不是一点东西都没有，而是灵妙真心，就是妙有。妙有者，有而不有，不有而有，无相可见。所以它具有很大的功能，很大的能量。我们将内虚空、外虚空、密虚空化为一体时，就是一个大空。这个大空并不是一点知觉都没有，而是了了分明，灵知了了。这就是彻却界，即大手印。</p>\n<p>　　大手印的三要素就是见、定、行。就是要做到见、定、行三合一。我们首先要<a href=\"/remen/jiandi.html\" class=\"keylink\" target=\"_blank\">见地</a>正确，要明白什么是我们的本性。知道本性是一切众生都具有的，它不生不灭，不增不减，不垢不净，不动不摇。这样就知道这个世界上的所有东西都是虚妄不实的，都是‘因缘所生法，我说即是空’。我们只要把自己所执著的一切东西都放下，恢复我们活活泼泼的本性就成就了。所以见地正确就有了<a href=\"/remen/dingli.html\" class=\"keylink\" target=\"_blank\">定力</a>。因为我们知道外面的色、声、香、味、触、法都是假的，都是不值钱的稻草，就不再著相了。有了佛性这个大宝贝就不要外面的稻草了。我们最珍贵的佛性，在佛经上被誉为‘摩尼宝珠’，能予众宝。它能生出一切东西来。我们的心安定了，行为就能合拍，这就是瑜伽，即相应。假如我们说的是一套，做的是另一套那就不行，因为我们的行为没有修上去。所以‘行’就是指要能真正证到。</p>\n<p>　　修大手印明心见性后，再进一步修大圆满脱嘎法(意为顿超，亦叫虹光法)。禅宗是先开悟，开悟后再在境界上把自己的习气磨光，把所谓的见惑、思惑、尘沙惑、无明惑全磨炼光净，一点也不著相了，这样就成就了。密宗比禅宗多了一个方便接引法，就是脱嘎法。脱嘎就是用我们身内的五种光和外界的五种光合起来，光光相映，合为一光。我们身内的五种光就是：一、远通水光，就是从我们眼睛里放出的光。我们的眼睛不是水汪汪的吗？这是由于有脉管直通到眼睛的缘故。二、白柔脉光，就是各种脉管所放的光。练气功的人不是讲任脉、督脉、中脉等等。这些脉管都放光，就叫白柔脉光。三、肉团心光，就是从我们的心脏放出的光。四、法界体性光，就是我们自性的光明。五、界性净光，就是我们的整个身体是一个法界，身体统统是光。外面的五种光就是：太阳光，月亮光，灯光，水光和黑光。黑暗也是一种光。修虹光法就是用外面这五种光，激发我们身体里面的五种光。我们现在不是有激光吗？！就是把能放光的红宝石放在激光盘里面，用强烈的电光打上去，把宝石本身的光激发出来，这就是激光。激光很强能穿透钢板。修虹光法就是用外界的光刺激我们的本性光。这样外面五种光和身内五种光合为一体，就使整个身体由量变到质变，变成一个光明体。到临终时，‘轰—’化成一束光就走了，这就是即身成佛，与即生成佛不同(一个是身体的‘身’，一个是生命的‘生’)。即生成佛是指活在世上这一生能成佛，但临终时没有化成光还有身体遗留下来；如果身体化成光也成佛了，就是即身成佛。修成虹光法最好的情况是爪发不留，身心都融于法界而变成光明体；修得不太好的还有指甲和头发留下，其余都化成光了；修得最坏的情况是身体不能化成虹光，而是缩阴，就是身体缩小了。比如<a href=\"/remen/gongyang.html\" class=\"keylink\" target=\"_blank\">供养</a>在九华山百岁宫无暇禅师的报身，就是缩得很小，不足二尺，装金后供在<a href=\"/remen/fokan.html\" class=\"keylink\" target=\"_blank\">佛龛</a>里面供人瞻养，那就是缩阴。</p>\n<p>　　要修虹光法就不能工作，要<a href=\"/remen/biguan.html\" class=\"keylink\" target=\"_blank\">闭关</a>，要从早到晚不停的修才行。如果修一修又去上班了，那就不行。因为这个法不是看太阳光就是看水光，不是看水光就是看月光，不是看月光就是看灯光，不是看灯光就是看黑光。总之要一天到晚打坐修法才能成就，不然就化不成光。所以没有时间或不具备好的外部条件都不能修。比如你现在要看水光，那就必须有水才行啊！所以虹光法修起来很难。即使虹光法修成后，也不能有所住著，如果住著在虹光上，也只不过是法界一游魂，不能圆证佛果。因为佛性本来是空的，我们的心，就像整个大虚空一样一丝不挂，一尘不染。一切相都是我们本来具有的佛性所显现的。佛性是具足万相，具足万能的。因为一切都没有，所以才能有一切。佛教的教理是最圆满最彻底的。而其他宗教总有个东西，总有点住著。如果住在一点东西上，其它就不能圆满具足了。</p>\n<p>　　可见密宗到最高层和禅宗讲的完全一样，也是无相的，有相法都是导引法，都是初步的摄机法，无相法才是上上法。禅宗其实也是密法，并不是显教。密者就是如来密因，无法可见也。《楞严经》中不是讲：大佛顶首如来密因<a href=\"/remen/xiuzheng.html\" class=\"keylink\" target=\"_blank\">修证</a>了义吗？！我们的佛性就是无相可见，无声可闻。既然无声无相又怎么能见到呢？所以说大佛顶是见不到的(只要心心相应就是)。这就是如来密因，这就是秘密。就像惠明问六祖大师：‘还有更密的吗？’六祖说：‘密在汝边，与汝说者即非密也’。意思是说秘密在你自己，和你讲的就不是秘密。前面我们讲过禅宗有外道禅、凡夫禅、小乘禅、上乘禅、最上乘禅。外道禅是带异计而修的，心外有法，欣上而厌下，他们不知道上下都是平等的，众生就是佛，佛就是众生；凡夫禅不是带异计而修，是正信因果而欣上厌下；小乘禅是悟了偏空真理而修的，认为这个身体不是我，偏空了；上乘禅(又称菩萨禅)是悟法、我二空之理而修的；最上乘禅就是悟了我们本身就是佛，佛就是我们。如来自性我们一点也不缺少，同佛一模一样。这样来修就是最上乘禅。这和密宗的大圆满不是一样吗？！所以讲到最高处密宗和禅宗完全一样。</p>\n<p>　　(四)</p>\n<p>　　‘相传在西藏密部中，有不修而成佛的法门两种：一种是迁识往生的颇哇法；另一种即本法。’(见原文三十五页)。不修就可以成佛，那该多好！大家都想得到这样的法。不修真能成佛吗？其实不行啊！关于‘颇哇法’我们前面讲过，所谓不修是不需要修禅观，但还是要修观想的。而这本《中有教授听闻解脱密法》虽如本经所说：‘此法为不需要修习禅观见法即得解脱之甚深教授。’(见原文四十页)。但我们熟悉本法的内容，时时刻刻不忘记，也等于是修啊！所以大家不要贪便宜。</p>\n<p>　　我们现在修法都不离禅观。观就是观照，就是看著念头起处不跟著它跑。净土宗的‘般舟三昧’，‘念佛三昧’就是禅观。《观无量寿佛经》中就讲了十六种观的方法：观太阳、观净土圣境、观阿弥陀佛等等，其中最容易的念佛观是第十六观。就是耳根要听著自己念佛的声音，字字分明。现在的净土宗人散心念佛就不能入观。他们一面念佛，一面妄念乱动，还说废话，所以修得不得力。以为反正阿弥陀佛发大愿要来接引我们，只要相信有西方极乐世界，再念念佛就行了。因为我们是带业往生吗！业造了可以带走，带到西方极乐世界去。真这么便宜吗？其实错误了。带业往生是不错，但应明白业就是心念动。心念一动无明就起。所以《起信论》中说：‘无明为因生三细’。这三细相就是业相、转相、现相。心念一动无明起就是业相，即造业之相。我们本来没有相，因为法身无相，一点东西都没有。在《四书》中也讲：‘混沌初开。’混沌的时候本来是没有相，就是我们大家不安分，妄念乱动。这就叫真如不守，自心乱动。认为有觉性就应当有所见到，怎么没有见到东西呢？怎么是空呢？因为追求有相，动的就更利害了，动上加动，所以业相就是动出来的。从无要转到有这个过程就是转相。最后于混沌中现出相来这就叫现相。所以‘无明为因生三细’中的三细就是<a href=\"/remen/yezhang.html\" class=\"keylink\" target=\"_blank\">业障</a>。这个业障不是我们一生一世修行就能了光的。到了等觉菩萨位(十地之后就是等觉妙觉)还有最后一分无明未破，这就是业，要生西方极乐世界还得带著走，所以叫带业往生。不是说我们一面打坐念佛，一面修法，一面做点坏事造点业不要紧，不能这样理解。我们假如已经信佛修法就不能再造业了。再做坏事那就是知法犯法罪加一等。做坏事就要下地狱，不是说可以带著往生。所以我们要小心，千万不要错会‘带业往生’之意。我们要众善奉行，多做善事。诸恶不做，坏事再微小也不要做。现在修净土宗的人认为：我们带业往生，临终十念就可以生西了，现在不修行不要紧。现在不修行到临终时你能念吗？！临终能念就要靠我们现在做功夫才行。我看到很多人临终时四大分散，非常痛苦，根本就不能念了，甚至听也不想听：‘哎哟！烦死了，我的心乱的很。’这是什么缘故呢？因为他心里不清净，舍不得离开这个世界。他生于斯，死于斯。他的亲属、金银财宝，名誉地位都在这个世界上。再加上四大分散苦不堪言，那时叫他念佛他念不出来了。临终时能念佛就要靠现在做功夫。要有很好的定力，病痛来了也没关系，还能念佛，<a href=\"/remen/zhengnian.html\" class=\"keylink\" target=\"_blank\">正念</a>还能提起来。现在不用功靠临死那一会儿怎么行呢？从前我们有个师兄弟也是这样说：‘现在不用功不要紧，等我快死的时候用一个星期的功就行了。《阿弥陀经》不是说：若一日二日……乃至七日，一心不乱，彼佛现前吗？’后来我看他非但一个星期的功夫用不上，还痛苦混乱的已不知道用功了。所以不是这么夸夸其谈就行的，临终十念带业往生不是那么简单。我们要想稳妥，还是现在要好好用功，要做到一心不乱才行。</p>\n<p>　　禅宗也是一样不离禅观。比<a href=\"/remen/rufa.html\" class=\"keylink\" target=\"_blank\">如法</a>相宗要修唯识观，天台宗要修<a href=\"/remen/zhiguan.html\" class=\"keylink\" target=\"_blank\">止观</a>，还有参话头都是禅观。参话头要起疑情，整个身心都观注在这个疑情上凝做一团，果真能如此好消息就来了。就怕你心散乱起不了疑情，所以一定要深入禅观才行。密宗更是注意禅观，它是以身(印)、口(咒)、意(观)三密加持。手结印脚敷坐，手脚都不动了这是身密；口持咒不停，这就是口密；意就是观照，这就是意密。所以密宗也离不开观。有相密更是不离禅观：观种子、观光、观佛、观月轮、观日轮、观气脉明点等等，没有一个法不用禅观。</p>\n<p>　　而这本《中有教授听闻解脱密法》与其它法不同，它直接指示我们，每一个人到死的时候，都有死光发现，都要放光明。不是因为修而放光，不修的人死后也要放光。因为本性是具足光明的，只是因为我们被色相所迷而不觉。所以我们只要把经中所述的经过情形记得很清楚，到死的时候识神一出来，边上再有道友给我们提醒，我们一醒悟与本性光明合上去，就能成就了。这就像我们演戏时，一个角儿在台上忘了台词，边上有专门提词的人给他一提醒，他就想起来了，就知道该如何去做。从这个意义上来讲，本经的确是不需要修禅观就可以解脱的法门，但是大家不要贪这个便宜。一听不用修，你们就不修了，放放野马！这样可就坏了。因为现在你不用功修法，一点功夫也没有。到死的时候就像喝醉了老酒，昏昏迷迷、糊里糊涂的，既使边上有人提醒你，你也不能醒悟。由于光明显现的时间不长，只有一顿饭的时间，顶多半个小时之后，生前所造的业就像电影一样，一幕一幕地现前了。这样你就跟著这些业障走了，而错过了解脱时机，那就太可惜了。另外临命终时没有好的因缘也不行。佛在《阿弥陀经》中再三叮嘱：不可少善根、福德、因缘得生彼国。所以时间因缘很重要。比如快死的人被送到医院去抢救，医生用很长的强心针给他打进去，还‘砰咚、砰咚’的为他做人工呼吸。快死的人已经很难受了，这样做他还能安稳吗？还能给他行这个法吗？就不能做了。所以还是要小心谨慎为妙，大家还是要好好用功才对。另外，人的根性各不相同，有的人很早就听到净土宗的修法，可是没有很好的修行，只是随随便便的做做早晚课。而有的人一直不知道有这个法，在临命终时才听到善知识和他讲：念佛可以生西方极乐世界。他有大善根，那时候就能一切放下，马上正念提起：阿弥陀佛、阿弥陀佛……，这一念也能生西，也能超脱。所以不能一概而论。不修禅观的确可以解脱，但是我们现在能多用功还是多用用功好，以防万一我们到临命终时不具善缘而未得解脱，错过此生。</p>\n<p>　　我们活的时候，修法不得力，修未成佛，就得靠本法在中阴时期得度。就连藏密黄教的祖师宗喀吧大师也是靠中阴救度法成就的，因为他在世时要整理红教的教规：去其糟粕，取其精华，严持戒律。他作为一代导师要领导群众，为大家奔忙，自己修持的时间少，耽搁了自己。所以我们一定要用功才行，不可大意！为什么我们活的时候，修而未成佛呢？老实讲还是自己不肯用功，不肯放下一切。贪、嗔、痴还很厉害。假如我们果真肯放下，没有一个不成功的。‘放下屠刀，立地成佛。’只要肯放，当下就是！因为我们本来是佛。我们开悟了，就明白了：实相是无相的，就是了了分明的灵知。它是包含一切的大能量。所有相都是假的，都不可得。要在境界中磨掉自己的习气，才要著相，赶快凛觉，禅宗称此为‘牧牛’。就是把牛的疆绳抓紧，鞭子高高举起，才要著相就抽打过去。这样做一定能成就。所以在有生之时修未成就者，都是因为自己不肯努力用功。现在图个惬意，吃吃大鱼大肉，跳跳舞，搓搓麻将，多开心啊！哎，著相著得厉害，不肯放手一切。不好好用功怎么行呢？！我们本来是佛，只要我们把习气除掉，把无明打破，不再执著，哪能不成就呢？不要分别这个法高，那个法低，成佛了就知道：‘是法平等，无有高下’。释迦牟尼佛早就知道末法时代的众生都不肯好好用功，专为我们设了<a href=\"/remen/jingtufamen.html\" class=\"keylink\" target=\"_blank\">净土法门</a>，依仗佛的慈悲力量接引往生，不然也不需要净土法门。后来莲华生大士又为我们说《中有教授听闻解脱密法》，作为人生的最后一次救度。种种法门都是佛菩萨慈悲心切，根据各种人的根基而设的，并不是法有高下。</p>\n<p>　　现在大家有缘看到这本书真是要庆幸万分。因为多生历劫在六道中轮回，现在终于有解脱的把握了。我们能得到如此大的福报，绝非一佛、二佛、三佛所种的善根。诸位不要等闲视之，要时时刻刻地回忆，记熟本经的内容才行。到临命终时一经提醒就可以解脱了。</p>\n<p>　　无论什么人，聪明也好，愚笨也好，没有一个不是贪生怕死的，都想多活几年。俗话说：‘好死不如赖活著’。就是说再好的死还不如活在世上受受罪好。我们平常说害怕，其实就是怕死。如果你死都不怕了，还有什么可怕的呢？！有人说：‘怕鬼怪’。怕鬼怪把你抓去，还是怕死。其实‘死’只不过是这个身体坏了，本性是不坏的。所以，‘孔子云：朝闻道，夕死可矣。此语正可为本法的写照’(见原书四十一页)。儒、释、道有许多相通之处。尤其是孔子著的《<a href=\"/ctwh/jing/13j/lunyu.html\" class=\"keylink\" target=\"_blank\">论语</a>》，我们应该好好学习，因为讲的都是世间法啊！‘佛法于世间，不离世间觉。’世间法中的纲、常、伦、理我们都要通达。假如世间法不通，人格都不够，还能成佛吗？！所以伦理、<a href=\"/remen/daode.html\" class=\"keylink\" target=\"_blank\">道德</a>于学佛人更为重要。‘朝闻道，夕死可矣。’就是说早上能听到这个大道，明白了这些道理，晚上死了也不怕，没有什么可遗憾的。因为我们没有虚度此生，我们的法身得度了，慧命得救了，就能出六道轮回，就不会死了。其实我们本来就没有生死，因为佛性是不生不灭，不去不来，不动不摇，不增不减，不垢不净的。有的人说：‘佛法只修心不修命，不好，还是道教讲性命双修要好一些。’哎，这些人真是糊涂！我们的佛性就把性和命都包括了，就是性命双修。因为佛性是万能的，它亘古长存，不生不灭，这不是长命吗？还有什么命能比这更长呢？！而道家练出的阳神却是‘纵然百万劫，依旧落空亡。’它怎么能和我们的佛性相提并论呢？阳神只不过是第七识所生的意生身，还是假的。佛性才是无量寿。阿弥陀佛三个字解释起来就是无量寿，无量光。无量寿不是把<a href=\"/remen/shouming.html\" class=\"keylink\" target=\"_blank\">寿命</a>包括在内了吗？还需要什么性命双修！肉身终究是要败坏的，因为有成必有坏，有生必有死。这就是辩证法。《金刚经》中所说：‘所谓佛法者，即非佛法。’也是辩证法。所以恩格斯说：‘辩证法最初来源于佛教’。有些人还不满足，还要什么性命双修，去修这个身体，其实错误了。这就叫外道苦修身必坏。身体是房子，修房子有什么用？我们应该修房子的人，就是佛性。所以我们真正闻到大道，得到这个旨趣就不怕死了。尤其是读了这本书，到死的时候识神一出来，看见中阴境界，自能了悟实相。因为佛性本来就是大光明。我们不能放光是因为有迷误，有妄想颠倒。断气时四大分散，痛苦得迷闷了。妄念动不出来，那时候就放光了。这就叫死光发现。这时我们虽然放光但就像喝醉了老酒一样，什么都不知道。这个光明持续一会儿，业障就像电影一样，一幕一幕地现前了。我们的识神就跟著这些景象动，这样就被业障拉走了。这一段迷闷时候的光明和我们打坐打开时候放的光是一样的。我们要认识它，这就是我们的本来面目。到那时一经提醒，与光明合上去，就能证成报身佛而得解脱了。所以强的光好，昏暗的光不好，喜欢昏暗的光就堕到三恶道里去了。明白了这些就不致误入迷途，不至于走错路，看见境界也不害怕了。怕都是怕死。我常常和修法的人讲：‘你们见到什么境界都不要怕，不死怕什么呢？’我们有位同参修法的时候气脉发动，‘啪！’爆开了。‘哎哟！不得了了，命没有啦！头要爆开了。’他非常害怕。其实不要害怕，头是爆不开的。那只是气脉发动帮我们打通脉络，就是练气功的人所说的打通任脉、督脉、奇经八脉等。打通时要发生振动，这是身体在发生变化。你怕什么呢？假如身体不发生变化，说明我们没有修好。功夫做得好身体是要起变化的。如果见到定中的境界更不要怕，都是假的。有人看见蟒蛇、猛虎，狮子：哎哟！吓死了。怕什么呀！都是由于我们心里不空净，第六意识才变现出这些境界，只要我们不理睬它，它马上就消失了。从前我们一个师兄弟打坐的时候，有一个大毛手像蒲扇一样大，‘啪—’闷在他的面孔上。‘哎哟，大毛手要把我闷死了。’他赶快念这个咒、那个咒，统统都念了还不行。最后没办法了就想：‘死就死吧，反正听师父讲过色身是假的，不要这个色身闷死算了。’这个念头一动，大毛手马上就没有了。可见这些都是虚幻不实的东西。一切法、一切咒都不如我们心空净。心真空净了，一切境界就消失了。所以打坐时，看到什么境界都不要怕，都是假的。要记住‘凡所有相，皆是虚妄’。既使看见佛来也不要喜欢。佛来斩佛，魔来斩魔，都不可得。</p>\n<p>　　佛的教理很<a href=\"/remen/yuanrong.html\" class=\"keylink\" target=\"_blank\">圆融</a>，越是有知识的人越爱看，现在很多欧美人都不信天主教、基督教而改信了佛教。因为佛法是科学的，是能够证实的。在佛的教理中最令人难以接受的就是六道轮回。有的人说：‘死了之后怎么还有六道轮回呢？我们也看不见摸不著，恐怕没有吧。’实际上确确实实是有！只要我们依照一定的方法去做去修，修到一定程度就能看到六道轮回真的是有。只是它们的形像稀薄，我们肉眼看不见。比如色界、无色界的相我们就看不见，色界的相是妙相，比欲界要好。无色界也不是什么形像都没有，只是越高越微妙，越高越微薄了。等科学更昌明更发达的时候，就能照见中阴身。那时大家就会相信不再疑惑了。中阴身就是我们平常说的魂灵，就是识神，它的的确确是存在的。它就是这么转来转去，做善事为人类造福就升天，做坏事造恶就下地狱，一点不假。还有的人说：‘那人为什么不知道前世的事情呢？是不是喝了迷魂汤了？’其实不是。而是经过入胎、住胎、出胎就昏迷了。入胎就是在男子放精的时候，把中阴身冲进母亲的子宫里。男子的精液很臭，母亲的子宫里也是血肉模糊，中阴身在这样浑浊的环境里住九个半月就昏昏沉沉的了。这就叫住胎中阴(以后再详细介绍)。生出来的时候，头朝下脚朝上翻个颠倒，从骨盆里像两座大山夹著一样硬被挤出来。这样经过入、住、出这三个过程就昏迷了，就不知道前世的事情了。经过入、住、出能不迷者只有佛能做到。那么有人要问了：‘怎么有的人知道前世的事情呢？’的确是有，报纸杂志上曾报道：美国好莱坞的明星转胎到了保加利亚，他就知道自己前世的事情。他把他前世的事情讲出来，人们经过验证一点也不错。在我国的云南、贵州等地也有好几个孩子知道自己前世的事。这是什么缘故呢？那是因为他们的缘份好，在小孩刚要出生的时候，把前面一个中阴身赶出去，而自己抢住进去，这就叫抢胎。就像文革时期抢房子，把别人赶出去，自己住进去。所以他没有经过入、住、出这三个阶段就知道前世的事情。由此可见，六道轮回一点也不假，不是死了就完了。</p>\n<p>　　佛说的话不是空口无凭，都是自己亲自证实的，大家一点都不应怀疑。不然的话，佛在世的时候也没有显微镜，佛怎么说：‘人看一杯水，佛视千万虫。’呢？！那时也没有望远镜，佛怎么说：‘天空中有很多很多的太阳，很多很多的世界。’现在这些都能验证了，水里是有很多的细菌，太阳也有很多，世界也有很多。现在我们不是能乘宇宙飞船到月亮上去吗，他们说月亮上没有人，也没有生物，其实月亮上、太阳上都有人。大家会说：‘哎哟，不对吧？太阳上有人不是被烧死了吗？’其实太阳、月亮上的人都不是我们这样的身体。我们的身体需要氧气，没有氧气就无法生存。他们的身体烧不死，我们也看不见。人的肉眼连我们人间的鬼都看不见，还能看见太阳、月亮上的人吗？！你们要想看见就必须好好修法，但千万别著相，一著相就成魔了，所以佛说的话一点也不错，佛是如语者，实语者，不诳语者。所以这部《中阴教授听闻解脱密法》也是不容怀疑的，即使是不理解的地方也不要怀疑。<a href=\"/fjrw/hcrw/txds/\" class=\"keylink\" target=\"_blank\">太虚大师</a>说：‘不理解的地方先放到一边，不要去怀疑、诽谤。’以后慢慢深入地去修，修到一定的程度就明白了。佛说的话没有错误，不是假的。不像现在的人都是骗人。药是给人治病的，人命关天，还有人弄假药来害人，真是不得了。</p>\n<p>　　(五)</p>\n<p>　　《中有教授听闻解脱密法》这个题目翻译的很啰嗦。简单的讲就是‘中阴闻教得度法。’‘中有’两个字就是指中阴身。所谓中阴身就是前面一个身体已坏，后面的身体还没有形成当中以风大为主的阴身。我们现在的身体是以地大为主，都有躯壳拖累。中阴身少了这个大包袱，所以他有小小的神通，但不像佛那样神通俱足。中阴身是七天一个生死。人死后，头一个七天中阴身还高大些，到第二个七天的时候，前个中阴身死了，第二个中阴身又重生。但比前个中阴身要矮一些。越到后面越矮，投胎也越坏。所以救度要越早越好。而本法就可以使中阴身在听到教授后得到解脱。所以本法是西藏秘密部的宝经之一，是莲华生大士创建的无上大法。莲华生大士从印度来到西藏，奠定了宁玛派(就是红教)，所以他是西藏宁玛派的初祖，但不是西藏教的初祖，他的传承是以心印心(<a href=\"/remen/fozu.html\" class=\"keylink\" target=\"_blank\">佛祖</a>都是以心印心)，我这样理解，这样成道，别人这样理解也这样成道。大家成道都是一样的，就像同一枚图章印出的文字一样，没有什么不同，这就叫以心印心。因莲华生大士是肉身飞升成道的，所以他把人在死的时候是什么样的境界，看得清清楚楚。莲华生大士慈悲我们，因为人身难得，为了使生前修法不圆满的人，不要再错过此生，使我们临死的时候能有最后一次机会得度，他便把在中阴阶段看到的情形以及如何得度的方法记录下来。写下来之后，藏在山洞里面并没有传授，也没有人知道。这是什么缘故呢？因为一切法的传授都需要时间因缘。就像我们做功夫，也要时间因缘成熟才能打开本来，亲证佛性。后来，莲华生大士自己化身成羯磨洲大师，把藏在山洞里面的这部密法拿出来<a href=\"/remen/liutong.html\" class=\"keylink\" target=\"_blank\">流通</a>。我们中国密宗的由来也是这样，佛在当时把密本写好后，藏在铁塔里面。后来，时间因缘成熟，才由龙母菩萨(即龙树大势菩萨)从铁塔中取出来弘扬。</p>\n<p>　　大家知道,三世诸佛都未曾讲过人死后七七四十九天的过程,更未提到死后如何才能解脱。佛经里面的很多法都需要经过修持才能成佛，而不需要修持就能成佛的法，唯有莲华生大士的这本‘中阴教授解脱密法’。因为莲华生大士看见我们众生(尤其是末法时代的众生)，都不肯死心踏地的用功修行，他悲心痛切为我们留下这部无上密法。的确，现在能有几人肯死心蹋地的修行用功呢？！都是在那里马马虎虎，敷敷衍衍的。因为没有真用心，所以很好的法也修不相应，身体化不空。比如有些人念佛，就不是心口相应的念，而是口念心不念。一边念佛还一边算东算西，思想乱得很。我看见很多老太太、老太公嘴里一面念佛，还一面议论张家长、李家短。根本没有好好念佛！所以憨山大师说：‘念佛的人要像推重车上山，极力追顶。’就是思想上要有这个佛号，一个字一个字在大脑里过才行。持咒的人也要这样，把咒文一个字一个字的在大脑里过，耳朵要听清爽念咒的声音，这就叫‘心念耳闻’。这样做必定能入定，身体必定能化空。不这样做身体怎么能化空呢？！有的人还有身体在就以为是空了，问他：‘你还能听到外面的声音吗？’他说：‘听得见’。那就没有空啊！真空了，声音就没有了，整个世界都没有了，唯有历历孤明，历历者就是了了分明，孤者就是绝对真心没有第二个。他又说：‘能听到声音，但他讲话的内容我没有分别。’这不算入定，还差得远呢！因为你没有化空、没有空净，你没有脱开怎么行呢？！所以莲华生大士悲悯我们，写下这部中阴救度法，使人在死的时候能被唤醒。</p>\n<p>　　当然如果我们真正能做到断惑证真，就可以不要这个法了。因为我们遇到境界心不动不著相，活的时候就成就了。来州和尚讲：‘真正开悟，生为福德本，死是报身佛。’就是说真正开悟了，在世的时候就能为大众造福，到死的时候就是报身佛，就没有中阴身。所以说上根人不落中阴。真正往生西方极乐世界的人也没有中阴身，他一断气就看见阿弥陀佛来接引，就生到西方极乐世界去了。可见真正的上根人就无需中阴救度法。</p>\n<p>　　但是要知道横超三界，生西方极乐世界很不容易，断惑证真竖出三界更不容易。因为法身成就不是中下根人所能证到的。我们多生历劫的习气很重，就像臭马桶，多年的积粪在里面，臭气很难一下消除。这就叫做‘真理虽然顿达(理我们知道了)，妄情难以了断(执著的习气、妄情还重得很)。’可见有些用功修净土、禅宗和密宗的人认为不一定要熟悉《中有教授听闻解脱密法》是错误的。比如参禅，中下根人就不容易开悟。参禅人要起疑情，但很多人疑情起不起来，在那儿念话头。这样还不如修净土宗念佛法门，有佛接引，命终时往生西方极乐世界，这个还容易做到些。但是念佛没有做到一心不乱也不行。佛接引众生是无缘大慈，纵然你不信佛、不念佛，佛菩萨也会慈悲的来接引你。只是到那时你心里混乱得就像一潭浑水，看不见佛来接引。甚至看见强烈的佛光还吓的逃避。所以末法时代人根陋劣，就是往生净土，也不是个个都能做得到。就连天台宗的开山祖师智者大师，为了接引众生，设立教观，耽搁了自己的修行。在临终生西方极乐世界时他说：‘我仅得中品’。这样看来，我们还是需要依靠这本《中有教授听闻解脱密法》。通过熟悉本法，你就知道死后中阴境界究竟是怎么一回事，当中阴境界显现时，边上有人一提醒，你就可以得度了，差一点的也可以生到佛的净土，得真实受用。</p>\n<p>　　关于‘莲华生大士的应化事略’书上都有，在这只稍微讲一讲：莲华生大士是在释迦佛圆寂八年之后，降生在西印度陀曩俱舍海中的一朵莲花上。他是由阿弥陀佛的大愿，观世音菩萨的大悲心，释迦牟尼佛的大智身综合起来化生的。我们常说：‘莲花出污泥而不染。’因此莲花在这里是表法的，表示清净无染，因果同时，圆满无碍。莲花生大士具足一切佛菩萨的智慧。他从西印度来到西藏，奠定了藏密的基础。所以他是西藏密宗红教宁玛派的大祖师(那时西藏的密教是不正规的黑教)。以后从密教中又分出黄教、白教、花教等。莲华生大士是肉身飞升成佛的，不像禅宗的祖师圆寂后都有色身留下。有的是色身不坏，就像<a href=\"/chanzong/gongan/36284.html\" class=\"keylink\" target=\"_blank\">禅宗六祖</a>慧能大师的肉身现在还在南华寺。还有石头希迁祖师(他是六祖大师的徒孙，本来是徒弟，因为他去拜见六祖时，六祖快圆寂了，叫他去参拜师兄青原行思)也是肉身不坏。在日本侵略我国时，被日本的一个牙科医生偷去，现供养在日本的博物馆，每年开放一次，供众人瞻仰。</p>\n<p>　　在我国流传的经，都是从印度文翻译过来的。如《楞严经》没从印度传来时，智者大师(天台宗的开山祖师)听到这部经的名字，就每天向西方朝拜，希望这部经能尽快传到中国来。而在当时寺院中流传的各种<a href=\"/dazangjing/\" class=\"keylink\" target=\"_blank\">大藏经</a>中(如《碛砂藏》、《龙藏》、《大正藏》等)不但没有‘中阴救度法’这部经，甚至连名字孙景风居士也没听到过。在翻译这部经的三十年前，孙景风居士归依了金刚上师诺那尊者。所谓金刚者，它能摧毁一切，而一切不能摧毁它。这里还是表法的，表示坚固不坏。上师表示能够为我们摧毁一切邪魔，让我们圆成佛果。真正的金刚上师需具备这样的功德。诺那上师从西藏到内地传法时到过上海。在西藏传法的几位大德当中，诺那上师是最有智慧的。他精通‘般若’。其他的上师只懂得西藏密教的<a href=\"/remen/yigui.html\" class=\"keylink\" target=\"_blank\">仪轨</a>，对‘般若’还不精通。那时候康藏两个地方佛教昌明，以密宗最为殊胜。普遍传了‘颇哇法’，当时在上海修‘颇哇法’的人就很多。‘颇哇法’很简单，在西藏密乘里，大多先修这个法，再修别的法。别的法假如修不成也不要紧，还有‘颇哇法’做保险。可以生到西方后再修。</p>\n<p>　　后来孙景风居士又拜了个蒙古师父叫宝堪布上师。宝堪布上师告诉他，有一部密而又密的宝贝经，就是现在讲的这部《中有教授听闻解脱密法》。但在当时宝堪布上师秘密得连经名也不肯说，并告诉他只要听过七遍的人不必修也能成佛。孙景风居士听了之后疑惑不解：哪有这么便宜的事？不要修就可以成功，恐怕没有。大概是宝堪布上师骗骗我的，其实不是。为什么说要听七遍呢？因为听一遍、两遍人往往不注意，听过七遍就耳熟能详记住了。基督教里也讲：‘七天而成就。’从始至终是一周，一个循环。但这个数字不能说死；一定要七遍，八遍、十遍就不行？而是说要圆满，要把经文听熟才行。假如我们听七遍还不熟，那就要多听几遍。就如同禅宗人做功夫‘打七’一样，也是这个意思。‘打七’就是表示从头至尾自始至终要立竿见影，打坐成功，克期取证。如果七天不成就，就再打下一个七。就这样‘一七’、‘二七’……一直打下去，直打到圆满为止。听熟了之后还不能忘记，要常常想著经里的教导。要把这些教导记住：我们到什么时候开始放光，而光明就是我们自己，在中阴阶段看到光明后与之合上去，那就必定成佛了。所以本经真是功德无量！没有福报的人是听不到的。大家今天能听到真是无上的福报！无穷的福报！要做难遭遇想。</p>\n<p>　　宝勘布上师秘密的不肯讲经名，并不是保守，而是因为尊重之故。恐怕轻轻易易地告诉大家，人们不重视，反而等闲视之了。比如我们讲明心见性，说：‘见性不难，明心也很容易’。一些人听到后觉得这么简单，就不注意、不尊重、轻轻易易地放过去了。其实见性是不难。前面讲了，所谓‘性’者就是我们见闻觉知的能量或性能。眼睛能看见东西，耳朵能听到声音的功能就是我们的佛性！没有什么稀奇，很容易。但一些人听过以后不当一回事，这个耳朵进去，那个耳朵出来变成耳边风了。古人则不然。他就是不知道，而一但听到：‘就是这个！’他马上很珍惜，绵绵密密地保护它，时时刻刻不放松。我们现在的人以为‘这个’并不稀奇，还有些人也没福去想、去接受，还怀疑说：‘这个是佛性？假如这个是佛性，我怎么没有得神通呢？’唉！他并不知道仅仅是听到一点消息，还没有把色身世界都化空，还没有真正的亲证。要把色身、思想、世界、虚空都粉碎无余才行。但只化空一次还不行。因为多生历劫的习气深重，不是这一下就行了。当然也不能说死，也有大根器的再来人，一下子就能到底，就能成功。但这种人很少很少。</p>\n<p>　　所以，针对修行，佛在《楞严经》中说：‘有两种修法’(《楞严经》是部宝经，讲得很详细。)一种修法是：‘理属顿悟，乘悟并销’。就是瞬间懂得了见闻觉知之性就是我们本来面目的道理，乘开悟的时候一切都销光殒尽，神通大发。这种人纵然有，但少而又少。都是顿悟渐修的多，即《楞严经》中讲的另一种修法，‘事非顿除，因次第尽’。‘事非顿除’是指在事上要渐渐地修习，把多生历劫的习气一点一点除光。即‘无明分分破，法身分分证。’证到圆满时神通会自然大发。‘因次第尽’的意思是要慢慢的一步一步的修证。所以禅宗人说：‘理虽说顿悟，妄情难以觉除。’妄情就是指我们执著虚妄的情知情见，我知我见。这些一下消除不了，要慢慢来消除。换言之就叫历境练心。我们刚刚懂得了一点道理，不可能马上发神通。懂了理之后要按这个理去实修实证才是最重要的！要在境界中磨炼自己，要常需觉察，损之又损。把执著的习气和贪、嗔、痴三毒除光消尽。等到习气一毫都没有了，那就成道了。所以说我们要成道，种种方法都有。有顿悟的、有渐修的，就看你如何来承当。如果习气不改，承当不了，到生死关头怎么办呢？就要靠‘中阴救度法’来救度！</p>\n<p>　　孙景风居士在翻译本经的二十多年前就看到了一本书叫《中有听闻解脱密法》，是英国牛津大学教授伊文思博士和喀齐达瓦桑杜喇嘛由藏文翻译成英文。后又由中国的张莲菩提妙定居士根据英文本翻成中文。再后来又见到一个版本是赵洪铸居士根据英文本翻译成中文，但中文是四字一句的偈文。偈文就像诗、颂一样，比张妙定翻译的要高一筹。但因为要押韵，所以意思就有点出入。这本书的藏文名字叫‘巴多脱卓’(又名‘西藏度亡法’)。‘巴多’意为中有，就是前身已坏，后身未成当中的阴身。‘脱卓’就是让中阴身听到教义后可以得到解脱，即听闻解脱之意。大家可能会奇怪，人死了还能听到吗？能听到！因为我们的见闻觉知并不是眼睛、耳朵、鼻子、舌头、身体，而是我们的佛性。现在科学家也讲：看见东西的不是眼睛，是大脑。大脑不起作用眼睛就看不见东西。同样，听到声音的不是耳朵，也是大脑。大脑不起作用，耳朵也听不到声音。而且耳朵听到的声音是粗的，叫听。大脑听到的声音是细的，叫闻。所以本经的名字中就有‘听’‘闻’两个字。有人做过实验，给人开刀的时候，用很微弱的电流通到大脑上，大脑就能听到人耳听不到的空中的音乐声。而在他边上的人却听不到。因为边上的人是用耳朵而不是用脑神经来听，所以听不到。由此可见我们看东西也不是用眼睛看。眼睛就像眼镜一样，要通过大脑起作用才能看见。所以谚云：‘心不在焉，视而不见，听而不闻’。就是说当我们不专心的时候，既看不到面前的东西，也听不到耳旁的声音。这里讲的大脑和中阴身都是第七识所变现的。因为在第七识中形成了我相和我执。假如功夫做得好，第七识就能离开肉体出来，这就是意生身。也就是道家所说的阳神。他有神通，不用躯壳，不用眼、耳、鼻、舌，就能看，就能听，就能闻。所以我们对中阴身讲话他听得清清楚楚。其实他也在同我们讲话。死了之后，灵识(中阴身)就出来了。他本来还不知道自己死了，当他听到家人在很悲伤地哭喊，看到他的尸体睡在床上，才想到：我死了！他也喊家里人，也很悲伤，舍不得离开家人。还想往躯壳里面钻，但钻不进去了。因为肉体已经坏了。就好比电灯，电灯泡坏了，电来, 了也不会再亮了。所以这个时候他悲哀哭泣，四处乱转。中阴身就是这样一个阶段。所以你们要好好同他讲，不能哭。你们哭，他也在边上哭，哭得他心乱如麻，就不能得到解脱。净土宗也讲：人死的时候，大家不要哭，帮他助念，帮他往生西方极乐世界，就是这个道理。</p>\n<p>　　当孙景风居士看到翻译的这两种版本时，知道确实有这么一本书，但藏文原本还没有见到。他非常感慨：‘这本书在传到素有大乘佛教之称的中土之前，竟先传到了西欧！’目前欧美许多国家都在研究佛法，他们有许多高级知识分子看了佛经之后，与基督教的《新、旧约全书》(即圣经)相比，觉得佛经讲得很圆融，非常好。所以很多人都改信了佛教。可见一切法的弘扬都需要时间因缘。这本书既然已传到欧美，就没有必要再守秘密了。现在我们能看到，总算大家有福气。张、赵两居士弘法的功德，确实值得推崇。但由于东、西方文化不同，所表述方法不太一样。就姓名来讲，中国人是姓在前名在后，而西方是名在前姓在后，表述的方法就不同。而且一句话所隐含的意义很多，不是一句一意。尤其是中国字，往往一字多义。所以西欧学者翻译东方高深的佛学，容易产生一些隔阂。另外，在佛教密部里，佛是无量数的佛，名字也很多。就像《阿弥陀经》中所说的六方佛，名号就很多。经文的专用术语及名词则更多。要把词义解释清楚，不著在字义上，非常困难。我们常说：‘依文解义，三世佛怨，离经一字，必同魔说’。就是说不能光依照文字解释意思，内含的经义没有解释出来就不好。所以讲经最难之处就叫‘点中言’。就是要把中心要义点出来，点出什么是最重要的中心思想，怎样可以使我们开悟，见到本性。名词可以抛开，要把中心思想拿出来，这就叫遣辞定名。假如你自己还不理解，怎么可以把它写出来呢？而张、赵两居士的翻译，先从藏文译成英文，再从英文转译成中文。所以孙景风居士推想：纵然用同一原本，如果用直译法或用义译法，或直译与义译兼用，即使是一个人前后翻译尚难尽同。何况是经过两次转译呢？！难免有些错文略义。最好能看到藏文原本，按原文翻译成中文，可以使内容更为充实。由于孙居士精通藏文(在本书里他说粗知藏文，是谦虚)，所以他想得到藏文原本再核对一下。他有这个志愿，想得到这部经的原文又得不到，像有个东西埋在心中一样，耿耿于怀。</p>\n<p>　　‘有志者事竟成！’在宝堪布上师圆寂后，整理他经箧的时候，竟然发现此宝经的原文。孙居士如获至宝，总算圆满了多年的愿望！全经是手抄本，不是印刷出来的，因为这部经是由莲华生大士写在梵页上(西藏或印度的经都是写在菩提树的叶子上，叫梵页)。原本内容要比英译本多，共有十四种名目(这些名目后面我们再讲)。如书中的‘答卓咒本’，有很多咒(书后都附有)，可以使中阴身从痛苦的罪业中解脱出来。这些咒在张、赵两居士的译本当中仅有其名。还有‘解业集颂’，是解除业障的颂文。颂文就等于是偈语。四个字、五个字、七个字一句等等。这些内容在张赵两居士的译本中都没有了。经过对照，发现张、赵两居士的译本不够全面，于是孙景风居士发心要尽他毕生的精力重新翻译。开始只译出草稿，以后又恐怕有用辞不当，不完善的地方，经过多次修改整理后藏在箱子里面。等他到七十岁的时候(翻译时还未到七十岁)，恐怕译稿有散失，又重新整理，编好顺序，完成了这部宝经的翻译工作。</p>\n<p>　　为了使读者能够理解并记住经文，孙居士把经中的名词都作了注释，另外还附加了两部曼荼罗表。这样全经的脉络就贯通了。我们做文章写书就要脉络贯通，就像人体的血脉经络也要贯通一样。我们人体当中就有阴极和阳极，当我们思想紊乱、妄念多端时，阴极和阳极不相合。所以要做功夫，做到心真清净了，阴极和阳极自然会溶合，奇经八脉自然会贯通。但是不能有心去求。有心去求就是妄想、妄念，这样反而使气脉不通。只要一切放下，气脉自然就会畅通了。</p>\n<p>　　‘曼荼罗’就是佛、菩萨以及眷属圆满具足聚集在一起的道场、坛场。修密法的人都有曼荼罗。我们心中心密法的曼荼罗是以释迦牟尼佛为上首，下面是弥勒菩萨，弥勒菩萨下面是观世音菩萨，观世音菩萨下面是光明童子，两旁是文殊菩萨、普贤菩萨和四大金刚等。由于佛心的建立属于光明童子，他向佛偷学了心中心法的密咒之后，就能起大作用，所以心中心曼荼罗里就有光明童子。曼荼罗的名目很多，一种是三昧耶曼荼罗，一种是大曼荼罗，还有事业曼荼罗(就是羯磨曼荼罗)。大曼荼罗就是前面讲的眷属圆满聚集的坛场；三昧耶曼荼罗就是佛菩萨持不同的器械，结不同的手印聚集在一起的坛场，以表示每一个佛菩萨所发的誓愿不同；事业曼荼罗就是显示佛菩萨成就各种事业的坛场。总而言之，曼荼罗就是眷属圆满聚集的道场、坛场、方位图。它通常分东、西、南、北、中五方五佛，表示我们的五大智慧。属于中央的是最重要的法界体性智，即我们的本性光明。其余的四大智就是转第八识成大圆镜智；转第七识成平等性智；转第六识成妙观察智；转前五识为成所作智。其实我们的佛性本来没有什么方位，它是一个大圆。方位是用来表法的，比如西方极乐世界在我们世界的西边，在西方极乐世界的西边还有西边，相对来说西方极乐世界不就在东边了吗？！所以不能说死。</p>\n<p>　　在本经中有诸佛裸体双身像和饮血忿怒像，为大多数人不能接受。他们怀疑：佛经里怎么还会有这些形像？下面我们著重讲一讲。</p>\n<p>　　为什么诸佛要现裸体双身像呢？一方面是为了应众生之机而显现的，因为藏密是针对西藏人讲的(当然也是为广大众生讲的)，西藏人非常著相，说我们都是佛，他们就不能接受。他们认为：‘假如我们是佛，怎么不能显神通呢？也不具足万能嘛！所以我们不是佛，是凡夫’。要给他戴上皮绒帽，穿上佛的衣裳，装扮一下，这样他们才相信自己就是佛。所以他们需要有一定的形像才行。他们还说：‘要了生死，要成佛，没有阴阳怎么能化生呢？’所以佛顺应他们的机缘而显现双身像。其实我们人体本身就有阴阳，我们的身体是由地、水、火、风四大假合而成，火属阳，水属阴。平时因为妄想、颠倒、执著、追逐外境之故，阴阳不相合，也感觉不到。假如功夫做得好，心真空净了，就能清清楚楚地感觉到体内像两股电流‘哗……’合到一起了。这就是道教所讲的婴儿素女，黄婆为媒。就是在我们心包里的中黄庭观想成一个‘婴儿’—即所谓的阳神。这完全是观想的功夫，只要用心观想就能成功，因为一切唯心造！所以我们每个人都有阴阳，并不一定非要佛父佛母才是阴阳相交。另一方面双身是用来表法的，佛在《<a href=\"/fojing/yuanjuejing/yuanwen.html\" class=\"keylink\" target=\"_blank\">圆觉经</a>》上讲：‘一切众生皆因淫欲而正性命’。我们人有色身就是因为有淫欲心。在中阴阶段同样有淫欲心，并没有减少丝毫。当它看见有缘的父母同房时，淫欲心动就飘过去入胎了。所以生就是从淫欲而来的。我们现在要脱离生死轮回，要成佛，还是要从此处出。双身像就是表示生从此处来，了从此处出，所以是表法的。假如你们还有淫欲心，遇到这种境界时心还在动，就不能了脱生死。只不过是嘴巴上说说而已。我们要在淫欲当中能脱离欲乐，看见双身像时一点都不动心，那才是真了脱生死，否则不行。所以密宗里就有双身法。莲华生大士讲：‘双身法不能轻易的尝试’。这个法是两头蛇，一头是直接超升，一头是直堕地狱(因为只要心一动就会下地狱)。有很多人为满足他们的淫欲心，欺骗别人说：‘我们来修双身法，可以了生死’。殊不知这不是了生死，是要下地狱的。所以明白了这个道理，就不要轻易的尝试。平时要多加观照，看见双身像千万不要动心。佛在《楞严经》里讲得很清楚：‘裸体相呈，味同嚼蜡’。就是说裸体呈现在你面前，就像把蜡烛油放在嘴里嚼一样，一点味道都没有。所以最高深、最重要的是事实的考验，绝不是儿戏。佛没有一定的相，是应众生之心而显相的，叫应化相。佛为度化我们而显现双身像，看我们是不是真有定力，是不是能在欲乐当中入定。这就叫欲乐定。所以要明白双身像是应众生之机而显现的，也是表法的。大家不要疑虑。</p>\n<p>　　为什么要现饮血的忿怒形像呢？因为佛有两轮身：一种是正*轮身，另一种是教令轮身。正*轮身就是三十二相、八十种好，智慧福德之相，众生见了都心生<a href=\"/remen/huanxi.html\" class=\"keylink\" target=\"_blank\">欢喜</a>；教令轮身(也称明王身)就是忿怒、恐怖、饮血等相，是为了让魔王看见害怕，警告他，不让他来捣乱。所以忿怒像同样也是表法的，大家看到忿怒像也不要恐惧。</p>\n<p>　　我们讲这些就是为了防止有人对双身、忿怒等相发生疑惑而致堕落。防止将来境界现前时，心生邪念而怀疑、诽谤佛法：‘怎么还现双身像呢？不对吧？’要知道佛是应众生之机而显相的，就是表示我们生从此来，死从此去。一切都不可得，都是我们自己的心所显现的假相。我们的心，果真清净了，一点相都没有，就是无上大光明，就是报身佛。心如果不清净，那就要现各种各样的相。所以这些相现不现，就看我们的心清净不清净。比如西方极乐世界就分四种净土：最下面的是凡圣同居土，上面是方便有余土，再上面是实报庄严土，最上面是常寂光净土。往生到什么净土，就要看我们功夫的好坏。常寂光净土就没有相，因为佛性本来如此。只因为我们著相，才会现相。就拿做梦来比，假如我们功夫做的好，平时心里清清净净不著相，睡觉的时候就没有梦境。平时对境生心，想这想那，睡著之后就会做梦，这样那样的境界就都现前了。从前高峰祖师的师父问他：‘你平时做得了主吗？’他回答：‘做得了主’。这就很好，平时能做主就不容易了。比如这里有一锭金子，我们心就跳了：‘哎哟！这金子能归我就好了！’好色的人看见漂亮的女人，心一动，就跟著她跑了。这就叫色不迷人人自迷。好喝酒的人闻到酒香，就馋涎欲滴。这些就是做不得主。如果遇到这些境界能不动心，还只是初步。所以高峰祖师的师父又问他：‘做梦的时候作得了主吗？’他答道：‘睡梦中也能作主’。做梦的时候是半昏迷，死的时候是大昏迷(因为四大分散很痛苦)。能在梦中做得了主，功夫就进一步了。有人平时倒可以作主，但睡梦中就糊涂了。所以高峰祖师梦中能作主已相当不错了。他师父进一步问他：‘无梦无想时作得了主吗？无梦无想时主人公在什么地方！’就是这时既不做梦，也没有思想，主人公在什么地方？他答不出来了。‘哎！不行不行，赶快参！’他师父说。所以做功夫得向上升进才行。</p>\n<p>　　我们了解了双身像和忿怒像的涵义之后，在中阴阶段看见这些像时，就不要再起颠倒妄见。要知道这些相都是我们自心所显现的。我们的心就像一面镜子，所有的相都是镜子里显现的影子，任何境界都能不动心，在中阴阶段与光明合上去，就证成报身佛了。活的时候要修成报身佛很不容易，当然只要老老实实的用功，活著就能证成法、报、化三身：我们做功夫打开本来见到自性，就是法身佛；再做功夫勤除习气，心真空净了，就能转化境界，就能转化色身，就能发神通证成报身佛；再进一步就能出意生身，即化身成就。证到三地菩萨就可以现意生身(第七识意根所生之身叫意生身)。证到五地菩萨就能出三个意生身，就是道教所讲的‘一气化三清’。所以道教和佛教也有很多相通的地方。只是道教讲的不究竟，不彻底，总是著一点相。因为第七识所化的意生身还是假的，只是佛性本体所起的妙用，不可执著。到了八地以上的菩萨就能现种类具足的意生身。不光是现人身，要现什么就能现什么(如高山、大河、树木、房屋等)，可以现一切种类。这就是变化自在。就看我们怎么用功了。第一步要能做到念起不随。念头一起就能看见不跟它跑，仍然是清清爽爽，了了分明，一点影子也不留。这样就能做到受身自在，想到哪里投胎就可以到哪里投胎；第二步要能做到好坏都平等，好的不喜，坏的不恼，就能变化自在了；第三步要能做到微细流注断灭，一切化空，圆觉大智朗然现前，那就能现百千万亿化身，度百千万亿万众生了。所以在我们活的时候，按大圆满、心中心等层层入胜之法去修，就能证到这些。假如在我们有生之时没有修好，到最后还有‘中阴救度法’，可以使我们证成报身佛。我们今朝有缘能听到这个无上大法，真是无穷的福报啊！</p>\n<p>　　世人传说，人在死后会看到各种各样的境界。有的人死后会看见阎王鬼卒、黑白无常、牛头马面等恐怖景象；还有的人坏事做多了，在没死的时候就看见这些恐怖景象。我见过好几位，还是佛教徒。当然他们破坏戒律，没有很好的修行。在临死时地狱境界现前，感到非常害怕，就自言自语道：‘哎哟！某某人讨债来了，某某人讨命来了’。这是什么缘故呢？这就是由于人们生前造业，死的时候自识作崇，才变现出这些境界。人们被这些境界缠住就解脱不了。其实都是我们的识神在作怪，因为一切相都是我们自性所显现的，不是自身以外另有一个阎王鬼卒。所以说心外无法，法外无心。当遇到这种情况时就要安慰他，提醒他：赶快念《<a href=\"/fojing/dizangjing/yuanwen.html\" class=\"keylink\" target=\"_blank\">地藏经</a>》，求地藏菩萨保佑。这样就可以帮他消除业障，帮他解脱。只要他心安了，恐怖境界就会化掉。如果他心不安，就真的堕到地狱里了。</p>\n<p>　　地狱真的有吗？没有！也是假相。但是身临其境的人就不是没有。比如做梦，我们梦到好的境界就高兴，梦到坏的境界就害怕。醒了之后才会想：噢，刚才只不过做了一个梦，其实什么都没有。但在没醒的时候还是有。假相不无，唯业所现，唯识所变，都是业识所变现的。只要我们心真空净了，这些境界就消失了。有人说：‘那我尽管做坏事好了，反正都是空吗’。哎！心真空净的人就不会做坏事了，心不空净还有贪、嗔、痴的人才会做坏事。做坏事的人，到境界现前受良心的遣责想空都空不了。比如一些造业深重的人，在中阴时期就会看见七条恶狗追著咬他(这就叫七犬吠逐)，或者看见夜叉来叉、虎狼来追，把他往坏的地方赶。这时他心慌意乱，就被追到地狱或畜牲道里去了。还有那些杀鸡、杀鸭、杀猪的人，由于杀业太重，临死时就会看见红帽子、绿帽子都追来了，吓得东躲西藏。所以我们劝大家吃素，不要<a href=\"/remen/shasheng.html\" class=\"keylink\" target=\"_blank\">杀生</a>就是这个缘故。能吃素就尽量吃素，不能者暂时吃一点三净肉(即眼不见杀，耳不闻杀，不为我杀)，不要再杀生造业了，以免受报。</p>\n<p>　　可见，由于我们心里不空净，著相造业才会出现这些恐怖景象。如果我们心安了，就会现圣像佛像。如果我们心里彻底空净了，连佛像也不可得，因为法身是无相的。正如《金刚经》所说：‘凡所有相皆是虚妄’，就是我们不觉悟以为真有！不要以为现在可以抓得住、摸得著、看得见就是真的，以为我们真的有夫妇、有儿女、有金银财宝。我看到很多男男女女抱在一块，一担臭粪桶抱一担臭粪桶，肉麻当有趣，其实都是假相。就和我们睡著了做梦一样，都是梦境！明白了这些道理，平时就要在境界中磨炼自己，使自己在任何境界中都能不动心，不著相。只有这样好好用功才能醒悟。比如我们用功念佛，深入念佛三昧，身心世界都化空了，只有了了分明的实相现前，那个时候就等于我们做梦被喊醒了一样，一点境界都没有。哪有什么山河大地、男女老少、金银财宝呀！功夫要做到这个地步才行。而不是说打坐要看到什么好的境界，那些都是假相，不是真的。实相无相，所以我们不要上当！</p>\n<p>　　本经提到：‘中有身时，漂泊无依，终见三大悬崖绝壁，一白、一黑、一红，深不见底，此即其人生前贪嗔痴三毒所感’(见原文三十九页)。人死后第七识所变现的中阴身，看见他的尸体睡在床上，听见家人哭喊他的名字，这时他才知道自己死了。可他还是想要身体，想往尸体里钻，但已钻不进去，因为身体已经坏了。于是他就心慌意乱、无依无靠、东漂西漂。所以劝大家不要著相，其实我们可以不要身体。比如<a href=\"/remen/chaodu.html\" class=\"keylink\" target=\"_blank\">超度</a>亡灵时就是劝告这些亡灵：色身是苦本，赶快舍弃这个色身吧，不要再执著了！现在为你念‘<a href=\"/fozhou/wangshengzhou/quanwen.html\" class=\"keylink\" target=\"_blank\">往生咒</a>’，送你走，以免再受苦了。但因为执著之故，中阴身还是想要身体，就漂泊不定。在漂泊中，看见三个悬崖峭壁：一红、一白、一黑，深不见底，挡住了去路。这是什么缘故呢？这就是由此人生前贪嗔痴三毒所感招的。贪是贪得无厌，属火，是红色的。嗔就是嗔恨心，是白色的。痴就是愚痴，没有智慧，是黑色的。贪嗔痴具足是地狱种子；贪重嗔痴比较轻的是饿鬼道，所以饿鬼嘴里都喷火；嗔重贪痴较轻的是修罗道；痴重贪嗔较轻的是畜牲道。所以看见这三个悬崖峭壁也不要害怕，只要把贪嗔痴三毒息掉，三大悬崖峭壁就没有了。</p>\n<p>　　如果大家贪嗔痴还很厉害，将来就会变现这些恶境界缠住我们。所以看了这部经之后，大家就要醒悟了，要督促自己赶快用功。不要再贪嗔痴，都不可得。还贪什么呢？！家财亿万，到临死时一分钱也带不走，留给子孙实际上是害子孙。‘积德胜积金’，积德给子孙，将来子孙的造诣都很好。留很多钱给子孙反而不好，因为子孙不知道钱来的艰难，滥花滥用还造很多业，福报很快就会消光。从前上海银楼的小老板叫杨经武，乱花钱把他父亲留给他的整个银楼都花光了，最后自己成了瘪三在马路边冻死了。所以，我们应明白这个世界上的东西都是虚幻不实的，不要再执著、再迷恋色相了，要赶快放下来。我们迷于色相就是<a href=\"/remen/mixin.html\" class=\"keylink\" target=\"_blank\">迷信</a>。不懂佛教的人说我们是迷信，其实他们才是迷信。他们迷于色相，唯有自私、把色相当成真的去追求。这样做就会造业受报、轮回六道、无有了期。所以他们才是迷信。我们明白这一切都是假相，都不可得，就不要再和别人攀比了。各有各的缘，他现在享福，是因为他前世做得好，我们现在生活差，是因为前世做的不好，从现在起再做好就行了。有些人放不下要和别人攀比，得不到就去贪污盗窃，最终必然受到法律的制裁。所以我们应随缘度日才好。</p>\n<p>　　我们在六道轮回中头出头没，糊里糊涂的沉沦在生死苦海之中。就像粪坑里的蛆一样翻上翻下，还自以为开心快活呢。其实我们人看了这些蛆就会想：‘哎哟，真是肮脏死了’。佛菩萨看我们也是这样想：‘你们这些众生真可怜，就像粪坑里的蛆一样，还自以为开心呐！其实你们真是太苦了’。我们真的是苦啊！比如我们在这个世界上为了活著就要吃饭，为了吃饭又要去购买，买来之后还要洗，洗完了还要烧、煮，烧好了才能吃。买、洗、烧之前还要去工作挣钱，没钱怎么能买东西呢？所以整天忙忙碌碌。天上就不是这样，天上的果报好，要吃什么一想就来了，不用买、洗、烧。所以我们现在做好事，将来就能生到天上享福。但这些福享完了还要下来受苦，如果造了业还要下地狱，就更苦了。所以这个福报也不究竟。只有出了六道轮回才究竟。我们现在修佛法，就像是在六道轮回的苦海中遇上了救命的船，可以帮我们渡过苦海登上<a href=\"/remen/bian.html\" class=\"keylink\" target=\"_blank\">彼岸</a>，这就叫慈航普渡。万一遇到狂风大浪，怕船翻了，船上还备有救生圈、橡皮船等设备来帮助我们。所以佛教有很多方便法，如禅宗、密宗、净土宗等等。尤其是密宗方便法最多，五花八门样样都有。前面我们讲的九乘次第就什么都包括了。这些法就可以防止我们沉沦，能使我们尽早出离生死苦海。而本经就是最方便最稳妥的法，它非旦装有救生圈，而且装有推进器(即电动机)可以完全自动化，不用人费力就可将我们推上彼岸，所以被称为径登彼岸的保险法门。</p>\n<p>　　大金刚持佛云：‘日杀<a href=\"/remen/poluomen.html\" class=\"keylink\" target=\"_blank\">婆罗门</a>，积造五无间，若遇此教授，俱解脱无疑’(见原文三十九页)。日杀婆罗门，是印度婆罗门教的一个派别。就像天主教、基督教一样也是派别很多。我们佛教的宗派也很多：有净土宗、禅宗、密宗、法相宗、曹洞宗等等。日杀婆罗门是一种最低下的教派，他们做的是下无间地狱的<a href=\"/foxue/changshi/153417.html\" class=\"keylink\" target=\"_blank\">罪恶</a>。无间地狱有两个意思：一是说受苦没有一分一毫的间隔；二是说房子里面没有间隔，一百个人挤在这房间里挤的不得了，一个人在这房间里也是这么挤。大金刚持佛告诉我们：即使是造了下无间地狱这么重的罪，只要遇到这本‘中有解脱密法’，也能够解脱，为什么呢？就像我们睡觉做恶梦，非常害怕，这时只要把你叫醒，恶梦就没有了。本经就是将我们从恶境中唤醒，一醒就解脱了，就这么快！因为一切都是假相，都不可得。不要以为现在是真的，现在也是假相，同样不可得。功夫做得好的人就会知道，心一空净，大地平沉，虚空粉碎，那里还有这个世界呀！一切都没有了。所以我说根本就没有地狱，就看你们能不能醒悟。</p>\n<p>　　我们能听到这个法真是万分庆幸，纵然在修法时没有成就，临终还有这个保险法门。我们现在就要把本法搞清楚熟记于胸中，将八识种子培养成熟，到最后时刻，边上有人一提醒，就能醒悟得度了。可见本经非常殊胜。所以见到本经的人，断不可执一己之见而生疑谤。一己之见主要是针对经中讲到的双身法。我曾听到有几个人讲：‘这本经别的都好，就是双身不好’。还有人讲：‘还有什么佛父佛母双身法呢？不好不好’。这样讲就不好了！我们要了生死，应该没有男女之见才好。有男女之见生死怎么了呢？关于双身，我们前面已经讲过了，第一，是表法的。就是我们人体本身就有阴阳，生从此来，死从此去。生死就是从父母同房中来的，我们现在要脱离生死，也是要从这里出啊！第二，佛是应众生之机而显现的。如果众生死的时候，心里空净了，真能够一丝不挂，就不显什么相了，就是因为我们心里不清净，才看见七犬吠逐，夜叉来追，豺狼虎豹，十殿阎罗等恐怖境相。与其这样，还不如现些好境相(如佛父佛母双身相)把我们救度了。这样多好！第三，本经是莲华生大士根据西藏民族的习惯，执著的习气写的。因为西藏人文化程度比较低，非常著相，说没有相他们不相信，他们会想：没有相我怎么生出来呀！应当有父母才能出生啊。所以佛就给他们化身成佛父佛母。正如《观世音菩萨<a href=\"/fojing/pumenpin/\" class=\"keylink\" target=\"_blank\">普门品</a>》中说：应以宰官身得度者，即现宰官身而为说法；应以女人身得度者，即现女人身而为说法。双身就是应众生之机缘而显现的。第四，我们要真能了脱生死，就要经得起事实的考验。不是嘴巴上说说，理上理解就算数了。双身在你面前显现，看你能不动心吗？要事上能了才能成报身佛。事上不能了只能得法身！而本法就是让我们超过法身证成报身佛的。法身只是初步，要证得报身，进而证成化身，那才能圆满。要证成报身佛就要经得起事上的考验，看到双身相就等于没看到一样，心一点都不动。这就是最后的考验。再说我们心真清净了，那有什么单身相，双身相？什么相都没有，就是一个大光明。所以密宗的法很深，千万不要以一己之见而疑惑甚至诽谤这个法，这样做是要遭恶报的。从前弘一大师刚出家时，看到密宗双身法说：‘密宗是什么妖魔鬼怪，怎么会有这些东西？’后来，他经过深入研究才明白了，并做了一篇《<a href=\"/remen/chanhuiwen.html\" class=\"keylink\" target=\"_blank\">忏悔文</a>》。他在《<a href=\"/remen/chanhui.html\" class=\"keylink\" target=\"_blank\">忏悔</a>文》中说：‘从前我不明白乱说，诽谤了密宗。现在我深深的忏悔’。还告诫后人不懂的就不要瞎说。大家如有兴趣，可以去查看弘一大师的《忏悔文》。我们不明白的事情很多，大家断不可以一己之见而诽谤本法。</p>\n<p>　　因为这部大法是秘密部中至高无上的宝典，所以非常珍贵。可以让我们立刻证成一大法界的自性本觉圆满智。一大法界就是一真法界，具足十法界。就是我们的自性、法身。我们的法身本来就是大觉，唯一圆觉，不是后来才觉的，所以又称为本觉圆满智。六祖大师曾说：‘何期自性，本自圆满；何期自性，本自具足’。所以它是圆满具足一切，无所不能，无所不知。那么众生现在为什么不知呢？就是因为迷于色相而忘记了我们本来的佛性。一天到晚吵吵闹闹，颠颠倒倒，把假的当真，真的当假，烦恼重重，智慧就被遮盖住，光明就显发不出来了。我们做功夫就是为了恢复本来面目。所以这部法就是要我们打开本来，证得法身成就，进而报身成就(报身是光明身)，再进一步化身成就。它教导我们在中阴阶段大放光明时与诸佛的光合为一体而证成报身佛，圆成一真大法界之自性本觉圆满智。所以是密而又密的大法。</p>\n<p>　　这部大法又是阿达尔玛普贤王如来的心髓。阿达尔玛佛是一个大佛，译成中文就是普贤王如来。因密法注重实修，也很注重形像，所以密宗人认为阿达尔玛佛是最初成就的第一尊佛。在显教里没有第一个成就，也没有最后一个成就的佛，是无始无终的一个大圆。这样讲比较圆满。如果有第一个，人们就会问第一个是谁教他的呢？就像有人问天主教的教徒：‘人是上帝创造的，那上帝又是谁创造的？’这样就不很圆满。其实一切众生都是佛，那有什么第一尊呢？就是那个佛列出教规来教导众生，那个佛就是第一尊。在密宗里就是指普贤王如来。本法就是他的心髓，所以非常珍贵。就像达摩祖师收了很多徒弟。他临终时考徒弟，想看看他们的见地如何。考了之后他说：你得我的皮，你得我的骨，你得我的肉，只有神光大师得我的髓—就是指佛法的心髓。所以神光大师才能成为中国禅宗第二代祖师。</p>\n<p>　　这部法也是莲华生大士创建的西藏宁玛派无上密中密的大法。宁玛派的法很多，有证体的，有起用的。而这部法不是转弯抹角间接的法，是可以直接成道的至高无上的大法。比如，我们现在要修密法，首先让你磕十万八千个大头，念十万八千遍‘<a href=\"/foxue/jichushuji/327/10980.html\" class=\"keylink\" target=\"_blank\">四皈依</a>’，念十万八千遍‘百字明’，供十万八千遍曼达等。修完这些法就需要十几年。然后再修初步的观想法，再修相应法。相应法又分很多种，都是转弯抹角的，不像这部法立即就能成就。现在大家能听到这部密法真是非常幸运！</p>\n<p>　　孙景风居士完成了本经的翻译工作，了了自己的心愿，也实现了张妙定、赵洪铸和屈文六老居士(法名法贤，人称法贤大师，是孙景风居士的师兄)的宿愿，可以普利众生。孙景风居士非常谦虚，说自己学识浅薄，修持不够，年纪也大了，精力已经衰退，所以疏漏之处在所难免。因此，他一方面希望贤达、大德通家(即贤者智者，修法在未登初地至十地菩萨之前有三贤位：十住、十行、十回向)好好地对本经进行审查、批阅、纠正错误。另一方面，希望读者对本经不要马马虎虎地看过去，要静下心来专心致志地悉心研习。看懂了之后还应当告诉别人，帮助别人。大乘佛法好就好在这一点，不是自度就算了，应该自度度他，自觉觉他。不能自己当个宝贝藏起来，不给别人看。时间因缘到了，就应该广布流通，广为宣传、广为详说。现在很多佛门弟子坏就坏在搞封闭。到庙里要买门票，不然就不能进门。买门票进去了也没有宣传佛法，还要拿钱来，才给你念经做经忏。所以佛法扫地，真是太可惜了！还不如基督教，既不用买门票，也不用做做祈祷就交钱。他们敞开大门拉人进去听道。和基督教徒比起来我们佛教徒差得太远！在社会福利方面做得更差。基督教的同道之间互相帮助，而我们佛教徒之间彼此你说我不好，我说你不好，互相诽谤。佛教的大门应该敞开，不应分彼此，要为一切大众详详细细的解说，宣传佛教的真义。要救度众生脱离苦海，这才是佛教的本怀。如果只做做佛事赚赚钞票，这种佛教对社会、对世道人情有什么益处呢？！这样就流于迷信了，反而不好。</p>\n<p>　　最可怜的是有病快死的人，更要详细为他们解说，让他们明白。对于亡者要在他耳边给他讲，让他不要害怕。声音不要过低，要大一点，但不能太大。因为亡者的耳根比我们灵敏九倍以上。我们现在都有一个躯壳，亡者没有躯壳所以具有五通：天眼通、天耳通、神足通、他心通和宿命通。千里万里他一飘就到。我们和他讲话他都能听见，同时他也在和我们讲，可我们却听不见。尤其当他看见他的尸体横到床上时，他明白自己死了，就非常著急，想要有身体，于是就到处乱跑。另外造恶业的人业障现前，恶相追逐就更加慌乱，就被赶到坏的地方去了。所以要在亡者耳旁，对他说明：你现在见到什么境界都不要害怕，这些境界都是假相。只有光明才是真的，与光明合上去，就能出六道轮回成道了。多么痛快，多么方便，所以这个法真是太好了。再用这种救度众生的功德回施(就是送)给一切有情，希望他们能把情见斩断。因为众生都是有情的。所以菩萨(即菩提萨埵)两个字就是觉有情。就是要把情见觉破，把爱根斩断。爱是个坏东西。因为爱生水(比如要好的人分别了，就哭哭啼啼舍不得离开。见到爱吃的东西口水就流出来了)，水性是朝下流的，不能往上流。除非用水泵把它抽上去，才能由下往上流。所以要升西方极乐世界的人，一定要斩断情见。情见不断还恋著<a href=\"/remen/jiating.html\" class=\"keylink\" target=\"_blank\">家庭</a>、儿女，就生不到西方去。因为西方极乐世界是净土在天上。朝下流就不能飞升到西方。所以《楞严经》中说：‘纯想即飞’。就是说假如情见都断了，只想西方极乐世界，那么就能飞升。在飞行中西方极乐世界的圣境就会现前。紫柏禅师和憨山大师也说：‘念佛要念到把爱根斩断才行。如果斩不断爱根，念佛就没有用。’</p>\n<p>　　以上就是‘翻译缘起’。通过‘翻译缘起’希望现在及将来的人，都能明白本经的由来及大概内容，明白它的珍贵之处，切不可等闲视之。</p>\n<p>　　二、卷头语</p>\n<p>　　(一)中有的种类</p>\n<p>　　在密部中，中有分‘前三’与‘后三’六种。前三者是指生处中有、梦境中有和静虑中有；后三者是指死位中有、法性中有和轮回中有。下面我们分别介绍：</p>\n<p>　　1. 生处中有(亦名处胎中有)</p>\n<p>　　就是指男女同房时中有身淫欲心动，充当了第三者，就在男子射精的时候被冲进子宫里形成了胎胞，这就是处胎中有。这段时间共有九个半月。因为母体是血肉之躯，子宫里很浑浊，中有身在里面住九个半月就昏愦了，再加上出生的过程很痛苦，所以人出生之后就不知道前世的事情了，而不是喝了什么迷魂汤。</p>\n<p>　　2. 梦境中有</p>\n<p>　　就是指我们睡著做梦时所现的各种境界。在梦中我们也是六根具足，既能看、又能听、还能摸。什么都能抓住，见到好的境界就喜欢，坏的境界就害怕。非常逼真，和我们醒的时候一模一样。大家看小人书或连环画，上面画得就很形像：有人做梦了，画几个圈圈‘咦’识神就出来了。做梦就是这样，识神跑出来就见到各种各样的境界。这就是梦境中有。</p>\n<p>　　3. 静虑中有(亦名禅定中有)</p>\n<p>　　就是指我们打坐用功入定时，识神出来所见的境界。我们前面讲过，第七识本来是能够出来的，但由于我们的六根不清净就把它束缚住了。六根(眼、耳、鼻、舌、身、意)与六尘(色、声、香、味、触、法)根尘相对，就生心动念，现出各种各样的境界，这就是识。而在我们打坐的时候，心里比较清静，六根(眼、耳、鼻、舌、身、意)不接受外境(色、声、香、味、触、法)，没有东西遮盖，识神就能够出来。但这时出来的是阴神，不是阳神。别人看不见这个影子(中阴身你们也看不见，因为它是以风大为主的)。这就是静虑中有。</p>\n<p>　　4. 死位中有</p>\n<p>　　就是人在刚断气时，像喝醉了老酒一样，昏昏沉沉的，处于迷闷状态。这个阶段大概有三天半到四天的时间，就叫死位中有。我们平常在人死后给亡者‘做七’是从断气这一天算起。但本法是从亡者死后第五天才开始算第一个七。因为处于迷闷阶段的中阴身，对什么事情都不清楚，我们给他做佛事，他也不大知道，所以‘做七’的时候，死位中有这段时间不应该算。</p>\n<p>　　5. 法性中有</p>\n<p>　　就是人死了四天以后，亡者的识神渐渐从迷闷状态中清醒过来。这时他的神通要比我们大，见闻觉知的能力要比我们现在强九倍。比我们看得远，比我们听得清楚，想到哪里一飘就到。他这时候的神通就是业通，即业障、报障所现的神通。这段时间从第五天算起共有十四天，这就是法性中有。与前面死位中有的四天加起来共计十八天。</p>\n<p>　　6. 轮回中有</p>\n<p>　　就是指人死了十八天之后(即法性中有过后)，至投胎前的这段时间。在轮回中有时期中有身就要投胎，生死轮回又要从头开始了。</p>\n<p>　　(二)密法成就的种类</p>\n<p>　　在密法中，成就的种类可以分为三种：1. 即生成就。2. 中有成就。3. 转身成就。下面我们分别介绍：</p>\n<p>　　1. 即生成就</p>\n<p>　　一切法不论禅、净、密都可以即生证成法、报、化三身。就是说在我们活著的时候就能修成法、报、化三身。</p>\n<p>　　禅宗直指见性，当下开悟即可证见法身，是最直接了当的法门。密宗的法门很多，可大致分为生起次第和圆满次第两步。生起次第就是先从没有开始，观想气脉明点，修九节佛风，练深呼吸，观想成功之后就从无到有生起来了。圆满次第就是再把有化空，最后连空也不住，这样就证成了法身。但在密法中要先修生起次第，再修圆满次第，不能一开始就修圆满次第，也就是说先要修有相密，然后再修无相密，所以比禅宗多饶了一道弯。而我们的心中心密法直接了当，一下子就到了圆满次第。没有走弯路。因为一切都不可得，身体是假的，世界也是假的。都是虚妄不实的。修心中心密法就可以使我们的身心世界都消殒，那时大地平沉，虚空粉碎即可证见法身。所以心中心法说起来是密法，实际是禅法，故又称为禅密。净土宗也可以即生证见法身，只是他们不这样讲。而是换了一种说法，叫‘念佛三昧’或‘花开见佛悟无生’。花者即心花也。我们的肉团心长得就像莲花蕾一样，莲花蕾没开的时候就像市场上卖的猪心、牛心的形状。心花开有两种情形：一种心花开是指在我们人死的时候，当最后这口气一断，就触动心脏边上的死穴，这时这个心蕾‘哗’就开了，八识就能走了，八识一走人就死了；还有一种心花开是指我们打坐用功，用到气脉打通时心花就开了。所以花开就是指心花开，见佛就是指见到自己的本性佛，就是见到无相之相，那时就是证见法身。由此可见，禅、净、密都是相通的。禅就是净，净就是密，密就是禅。但现在的净土宗人不讲这些，也不肯好好用功修行。还说：‘什么一心不乱？不要不要。我们临命终时，十念生西带业往生。’这么一说就坏了！大家都不肯好好的用功。所以莲池大师早就说：‘念佛者多，生西者少！’他反问自己：‘何也？’为什么呢？‘念佛不痛切故。’就是说念佛念得不痛切！不肯用心，不肯放下一切，执著色身不舍，执著家庭不舍，执著世上的快乐不舍。不知道世上没有快乐，我们活在这个世界上就如少水之鱼，这是佛讲的，就像鱼活在水里，水在一天天的减少，还有什么快乐呢？要死了还快乐吗？！所以不论修禅、修净还是修密都要一切放下，好好用功，证见法身才能生死自在矣。</p>\n<p>　　是不是光证成法身就为止了，就万事大吉了呢？不是！前面我们讲过；初到法身边还不行。要到法身向上，法身正住才行。只悟到了一点点道理，事上透不过，还非常著相，遇到坏的境界就很慌乱，烦恼；遇到好的境界又喜欢高兴得忘其所以，还能成道吗？所以事上透得过色身才能转，才能变成光明报身，证成报身佛。不是活著的时候不能证成报身佛，就看我们怎么用功。佛在《楞严经》中说得很清爽：一切事相，山河大地都是妙明心中物。就是说一切事事物物及山河大地都是我们本性所显现的，都是我们自己。我们的身体当然也是妙明心中物。我们能转山河大地同样也能转色身啊！所以事上能透得过，色身就能转了，就能大放光明证成报身。当然光明是一点一点显发的，不能一下子放得很大，很圆满。如同本经描述中阴身所见的光明一样：先是看见像迷雾一样的光；慢慢的看见像东方太阳升起时鱼肚白色的光；再慢慢地光亮出来了；再慢慢地现出月轮；再慢慢地显出日轮；再慢慢地现出像千百万个太阳那么亮的光。就这样慢慢的证成了报身佛。</p>\n<p>　　那么化身呢？也可以即生成就。佛在《楞严经》上没有讲，但在《<a href=\"/fojing/lengqiejing/yuanwen.html\" class=\"keylink\" target=\"_blank\">楞伽经</a>》中讲了。所以要多看几种经。佛在《楞伽经》中讲得很清楚，证到三地菩萨就能出意生身了，这就是化身。要证成化身就要在境界中磨炼，时时刻刻不忘观照，勤除习气。明白一切事物都是假的，都是我们的妙明心中物，都不可得，就不会再和别人发火斗气了。他要这个就让他拿去好了。为什么要争争夺夺的呢？都是我们各执己见不肯放，以为这个对那个不对就发生了争执。其实本来就没有对错，就看我们从哪个角度来看。看的角度不同，认识就不同，这样就会相互抵触。其实大家放下来心平气和的讨论一下，你怎么看，我怎么看弄清楚了，就不用再争争吵吵了。比如这个杯子，他说放到这里好，你说放到那里好。假如他不同意，那就按他的意见办也没关系。我们应舍己从人。《普贤菩萨<a href=\"/remen/xingyuan.html\" class=\"keylink\" target=\"_blank\">行愿</a>品》里不是说：要恒顺众生吗？！我们学佛的人就是要恒顺众生，要在这一方面锻炼自己，上上升进就可以证成化身佛了。如果总以为自己对别人错，那么你的习气几时能消除？何时才能证成化身佛啊？！纵然打开见到一点法身，生死还是不能了，还是不能证得报身，更不能证得化身。所以真正的成就要在事上时时刻刻的锻炼自己，没有一己之私才行。王阳明曾说：‘格物致知’就是要把物欲之情见除掉，把我见拿掉。我见最坏，总觉得自己对其他人都不对，以我为主。家庭不和睦也是这个原因。要是把我见除掉，家庭就会和睦，法法就会流通了。</p>\n<p>　　所以我们活在这个世上，不是不能证成法、报、化三身，就看我们怎么用功。本书说：‘即身成佛成法身佛。’(见原文四十七页)这只是一种说法，我们把它再发展一下：不是只能即生证成法身佛，而是法、报、化三身都能即生证成。</p>\n<p>　　2. 中有成就</p>\n<p>　　如果我们活的时候，法没有修好，没有证成法、报、化三身，那么我们死后还有机会成就。这部《中有教授听闻解脱密法》就是让死者在中有期间(就是死后五十三天)，听到本密法的教导而超出轮回得到解脱，这就叫中有成就。活著未修成就，死后再错过这五十三天那就太可惜了。生死又要从头开始，又要投胎受报沉轮于六道轮回之中，不知何时才能解脱。因为人身难得佛法难闻，在芸芸众生之中，能得到人身的不到百分之一。我们地球上只有几十亿人，而那些细菌却不知道有多少！得人身能听到佛法的人又有多少呢？上海有一千三百多万人，有多少人能听到佛法！能听到佛法真正<a href=\"/remen/xinyang.html\" class=\"keylink\" target=\"_blank\">信仰</a>正法的人就更少了。都是到庙里去烧烧香，拜拜佛，求求保佑，这样的人占大多数。所以我们活著的时候就应该用功修行。如果修行不能成就，到中有时期还可以借助本法成就。可见这本经非常珍贵。</p>\n<p>　　这部《中有教授听闻解脱密法》中的‘中有’二字，是针对上述中有种类中的后三者而言。它是指前身已坏后身未成当中以风大为主的阴身。它每过一个七天就是一个生死，共七七四十九天，就有七个生死。第一个七天中阴身比较高大一些，每过一个七天就矮一些，以后就越来越矮，越来越小。最好让它在第一个七天就能超度解脱，拖得时间越长越不好。但以下几种情形没有中阴身：做善事直接升天和做恶事直接下地狱的人没有中阴身；修道直接往生极乐世界的人也没有中阴身。除此之外都有中阴身。</p>\n<p>　　人死后的中阴身按时间长短可以分为死位中有、法性中有和轮回中有三个阶段。在每个阶段如何解脱成就呢？下面我们再分别介绍。</p>\n<p>　　(1)死位中有时期可成就法身佛</p>\n<p>　　死位中有就是人死后三天半或四天之内，这段时间亦称为识闷绝位。识就是识神。人刚死时就像我们休克或开刀前打全麻，昏过去了什么都不知道，这就是识闷绝位。大家要记住这段时间是人死后三天半或四天之内，要放两次大光明(具体怎样放光？我们后面再讲)。这两次放光的时间很短暂，不过是一顿饭的时间，光明就没有了。因为没多久我们所造的业障现前，光明就被遮盖了。在这段时间内，如果经过讲法、教导和开示，我们能醒悟，就可以证成法身佛。因此成就很快。但在死位中有时期能成就的人很少，因为绝大多数人这时处于昏厥状态。所以要想在识闷绝位成就者必须有一定的定力和功夫。这就要靠我们现在用功修行才行。在世时真正证到法身，到识闷绝位就能成就了。如果功夫做得深，那时，既使没有人给你念诵、提示，你也能成就。所以现在好好用功最为重要。</p>\n<p>　　(2)法性中有时期可成就报身佛</p>\n<p>　　在人死了三天半或四天之后就进入了法性中有时期。这时人已经清醒，不再昏沉迷闷了。法性光明会多次现前。这段时间共有十四天，加上前面死位中有的四天共十八天。法性中有时期导示的方法有二十一次之多，因为每天的境界都不同，所以每次导示都不一样。大家看佛菩萨是多么的慈悲啊！经过这么多次的教导就是业障再重的人也应该得度了。所以我看大家以后就不必再到庙里去请和尚放焰口。因为焰口是指饿鬼道的饿鬼，他们嘴里喷火不能吃东西。放焰口就是供养饿鬼道的佛菩萨，请佛菩萨慈悲这些鬼魂，让他们能得食，能得度。人刚死的时候还没有到饿鬼道，根本不需要放焰口。难道死者都有这么大的罪，都必定要到饿鬼道里去吗？！所以对刚死的人放焰口不对。还是应该根据本经来教导他：‘现在你是什么样的情况，如何放光，怎样和光明合上去。现在有什么佛来度你了’等等。这样给他导示比较好。在法性中有时期，由于没有躯壳的拖累，没有什么东西遮盖，本性光明就现前了。当然光明是一点一点显发的。正如本经所描述的一样：先是看见像迷雾一样的光；慢慢的看见像东方太阳升起时鱼肚白色的光；再慢慢地光亮出来了；再慢慢地现出月轮了；再慢慢地现出日轮；再慢慢地现出像千百万个太阳那么亮的光。能认取这光明，和光明合上去，你就证得光明报身而成就报身佛了。当然法身佛也在其间。因为法身是根本。就像一棵大树，法身是大树的树根，报身是大树的树干，化身是大树的树枝树叶。中有身成就报身佛，就是指在法性中有时期这十四天之内证成的。法性中有时期能够直证报身佛，多么殊胜啊！这是莲华生大士慈悲我们(佛经中都没讲到)，给我们讲这样深妙的法，大家真该万分庆幸！！</p>\n<p>　　(3)轮回中有时期主要是‘闭胎’和‘选胎’</p>\n<p>　　亡者经过法性中有这十四天之后，就降入轮回中有时期了。轮回中有时期的境况就比较差。在法性中有时期前七天是由佛菩萨的正*轮身来接引，后七天是由佛菩萨的教令轮身即明王来接引。明王就是怖魔的愤怒身，形像很恐怖、很害怕。如果我们业障重，前两期中有都没得度，只好落到轮回中有时期。到轮回中有时期业力幻现的各种境界都现前了，所以前面我们讲过越到后面救度越差。轮回中有时期的救度方法主要是指‘闭胎’和‘选胎’。轮回中有时期导示的方法有二十四次之多，比法性中有还要多三次。选胎就是选择一个好的地方去投胎。闭胎就是把胎门关闭掉，坏的地方不能去。从前玄奘法师到印度取经，经过喜玛拉雅山的时候看见一个山坡，他说：‘这里面有一个大修行人。’于是他们找啊找，找到一点痕迹像是个山洞。由于年深日久，山石、泥土、树木、草丛把洞口都堵实了。他们就把它挖开，果然里面坐了一个修行人。这个修行人入了灭尽定，想等佛出世的时候给他说法。入灭尽定一定就是几千年，乃至几万年。玄奘法师把他叫醒。他看见玄奘法师来了就说：‘呀！佛出世来度我了。’玄奘法师说：‘我不是佛，佛已经圆寂多年了。你怎么躲在这里？’他说：‘哎呀，我在等佛出世度我呢！’没想到他入灭尽定太久了，错过了机会，他很伤心就哭了。玄装法师说：‘你不要哭，你的身体这么多年已没有用了。你到震旦(就是中国)看见高大的楼房，琉璃瓦黄墙头，就到那儿去投胎。’这就是帮他选个胎门。于是他就去投胎，投到尉迟恭的家里。后来就成了唐玄奘的大弟子窥基法师(也称三车法师)。本法在轮回中有时期的导示就是让中阴身投胎到好的地方，有好的因缘能听到佛法，而不是投生到坏的地方，生到边地听不到佛法。这就是本书说的‘转胎成化身佛’(见原文四十页)。其实并不是一转胎就能证成化身佛了。因为转胎来再修行也不一定就能证成化身佛。就像我们大家都不是一时一世学佛法了。假如是一时一世学佛法也不可能修心中心法，也听不到这么殊胜的中阴救度法。所以本书中的转胎成化身佛意思就是转胎投生到好的地方，能碰到学佛的机缘，好好用功修行，上上升进，法、报、化三身都能成就，三身四智都能圆满。</p>\n<p>　　由此可见，有了这部《中有教授听闻解脱密法》在世时纵然没有证成法、报、化三身，到死后还有机会成就。但要求我们一定要懂得该密法的教导，将本法的内容熟记于心中；同时在临死时还要有善缘，这一点很重要。比如有很多人是横死的，在外面突然被车子压死了，又忘记了本经的教导，这时又不具善缘，到哪里去听法呢？！所以这些事项在我们活著的时候就要多加注意，平时要好好修法，到中阴境界现前时，即使没有人提醒，当光明显现时也自然能醒悟，能承当！这样就能成就报身佛。</p>\n<p>　　3. 转身成就</p>\n<p>　　就是我们活的时候没有修成佛，但在死时可以往生佛的净土再继续修行成佛。比如净土宗和密宗的‘颇哇法’就是转身成佛的法门。因为他们<a href=\"/remen/zhuansheng.html\" class=\"keylink\" target=\"_blank\">转生</a>到西方极乐世界时是凡夫，还不是佛。还要继续修行，上上升进从凡圣同居土升到方便有余土，再从方便有余土升到实报庄严土，最后升到常寂光净土，这样就成佛了。这就是转身成就。</p>\n<p>　　(三)、本法是中、下根人、凡夫或大罪者最方便的解脱法</p>\n<p>　　上根人平时曾修习大法，如密宗的‘大圆满’‘大手印’和我们的心中心法(在密乘中心中心法是最高乘，是大圆满的心髓)等，已经证到了法身，这种人就用不著本密法了。因为死的时候法身一显现我们就能认取了。所以平时打坐坐得好，到时候根尘脱落，一切都没有了，呼吸断了，就好像死了一样。每个人到那个时候都有点恐惧：‘哎呀！呼吸怎么断了？’以为要死了，心就慌了，其实我们不会死，不要害怕。还有的人说他那时候是胎息。就是鼻子里没有了呼吸，但下丹田里面还在动著。我对他说：‘定境是有了，但还没有化空，还有胎息在，不行。还是没有明心见性，没有开悟。’开悟时什么都没有，只有了了觉知的灵性，哪有什么胎息不胎息？我们果真做到这一步，到临死时就不害怕了，因为气都断过了，知道临死是什么样，到时候一点也不会慌乱，安然而逝。这就叫‘坐脱立亡’。所以修到这个程度的人，就不需要本密法，他自己就能做主成道了。</p>\n<p>　　这本《中有教授听闻解脱密法》是专为中、下根人，诸凡夫或有大罪者而设的。为什么有大罪的人碰到这个法也可以成就呢？因为一切本来空！罪障并不是真有。所谓的地狱也是空不是真有，就像我们在梦中杀人，执著迷惑了以为是真有。醒了之后才知道是梦境，根本就没有。所以一切罪障本来就是自己的妄情、妄想、妄念所造的。我们如果没有妄想颠倒，怎么会去杀人放火？怎么会去抢别人的东西呢？我们现在也都是在做梦啊！大家整天争争吵吵的固执己见，你说我不好，我说你不好，一定要吵个究竟。其实都不好，都是在做梦。假如大家不做梦了，明白一切都是假相，就不会争吵了。我们用功修法修得好，真入定了，身心世界就会完全化空，只是灵觉昭昭，那就是梦醒之时！所以奉劝大家赶快放下，一切都不可得。本法的目的，就是在我们命终后看到坏的境界时，把我们赶快唤醒。就好比我们睡著了正在做恶梦，别人喊我们：‘快醒醒！快醒醒！’我们一醒，恶梦马上就没有了。不过要到命终时才醒悟，还不如现在就醒悟好。现在就应该赶快修法打基础，不要再著相再执著，到那时由他人在旁边给我们念诵本经，我们的识神一听到就醒悟了，就能在法性中有时期得到解脱而证成报身佛。不然我们执著的太厉害，到那时昏昏沉沉的喊也喊不醒。</p>\n<p>　　这本经非常殊胜，即使我们不识字或者没有见到也不要紧，只要我们能听到(假如能看到当然更好)中有教授的口诀也能解脱。那怕只听到一次，纵然犯有五无间罪也可以解脱。五无间罪就是：杀父，杀母，杀罗汉，出<a href=\"/remen/foshen.html\" class=\"keylink\" target=\"_blank\">佛身</a>血，破坏僧众。在社会上我们常常听到有人把自己的父母杀了，这就是杀父杀母；杀罗汉就是指杀死已证到罗汉果地的人；出佛身血就是伤害佛的身体致使流血；破坏僧众就是破坏僧团。由四五个出家人聚集在一起的称为僧，也叫合和僧，一个出家人不能称僧，而是称和尚(和尚是清教士，又称<a href=\"/remen/biqiu.html\" class=\"keylink\" target=\"_blank\">比丘</a>)。本来大家住在一起，一心一德一块用功修行，互相督促，互相鞭策，共同成道，这样该多好。可现在庙里不是这样，都是分派别，你说我不好，我说你不好，挑拨离间破坏团结，这就叫破坏僧团。这五种罪最大，叫五无间罪。犯五无间罪是要下无间地狱的。地狱共有十八层，其中最大的地狱是阿鼻地狱。无间地狱是阿鼻地狱中的一种。‘无间’有两个意思：一个是说受罪的时间没有间隙，没有一分一秒的停止；另一个意思是说房子有多大你的身体就有多大，把你挤住卡死。在这房间里无论是成千上万的人，还是一两个人，都是这样无间隙，挤得要死。就像在我们中国挤公共汽车一样，挤得透不过气来。果居无间的人，刚一死就到无间地狱里去了。没有中阴身。纵然犯了如此重的罪，只要听到本法的教导就可以解脱。你们会说这么便宜呀？犯了这么大的罪的也可以解脱吗？的确是这样！我们前面讲了，因为一切罪障本来空，都是空花水月梦幻泡影。就是我们不醒悟，只要我们一醒悟，业障就没有了。所以说：‘了则业障本来空，不了应需还宿债。’了就是明了，了悟。你明了了，心真空了，业障就空了，地狱就消失了；你不明了，不明白，心不空还著相，那么你的罪障就在，就应还宿债，就要下无间地狱去受罪。所以，这部经就是在最紧要关头把我们喊醒：‘哎，××人，赶快醒悟，这些都是假相，都是业力所显现的，都不可得。现在佛菩萨放大光明接你来了，与光明合上去，你就成佛了！’这不就解脱了吗？！所以说再大的罪障也能解脱。但是人的执著心很厉害，从前，有一个修行人修到四果罗汉出宿命通了，知道自己过去世曾杀过父亲，属五无间罪之一。他心里很难过，自感罪业深重，坐也坐不住了。佛知道了，就对文殊菩萨说：‘这个罗汉发了宿命通，发现自己过去世杀了父亲，心里很不安。我们两个串串戏，来救救这个罗汉。’于是文殊菩萨拔剑杀佛。哎哟！出佛身血更不得了啊！比杀父还厉害。大家在旁边看到就说：‘文殊菩萨要跌到铁围山外去了，要下地狱了。’佛说：‘大家不要紧张，文殊菩萨没有杀佛之心，一切都不可得。’这就是教导我们只要不著相，一切都空不可得，如果还著相，就会从你的心里生出种种罪恶。即‘心生种种罪生，心灭种种罪灭。’心一空净就没有罪了，就好比我们梦中杀人，醒来之后什么都没有一样。文殊菩萨醒了，他就没有罪。没有罪，怎么会跌到铁围山外呢？！这时那个罗汉醒悟了，心也就平静了。所以救人要救心。听我讲这些，你们可不要说：‘我去杀个人好了，不要紧。到临死你们喊我一声我就得度了。’这样可不行！学佛就是让我们心空净，让我们醒悟。你醒悟了，心果真空了，为什么还要去杀人呢？你要是去杀人，就证明你的心并没有空啊！所以劝大家一定要注意，不要再著相！</p>\n<p>　　即使是犯了这么大的罪也可以解脱，而且<a href=\"/remen/shana.html\" class=\"keylink\" target=\"_blank\">刹那</a>之间就能证得等觉菩萨位(等觉菩萨在十地菩萨之上)。这个道理很深，一般人是不容易理解的：这么大的罪怎么一下子就成了等觉菩萨呢？其实，这就是佛所说的一切唯心造！我们真正开悟明白了，就是等觉菩萨。六祖大师在《<a href=\"/fojing/liuzutanjing/yuanwen.html\" class=\"keylink\" target=\"_blank\">六祖坛经</a>》里说的很清楚：‘前念迷就是凡夫，后念觉就是佛。’就是说在刹那之间，前念还迷著后念觉悟了，就是佛了！就在转念之间，很快。所以净土宗念佛就是这个道理。‘阿弥陀佛，阿弥陀佛……’这就是转换！本来我们念贪、嗔、痴，现在我们念佛不就转换成佛了吗？！大家知道赵孟兆页是个大文学家，书画家。他的字写得非常好，画也画得好。有一天他画‘八骏图’，要画八匹形态各不相同的马。他就思索著这些马都应该是怎么样的形态。这时他夫人送莲子汤给他喝，推门一惊：‘砰’的一声，碗掉到了地上，把赵孟兆页吓了一跳：‘哎哟！怎么了？’他夫人说：‘刚才我看见你都变成马形了！’赵孟兆页想马想的过深了，他自己的身体都变成了马形。于是他想：我想马就变成了马形，那想佛我不就变成佛了吗？好！我不画马了，我画佛。赵孟兆页很聪明，以后他就画佛了。所以说一切唯心造。我们时时刻刻的观想就是这个缘故。一切都是我们自性所造的。十法界最坏的就是地狱界(你总做坏事就要下地狱)，也是我们自己造的。只要我们时刻想著成佛，就能成佛，道理就这么简单。并不是靠别人来帮我们，而是要靠我们自己的心念转换。别人对我们的帮助只是唤醒我们。只要我们能马上清醒，转换过来，再大的罪也能消除。这样，从前做过坏事的人，心里就不要再有所挂碍：只要一切放下就行了。但从此以后，再不要做坏事！</p>\n<p>　　‘中根以上密乘真言瑜伽士，曾修‘生’‘圆’两次第，具有持诵心咒等诸种修持者，不必待到法性中有期间，即为持明勇士空行等众，迎归净土。’(见原文四十九页)生起次第就是无中生有。比如我们现在看不到身体里有什么东西，通过观想脉管、明点、佛菩萨等，观想成功后就可以看到了。圆满次第就是从有再到无。就是生起来之后再把有化空。因为有相的都是假的，比如明点只不过是我们的第八识，还是识神。要把它也化空才能证成法身佛。最后再从无生有就生起神通妙用，就变化自在了。这就是圆满次第。我们修无相法，一开始就是修圆满次第。把有化空证成法身佛之后再勤除习气。除习气这个过程就是从无再生有，习气除光消尽，就可以起妙用显神通了。所以生起次第是初步入门的有相法，而圆满次第是无相法。修过生起与圆满两次第的中根以上密乘真言瑜伽士就是指修密宗持咒相应的人，他们曾经修法持诵过各种佛菩萨的心咒(像最普遍的<a href=\"/fozhou/liuzidamingzhou/42981.html\" class=\"keylink\" target=\"_blank\">六字大明咒</a>，即四臂<a href=\"http://www.gming.org/fozhou/guanyinzhou/\" class=\"keylink\" target=\"_blank\">观音心咒</a>：嗡嘛呢叭咪吽，<a href=\"/fozhou/emituofoxinzhou/\" class=\"keylink\" target=\"_blank\">阿弥陀佛心咒</a>：嗡，阿米爹瓦啥，莲华生大士心咒：嗡贝嘛别渣吽)，就不必等到法性中有期间，在死位中有时期即为持明勇士、空行等众迎归净土了。持明就是怖魔的明王，很勇猛，魔王看见非常害怕，就不敢来捣乱了。空行就是<a href=\"/remen/hufa.html\" class=\"keylink\" target=\"_blank\">护法</a>的一切神骑。净土不光是指西方极乐世界，十方世界都是净土，都可以去。所以大家还是生前努力用功修法好。</p>\n<p>　　纵然根器不好，是下下根人，但对于密宗的法能深信不疑，不生邪见，能朝于斯，夕于斯的修持，这样的人一经听闻本法亦可以解脱。现在有很多人诽谤密宗，尤其是净土宗的人说：‘密宗不好，要入魔的，净土好。’这样说密宗就是破坏密宗，就是诽谤佛法。他们不知道这样做有罪啊！净土宗是好，我们不能说净土宗不好，但净土宗同样也离不开密宗，也要念‘<a href=\"/fozhou/shixiaozhou/quanwen.html\" class=\"keylink\" target=\"_blank\">十小咒</a>’，‘往生咒’，‘<a href=\"/fozhou/dabeizhou/quanwen.html\" class=\"keylink\" target=\"_blank\">大悲咒</a>’，‘<a href=\"/fozhou/lengyanzhou/quanwen.html\" class=\"keylink\" target=\"_blank\">楞严咒</a>’。净土宗既然离不开密宗，还说密宗不好，这不是胡说吗？！所以不要对密宗生疑虑，不要有邪知邪见，破坏密宗，这样很不好！其实这些人很可怜，他们还不知道密宗是怎么回事就乱说。就像我们前面讲的<a href=\"/fjrw/hcrw/hyfs1/\" class=\"keylink\" target=\"_blank\">弘一法师</a>，他不知道的时候也说密宗不好。后来他看到密宗的经文时说：‘哎呀！多么圆满，样样都具备，我真是罪过！’他为此写了篇‘忏悔文’。有些人就是人云亦云，还不知道密宗是怎么回事就诽谤，这就是邪见。假如对密宗能够真正相信，能不生邪见，这样的人一经听闻本法即得解脱。所以成道最要紧的就是信仰和<a href=\"/remen/xinxing1.html\" class=\"keylink\" target=\"_blank\">信心</a>。在显教里不是也讲要具足十信位吗？！菩萨就是依次先入十信、十住、十行、十回向，最后到十地。如果信也不具足，怎么能成道呢？所以听到本法之后深信不疑者，即使是下下根器也能解脱。</p>\n<p>　　对于学习显教的诸法师，本‘中阴救度法’也是非常重要的。净土宗、禅宗、法相宗等都属于显教。尽管学习这些显教的诸法师持戒很严谨(不像现在都是<a href=\"/remen/pojie.html\" class=\"keylink\" target=\"_blank\">破戒</a>和尚多)，说法也说得天花乱坠，但由于他们没有用心修持佛菩萨的心咒，也不知道密咒(即真言)的真正含义，更没有和哪些佛菩萨结过缘(像我们修心中心密法的人，每天要念四十九遍‘慈氏咒’和弥勒菩萨结胜缘)，所以等到了中有境界识神出来之后，懵懵懂懂的一点也不知道。有时看到很凶很害怕的忿怒相和佛父佛母合抱到一块的双身相，就会胡想：‘佛菩萨怎么会有这样的相？不对不对，大概是魔王’。把佛菩萨的这些忿怒相都当成了魔王。他们不知道佛现忿怒相是用来怖魔的，像密宗里的玛哈格拉护法神(汉地称大黑天)，就是口啖鲜血，脚踩女人，左手拿塔，右手拿头颅，非常害怕。不像护法神韦驮菩萨是慈祥庄严相，因为韦驮菩萨是正*轮身，而玛哈格拉护法神是教令轮身。大家不要一看到忿怒相，双身相就像碰到冤家敌人一样，立起嗔心。甚至有些人还诽谤说：‘密宗不好’，‘密咒不好’，‘只有我们这个法最好’，贡高我慢。现在就有所谓的‘青海无上师’，她说：‘你们不用念观世音菩萨的咒，也不要念阿弥陀佛的咒，就念我青海无上师就行了。’这就是大慢语，就是个大魔王！因为诽谤密法的缘故就要下恶趣涧，堕到恶道深层阿鼻地狱里去(‘涧’就是无底洞，‘趣’就是道，恶趣就是恶道)。所以对本法大家生前一定要好好的学习，要弄明白，对于显教诸法师，实在说来，这也是必不可少的重要环节。</p>\n<p>　　(四)、本密法的殊胜功德</p>\n<p>　　我们死后就到了幽暗无光、冥冥不知东西的幽冥界中，而这本经就像是幽冥界中的灯塔，在阴间为我们指明了方向，使我们不至于误入迷途，不至于坠入深渊。进一步还可以超出生死轮回，所以本经又被称为永恒长久的人寿保险单。现在有很多修净土宗的人，对于能不能生西方也没有把握，也很担心，因为念佛生西方要念到一心不乱，那么现在有了这个宝贝经，纵然念佛没有念好也不用害怕了。到临命终时，只要有人给我们说法、引导，我们就可以解脱得度了。所以能听到这个法，就像是在大海中得到一根救命的稻草，就等于是拿到了保单，真是幸运得很！所以对于这部非常殊胜的无上密法，要常常诚心诚意虔心阅读。对于这本书上的文字句义要涵咏玩味(涵就是意义深藏，咏就像我们咏诗一样要深深的思考，玩味就是要把本经真正的经义、妙味显化出来，深深的理解)，不要马马虎虎地看过去，要把每个字义都弄通，要真正了解本法的旨义。</p>\n<p>　　对于本经的两部‘寂’‘怒’曼荼罗和百尊海会要熟记观察。寂是寂灭，怒是愤怒。我们前面已经讲过几次，佛有两部身：一个是庄严肃穆慈祥的正*轮身，即寂静部；一个是忿怒可怕的教令轮身，也叫明王身，即忿怒部，就是教导众生、魔王令其归顺佛教的。曼荼罗就是佛菩萨及其眷属圆满聚集的坛场，也是我们现在大家说法的一个道场。百尊海会就是指人数多的一个大海会，不是具体的一百个人。就像《阿弥陀经》中西方极乐世界的莲池海会，就可称为百尊海会，对于这些形像我们要仔细观察，熟记在脑子里。</p>\n<p>　　对于本经中佛父佛母合抱的双身像，绝对不可生颠倒妄见：‘哎哟，那个时候还有这些带淫相的东西啊？’淫心一动就坏了。或者说：‘这本书不可信吧？’诽谤这个法。本来能获得很大的利益，但是一生颠倒妄见，就得不到利益，得不到解脱了。而且更有谤法之罪，这就叫‘更罹谤法之咎’(见原文四十九页)。‘罹’本来的意思是灾难，在此是具有、获到、受到之意。你诽谤本法就是罪孽深重，那就糟糕了。关于这一点我们已讲过多次了，现在再稍微讲一点。双身像是表法的，表示我们本来具有阴阳合体的双身，我们的佛性法性(一切法的根本叫法性，成佛的本来叫佛性)本来具足这个阴阳合体的功能。六祖惠能大师不是说：‘何期自性能生万法’吗？！这就是说我们的性体本来具有能生万法的功能，万法就是阴阳合体而生的。所以双身佛像含有至高无上的秘密意义。对此无上密义绝不应作邪想，不应作淫乐想。比如我们现在的身体是由地、水、火、风假合而成，火大是阳，水大是阴。道教里也讲婴儿素女，黄婆为媒。所以我们身体本身就有阴极和阳极。平时我们人体的阴极阳极不碰头，等到我们修法修到入定时，就能清清楚楚的觉察到身体里有两股电流‘呜—’合到一起了，这就是阴阳合体。所以我们现在的色身本身就是阴阳合体，为什么大家对此还要去诽谤怀疑呢？！因此对于双身像我们不要做邪想，不要做男女交媾想。假如我们真正理解懂得这个密义，不胡思乱想，那么到死的时候由于生前已经薰习(薰就是我讲你们听，习就是熟悉)之故，就不会忘记了。有一次我问大家：‘关于双身我们已经讲过很多次了，你们讲一讲什么叫双身？’结果一个人也讲不出来。真糟糕！你们就没有熟悉。所以我们要熟悉，理解，明白本经的内容才行。</p>\n<p>　　如果我们真正明白理解了以上这些道理，再加上自己本身的智慧(就是指我们的佛性，它本来就具有无穷大的智慧。这个智慧是从自己内心本性里发出来的，这就是‘般若’，又叫自内证智。不是从外面吸收来的什么经验知识，那些是世智才聪，是小聪明，与真正的大智慧不相干。)到中阴境界现前时就能豁然开朗，‘自然对于经偈文字，记诵如流；寂怒诸相，不惊不怖；双身佛相，生起正信；即可无二交融而证佛位’(见原文四十九页)。这本经里有很多偈文。偈文就如同四个字一句、五个字一句的诗、颂，可以像唱歌一样诵出来。那个时候中阴身记忆力特别强，要比我们现在强九倍。你一说它就明白了，就能对于这些经偈文字念得像流水一样快，对于佛的教令轮身一点也不惊怖害怕了，对于佛父佛母合抱的双身相，就能生起正信并钦叹：‘真不错！这是表法的。法尔如斯，我们本来就是具足阴阳的。’这样，佛是我们，我们是佛，就水乳交融合为一体了。不是我之外有佛，佛之外有我。净土宗也是这样讲的：心佛道交，打成一片。念佛念到这个程度，你就是阿弥陀佛，阿弥陀佛就是你。不是你之外有阿弥陀佛，阿弥陀佛之外有你。这就是无二交融，合为一体而证佛位焉。</p>\n<p>　　‘中有之身，六根具足，具有业通(因为业力所感之神通)聪明伶俐，九倍于生前，特别是耳根最敏，生前重听之人，此时虽在远地，亦能应呼而至，一切无阻’(见原文五十页)。我们前面讲过，中阴身眼、耳、鼻、舌、身、意六根都具足，不是说丢下尸体就没有六根了。因为他的八识还存在。八识是根子，生起七识、六识和前五识。因为有业力所感的神通，那时的中阴身看得更远，听得更细，但是只有五通，没有漏尽通。这个五通也没有佛那么深远，没有佛那么广大，但比人活的时候要聪明伶俐九倍，特别是耳根最灵敏。《楞严经》中佛让文殊菩萨讲一讲在我们<a href=\"/remen/suoposhijie.html\" class=\"keylink\" target=\"_blank\">娑婆世界</a>众生的六根当中，用那一根修法能得益最快、最迅速？文殊菩萨选的就是耳根，即‘此方真教体，清净在音闻’。比如某某人睡著了你轻轻地喊：：‘××人’他一听就醒了。你让他看，他也看不见，更不会醒。你给他吃东西，他也不知道，更不能吃。我们醒的时候即使是隔一座山你一喊，他也能听到。而眼睛仅隔一张纸就看不见了。可见耳根最利。同样中阴身也是耳根最利，你喊他的名字，同他讲话，他都听得见。就是耳聋的人(即重听之人)，死后虽然在很远的地方，也能应呼而至。比如一个人死在外地，恶报传来，你喊他的名字：‘××人，请到这里来受供。’他虽死在远地，因为有神足通，也会一飘就到，一切山河都不能阻碍。这就是经中所说的：‘六根觉能齐赋有，行动无碍任游行’。我们的色身是以地大为主，所以有障碍，想上高上不去，想要过河，没有船，没有桥也过不去。而中阴身是以风大为主，已经脱离了血肉质碍之体，少了一个包袱，没有形质，所以就能行动无碍了。中阴身就是第七识所化的识神，识神有阳神和阴神之分。阳神就是功夫好，能够现相。阴神就是功夫差，不能现相。假如我们真能出神的话，一切都不能阻碍了。有人说假话，我们一听就知道。有人说：‘我出神了，到一条大河，没有桥，我不能过去，只有求观世音菩萨，后来观音菩萨把我扶过去了。’我说这真是胡说八道，这哪里是出神，是出鬼了。如果真出神就能飘了，怎么连大河还过不去呢？可见这就是在骗人！现在外面的邪教很多，邪知邪见不知道有多少，都不是神通，都是假的，都是为了而已。</p>\n<p>　　中阴身在闷绝中有(死位中有)时期还是昏昏懵懵的，就像睡著了一样。等到了法性中有时期就清醒了，这时它独自漂泊没有伴侣。它为什么要漂泊呢？因为这时业障带来的恐怖境界就像电影一样，一幕一幕的现前了；再加上身体没有了，不知该到哪里去？到哪里才能找到一个身体呢？于是它就恐怖惊疑，莫知所适，东漂西漂了。这个时候一旦听到有人和他讲法，指示他，教导他：你应该怎么样……。他就欣然依从了。比如我们按本经所讲的内容告诉他：‘不要害怕，这些相都是你自性所显现的，都不是真的。’他一听不是真的就不会害怕了。或者对他说：‘这时光明显现了，这就是你自己的光。佛也放光来接你了，与这个光合上去你就解脱了。’他听到后与光合上去就能成就了。在这本经中有很多根据佛光所做的偈子，都是为了教导亡者的，只要别念错字句，亡者听到后就可以恍然大悟。明白了这些现象都是假的，就不会害怕了。所以用不著请什么人来放焰口，因为亡者刚死并不是马上就到饿鬼道。还是应按本经的教导来救度亡者比较好。本经在法性中有时期对亡者有二十一次教导，在轮回中有时期有二十四次教导，加起来共有四十五次之多。经过这么多次的教导，‘纵使蠢如畜牲，也可令其归依<a href=\"/remen/sanbao.html\" class=\"keylink\" target=\"_blank\">三宝</a>’(原文五十页)。我们知道畜牲是最愚痴的。人太愚痴了就会转胎为畜牲。我们前面讲了人有贪、嗔、痴三毒。贪、嗔、痴都具足的是地狱种子，贪心重的是饿鬼种子，愚痴重的是畜牲种子。经过本经这么多次的教导，就是再愚痴的人也可以让他<a href=\"/foxue/keben/299/10389.html\" class=\"keylink\" target=\"_blank\">皈依三宝</a>(皈者，归家，回来。依者，依靠。三宝就是指佛、法、僧)，至少可以使他不失人身！大家可不要小看这人身，人身难得啊！不得人身者千千万，万万千，得人身者只是极少数。整个世界不过几十亿人，不得人身的不知道有多少。能够不失人身，而且能够生到善道的人就更少了。我们这个世上有善人、有恶人。有的家境很好，有的家境很苦很差，那就是恶趣人。比如刚从地狱里出来的鬼魂，就不能马上投胎为人，都是先投生在畜牲道里，就像蚊子、苍蝇等，让人一下子打死，然后再慢慢投生为人。初投生为人时都是很愚蠢、生活很苦。本法就可以使这些最下下根的人也能够不失人身，并能生到好的、有善缘、有佛法的地方，修习佛法直至成佛。而那些贤者，虽然在世上做人做得很好，但在活著的时候没有听过本经的教授，也仍然出不了六道轮回。我们修佛法有圣贤位：十住、十行、十回向称为三贤位，十地称为圣位。在人世间也有圣贤位。成圣很难，成贤还比较容易。比如孔夫子就有七十二贤。就是有七十二个好学生，他们都是对人很好，肯帮助救济别人。虽然是好人，很贤德，但因为没有听到过这部经，或者没有理解本经的教义，更不知道死后中阴时期的各种境界，也只能是在生死大海中<a href=\"/remen/liuzhuan.html\" class=\"keylink\" target=\"_blank\">流转</a>而已。纵然十善升天(十善并不是做十桩善事，而是指我们的身、口、意三个方面：身有三个坏处，就是杀、盗、淫；意也有三个坏处，就是贪、嗔、痴；口有四个坏处，就是两舌、恶口、绮语、妄语。身三口四意三，这十个方面都好就是十善)，生死也不能了。至多升到忉利天，就是玉皇大帝住的三十三天。等福享完了，又掉下来了，还是出不了六道轮回。</p>\n<p>　　本法是不需要我们入观、修道就可以成佛的最好的秘密法门。我们只要把本经熟读七遍，平时常常回忆不忘记，临命终时就能得度。所以又被誉为不修就能成佛的唯一法门。说是这样说，其实我们现在时时刻刻想著经中的话就等于是修。如果我们看书，看过又忘了，那就糟了，临终就不能得度。所以现在要常常记忆，要熟悉经中的内容，就等于是不修而修。本法亦‘为一切法中续部的心要’(见原文四十八页)。‘续部’就是指一切法中最后一步，‘心要’就是指心地法门。心地法门是练心的，最为重要(不是相法，像做气功是为了锻炼身体，这就是相法)。因为我们本来都具有佛性，到那个时候本来就要放光，光明就是我们自己这就是一切法门中最后一步的心要。这些道理非常重要，它不仅仅是为救度亡灵用的，还可以做为人世间生死常识的指南。我们佛法(人称佛教)实在就是为了教育活在世上的人，不光是为了度死人的。现在的佛教徒搞错了，庙里都是在做佛事，赚钞票度亡灵。他们不能讲经，不能教育人。其实真正的佛教应该教育大家，在社会上怎样处世为人，怎样积极为大众服务，死的时候怎样才能解脱，应该让大家知道、了解这些常识才好。可见佛教既是宗教，又是哲学；既是科学，又是社会学。</p>\n<p>　　(五)、度亡时期注意事项十四条</p>\n<p>　　这十四条注意事项，我们要一条条的记熟，错了就不好。下面我们分别讲解：</p>\n<p>　　第一条：‘中阴救度法’是藏地超度亡者通用的办法，而在我们汉地超度亡者都是请和尚念念经，放放焰口，因为汉地很多人都不知道有这个法。在这本经里讲了我们死后每一天所见的不同境界，以及到时我们应该如何去做；还讲了我们应该如何教导亡者以及亡者得度之后的情况。根据西藏修道人的传述：有一个大喇嘛修道修得很好，已经证到‘生死一如’的最高境界。即生就是死，死就是生，没有生死。‘如’者即不动也。证到这个地步的这位大喇嘛，他体验了一下死亡的整个过程：断气时是什么样？到什么时候放光？到什么时候看见什么佛？他对经中所述每一天的境界，一一进行了体验，结果与本经所说的情况完全一致。这就充分证明了本经是正确的，是不容怀疑的。就像吕纯阳祖师成道后，想体验一下杀头是什么滋味？究竟有多么痛苦？体验之后他说：‘就像头上顶著滚烫的油锅，走了四十里路，烫死了。’这就叫‘游戏三昧’，西藏的这位大喇嘛也是如此。所以无论是<a href=\"/remen/dujing.html\" class=\"keylink\" target=\"_blank\">读经</a>或行法的人(超度死者的人)，都应该有至诚之心，要充分相信这本经。要专心致志虔诚地按照经文读诵或按经文给亡者讲解，不要马马虎虎的。这样‘则存亡俱获大利’。给亡者讲法的人就是‘存’，死的人就是‘亡’，二者都会获得很大的利益。因为死者得度成佛当然得到很大的利益，行法的人救度众生也有很大的功德。另外行法的人一遍一遍地给亡者读诵，对经文就熟悉了。他读一遍印象就深一点，这样经文就深深地印在他的八识之中，基础就稳固了。到临命终时纵然没有别人为他行法，遇到中有境界现前时，他也能马上明白，自己就可以救度自己了。</p>\n<p>　　第二条：佛法三藏十二部，汪洋浩瀚，博大精深。如果没有研习过的人，不免望洋兴叹，无从下手。其实千经万论无非是直指众生自性，故明白自己的本心，见到自己的本性，就是佛法的精髓，成道的关键。本经为密部至高无上的大法，其中有许多义理与专有名词在显教的经典中都见不到。孙居士恐怕度亡时，行法的人对死者能否领悟经义没有把握而产生疑虑，所以他再次提请读者注意：如果是为了自己研习本法，则应当对于经文义理，通达熟悉理解为上。如果是为他人行法，只需要依照本经高声宣读即可，但必须心念专一，口齿清晰，字句分明，亡者必可得度。为什么呢？一是因为此法有大威力加持，诵本经的功效和念密咒(即真言)的功效一样；二是因为在中有时期亡者六根聪明伶俐九倍于生前，既使是生前愚痴迟钝的文盲，一旦听闻到本经的教导，也可立即解脱。</p>\n<p>　　第三条：在我们汉地人死之后，要超度亡者常有延僧放焰口的习俗。放焰口是密法中的一部大法，也叫瑜伽焰口施食。‘焰口’这两个字有两种含义。一种含义是形容饿鬼道的饿鬼。因为饿鬼道的饿鬼嘴里都喷火，像火焰，不能吃东西所以叫‘焰口’。佛在《<a href=\"/fojing/yulanpenjing/\" class=\"keylink\" target=\"_blank\">盂兰盆经</a>》中讲到，目犍莲的母亲因为业障重，落入饿鬼道，不能吃东西。目犍莲想救他的母亲，给她送东西吃，结果她一拿到手里就变成了焦炭，不能吃。所以饿鬼都很痛苦。‘焰口’的另一种含义是特指主宰饿鬼道的佛。在六道里每一道都有佛来主宰。因为佛是大慈大悲的，要利益一切众生。饿鬼道的饿鬼这么苦，佛也想救度他们，于是就化身成饿鬼，他也是满口喷火，和这些饿鬼一样。因为他要恒顺众生，和饿鬼们相近，才好给他们说法。就像文殊菩萨要度猪，就化个猪身和猪在一块。这样化身同类，才便于接引他们。所以住在饿鬼道，主宰饿鬼道的佛的名字就叫‘焰口’。瑜伽焰口施食就是请佛以法力加持，让饿鬼嘴里的火焰能够熄灭，可以得到法食，得到救度。这个习俗好不好呢？当然假如亡者真的变成了饿鬼，没有东西吃饿得要死，给他放一台焰口帮助他，这是一件好事。对于饿鬼有很大的利益。佛法就是要对活在世上的(阳间)和死亡的(阴间)众生都要有利，叫冥阳两利。饿鬼本来不能吃东西，现在能让他吃了，能从饿鬼道里超度出来，这多好啊！但要注意瑜伽焰口施食是针对饿鬼道的饿鬼，不是超度亡者通用的方法。因为在中有时期，死亡的人并不是个个业障都这么重，都要堕到饿鬼道，尤其是在中阴阶段(七七四十九天之内)更不是这样！六道是随业轮转的，在世上做好事修善业的就升天，<a href=\"/remen/shane.html\" class=\"keylink\" target=\"_blank\">善恶</a>夹杂的就投胎人道，地狱、饿鬼、畜牲是三恶道，是最坏的道。死了之后都放焰口，岂不是认为人人都这么坏，都要堕到饿鬼道里去了。所以这样做不对！我们修心中心法，六印做完之后借法力的加持和佛力的加被，就不会堕入三恶道。这样我们放焰口还有什么用呢？！所以在中有时期不需要放焰口，还是应以《中有教授听闻解脱密法》对亡者施法为好。对他说明死亡的经过情形，教他认取光明，就可以被超度，可以证成报身佛。这是对亡者最有利的救度方法。所以还是应以本法来代替放焰口更好。</p>\n<p>　　请和尚放焰口做佛事，看起来是做好事，其实并不好。因为你也请和尚做佛事，他也请和尚做佛事。弄的和尚没有时间来修法。以前南山宗的祖师就针对当时的社会现象说：‘现在这些居士都来请和尚做佛事，实际上是害了这些师父！他们非但没有功德而且还有罪。’因为他们出家并不是为做佛事赚钞票的。他们是为了修行成道，了脱生死，出六道轮回的。你们害得他们没有功夫修道，一天到晚赶经忏还来不及，所以你们非但没有功德还有罪。因此我劝大家还是不要这样做。另外这些师父接受你们的请求，没有功夫或来不及做时，就难免夹杂一些虚伪的东西。我亲眼见到有些庙里做<a href=\"/remen/fashi.html\" class=\"keylink\" target=\"_blank\">法事</a>时，人数不够，就随便拉两个乡下人来凑凑数。他们也不知道怎么念经，怎么敲打<a href=\"/remen/faqi.html\" class=\"keylink\" target=\"_blank\">法器</a>。给他们把<a href=\"/remen/jiasha.html\" class=\"keylink\" target=\"_blank\">袈裟</a>披上，边上的人说敲，他就叮叮咚咚的敲，也不知道什么时候停，边上的人叫他停时他才停。这些都是很虚伪的。另外他们念的经忏是不是就算数呢？也不算数。因为‘打水陆’时要出黄榜。黄纸上都写著：什么经要念多少部，什么经念多少部。但因为一趟一趟的水陆接踵而来，他们根本来不及念，所以就念得少了。有两个法师亲口对我说：‘唉！我们欠的经债，不知道怎么来补偿！榜上都写了《<a href=\"/fojing/miaofalianhuajing/\" class=\"keylink\" target=\"_blank\">法华经</a>》要念多少部，而我们来不及没有念，都用《观世音菩萨普门品》代替了。’所以这些师父们当然也有罪，因为他们与经不相应，欠下了经债。欠债难还啊！那么这个罪还是由居士们造成的。所以还是以本法代替放焰口比较好。大家要把本法弄熟悉、弄精通，当什么地方有人死了，就可以去帮助他们来超度亡者，这样比较好。这样做更有利于亡者，使亡者能够真正得度，所以功德更大。</p>\n<p>　　焰口并不是佛说的，是一些大祖师根据佛所讲的经义，用一些相关的<a href=\"/remen/zhouyu.html\" class=\"keylink\" target=\"_blank\">咒语</a>组织起来的(比如在放焰口用的本子里，就有很多苏东坡写的句子。苏大学士的文学、诗词歌赋都很好)。放焰口用的本子并不相同，但里面的咒语是一样的。在焰口本子里有各种各样的咒(像变食咒等等)，这些咒语都很好。在我们的功课本里这些咒也都有。任何一个法门不管是净土宗，还是禅宗，还是其他什么宗，都离不开密法，都离不开密咒。</p>\n<p>　　实施中阴救度法‘最好由曾学密宗或具有戒行之高僧，或居士娴习颇哇法及本法者专门为人教授念诵，执以为业’(见原文五十二页)。在西藏的喇嘛非常多，但在内地喇嘛及阿阇黎金刚上师却很难遇到(阿阇黎汉译就是金刚上师，他能够教授众生，能传法)。有道行的人也很难遇到。现在中国的出家人很多，但大半都是对佛法不大通的人。有戒行的高僧就是指<a href=\"/remen/juzujie.html\" class=\"keylink\" target=\"_blank\">具足戒</a>行不破戒。现在的出家人都是破戒者多，持戒者少。十个当中就有八九个都是破戒的。我就曾看见，<a href=\"/remen/libai.html\" class=\"keylink\" target=\"_blank\">礼拜</a>六快下班了，他们把和尚衣服脱掉，便衣一穿，帽子一戴就出去了。不知道做什么事情去了。有的是坐小汽车回家看老婆孩子去了。我在普陀山说法的时候，曾看见有个师父正在帮人家做佛事，他的老婆孩子一大群都来喊他：‘我们现在要收稻子了，快回去吧。’这还成和尚吗？！都破戒了，看著就不像个和尚。如果不具足戒行就不能称其为和尚！所以现在具足戒行的高僧的确是很少。在家居士如果对颇哇法或本法很熟习(娴习就是熟习)，也可以请这些人来为亡者念诵。但在家居士平常有工作，也没有时间专门从事念诵。所以我劝大家都来学密宗，因为本法后面都是密咒，念这些咒就是学密宗。因此最好有一些阿阇黎、喇嘛，或具足戒行的高僧、或熟悉本法的在家居士能以此作为自己的工作(这是孙景风居士讲的)。三百六十行，也可以把这件事执以为业。假如把这件事执以为业，收钞票赚钱也不好。因为这样做就是贩卖如来！就是以佛菩萨的法作为营业的工具。佛在世时也没有给人诵经念咒超度亡灵。佛经上也没有这样的话，那么做佛事是怎么来的呢？因为从前的和尚都是在山林里用功修法，有的在山上搭个茅蓬，有的住在庵或庙里。因为这些师父们不工作，无法生活，所以山下的居士们常常给他们送供养。师父们受到供养就要有所报答。这样居士家里有什么事情，师父们就帮他们念几句经，诵几句咒回向回向。做佛事就是这么来的。渐渐的就变成拿钞票了。再渐渐的就定下规矩来：水陆一堂五万块，普佛一堂五百块等等。其实佛经上没有这么回事。如果执以为业，不拿钞票帮助别人超度亡者，对于死亡的人是很有利益的。因为你利于别人，无形当中就做了大功德，反过来如果你是为了拿钞票就坏了，就没有功德。所以我们说：‘<a href=\"/remen/suixi.html\" class=\"keylink\" target=\"_blank\">随喜</a>功德最大。’今天碰到这个事情，好！我来帮你忙，给你念一念咒，并不希望得到人家的报酬，这样最好。多给别人念，自己也熟悉了。多念一遍就多熟悉一次。将来临死的时候不要人家的帮助，自己就明白了。光一发现，和光合上去，自己就解脱了。所以做这个事情是一举而两利，就是冥阳两利，这样多好啊！</p>\n<p>　　第四条：全部密法施行时可分为四个阶段：</p>\n<p>　　第一阶段：就是濒死之人(即快死的人，濒即临近)应有死相出现。死相有两大类：第一个死相为五根败坏。就是我们的眼、耳、鼻、舌、身要坏了。眼根坏的时候视觉不明。本来我们的眼睛都有亮光，到眼根坏的时候就像退了光的珍珠一样没有光彩了，眼珠也呆滞不动了。有神经病的人眼珠也是呆滞不动的。人要死时眼根坏就是这个样子，可以看得出来。耳根坏则听不见声音了。你喊他，他也听不到。这就是耳根坏了。鼻根坏则鼻柱歪斜，就是鼻梁歪了。舌根坏则语言涩滞。就像大舌头，讲话也讲不清楚。喝醉了酒之后也是这样讲话讲不清楚。身根坏时身体重的搬也搬不动，这是第一种死相－五根败坏。大家一定要记清楚，看到这些现象出现时就知道他快死了，就要给他行法了。不要错过时间。第二个死相为四大消融。我们活的时候四大是融合的。现在快死了四大就要消融(融就是融化)，就要坏了。我们的皮肤、肌肉、骨头都属于地大。地大坏时身体就僵硬了，变得非常沉重，动也动不了了。血液、唾液等流动的属于水大。那时候血液凝止了，心脏就要停止跳动。体温属火大，坏则身冷。我们每个人都有三十六、七度的温度，身根要坏的时候就是火大要坏了，身体就变冷了。所以我们只要摸摸他身上还有热气，那就还好。如果慢慢变冷就是火大消融了。气息就是我们的呼吸，属于风大。坏的时候就只有出气，没有入气(即不能吸气了)。人要死的时候，喉咙中都有口痰，叫海底痰，‘呼噜……呼噜……’作响，吸也吸不清爽。最后这一口痰一落就断气了。这就是两种死相，病者的家属及行法者都要特别注意。当这些现象出现时就要给他修‘颇哇法’。</p>\n<p>　　‘颇哇法’怎么修呢？我们前面讲过了，就是要把中脉脉管观想明亮，像日光灯一样，中间有个明点。用‘嘿－’把它升起来，再用‘嗄－’把它降落。到走的时候用‘啪－’把这个明点打出去就解脱了。死者在世时曾修过‘颇哇法’，脉管已经通了，并已有验证的人，在他死相现前时只要提醒他：‘现在时间已经到了，注意用‘嘿－’升起，升起之后用‘啪－’破掉，这样你就能往生极乐世界了’。只要这样提醒他就行了，但这必须是对于修‘颇哇法’已有验证的人。现在，在西藏不是有用吉祥草插头顶梵穴的吗？我们的身体有九孔，梵穴是其中一孔。只是大家不知道这个孔，用吉祥草分开之后一插就插进去了。但这并不是脉管真正的通了。只不过是让修法的人心里有个安慰：‘噢，我的脉管通了’。其实不是！他还没有观怎么就通了呢？要把脉管观通、观亮才行。插吉祥草只不过是象征性的开顶，不是真正的开顶。真正的开顶，顶上要有黄水流出来。人死的时候也是这样，总有一孔要流黄水。真正开顶是要有验证的。真正修法有验证的人就无需他人再来帮助，他自己就能解脱了。我们只需提醒他一声就行了。另外我们还可以帮他多念度亡等咒，就是我们后面所说的很多咒，如‘六道金刚咒’、‘听闻解脱咒’、‘本觉大悲咒’等等。如果是没有修过‘颇哇法’的人怎么办呢？也有个办法可以帮助他。我们修过密宗的人都知道运气和发气。这时要观想他的灵性从他的脚底由下向上推移，一直上到头顶上，然后‘啪－’的破开就出去了。可以这样帮他修。但一定要由修密法有相当程度的人才能做到。不然你的气放出去没有力量。如果是平时没有修过密法，对密法素无研习的人怎么办呢？孙居士也想了个办法，就是对他应作下面的念诵。第一、指示明光寻求大道文(见原文六十五页)。第二、四大融入指示(见原文六十八页)。第三、发心证认死位明光文(见原文六十九页)。第四、明光直指教授(见原文七十一页)。我们现在只要知道这些经文的名字是什么就行了，内容以后再讲。对于生前已修过‘颇哇法’的人就不用念这几段文字了。对于素无研习密法的人就要一遍一遍的念，不计遍数。我们度亡要分好几个阶段，这是第一阶段。要在这个人还没有断气时做，等断气再做就来不及了。所以这几段文字大家一定要把它弄懂、念熟，这样才能帮助别人。</p>\n<p>　　第二阶段：当亡者死相(就是前面讲的五根败坏、四大消融)全现，气息已完全断了(上面讲的是气息还没有断的时候，现在讲的是气已经断的时候，这一点大家要注意)，这个时候，再经过二、三十分钟就要加诵以下的经偈。即：第五、本尊道场观(见原文七十三页)。第六、法性中有指授及六句要偈(见原文七十五页)。第七、令其认识本来面目教授(见原文七十七页)。这三段文字和我们前面讲的四段文字加起来共七段。这七段文字要轮翻念诵直至死位中有时期结束。要度人就不要怕麻烦，不能随便念两遍就算了。要不计遍数的念。因为前面的念诵他没有听到，后面的念诵他也许能听到，那样他就能得度。所以在死后三天半到四天之间要不计遍数的天天念诵。不要去请和尚放焰口。因为这四天之内是死位中有时期，亡者还处在迷闷阶段，识神还是昏昏沉沉的不清楚。所以要多次念诵希望他能听到，听到了就解脱了。这就是第二阶段的行法。</p>\n<p>　　以上这七段偈文都是为了教亡者认识本来面目的。关于本来面目我们应该现在就能认识清楚才好。本来面目就是没有面目的面目，这一点大家要注意。不是有男相、女相；老相、少相；长脸、圆脸。一切相都没有！实相无相，就是大光明。我们修法明心见性就是要认识本来面目。从前禅宗人参禅就参‘父母未生之前是什么样？’父母现在把我们生下来，有男、有女、有肥、有瘦等相。那么没有生之前是什么样呢？有位师父时时刻刻参这个话头，参了好几年也不能开悟。有一天他出去游玩，正好碰到两个邻居打架。你打我，我骂你，丑秽不堪。有一个人出来劝架：‘哎呀，都是街坊邻居，天天见面怎么能这样没有面目！’他一听：‘怎么这样没有面目’，‘噢－’他开悟了。原来就是没有面目的面目！有个面目就不是了。曾经有人问我：‘我今天打坐打得很好，看到了精灵像，我大概是个精灵吧？’我说他这是见鬼了！凡是有相的都不是。所以现在就要认识本来面目，这样到死位中有时才容易得度。</p>\n<p>　　第三阶段：到了死者断气的第五天，就是死位中有时期已过，不再昏沉迷闷了。这时中阴身渐渐的清醒过来，有点明白了。这就到了法性中有时期。法性中有时期就是本性光明大现的时候。如果这时他醒悟了，马上与光明合上去就能超脱成报身佛了。在这段时间应当依照本法的规定，每天各诵经偈一种。应当诵什么经，诵什么偈子，诵法在后面都讲的清清爽爽。但是要按照顺序念，不要前后颠倒。这样要念诵十四天。与前面念的三天半到四天加起来共计十八天。此为第三阶段的行法。就是说在临死前有一种行法，死后在死位中有时期有一种行法，现在在法性中有时期又有一种行法。加起来是三种行法，大家一定要记熟。</p>\n<p>　　第四阶段：法性中有时期过了之后(就是死了十八天之后)就到了轮回中有时期，要投胎了。本性光明显现的十四天时间已过，这时生前所造的业障就像电影一样，一幕一幕的现前了。造善业者跟善业跑，造恶业者跟恶业跑，入于六道轮回之中。所以解脱的时间越早越好，越晚越坏。最好在前四天解脱就能成法身佛。解脱不了，在第五天到第十八天之内解脱就能够证成报身佛，也很好。但到第十八天以后还不能解脱，那就入于轮回中有时期，这就不大妙了。在这个时期本经里也有救度的办法，就是帮助我们选胎和闭胎。就是帮助我们投胎到好的地方去，转身再来修。这样总比落入三恶道要好。在本经中分上、下两卷。上卷是死位中有和法性中有时期的救度方法，下卷是轮回中有时期的救度方法。轮回中有时期就要把下卷的经文全部念完，连诵三十五天。与前面合计起来共是五十三天。我们现在的做七是做七个七，共计四十九天，不算前面的四天时间。如果把这死位中有四天算上，总共就是五十三天。一定要把这五十三天都念完。我们现在的人往往诵经只做一个七，就是头七。临到二七到第七天才做，不是天天做，这样不好。在这五十三天内天天要念诵，天天要供奉。不能到第七天才念那么一次。《中有教授听闻解脱密法》实施时可分四个阶段。轮回中有就是第四个阶段。孙景风居士怕人天天念嫌烦，嫌文字太冗长，就让大家分次序来念。三天念一卷。第一天开始念到导示第十二天为止。第二天从导示十二念至导示第十九。第三天从导示第十九念至卷末。三天念一卷，周而复始直到七七念满为止。这样就比较少了。我看还是每天都念好。从前我们没有得到《中有教授听闻解脱密法》的时候，都是念《地藏经》和《金刚经》。把《金刚经》、《地藏经》全部念完要比本经下卷长得多，那时还要天天念。现在家里有亡灵在，应该天天念。不应该嫌烦！应该把它全念完才好。分三天念完是孙景风居士姑息大家，怕大家嫌烦。亡者到了轮回中有时期是从断气后第十九天算起，这时候不光念下卷全文，为了安全起见，还要把上面三个阶段的救度法加在一起一块念诵则更为圆满。你们是不是又嫌长了，更心烦了。为了救度众生我看还是不要怕麻烦。因为我们利益别人就是利益自己。做为自己将来往生的资粮。一有功德，二又熟悉，这样多好！所以不要怕麻烦。</p>\n<p>　　第五条：在我们行法的这五十三天当中，死的人哪一天能得度呢？什么时候能解脱呢？我们大家都无从知道。除非我们修法得了某种神通，不然大家都是糊里糊涂的。只好从头到尾依次念诵。从死位中有念到法性中有，法性中有再念到轮回中有，就这样天天念过去，太冗长了。孙景风居士怕大家嫌麻烦，帮大家想了个办法，就是按照死者生前的情形酌予减少。这也是孙景风居士的苦心。死者生前好事做的多就不会堕入三恶道，那么就可以少读一点。假如这个人生前坏事做的多就很危险，就要多给他读一点。所以要斟酌行事。这个人生前修行很好，只要念到死位中有就行了，后面法性中有、轮回中有根本就不用念了。他生前如果没有用功，那么就要给他全部念完。所以念诵要根据亡者生前为人、修道的情形来斟酌减少。如何减少，经文本身并没有规定，这是孙景风居士自己想出来的主意。他是根据经文的涵意，把经文不明显的意思挖掘出来，拟定了一个减少的方法。下面我们分别讲述他拟定的甲、乙、丙三种方法。</p>\n<p>　　甲：这一种方法和我们上面所说的差不多。就是对生前曾修过密法(所以生前多修密法还是好)，或者没有修密法但把《中有教授听闻解脱密法》读的很熟，并具有戒行者，这样的人给他诵到死位中有(第二阶段)结束就行了。具足戒行，这一点很重要，就是说这个人众善奉行，诸恶不做。假如密法修是修了，还做坏事，那就不行！你做坏事就等于没修法。我们只可利益群生，不可做一点点坏事。不要因为恶小就去做，不要因为善小就不做。善虽然只有芝麻大小我们也要做。恶虽然只有芝麻大小我们也不能做。我看现在很多修行的人就不具戒行。不然世间也不会流行这么一句话：‘要看黑心人，吃素道里寻。’吃素道就是指我们信佛的这些群众啊！就是说有很多信佛的人，一面信佛还一面做坏事。这样就是不具戒行。做坏事就是造业，业障就像乌云一样遮蔽了本性光明。在死的时候本性光明就显发不出来，这样你就不容易得度。如果不做坏事，真正是具足戒行的人，气量非常大，慷慨豪放，本性光明就容易激发。因为没做什么坏事，就没有业障遮蔽本性光明。这种人只需要在死位中有，念诵三天半到四天的时间帮助他一下就行了。就是提醒他一下：这时候你要放光了，有明、增、得、净得四种变换。到最后就像是万里无云的睛空一样大放光明。与光明合上去就行了，你就解脱了。后面法性中有及轮回中有的经文就不需要念诵了。</p>\n<p>　　乙：这种方法是针对活的时候没有修过密法，但是曾修过显教(比如净土宗、禅宗就是显教)，并具有戒行的人讲的。具有戒行这一条很重要，就是说他持戒很精严，这样的人可给他念诵至第三阶段(法性中有时期)结束为止。他就可以往生西方极乐世界了。这种方法的施实为期只有十八天，以后轮回中有的经文就不需要再念诵了，因为生到西方就不再轮回了。</p>\n<p>　　丙：这种方法讲的是最坏的一种情况。就是针对活的时候一点法也没有修持，佛也没有念过，咒也没有诵过，并不具善行的人而言。不具善行就是只知道占便宜。哎！人人都想占便宜，这是最坏的。所以我们常说：‘吃亏是福’。其实，我们并没有吃亏啊，吃什么亏呢？我们让人就是好，就是有德性。有德性的人就具善根。要是只知道占便宜，让别人都受到损害，损人利已，那就是缺德，不具善根。不具善根将来就不得好报。所以对于生前不信佛、不念佛，还做坏事不具善行的人，在他死亡之后，为了帮助他，就要从头至尾把经文全部念完，为期五十三天。不能懈怠，不能减少。并且对这样的人，在刚死亡之后就要连同下卷全经统统念诵。注意：不是从第十九天才开始念下卷全经。因为他做坏事，不具善行，业障重，不可能等到十八天，轮回中有的恶境界就要现前了，就要把他拉到地狱里去。</p>\n<p>　　以上所说的三种情况，增加还是减少什么经文，全在死者的家属及行法者斟酌情况而决定。要斟酌情况，不要弄错了。由此可见，还是生前多做善事，多修密法，好好用功，证见本性最为重要。这样就不需要念到第三阶段，在第一、第二个阶段就行了。那多好啊！</p>\n<p>　　前面我们说过，亡者何时得度？无从获悉。孙景风居士为我们想了一个办法：于每一期中有完毕之后，用拈阄的办法来求佛菩萨指示。就是将几个阄写好(写上‘已经超度’或者‘没有超度’)，在佛菩萨面前冥心祈求、祷告，求佛菩萨指示：××人是否得度？然后拈一个阄出来。如果这个阄上面写的是‘已经超度’，就说明这人已经得度了，以后就不用再行法了。如果写的是‘没有超度’，那么你还要给他行下面的法。比如，死位中有时期(四天)过了之后，用拈阄法求佛菩萨指示一下。如果亡者已得度，就可以停止行法了。如果没有，那就要行法性中有时期的法了。法性中有时期(十八天)过了之后，再用拈阄法请求佛菩萨指示，如果得度了，就不用行轮回中有时期的法了。如果没有得度，那么还要行轮回中有时期的法。用拈阄的方法最好偶一为之。不要今天问过，明天又问；明天问过，后天又问。这样不行！这样就变成儿戏了。要诚心诚意的，很虔诚的祈祷佛菩萨指示一下，下面的法还需不需要做？这种方法还是很适用的。从前延寿大师(就是永明寿大师)是禅宗的大德，也是净土宗的大德。禅宗有临济、沩仰、曹洞、云门、法眼等宗，永明寿大师是<a href=\"/chanzong/wujia/fyz.html\" class=\"keylink\" target=\"_blank\">法眼宗</a>的弟子。因为他后来归依了净土宗，法眼宗到他就没有了。当时他决定不了是修‘禅宗’还是修‘净土宗’？就用拈阄的办法在佛前请示。他写好‘禅宗’‘净土’几个阄，在佛前诚心祈祷。他拈一次、二次得的阄都是净土宗，但他还是不放心，共拈了七次都是净土。所以他就决定修净土宗了。佛菩萨很慈悲，只要我们诚心诚意请佛菩萨指示，无不感应如响。就像我们敲钟，敲一下响一下，这就是感应如响，就是感应道交。所以只要我们心诚就能感应。这是孙景风居士想的办法，经文里并没有。这个办法也可以用用。</p>\n<p>　　第六条：如果是出门在外，在异乡死亡的人，有电报或来信通知说：‘××人×年×月×日已经死了’。家里事后得讯，则应当按照经中的规定从死亡之日算起，看亡者这时是处于哪个中有时期，就用哪个中有时期的经文来教导亡者，使他能够得度。假如死亡发生在三天半或四天之内，那就是死位中有时期，如果是在第五天到第十九天之内，那就是法性中有时期，如果到第十九天之后(包括第十九天)那就是轮回中有时期了，就这样来计算。因为从电报或来信获得的信息较迟，不是马上死我们马上就能知道，其中已过的各种经偈就不必再补诵了。比如电报来的时候已经到了第十九天了，这时亡者已处于轮回中有时期，那么前面的死位中有时期，法性中有时期的经文就不必再补诵了，因为念了也没有用处。</p>\n<p>　　第七条：行法的时候，一切布置都不要过于复杂。依经中的规定：亡者面前供养一点果品饭食就行了，佛前也要供养。因为我们要念经偈，要求佛力的加被，所以要供养。在病人面前或停尸处，不要人多语杂，要保持清静。只需要行法之人给亡者念诵经文和咒语就行了。若人多语杂，杂乱无章，亡者或病人就听不清楚经文了。我看见很多净土宗人帮助亡者或病人来念佛，叫做助念团，声音好响啊！还敲起木鱼来：‘咚咚……阿弥陀佛，阿弥陀佛……’。太吵了！这样使病人或亡者的<a href=\"/remen/shenshi.html\" class=\"keylink\" target=\"_blank\">神识</a>烦乱而不能安静。所以还是应该清静点，不要念这么响，木鱼也不要敲，这样太嘈杂。安安静静的念就好了。尤其忌讳家属号哭。号啕大哭最坏，使死的人识神更加慌乱，这样不好！不能哭！一哭反而动了他的爱心。我记得很清楚，从前苏州有个功德林，是素菜馆。这个老板是一心修净土宗的。所以他开素菜馆，不杀生做好事。他临终时善相现前，已经看见阿弥陀佛来临了。可是正在这时，他的小老婆来哭他了：‘亲人呀，你死了以后我怎么办哪？’这么一哭，他的心就乱了。他的心一乱，就起颠倒妄念，业相就会现前。净土的善境界就消失了，佛相也没有了，都被他的小老婆给捣乱了。这样就不好。所以家属不要号哭。另外还要注意不能宰杀生命。不要以为这个人快死了，给他杀两个甲鱼补补身体，这样就坏了！这样做是送他的命！还有办丧事，做什么‘豆腐饭’。多杀点生，多办几桌饭菜，最不好！我见过很多家做豆腐饭，都是大家来吃荤菜、喝酒、划拳像是办喜事一样，没有一点哀思。这样做和丧事一点也不相干，对亡者一点益处也没有，我们不能做这些事情。</p>\n<p>　　第八条：大家要注意，死者在呼吸还没有断时，家属应移动其体作狮子卧式。狮子卧式就是吉祥卧，就是朝右睡。因为我们的心脏在左边，不要压住心脏。人在死的时候心包络(就是本经中所说的‘都帝’)就要开了，第八识就出来了。所以不要压住心脏朝右睡。左手放在左腿膝盖上，右手托在头下。本经还说，弄个鼻塞，塞住右面鼻孔，让左鼻孔出气，我看这个倒不必了。吉祥卧就可以了。狮子睡觉时就是这么睡的，所以又叫狮子卧式。显教中有一本书，叫作《临终时的景象》。这本书讲了人临死时的十种景象以及到那时我们应该怎么办。其中有一点就是说在人将要死的时候，四大分散，不宜触动其体，增其痛苦而生嗔。人马上就要死的时候，你动他的身体，他很痛苦。就像我们睡觉刚要睡著的时候，你碰他，他也会发火的：‘哎呀！真讨厌，我刚要睡著，你一碰把我碰醒了。’从前有位国王，他临终的时候，是在夏天。别人拿著扇子帮他赶苍蝇，一不小心，扇子碰到他的鼻子上。他本来很安静，就要生西了。这一碰，他发火了，嗔心一起就变成了毒蛇。这样就把他害了。所以死者临死的时候要安静，不能碰他，不能戮他的身体。大家注意搬动他的身体成狮子卧式，要看情形。在他还能动，还没有真正断气的时候，帮助他搬成狮子卧式是可以的。假如他这个时候正要断气，就不要动他了。他是什么样就由他去了，朝左就朝左，朝右就朝右，不要管他。这点大家一定要注意！快死的人送到医院最不好。医院在人快断气的时候，给他打强心针，做人工呼吸，动得他痛苦死了。就是要生西方，也会被拉回来的。再就是给他穿衣服也要等到断气至少八个小时之后。八个小时还是有点短，最好要等二十四个小时以后才行。因为那时他处在迷闷阶段，外气断了，内息未绝。我们打坐用功的人就知道，坐得真入定的时候，外气就断了，没有了，内息还是有。这个时候还是不能动他，动他他还是要发火、要生嗔恨心的。所以移动他的身体要斟酌，要看情形。大家要有经验，不要马马虎虎的。我看到很多人临死的时候，大小便都拉出来了：‘哎哟，赶快给他擦干净’。这时他一眨眼就要走了，不能动，由他去。你搬他、动他，他一发火就坏了，西方就生不上去了。所以这时候千万动不得！</p>\n<p>　　第九条：平时大家修什么法，以哪一个佛、哪一个菩萨为主，就把他作为依止之尊(依是依靠，止是我们靠上之后就不动了、入定了)，即为本尊。‘本尊’就是指自己平时所信奉修习的某一尊佛或某一尊菩萨。比如我们修六字大明咒，本尊就是观世音菩萨(四臂观音)。我们修净土，阿弥陀佛就是我们的本尊。我们修心中心法，本尊就是大随求菩萨。大随求菩萨就是观世音菩萨所显现的。西藏的习俗不论红教、黄教、白教、黑教都是念六字大明咒。和我们汉地人念‘南无阿弥陀佛’一样，大家都会念。现在就是连小孩也会念。因为有部电视连续剧《济公传》，里面有首歌就是唱‘南无阿弥陀佛，南无阿弥陀佛……。’现在连小孩也会唱了。能给他们种种善根，这也很好啊！</p>\n<p>　　假如亡者在生前没有修过什么法，没有什么本尊，那怎么办呢？那就以大悲怙主和阿弥陀佛为本尊。大悲怙主(怙是拥护、爱戴、保护我们的叫怙主)就是指观世音菩萨。他发大悲心，要救度一切众生。为什么以观世音菩萨为本尊呢？因为我们此地人都晓得观世音菩萨，家家供观世音菩萨。所以容易印到死者心里去。就是不信佛的人，做为装饰品家里面也供观世音菩萨。我看到很多人家里面的钢琴上放一尊观世音菩萨，作为艺术品。这也很好啊！赞叹赞叹观世音菩萨的尊容吗！另外在汉地，一般人甚至连小孩也知道阿弥陀佛，所以行法时，在大悲怙主后面再添加一尊西方极乐世界的阿弥陀佛为本尊怙主，也很好。这样可使死者容易明白领悟：‘噢！我要到观世音菩萨，阿弥陀佛那里去了。’所以我们可以灵活应用，只要不违背本经的旨趣就行。</p>\n<p>　　第十条：如果亡者七七之后，就是五十三天已过，我们用拈阄的方法看他是不是得度：哎哟！坏了，还未得度，也未轮转他道。就是六道当中哪一道都没有去，还在到处飘泊。这时的中有意生之身变易心念，就有可能幻化为饿鬼，或者幻现为空间的鬼魅(这就是我们平常说的孤魂野鬼，不一定到饿鬼道才是鬼)，无人超度，非常痛苦。</p>\n<p>　　在我们的周围，上下空间都住有罗刹、恶鬼、邪道等鬼魅。魑魅魍魉就是四大恶鬼。哪里能没有鬼呢？处处都有鬼，不要害怕。只要我们心里正直光明，不理睬它们，鬼看见我们老远就避开了。如果这个人心里昏暗老做坏事，鬼便有机可乘。所以做人都要正直为好。四维上下所住的罗刹邪魅之身，都有神通，能现种种神变。现在有很多练气功的人说：‘我有特异功能了’，其实不是！都是这些邪魅罗刹之身附在他身上，他就能现种种神变。刚从地狱里出来的鬼魂，在生前(未堕地狱之前)就想要种种神通。在地狱罪受完出来后，他就专门附在人身上变现神通。很多人著相，想要神通，正好与这些鬼魂相迎合。你心一动，他就附到你身上。你就有神通了，就可以在人前炫耀了。其实这些都是鬼魅之身所为。比如‘观亡’就是一种鬼魅附身。并不是某某人的家属真的被观亡婆请来了，而是孤魂野鬼在作崇。观亡婆都是心里不正常、不正当、阴气重重的人。这样鬼魅才好附到她身上，互相利用来骗人：我帮你现点小神通赚些钱，你供养供养我。因为孤魂野鬼无人超拔，所以他就要供养，想被超度。那么观亡婆怎么能知道别人的家事呢？因为附在她身上的鬼有点小神通，可以问当地的土地神。比如，明天张三要来观亡婆这儿。这个鬼就去问土地：张三家里有多少人？明早要来的是什么人？什么样的情形等等，他就知道了。第二天，张三来观亡了。观亡婆被鬼附身后，她就讲了：你家里有多少人，什么样的情形等等，讲的一点也不错。这个观亡婆还真灵呀！大家就相信了。其实就是这些鬼魅在作崇。从前，我认识一个观亡婆。附到她身上的鬼自己直接说：‘我是无处栖身的孤魂野鬼，我这样帮她，她也帮我，互相利用利用嘛！’所以大家不要去相信观亡婆，都是假的。我们用功的人，首先不要追求神通，要完全心空无住。因为本性是无相的，是万里无云的晴空，一点东西都没有。要时时空净我们的心，方能成道。我们一著相，一有所求，魑魅魍魉这些东西就都来了。所以大家要注意这一点。</p>\n<p>　　在我们这部经的下卷讲轮回中有时，就有‘防护追命鬼卒法门’。追命鬼卒就是因为人们在世的时候，坏事做的太多，死后而感得的一种恶境界。这些恶境界把我们往最坏的地方赶，往地狱里赶。所以叫追命鬼卒。那时候：冰雹、狂风、猛虎、毒蛇、追命鬼卒等等，很多恶境界处处显现。这都是亡者生前做坏事所感召的，叫作‘业镜台’。我们看《十殿阎罗品》里就有‘业镜台’。在‘业镜台’里，我们所做的坏事就都现前了。在这个时候，如果我们第七识所生的意生身(第七识是意根，执著有我。假如不执著有我，就没有这个阴身了，就是大光明身、法身，那就成佛了。所以还是第七识在作怪、在作崇，才有意生的中有身)，就是中阴身，还没有投到哪一道里，还是漂泊无依，因为恶境界现前之故，他就十分忧虑、害怕，做不了主。他一会儿想：我到这里去吧？一会儿想：我到那里去吧？这样忐忑不安的心念就叫变易心念。这时变易的心念，就有可能幻现为满嘴喷火的饿鬼了，或者变现为罗刹、邪魅、恶鬼等孤魂野鬼。所以这些都是自己在恶境界的追逐下，心念变化所造成的。因为一切唯心造吗！这些恶境界真的有吗？并不是真有，是我们所做的坏事、业障所感得的，是自己的妄心所现。只要我们心里明白：一切都不可得！马上清醒就好了。所以，这时候行法的人就要依照本经，呼唤亡者的名字，告诉他，教导他，让他不要害怕：‘这都是你自性所显现的，都是假相。’叫他赶快醒悟，从恶境中解脱出来就行了。这就是‘防护追命鬼卒法门’。就是预防、保护我们不受追命鬼卒的驱使，能从恶境界中脱离出来，不至于堕入恶道之中。</p>\n<p>　　因为亡者可能在五十三天之内未能得度，变成孤魂野鬼非常痛苦。所以在西藏有个风俗，就是在亡者百天之内还要供养，或者逢亡者的生死纪念日(即亡者出生日和死亡日)，或者逢年节(像汉地的清明节、七月半、十月初、大年夜等)，都要供养供养亡者，给他念念经文，超度超度。就是害怕亡者没有得度，落在孤魂野鬼之行列。所以要这样做做纪念。在我们汉地也同样如此。对已经死亡的父母或六亲眷属，或其他无依无靠的孤魂野鬼，或见他人杀鸡、杀鸭、杀猪时，我们如何超度他们呢？在本经附编当中有一些方法，可参酌彩用。什么情形用什么经，什么情形用什么咒，可以自己去斟酌使用。比如我们要追忆父母或亲属，可以念‘大光明咒’、‘听闻解脱咒’，‘本觉大密咒’、‘六道金刚咒’，‘地藏咒’、‘百字明’等等。用这些咒追忆父母和亲属最好！由此可见本经的内容非常全面。</p>\n<p>　　第十一条：这一条是孙景风居士为我们解释附编中的各种真言密咒。密咒就是佛菩萨的心在禅定中所化的符号，汉语称为真言。就是摄一切法，集一切勇。念咒就等于打电报和佛菩萨相通。咒就等于是电报的密码，威力很大，念法也很简单。他举了几个例子：如‘听闻解脱咒’，只有五个字：‘阿比甲当嘎’。这个咒我们要出声念，亡者一听到就会得到解脱。很简单！因为我们念这五个字就和念诵全部经的功德与威力一样。这就是佛菩萨力量的加被！还有另外一些咒，如‘本觉大密咒’，是普贤王如来的心咒。我们前面讲过，普贤王就是阿达尔玛佛，在密宗里，他是最初的一个佛，即法身佛。这个咒只有七个字，就是‘嘛嘛果林萨曼达’。‘六道金刚咒’是‘啊啊下萨嘛哈’，还有‘寂、怒百尊海会圣众咒’，寂就是寂静部，是慈详庄严的正*轮身；怒就是愤怒部，是愤怒可怖的教令轮身，即明王身，百尊海会就是说有很多佛菩萨，不只是一百个，就像西方极乐世界的莲池海会一样不可胜数！这个咒就是本经寂静部和愤怒部曼陀罗的总持(曼陀罗就是道场)，念诵一遍就等于读诵全部经文，非常好。所以读咒的力量很大。我们说念《地藏经》还不如念地藏咒。地藏咒一念就等于念《地藏经》的全文。既简单扼要，又威力无穷。‘能断金刚咒’就是能断金刚经的陀罗尼。陀罗尼就是总持(总一切义，持一切法。就是真言、密咒)。‘能断金刚咒陀罗尼’念一遍就等于念九千万卷《金刚经》。念一卷《金刚经》威力就很大了，念九千万卷就更不得了了。《金刚经》的威力的确很大，我给大家讲一个事实，是一位同事讲的：有对夫妇很要好，丈夫已经死了，就托梦给他妻子。他说：‘我死后很痛苦，你给我念念经超度超度吧！’他活在世上不需要，死了之后倒让他妻子帮他念经超度超度。他的妻子想：我怎么能给他念经呢？我是共产党员啊！再说我也不懂得怎样念经。于是她的妹妹帮她想了一个办法：到庙里去设个牌位。我们现在庙里都设有牌位。延生牌位是用红纸做的，要一千块钱。度亡牌位是用黄纸做的，要五百块钱。她就为丈夫设了个度亡牌位。三天后，她又梦到她的丈夫。这两次现身都只是看见上半身，下半身看不见。他说：‘你给我设了牌位不错，但是我很不得力。因为那里的牌位很多，念经的人又不是专心致志的念诵。’这是真的。那些念经的师父们都是马马虎虎、敷敷衍衍的。‘还是你自己给我念吧，念三卷《金刚经》。’她回答说：‘我不会念《金刚经》呀。’他又说：‘你去请一本《金刚经》，你又认识字，就照著字念好了’。于是她和她的妹妹商量，去请了一本《金刚经》。她每天早上，天不亮，就起来给她的丈夫念经。她不能让人看见！因为她是共产党员，怎么能念经呢？！所以只好在天不亮的时候，起来为丈夫念。三天之后，于梦中看见她的丈夫就不是半身像了，而且很高兴的告诉他的妻子说：‘好了，你帮我念了《金刚经》，我已经得到超度了。’由此可见《金刚经》威力很大，而‘能断金刚陀罗尼’的威力就更不可思议了。</p>\n<p>　　在密法寂静部曼陀罗方位图中有五方五佛。比如东方是不动佛，他的咒就是‘东方不动佛往生咒’；西方是阿弥陀佛，他的咒就是‘阿弥陀佛往生咒’。阿弥陀佛大家都很熟悉，因为修净土的人要往生西方极乐世界，都要念阿弥陀佛。释迦牟尼佛是我们的本师。释迦牟尼佛的法身就是毗卢遮那佛，报身就是卢舍那佛，化身就是释迦牟尼佛。他的咒就是‘灭一切恶趣王咒’，可以帮助亡者消灭他们的罪孽，使他们能够超生而不堕入三恶道(就是地狱、饿鬼、畜牲这三道，每一道都有主管)。这些咒均为度亡时不可缺少之咒。有人说，东方不是琉璃光王佛吗？是的，但要知道东方的佛很多，仅琉璃佛就有七尊，琉璃光王佛是其中的一尊，就是我们平常说的消灾延寿药师佛。所以佛有很多很多，不是一方只有一尊。就看哪一尊佛与我们娑婆世界最有缘，我们就选哪一尊佛。所以东方我们就选不动佛，就是金刚萨埵。在密宗里，他是最重要的佛，又叫大日如来。这些我们以后再介绍。现在，大家只要知道，佛有恒河砂数之多，不止是一尊。实际上一切众生本来都是佛，就是自己迷了，把佛性遮蔽了。看到什么东西好看就想要，听到什么声音好听就想听。迷于声色而忘记迷失了本性。所以说大家都是佛，本具如来智慧德相。只要我们能够一切放下，知道这些色、声、香、味、触、法都是尘劳，都是梦幻泡影，都是假相，都不可得，回光返照自己的佛性，不跟著色、声、香、味、触、法这六尘跑，回归本来，就成佛了！所以说四维上下有很多很多的佛。四维就是指东南西北四方，上下是两方，东南角、东北角、西南角、西北角是四方，加起来总共十方。我们修行的时候，有的人不是上升而是下降，他就害怕了：‘我要下去了，要到地狱里去了！’不要怕，下方也是佛土啊！并不是到地狱里去了。有个公案说的很清楚：一个女子在释迦佛身边入定了。大家心里都有点惊慌、不坦然。因为在当时女出家人被称为二僧，男出家人是大僧。女子应该是后退后退又后退，不能在前面。所以大家都认为这个女子不应该这样做。这时，文殊菩萨(是表智慧的，他是七佛之师)就想叫这个女子出定。他想尽办法：把她举到三十三天，她不出定：把她打下十八层地狱，她也不出定。释迦牟尼佛说：‘你不能叫他出定，下方有个罔明菩萨能叫她出定’。话音刚落，罔明菩萨就从下方来了。这就说明下方也有佛菩萨。《阿弥陀经》里不是也说有六方吗！所以不要说到下面去就是到地狱里去了，不是这样的。其实方所本来没有，没有什么东南西北、四维上下，就是由于我们有分别心：上去了，下来了，这才分出方位。佛性本来就是一个大圆，什么都没有，各方都是一样。所以超度亡者的时候，念一方佛的咒就行了。修净土宗的人念阿弥陀佛的咒就行了。假如所有的咒我们都知道，并把这些咒都诵给亡灵，超度他，使他能得一切诸佛力量的加被，那就更不得了了。度亡诵咒时最要紧的就是要有坚定的信念。要坚信不疑！假如你有一点疑惑，甚至来试法：‘我念这个咒有用处吗？恐怕没有用处吧？！’那就坏了。你的力量就减少了。所以不能存有丝毫的疑惑。像净土宗生西方极乐世界一样，要具备信、愿、行三个条件。这三条如鼎之三足，缺一不可，最为重要。第一，要有信心。当我们为亡灵施法加被他们的时候，要相信我自己就是佛，这个咒的威力一定很大，一定能够超拔他，让他升到净土去。要绝对的相信，一点也不要疑惑。我们在为亡者施‘颇哇法’的时候也是这样。观想自己就是佛，以我的法力将他的气从他的脚底往上推移，推到顶门上从梵穴出去。一点也不要疑惑，不要说：‘我的力量不够吧？恐怕不行吧？’那就不好了。我们信佛信心是最重要的。所以在修法的次第中，第一个就是十信位。但在没有真正证到本性之前，都有细微的疑惑，不是很相信。只有真正证到本性之后才能真正相信。所以我们施法的时候要相信，不能存有丝毫的疑惑之心。就是我们现在修法也是要相信我决定能成佛。要有这个信心你就能成就。因为我们本来就是佛，只因为颠倒妄想，误认外界的色相为真有实有而抓住不放，才迷失了本性。现在我们修法就是把妄念妄心息灭，知道外界所有的色相都是假的，都是虚幻不实的，就一定能成就。第二，有了信心之后还要发大愿。大愿就是<a href=\"/remen/putixin.html\" class=\"keylink\" target=\"_blank\">菩提心</a>，就是发愿一定要成佛救度众生，这个力量也很大。我们说有几种力量非常大：一个是法力无边；一个是业力无边，就是我们所造业的力量很大，六道轮回就是由于业力的牵引使我们不能解脱；再一个就是愿力无边，真正发了大愿力量是非常之大。修密宗、禅宗、净土宗都要发大愿。禅宗就因为愿力加持之故，这一生纵然没有开悟，下一轮再来就能开悟，愿力加持他就能不失人身，就能在出生之后一闻千悟，上上升进。禅宗人在真正明心见性之后，纵然习气未了，思惑未断，顶多七升天上，七返人间生死也就了了。所以净土宗人不要再说禅宗不好了。我们只要有愿力就能和佛菩萨的力量打成一片，感应相通。你感诸佛，诸佛应你。同样的道理，你感亡者的识神，亡者的识神也要应你。换句话说，就是亡者的识神被你的力量摄住了，就要听从你的教导，就能证成报身佛。第三，发大愿之后就要具体去做了，这就是行持。就是要真正做到断惑证真，才能圆证佛果。如果只发愿不好好的修行，那等于发空愿。即使是超度亡者也要认认真真，一丝不苟的行法才行。所以信、愿、行这三个修行必备的条件对我们超度亡者也同样重要。</p>\n<p>　　所以，我们念上述这些咒，只要能信心不渝，就能够与亡者感应相通。亡者得到咒力的加持就能够解脱。一切业障都拘不住他。他可以不受业障的牵缠而证得报身佛。因此我们在度亡灵加被他们的时候，要念附编里的每个咒。这些咒，字都不长，但威力很大，它们所具有的功德在本经附编里讲了很多，这里就不再一一讲述了。</p>\n<p>　　第十二条：曾有人问：‘密法是秘密灌顶传授，不能公开宣讲。现在我们公开讲这个法是不是违背了密宗的规矩呢？’的确，密法必须经秘密灌顶才能传授，这是因为：第一，密法非器莫传。就是说传密法要看被传人的根器是不是相当。如果这个人的根器不相当，既使传了他密法也没有用处，因为他修不上去。第二，密法匪人莫传。就是要看被传人是否真正正直，真正善良。因为密法有很多种：有启用的法，有证体的法等等。尤其是启用的法，假如传了匪人，就是心地不正的人，他会滥用这些法去做坏事，去害人。对于真正正直善良的人才可以传给他密法。不然传了匪人之后，他用密法去害人就是你传法人(师父)的罪过。鉴于此，密法不能瞎传，要求秘密传授。就像我们的心中心法，红教里的大圆满法等都是秘密传授的，虽然如此，但我们度生的心却是平等无二的。</p>\n<p>　　而这部《中有教授听闻解脱密法》是救度亡灵用的，是在人死的时候对亡者做最后一次救度，不是什么启用的法，也不会对别人产生危害。因此本法不同于其它密法，可以公开流通，广为宣传，广为详说，不必秘密的只对一个人讲。即就是有很多人在房间里，也可以为亡灵高声朗诵。让大家都听到，在八识田里种个种子，结个善缘：‘噢，密法里还有这个救度法呢！’这样大家都能知道这个法，都能脱离生死轮回，这多好啊！因此，要详详细细地对大家说，要把经文的意思都解释出来。当我们为垂死之人念诵经文时，因为有佛菩萨的加持，不必拘泥行法的人是不是修过密法，是不是有道行，是不是有法力。只要他能够了解经文中句子的意思，口齿伶俐就行了。如果对经文糊里糊涂的就不行，糊里糊涂是要出错误的。另外口齿不伶俐的人读诵也不行，因为说话说得不清楚，亡者不容易明白，万一听错就把亡者害了。所以这两点大家一定要多加注意。</p>\n<p>　　其实，佛法中所说的‘密’者，就是指我们佛性这个秘密宝藏。即所谓：‘我有一宝，秘在形山’。就是说我们有一个大宝贝，秘密的藏在我们这个有形的、以四大为体的色壳子里面。我们修法就是要把他打开，把他找出来，但必须用功修行才行。现在的人，根器很浅，业障很重，都不肯好好用功，都是敷敷衍衍的。我听到很多人说：‘我一面念佛持咒，一面思想还乱动。想这个想那个，叫他不要想了，但就是息不下来。’为什么息不下来呢？就是因为我们在白天的日常动用中太执著。不知道这些都是幻想，都是假的，追逐不舍、不肯放。所以坐下来的时候思想妄念就一刻也不停。假如白天我们真能做到时时处处用心观照，知道一切色、声、香、味、触、法都是幻影，都不可得，不理睬它，随缘应用，那么坐下来妄念就一定很少。所以只要我们真肯放，没有一个不成功。因为我们本来是佛吗！‘放下屠刀，立地成佛’这句话一点也不错。人就是不肯放，都在那儿计算利害得失：我怎么样可以发财，怎么样可以升官，怎么样才能享受得好。这样白天乱动，坐下来的时候妄念能不来吗？！睡著的时候能不做梦吗？！都是乱梦颠倒，这样不行！所以还是要现在用功，万一用功不得当，最后还有这么一个救度方法。中有时期得度是最容易的，因为色壳子已经没有了。灵识一出来聪明伶俐的很，他一听到指示，和本性光明合上去就成道了。我说这话并不是鼓励你们现在不用功。不是说现在不用功不要紧，将来我还有这个法可以最后得度。我们现在越用功越好。因为现在功夫真做好了，在死位中有时期就得度了，不需要等到法性中有时期了。我们一断气从色壳子里出来就超脱了，不需要别人给我们照这个经文来念诵就能得度。这样多好呢？！所以还是现在用功好。现在不肯放，将来到中有的时候还是要放，到中有的时候，你恋著家庭不放行吗？还能超脱吗？所以古来大德都说：‘要生西方一定要舍得离开这个娑婆世界，否则，犹如抱桩摇橹。’‘抱桩摇橹’就是把船的缆绳扣在岸边的木头桩子上，然后去船上摇橹。这样船能走吗？假如你想生西方极乐世界，还恋著家庭，舍不得离开，就犹如抱桩摇橹一样，徒废心力。所以要放，不放到死时也得放，与其那个时候放还不如现在放。因为根本就得不到呀！本身都没有还有身外之物吗？还有妻子儿女、金银财宝吗？大家都是念念不忘，不知这些都是妄想，都是在做梦，不肯觉悟。可见这个情见很难觉破。所以菩萨叫‘觉有情’，就是要把这个情见觉破、除尽！所以释迦牟尼佛就做了个榜样给我们看。他是王子，可以做国王，有妻子儿子，但他照样出家，离开他们。而我们有很多人像钻头蜜蜂一样，想高高在上做皇帝，做总统，大权在握，要啥有啥。这样是要造业的。我们的妻子儿女与我们只不过是一场因缘和合。什么因缘呢？就是债务的因缘。不是你欠他，就是他欠你。子孙对你<a href=\"/remen/xiaoshun.html\" class=\"keylink\" target=\"_blank\">孝顺</a>就是他欠你，子孙对你不孝顺就是你欠他。都是一场债务的缘牵缠在一起。人就是迷而不觉，只要大家真能够醒悟，一切放下，没有一个人不成道。所以说来说去我们在中阴阶段还是要不迷才行。后面的经文也是这样要求我们的：不要恋著家庭儿女，一切都不可得，更不要恋著身体了。这个身体是个大祸根！大包袱！你背著它就是业障的根源。人之痛苦、人之所患就是因为这个身体。假如没有这个身体就好了。所以我们现在就要明白这个道理，不要再认取色身。禅宗有一个偈子说得很好：‘应以空寂为体，不要认取色身；应以灵知为心，不要认取妄念’。空寂为体就是说：像虚空寂灭不动，没有东西，这才是你真正的本体。色身是假的，不要认取色身。灵知为心就是说：了了分明而不著相，把妄念息下来。妄念就是分别不停，执著不放。所以本经就教导我们：要一切放下认取光明。这样就解脱了。</p>\n<p>　　第十三条：上一条说只要口齿伶俐，对本文能解释清楚的人就可以行法。在这里又著重强调密宗首重师承，这是进一步的说法。的确密宗最重要的是师父的传授，即师承。所以超度亡灵的时候，应该很有礼貌殷重亲切的, 去请(不是马马虎虎、轻轻浮浮的)，‘曾得此法的金刚阿阇黎上师来传授本法，方为合法。’(见原文五十八页)阿阇黎就是金刚上师。金刚者表示不坏，是正法之智慧。所以请金刚上师来传授此法最好。‘方为合法’这四个字用的有些太固定，不大恰当，应该是：‘比较合法’要好些。假如没有这个因缘，没有金刚上师怎么办呢？就要恭恭敬敬，挚挚诚诚的观想我就是莲华生大士，我来为亡者讲这部经、超度他。所以密宗注重观想。修什么法就观想自己是哪位本尊。本法是莲华生大士传的，就观想自己就是莲华生大士就行了，这点不能疑惑。不要说：‘我是凡夫，哪能是莲华生大士呢？’不可以这样想。现在我为亡者传法度他，我自己就是莲华生大士。一点都不要疑惑。就像我们<a href=\"/remen/fangsheng.html\" class=\"keylink\" target=\"_blank\">放生</a>一样：买鱼、螺丝、乌龟等等，放生超度它们时，就要观想自己就是佛。所以不要疑惑，要观想自己就是莲华生大士。如果你对莲华生大士不熟悉，那就观想自己是观世音菩萨。这是对我们汉地人讲的。因为汉地最重视观世音菩萨，你们看家家都供观世音菩萨，因为观世音菩萨与我们娑婆世界的众生最有缘。佛临圆寂时嘱咐观世音菩萨：‘你和娑婆世界最有缘。我圆寂后，你来照顾娑婆世界的众生，保护他们。使他们都能离苦得乐，遇难呈祥’。还不只嘱咐观世音菩萨一人，还嘱咐地藏王菩萨：‘你对这个世界的众生也有缘，你要对娑婆世界的众生普施救度。’所以地藏王菩萨要在地狱里广度众生。假如你不能观想自己是莲华生大士，就观想自己是观世音菩萨，也就是观自在菩萨。为什么又叫观自在菩萨呢？因为观世音是这位菩萨的因地法名。这位菩萨在修法的时候是由耳根圆通入手的，就是通过听世界的音声而成道的，所以叫观世音。这种方法就是观照自己听到声音的是谁？问自己：是谁听到声音的呢？她那时是在海岛上修法。海水有时涨潮有时落潮。涨潮的时候，海水‘哗哗哗哗－’的响，她听见了。就问自己：‘听见声音的是谁呢？’潮落了，风平浪静，没有声音了。她又问自己：‘听不到声音的又是谁？’于是，她悟道了：声音是声尘，声尘是有生有灭的。海水涨潮的时候，‘哗哗哗哗’的响有声音。海水落潮的时候，风平浪静，没有声音。所以海水的声音是有生灭的，但我们的闻性没有生灭！就是能听到声音的性能，即功能是没有生灭的。听不到声，不是还听到了一个‘没有声音’吗！不是没有听到。我们一般人认为听不到声音就是没有听到。实际上你虽然听不到声音，但你的能闻之性还在。所以观世音菩萨是因地为名，观自在菩萨是观世音菩萨成道后的名字，也是用功的一种法门。就是时时观照，以法性为自己，而不是以妄念颠倒的色身为自己。所以禅宗就问：念佛是谁？念佛不是我们的色身。这个色身不能念佛，因为一口气不来了色身还没有坏，怎么不能念佛呢？其实能念者是我们的性能、功能，就是佛性，观照我们的佛性，无在无不在，处处都在。不是说在某一处，不在某一处，这就叫观自在。观世音菩萨成道了，就得大自在了。我们离苦得乐得大自在也叫得自在。所以观自在菩萨是果地法名。她大悲心痛切，看我们一切众生都像她的子女一样。而我们这些娑婆世界的众生却私心重重，只认自己的子女，人家的子女就不睬了。自己的子女，哎哟不得了，一点也不能碰。人家的子女，打死他也不关我的事。而观世音菩萨不是这样，她悲心痛切，时时刻刻的照顾我们。所以升西方极乐世界的净土宗人，也不能离开观世音菩萨，也要念观自在菩萨，念‘六字大明咒’，时时得观世音菩萨的保护。所以要观想你自己就是观自在菩萨。如果自己不敢承当自己就是观自在菩萨(或莲华生大士)，那么就观想观自在菩萨(或莲华生大士)是你的上师，在你的头顶上或者面前空中。在度亡的时候，你就是跟著观世音菩萨在念诵经文，有观世音菩萨的佛力加持，你的疑虑就解除了，就可以大胆放心的念诵了。实际上，我们不应该有疑虑，要认定自己就是观世音菩萨。尤其是在中阴阶段，要能够认取光明就是我自己，与之合上去就成报身佛了。如果不敢承当就差一点了，那就认为这个光是佛放的光，是接引我们的，这样我们就跟著去到西方极乐世界了，还不能证成报身佛。所以一个人的成就要看你的胆识，要看你的心量！胆识大、魄力大、心量广阔就能成大器。如果你胆识小，心量狭窄，那你就不行。所以根器非常有关系。不敢承当你就是观世音菩萨，那就观想观世音菩萨在你顶上或者面前空中，你是跟著她念的，这样也可以得到加被。孙景风居士也是苦心孤诣，他把我们众生大大小小的心量都考虑到了。这样做使存者(就是为亡者说法的人)和亡者(就是死亡的人)还有在一起听到此法的其他人都能得到利益。当然，在以后遇到因缘，还是应该请个金刚上师补传一下。因为密宗的规矩是这样的。</p>\n<p>　　这个法完全出自于莲华生大士的大悲心，因为他要超度亡者，希望死亡的人能脱离苦海，脱离六道轮回而达到彼岸，所以我们不能利用本法来赚钱。这一点大家要注意。现在有很多人做这些事是为了赚钞票。比如有很多人并没有出家就跟著去做佛事，为亡者念经赚钱。这些人真是不得了啊！不是我吓唬你们。不要为了一时的利益而造下地狱的因。不可以这样做！我们超度亡灵应该像莲华生大士一样是出自慈悲心，而不是为了赚钱。</p>\n<p>　　莲华生大士、观世音大士都是这个法的主人。因为莲华生大士就是阿弥陀佛、释迦牟尼佛、观世音菩萨三位之体合而成就的，所以莲华生大士就是观世音菩萨。他和观世音菩萨一样也是不离开我们。但是我们汉地人对莲华生大士很陌生。像莲华生大士的本尊咒大家都不知道念，就是：‘嗡啊吽别渣古鲁贝嘛悉地吽’。西藏人念熟了就成了：‘嗡贝玛别渣吽’。我们常常念，莲华生大士就时时现在我们面前，时时在救度我们。使我们能离苦得乐，往生他的国土。他与其他佛一样也有国土，即佛土。在我们此地，说到大<a href=\"/remen/beiguan.html\" class=\"keylink\" target=\"_blank\">悲观</a>世音菩萨的灵感，大家都很相信。正如《观世音菩萨普门品》中所说：你有什么灾难，只要念观世音菩萨就能解脱。观世音菩萨‘无时无刹，恒能寻声应念而至。’时就是时间，刹就是空间，恒能就是一直能，经常能做到，不是今天能明天不能，刚才能现在不能。所以这句话就是说：无论什么时间，无论什么地方，只要我们念观世音菩萨，观世音菩萨就能现身，就能寻声应苦。她就能够闻众生之苦，观世人痛苦的音声来救度世人。你在那儿念：观世音菩萨、观世音菩萨……。她就听到了，就能够应念而至。你想她，她就能够在你面前显现。有本书叫《观音灵感录》，记载的事都是很灵验的。有的人去做试验，那就不好了。《观世音菩萨普门品》中不是说：‘入火不焚，入水不溺’吗，有人就来试试看：把蜡烛点起来，念：南无大慈大悲观世音菩萨……。然后把手放到火上烧。‘哎哟！痛死了。不是入火不焚吗？怎么还烧得痛呢？’哎！不是诚心诚意，而是在考验观世音菩萨那就不好了。对于经文我们不能依文解义，要讲活，不能讲死了。‘入火不焚’有很多意思，这个火在这是指烦恼火。我们心里乱，就是火烧功德林。当你起烦恼烈火时，就念观世音菩萨，就知道一切都是空的，烦恼也就消失了。这不就是入火不焚吗？！所以我们讲法不能完全照字面意思解释。‘入水不溺’中的水是指什么呢？是指爱水。你看要好的人分别了，就要流眼泪。把你喜欢吃的东西放在你面前，口水就流出来了。所以这个‘水’是指爱水。倘若在这些时候，你念观世音菩萨，知道一切都是虚无漂渺的假相、幻想，就像空中的花，水中的月亮一样不可得，这样爱水就没有了。这不是入水不溺吗？！所以经典讲活了都能通，照句子讲死了就不好。所以大慈大悲观世音菩萨是无所不在，时时刻刻都能现身。我们真正苦难的时候念观世音菩萨，就能得到解脱。</p>\n<p>　　第十四条：按照我们国家过去的风俗：人死后前三天都放在床上不入殓。三天后就放在棺材里摆一摆，这时候棺材盖子不盖，钉子也不钉，这就叫小殓。七天后就把棺材的盖子盖起来，钉子钉好，这就叫大殓。所以从前的风俗就是三天小殓，七天大殓，但现在做不到了。现在在医院里，气还没有断透就说：‘不行了，不行了，马上送到太平间里去。’所以现在死在家里还比较好一点。但在家里也要看时间因缘。假如是夏天，天气很炎热，也放不到三天，这时就可以在殡仪馆的冷藏库中放一放。孙景风居士猜测我国的这种风俗大概也是因为在三、四天之内，死者的识神还没有完全离开尸体，还处在迷闷阶段。禅定功夫越好的人走得越慢。功夫越差的人走得越快。但在这前三天半到四天之间绝对不能烧。假如这个时候送到殡仪馆一烧，那就糟糕了。因为三、四天之内他的识神还没有完全离开，还可能假死，有可能又活转过来。这种情况的确是有！我在黄崖讲经的时候，有一个人告诉我说：‘从前我一点也不相信六道轮回。现在我真的深信不疑了’。我问：‘那是什么原因呢？’他说：我生病住院的时候，遇到一件事情。当时我的病并不重。那些病友在打牌，我没有事就在旁边看。这时我看见空中有个女子向我一招手，我就跟著走了。那时候我的身体也没有知觉，就飘啊飘，来到一个地方。有一扇大铁门，门上钉了很多钉子，上面写著「冥界’两个大字。这个女子关照我说：‘你在门口等著我，不能进来，我去叫一个人来’。说完她就进去了。我等啊等啊，等了很长时间她还不出来。我就跑进去了，看见里面阴森森的，一间间的房子。咦，我看见我的一位朋友。这个朋友说：‘是我请你来的，因为有桩事情要托付你：我的母亲为我离开了她，哭得不得了。一只眼睛哭瞎了，另一只眼睛快要瞎了。所以我请你来帮我传个消息，告诉她我在这里很好，叫她不要再悲伤。再一个就是我母亲在家没有人照顾。你是我的好朋友，我想托你照顾我的母亲。你肯答应吗？’‘答应！答应！’我说。‘好！那我赶快把你送出去，呆在这里不好’。于是他把我送出来，我又飘啊飘，到了医院。‘扑通’一声我又落下来了。这时我看见那些医生正在给我输氧气，打强心针。他们说：‘唉！好了好了，活过来了’。我问：‘怎么回事？’他们说：‘哎呀！你刚才都死掉了’。有一个打牌的人说：‘刚才，扑通一声，你的身体就扑到我的身上。我看到你的气脉都没有了’。他的识神走出去了，色身就扑到打牌人的身上。大家看到他没有气了，就赶快去喊医生来抢救。他说：‘我还不知道会有这种事情，没想到是真的！因为我当时已经死过去了，他们就打电报把我母亲喊来了。我告诉我母亲发生的事情，并问：‘我们隔壁某某人的儿子是不是死了？她是不是为此哭瞎了一只眼睛，另一只眼睛也快瞎了。’我母亲说：‘就是’。以后我就照他的要求供养他的妈妈。碰到这件事情我才相信真有六道轮回。这个人所讲述的就是假死。他的魂被这个女子一招就跟著飘出去了，并没有真死。因此三、四天之内色身可能是假死，还有可能活转过来。</p>\n<p>　　佛的制度是出家人死后不放入棺材，而是坐缸火化。大家都见过吧：一个火化缸，外面贴好火化者的名字。因为要烧火，所以缸底下有一个洞。要死的人盘在里面坐好，下面堆上木材，浇上油，放上供香，然后再点火烧起来火化。因为有供香，所以烧起来有香味。但这要经过二十一天之后才举行，不是当下就烧。如果三、四天没过就烧，他的识神还没有走。你要烧他，他会痛苦死了，所以不能这么快就烧。因为依照本经的开示，人死了之后外气虽断(就是指鼻子的呼吸断了)，内息未绝(就是指胎息还有)。我们做功夫也是这样，功夫做得好入定了，呼吸就没有了。但胎息还是有，还在下丹田里转动，第八识还没有走。第八识又叫‘暖受室’，如果摸摸身上还有热气，那就是还没有死。入灭尽定的人，他的第八识就没有走。他身上都冷了，但心口还没冷。第八识还在心包络里面，内息(胎息)还在。做功夫的人证到胎息并没有见性。因为这个身体还没有化空。要完全化空了，连虚空也不存在了，唯有绝对真心现前，那才是见性！所以做到胎息只是禅定功夫很好，但并不是见性。胎息也称识闷绝位。就是识神闷到里面，没有脱开这个色身，就像被别人打昏了，或者生病休克了一样。休克也是不呼吸了，世俗上称为昏厥。通常人死后这段时间有三天半至四天，修行有定力的人可以维持四至七天。七天之后识神才能完全离开，不再闷在身体里面了。所以人死后不能马上就烧。送到殡仪馆后，最好给他用防腐剂或放在冷藏库中保存几天。马上烧很不好。</p>\n<p>　　现在全国各地都举行火葬，这个方法很好，很清爽。从前我们都是要买棺材，买坟地土葬，很浪费！有些人还很讲究，要什么蓝板棺材、硬木棺材，还要很多的陪葬，真是不得了！现在挖古墓挖出很多的宝贝供人展览，对死者有什么意义呢？！所以还是火葬好，付之一炬烧光算数。人死了，家里本来就有很多事情，还要出殡，这样很麻烦。以前都是大出丧，我记得上海那个时候出丧，不知道要多少人，就像出兵一样，真是不得了！现在火葬这个办法很好，优点很多。可以节省财力、物力和时间，省下的土地还可以种庄稼。从前坟墓造得很考究，像一个大花园，真是浪费。佛的办法就是要节省，都烧掉。但佛制不是马上烧，而是坐在佛龛里或者坐在火化缸里，后来是在一个木头龛里坐几天。如果是有功夫的人，可能过很长时间身体都不腐化。像九华山百岁宫无瑕禅师的应化身，就是一直不坏。我记得从前常州天宁寺的眼开和尚，在清朝是翰林出家，他的功夫也很好。他临圆寂时就预先关照他的徒弟：‘三天之后你们开缸看看，假使我的色身不坏，那就可以装金。如果色身腐化就火化好了。还有这串佛珠是×××的，你们帮我还给他’。他安排好后就自己走到火化缸里，盘脚坐好。念佛僧众围绕他的火化缸给他念：‘本师释迦牟尼佛’。因为他是禅宗不是净土宗。三天之后打开缸一看，身上有黑斑了，表明身体已经开始腐烂。于是，大家就把眼开和尚的肉体烧掉了。不是有人说，现在毛主席的身体摆在水晶棺材里，身上已经有黑点了，这就表示已经腐化了。</p>\n<p>　　孙景风居士再三苦心关照：‘惟为死者安全起见，决不可朝死而夕即焚’(见原文五十九页)。人死之后识神还没有走，把他烧了，他痛苦的不得了。这一痛苦就把他害了，嗔心一起就投到毒蛇猛虎异类道里去了，不能再升西方。非但他的肉身痛苦，害得他的法身也不能成就。所以为了安全起见，绝对不能早上死晚上就去焚烧火化。应该送到殡仪馆冷气间里放几天，不要马上去烧。至少三天之后，我们再在殡仪馆里开追悼会火化。如果殡仪馆里没有冷气设备，暂且买个薄皮棺材，不要考究。因为薄皮棺材比较省钱，将来要烧的吗，买厚棺材有什么用处呢？所以买个薄皮棺材暂且收殓起来，经过七天之后再烧。或者依照回教的办法。回教的办法很好，把死者刷洗清爽之后，用白布从头到脚统统缠起来，以盒盛之。回教徒的棺材就是个盒子，用很薄的板钉成，下面一抽，底就掉了，所以叫脱底棺材，很小很轻。临葬时将盒底抽出去入土，就像你们搓麻将的盒子一样，一抽就脱开了。不像我们民间的棺材做得很厚很笨拙。回教徒的棺材都是到清真寺去租。租用一下，用过之后再还给清真寺，也不埋掉。不过我知道，若不是回教徒，你到清真寺，人家不租给你。收殓起来摆过七天以后，识神已经走掉了，这时再烧。这样死者既得安宁，活人也可以节省财力物力。事情少了，麻烦少了，家属也可以轻快些，不妨碍工作了。这一段话是孙景风居士附加上去的，就是希望大家注意不要朝死而夕焚。要摆过一个礼拜，最少要摆过三、四天再烧。</p>\n<p>　　以上就是‘卷头语’，下面开始讲正文。</p>\n<p>　　第二部分 正文</p>\n<p>　　中有教授听闻解脱密法(藏名巴多脱卓)</p>\n<p>　　西藏密教初祖莲华生大士心传宝典</p>\n<p>　　取库藏者持明羯磨大师自黄金河畔堪波达山请出流通</p>\n<p>　　诺门金刚乘弟子寿固金刚孙景风敬译</p>\n<p>　　本经由密宗红教初祖莲华生大士所著。由于时间因缘不成熟，他将本经写好后，藏在山洞里面，并没有马上流传。后来他又化身成持明羯磨洲大师，到藏经的地方(即黄金河畔堪波达山)，把经文取出来流通。现在由金刚乘弟子孙景风居士翻译完成。</p>\n<p>　　正编上卷 死位中有与法性中有</p>\n<p>　　◎皈敬偈</p>\n<p>　　法身 ‘阿弥多婆无量光’</p>\n<p>　　报身 ‘莲华’ ‘寂静’ ‘忿怒’ 尊</p>\n<p>　　化身 ‘莲华生师’ 众生怙</p>\n<p>　　三身上师尊前我敬礼</p>\n<p>　　死位中有就是人刚刚断气后的三天半到四天之内，这段时间中有身处于迷闷阶段，还没有脱离肉身。到第五天中阴身从身体里出来，就清醒了，这时就到了法性中有时期，为期十四天。</p>\n<p>　　‘皈敬’就是皈敬求加之意。皈者，<a href=\"/remen/guiyi.html\" class=\"keylink\" target=\"_blank\">皈依</a>也(皈即归家，依即依靠)；敬者，敬礼也。求加就是请求加被。皈敬偈就是依靠我们的法祖莲华生大士，向他敬礼，请求他的加被。阿弥多婆无量光就是说阿弥陀佛具有无量光、无量寿。他具足一切，法力无边，光明不可限量。这就表示我们的法身(即佛性)，它是诸法的根本。‘莲华’就是指莲华身。‘寂静’尊就是正*轮身，妙相庄严，有三十二相，八十种好。‘忿怒’尊就是教令轮身，即明王身，是专门怖魔的。所以在这里‘莲华’‘寂静’‘忿怒’尊都是指我们尊贵无比的佛菩萨，代表我们的报身。‘化身“莲华生师”众生怙’就是说莲华生大师是由释迦牟尼佛、阿弥陀佛、观世音菩萨合起来化生的，所以叫化身‘莲华生师’。众生怙就是指佛菩萨是广大众生的依靠和保护者。所以这段‘皈敬偈’就是说我们要在具足法、报、化三身的上师面前，恭恭敬敬的再三顶礼，诚心诚意的祈求佛菩萨的加持。</p>\n<p>　　诸中根瑜伽士，中有解脱方便，即此‘听闻解脱密法’。凡义有三：即前导、正述、结归三分。</p>\n<p>　　文中为什么说诸中根瑜伽士，而不说上根瑜伽士呢？因为上根人修法修得好，他们在未死之前已经证到自己的佛性，不必等到中阴境界现前即可解脱。所以本密法是诸中根人最方便的解脱法门。瑜伽士就是指修法修的相应的人。中根瑜伽士生前未证法身，活的时候不能了生死，但死后中有时期听到本法的教导就可以得到解脱。这本《中有教授听闻解脱密法》共分三个部分，即前导、正述和结归。前导就是在为亡者说法之前的导引。正述就是本经的正宗分，就是告诉我们一步一步的如何解脱。结归就是最后的归纳与总结。就像我们讲经一样也有：序分、正宗分、流通分。前导就相当于序分，正述就相当于正宗分，结归就相当于流通分。</p>\n<p>　　［初］前导</p>\n<p>　　此中敷陈‘中有教授听闻解脱密法’，在密乘中，修法行者，分为上、中、下<a href=\"/remen/sangen.html\" class=\"keylink\" target=\"_blank\">三根</a>，诸上根人，依‘引导次第’(引导次第者，谓行者初由显教入手，俟有相当修持，通达空性以后，次入密教坛城灌顶，授以大法，由‘生起’‘圆满’二次第循序进修，迨命终时，即仗引导次第而得解脱)。最初入手修持，即仗‘引导’，定得解脱，若或未能解脱，则于‘死位中有’(命尽时谓之死位中有)时，不必修颇哇法(迁识往生法名颇哇法)径修成佛。</p>\n<p>　　敷就是铺出来，陈是陈述。前导讲述了在《中有教授听闻解脱密法》中，上根人、中根人以及下根人如何解脱。上根人能够解脱的法，中根人就不能解脱，下根人则更不能解脱。所以上、中、下三根人的解脱方法都不一样。</p>\n<p>　　译者在括号里将密法的修行次第作了解释。就是说修密宗的人开始修行的时候都要由显教入手，假如不懂得显教的教理，就不能修密法！因为教理是通理，密法是事行。就像读书，先要明理，明理之后才能具体去做。净土宗同样也是先要懂得教理，然后再念佛—这就是修持。如果一点道理都不不懂，怎么去做呢？所以修行先要由显教入手。研究教理达到一定的程度，最好能够通达空性以后再入密教。通达空性就是指明白了色就是空，空就是色，不再把空当成是顽空、断灭空或析法真空、或体法真空等等，而是理解了妙有真空，真空妙有的道理(此段可参见本书‘翻译缘起’31页)。但如果对显教没有相当修持的人是不容易通达空性的。所以应该通达空性以后，再来实修密法。密法是通过持咒、结印等方法来修持，比显教多了一个方便加持—即佛菩萨的加持力。关于咒，我们前面讲过了，是佛菩萨的心在禅定中所化的符号。我们念密咒就等于和佛菩萨通电报，咒就是密电码，印就像天线一样。我们通过结印、持咒就能把自己本身的能量和宇宙间的能量接通，也就是和佛菩萨的能量接通。这样佛菩萨就会加持我们。显教就完全靠自力，比如参禅就没有佛菩萨的加持力。所以密宗有这样的方便法，比较省力，也比较容易成就。进入密教须经‘坛城灌顶，授以大法’。坛城就是道场，就是设个道场来为受法者灌顶。灌顶是个仪式。因为佛教是在印度创立的。当时印度王子继位(就是要做国王了)，就要请个大臣来为他举行仪式，这个仪式就是灌顶。所以为了尊重之故，传授密法时也依照这个习惯举行灌顶仪式。每个法的灌顶都不同，因为用的咒语不同。灌顶授法之后，再由‘生起’‘圆满’二次第循序渐修。‘生起’者就是从无到有，修有相的观想法。最初步的观想法是观想本尊、坛场等等。比如修‘嗡、阿、吽’就是观想红光、白光、蓝光分别从本尊顶上、喉结、心里放出来，收到我们的心中。再把我们所有的习气、污秽都消光、除尽。这就是从无生有，是生起次第中的一个方法。圆满次第就是把从无观想出来的有再化空，光也不可得，就像我们整日在空气当中不觉得有空气一样，要归无所得。所以《心经》中讲：‘一无所得故，依般若波罗密多，得阿耨多罗三藐三菩提’。无所得是真得，有所得就不对了。所以圆满次第到最后就是归无所得。</p>\n<p>　　修习密法应按次第循序渐进，不可跨越。现在有些人初步的还没有修好，就要修下一步的。比如修大圆满法，大圆满法分彻却、脱嘎两部分。有些人连彻却还没有修好，就修脱嗄了。这怎么能成就呢？！彻却没修好，心还在动，心动就像我们照镜子时镜子在摇动，这样照的像就不清楚了。所以先要把初步的修好。修好后你的心就像静止不动的镜子一样，照的影象就逼真现前了。有的人还没有修过彻却，也不知道修成彻却是什么境界，就修脱嘎了。这不是胡来吗？！所以不得师承胡来是不行的。</p>\n<p>　　我们修法，不管是净土宗、禅宗还是密宗修到一定程度都是一样的，都能证到自己的光明，都能明心见性(修到这种程度的人就是上根人)。我们平时修法用功，快打开本来见性时，呼吸是要断的。一般人到这时都很心慌：‘哎呀，我怎么要断气了，要死了！’一害怕就退回来了，很可惜！所以到这时千万不要害怕，要证见本性，要脱开这个色壳子，气是要断的，这就叫‘虚空粉碎，大地平沉’。上根人已经证到这个地步，到死的时候就不害怕了，因为他已经‘死’过，已经熟悉了，就能安安稳稳的解脱了。所以上根人就不需要中阴救度法，也不需要颇哇法了，即使他到死的时候有点迷闷，只要依照‘引导次第’也可以解脱。引导就是告诉他：你现在已经放光，与光明合上去就能解脱。他一听到就会马上醒悟：‘哦！我的光明显现了’。他就成就了。所以在世的时候用功最为重要！</p>\n<p>　　诸中根瑜伽士，临命终时，由此密法，决定解脱，又若未能解脱，则于法性中有(命尽后，经过三日半或四日期间，即为法性中有。)起现时解脱，故此听闻解脱密法，必须殷重修持为要。</p>\n<p>　　中根人即使活的时候没有证到本性，也不要紧。依靠这本‘中阴救度法’也决定能得到解脱。因为这个法很殊胜，它能够一遍一遍地提醒我们：现在是什么阶段，放什么光，是什么佛来接引你，什么菩萨来护持你……。使我们在中有时期(即死位中有、法性中有、轮回中有)得到解脱。所以借助本密法，即便是下下根人也不害怕了。中根瑜伽士中的‘瑜伽’就是指相应。就是我们修的法要和我们的心相应；凡夫的心要和佛的心完全相应。上和佛的心相应，下和众生的心相应。所以在我们修法时要专心致志、毕恭毕敬，非常的虔诚，才能把妄念打断，才能和法相应。比如修净土宗的人念佛，也要念得相应才行。光是嘴上念念佛号，心里还在乱动，那就不是相应。念佛要做到‘心念耳闻’，持咒也是一样，要把咒音听得清清爽爽，心佛道交打成一片，这才是相应。中根人在临命终时，假如在死位中有这三天半到四天之内没有得到解脱(死位中有有两次放光，假如这时候你业障重，经过很多次的提词，还没有醒悟，没有解脱)，那也不要紧，还可以在法性中有(就是死后第五天到第十八天之间)光明显现时得到解脱。因为那时还有佛多次放光来接引，还有菩萨来护持我们，所以到法性中时期仍然可以得到解脱，但要求我们对本法要虔诚，要恭敬，不要轻看。应时时刻刻，拳拳在心，不要忘记。</p>\n<p>　　一、颇哇法</p>\n<p>　　初、瑜伽人、于诸死相(凡人在未死以前，先现死相。请参卷头语度亡时期注意事项之(四))。当依观察死相自解脱法，善为观察。迨死相特征全现时，当施颇哇法，如教回忆，自行解脱。</p>\n<p>　　在卷头语中我们已经讲过了，不论是谁在未断气之前都先要现死相。就是身体重了，呼吸急促了，舌头大了等等的现象现前(可参见本书131页)。在度亡的时候我们要注意仔细观察死者，对于生前曾经修过颇哇法的人，在他死相现前时就要教导他：这个时候你不要心慌，不要痛苦，不要舍不得离开你的家庭。生老病死是人之常情。有生必有死，每个人都会死，这是辩证法。所以要镇定，不要悲哀，心不能散乱。现在到了关键时刻，千钧一发，你曾修过颇哇法，现在要注意观想用“嘿—”把明点提起来，升到头顶上，再观想把阿弥陀佛或观世音菩萨的脚拿开，然后“啪—”明点就出去了，就到了阿弥陀佛或观世音菩萨的心中。你就可以生到西方极乐世界去了。假如亡者生前没有修过‘颇哇法’那么在他死相现前时，就要由度亡的人来帮他修。到时还是用观想法，度亡的人把气集中到手上，然后把气从他的脚底往上推，推到心脏，再推到喉咙，再推到头顶。一边推一边观想，最后‘啪—’观想他的识神从头顶出去了。这个方法很有用。人到最后这一关非常重要，所以大家为帮助死者可以用这个办法。</p>\n<p>　　若已证迁转(即神识已经因修颇哇迁往净土)，则不需修此听闻解脱密法。若或未证，则当于亡者尸旁高声朗诵此法。若无尸在(详附注一)，则坐于亡者床榻或其住处而行此法。</p>\n<p>　　怎么能知道亡者的识神已经迁到西方去了呢？有个办法：就是测量亡者的体温。看他是不是脚底先凉，然后腿上再凉，肚皮再凉，心口再凉，到最后头上还是温温的，那就证明他的识神已经从头顶出去了，这就叫顶圣，就是升到佛的净土去了。但是摸的时候要轻轻地试，不能戳得太重。也不能左一次，右一次的戳。因为人到最后要断气的时候很痛苦，你若踫他，他心里很窝火。从前有个国王，也是修佛法的。到最后要走的时候，让别人给他扇扇子赶苍蝇。不小心，‘啪’一下子扇子打到了他的头上。这下坏了，国王一发火变成了蟒蛇，西方就升不上去了。所以不要左一次，右一次地去量他的体温，这一点大家要注意！假如亡者的识神经过修‘颇哇法’已升到净土去了，就不需要再修《中有教授听闻解脱密法》了。下面的经文、咒语也不必再念了。假如亡者的识神没有从顶上出来，就证明他没有到西方去。那就要在亡者的旁边为他高声朗诵本密法。假如亡者的房间里有很多人，最好由一个人领诵，其余的人跟著念，声音不要太嘈杂。</p>\n<p>　　附注一：亡者如在远方，亦可函索其生前相片或其贴身衣服一角，或取亡者生前用物，并列于前，呼亡者名，则亡者亦可应呼而至。</p>\n<p>　　‘附注一’告诉我们：如果亡者不是死在家里，而是死在外地，即‘无尸在’，这也不要紧。可以取他的照片，或者取他贴身衣服的一角(剪下一只角就可以了)，或者取亡者生前用过的东西，摆在他的牌位面前，喊他的名字。他叫张三，就喊：‘张三，请你来受供，我给你讲法，可以帮你解脱’。就这样和他讲，亡者即可应呼而至。因为死的人识神一出来，就脱离了躯壳，没有了障碍，所以就有神通(当然不像佛那样神通具足，没有漏尽通)，哪怕远隔千里万里，他也能感受得到。你喊他的名字，他一飘就到，快得很。所以遇到这种情况就这样来行法。</p>\n<p>　　二、诵法须知</p>\n<p>　　此时行法者，先念下文‘谛实力偈’三或七遍，钩召亡魂，来前听法。</p>\n<p>　　谛实力偈</p>\n<p>　　(此偈应于每一次行法之前，必须念诵)。</p>\n<p>　　以我意乐力　如来加持力　及法界力等</p>\n<p>　　凡所思惟境　皆随其所应　无碍速现前</p>\n<p>　　行法的人(就是超度亡者的人)，在每次行法之前都要先念‘谛实力偈’三到七遍。‘谛’是<a href=\"/remen/zhendi.html\" class=\"keylink\" target=\"_blank\">真谛</a>，就是真理。‘实力’就是说我们本来具足一切妙用、神通，拥有真正的力量。只要我们发心，呼喊亡者的名字，就能够把亡者呼唤过来，和他讲法，并且能够让他听懂。下面讲述‘谛实力偈’。</p>\n<p>　　‘我’是指行法者，‘意’是指乐意、诚心诚意，‘力’是指力量。‘以我意乐力’就是说我诚心诚意，非常乐意超度这个亡灵，作这件好事。我本身就具足这个力量。因为人人都具足万能的法性。只要我们诚心诚意的去做，再加上佛菩萨的加持力，我们就有这个感召力。因为一切时、一切处，不论我们修不修法，都离不开佛菩萨和十法界(指四圣六凡)的加持力。所以净土宗人不但要念阿弥陀佛，还要念观世音菩萨，以求观世音菩萨时时刻刻的加持。佛在《法华经》中也说：此人是行《法华经》的，修法华定的，要如何如何加持他。如果我们做好事，鬼神都会护持；如果我们做坏事，非旦佛菩萨对我们摇头：这个众生怎么在造恶？！就连鬼神也要责罚我们。所以我们平常说：‘三尺顶上有神明’，就是这个道理。这是真的！不要以为一个人做坏事没有人看到。其实鬼神都看得清清爽爽，你瞒不了人！因此，我们现在要救度亡灵，做好事，就会得到佛菩萨和十法界力量的加持，天龙八部都会护持我们。‘凡所思惟境’就是指我所想像的、所要求的。‘皆随其所应’就是说都能得到感应。‘无碍速现前’就是说没有任何障碍，能迅速现前。所以‘谛实力偈’就是说以我自己的力量，再加上佛菩萨的加持力和十法界的加持力，使我所要求的都能得到感应，我就能做好这件事，就能将亡者超度，不会有任何障碍。所以我们只要一点不疑惑，把这段偈文一念，亡者就能随感而至，很快地在我们面前显现。</p>\n<p>　　上偈诵已，即已钩召亡魂，当即观想其来住面前听法，开始朗诵经文。斯时亡者亲属及恩爱<a href=\"/remen/fuqi.html\" class=\"keylink\" target=\"_blank\">夫妻</a>等，不得哭泣，以碍行法。行法时，若有尸在，则于亡者外气将断时，由剌嘛或大德尊者、或亡者生前信崇之友、或同学侣伴等，引唇附耳(但不可近触其耳)，而为诵此听闻解脱密法。</p>\n<p>　　我们把‘谛实力偈’念诵三至七遍，就可以把亡魂钩召来。这时我们就观想亡魂已来到我们面前听法。我们就可以为亡者朗诵经文了。经文大义就是告诉亡者：心不要乱，一切放下，与光明合上去就可以超脱了。所以这个时候死者的家属，就是死者的夫(或妻)、子女、父母等不能哭泣。一哭死者的心就乱了，也就听不进去本法了。我们在这里哭，舍不得离开他；他也会哭，舍不得离开我们。这样就妨碍他往生西方极乐世界了。所以净土宗人也是这样讲：死的时候，大家不能哭，只能帮他念佛。有佛菩萨的加被，可以接引他升西。假如我们这个时候忍不住，就到外面去哭。因为在房间里哭，既妨碍死者又妨碍行法者。</p>\n<p>　　在为亡者超度的时候，假如有尸体在，就在死者外气将断未断的时候，由剌嘛(就是西藏的出家人，我们汉地称作和尚)或大德尊者(就是修道有成就的人)或亡者生前信崇之友(就是死者活的时候很相信、很崇拜的人)来为亡者行法。如果找不到上述这几种人，就找一个和他意气相投，合得来的伴侣来为他行法。行法时，为使他能听清本密法，不要离亡者太远，要靠近他的耳朵，但不要踫著，要离开一点。</p>\n<p>　　［次］正述</p>\n<p>　　三、诵法实施</p>\n<p>　　兹说解脱听闻密法者，初，供养三宝。若富饶者，有力设供，当广为陈献；若力不充裕，可以一心思惟，观为意所变现无量上妙供物，遍满虚空(谓非实有供物、而由心意<a href=\"/remen/zhongguan.html\" class=\"keylink\" target=\"_blank\">中观</a>想所成、变现上妙供品、为数无量、遍满虚空中)。次举诵下列各种念诵：</p>\n<p>　　(一)启请诸佛菩萨加被偈</p>\n<p>　　(二)救脱中有怖畏险峡偈</p>\n<p>　　(三)中有六纲</p>\n<p>　　(四)中有救怖愿</p>\n<p>　　以上四种偈文(均见下卷末附编中)。各念三至七遍，当视时间之长短而定。</p>\n<p>　　在我们为亡者诵听闻解脱密法前，首先要供养三宝。这是为亡者行法所要做的准备工作。供养要看个人的经济情况。假如家里很富有，有能力设供，就可以多供养一点。因为修密法要设坛场，要供养，所以密法可以说是富贵人修的。那些年纪大的人可能见过密法的坛场。从前，在上海的静安寺就设了一个密法坛场，布置的很庄严，供养的很丰富，非常讲究。所供的物品都是金银财宝和珍珠玛瑙，需要花很多钱，在曼荼罗像上，涂的东西都很珍贵，不是普通的颜料：黄的都是黄金(把黄金碾成粉装上去)，绿的都是翡翠，白的都是白银，红的都是玛瑙，所以富贵者就有能力供养。假如我们比较贫穷，没有能力供养，那就随力随份。佛菩萨是不会嫌好道歹的。不会说你供养的好，我就多加被你，你无力供养我就不理睬你。这是我们凡夫的见解。那为什么还要设供养呢？这是为了表示我们的真心诚意。佛经里曾讲过：有一个乞丐来供养佛。他讨啊讨，好不容易讨了点米。他把整整的、圆圆的好米一粒一粒的捡出来。在释迦牟尼佛给他说法的时候，他就供养了这一点米，而那些富足人家，供养十担八担的大米也不在乎。但是释迦牟尼佛却说：这个乞丐功德非常大。虽然他很穷，但心却非常诚恳。所以我们供养是尽力而为，不一定要很奢侈。有力供养者就多供养一点。假如力量不充裕，就把自己供养的一点礼物观想成须弥山大，变现成无量无边的上妙供品，尽虚空遍法界，来供养诸佛。这就是观想供养。因为我们的法性就是布满虚空，周遍法界的，所以我们就有这个力量。没有实在的东西不要紧，只要我们尽心尽意，诚心诚意地观想就可以了。因此我们说，时常以心香供养，就是顶好的无上供养。坛场供养设好后，我们就开始念诵上述四种偈文。第一个偈文就是启请诸佛菩萨加被偈(见原文一百七十二页)。第二个偈文是救脱中有怖畏险峡偈(见原文一百七十四页)。第三个偈文是中有六纲(见原文一百七十七页)。第四个偈文是中有救怖愿(见原文一百七十九页)。下面我们分别讲解。</p>\n<p>　　启请诸佛菩萨加被偈(此文在施法前念诵)</p>\n<p>　　凡亡者在临命终时，即当先作启白发愿，于三宝前，尽力陈设实有供品，或依自力观想所成之广大供云海，手执妙香，竭诚致敬，如下启白发愿：</p>\n<p>　　我们上面已经讲过，行法前要设三宝供养，尽我们的力量，富有者多供一点，贫穷者少供一点。实在没有也不要紧，就一心观想供养像海洋一样广大，像天空的云一样多，并在手里拿著很好的香启请诸佛菩萨，竭尽我们的诚心向佛菩萨敬礼。然后按照下面的文字告白发愿(上面的这段文字只是说明，不要念，下面的才是启请诸佛菩萨加被偈的正文)。</p>\n<p>　　诸佛及菩萨　十方<a href=\"/remen/changzhu.html\" class=\"keylink\" target=\"_blank\">常住</a>世　具足大慈悲　前知及圣眼</p>\n<p>　　这几句偈文的意思很简单，大家都能看懂。就是说请十方诸佛菩萨要常常住世。佛菩萨其实并没有离开我们。释迦牟尼佛圆寂时就说：我并没有离开你们，清净眼的众生就能看见我。眼混浊的众生以为我离开了。其实，佛菩萨是不舍众生时常住世的，但并不是住在一个地方不动，而是无所住处涅槃。</p>\n<p>　　佛菩萨都是有益于众生的，具足大慈大悲。我们就是要靠众生才能成佛。假如没有众生受苦，我们怎么会起大悲心呢？！没有大悲心就不会发大愿，没有大愿就没有大行。在《普贤菩萨行愿品》中的‘行’字(念hang，道行的行)就是从愿来的。所以说众生是我们成佛的资粮，我们要具足大慈大悲，没有慈悲是绝对不能成佛的！</p>\n<p>　　佛菩萨能够知道过去曾发生过什么事，将来会发生什么事，这就是‘前知’。佛菩萨具足肉眼、天眼、慧眼、法眼之用，一切皆见，这就是‘圣眼’。我们众生被妄想、颠倒、执著所蒙蔽，不能发掘这些功能。只要我们用心修法，把我们的妄想、颠倒、执著打破，就能显发这些神通。人死后离开了躯壳，也能够前知，也有天眼，也能看得很远，但不像佛菩萨那么圆满。</p>\n<p>　　为众生依怙　不舍大悲愿　祈降临纳受　实际意献供</p>\n<p>　　‘怙’就是依靠，就是说佛菩萨是我们的依靠，一直在护持我们。佛菩萨的确是不舍弃接引众生的大悲愿，时时刻刻闻声救苦。所以我们应祈祷请求佛菩萨降临到我们的坛场，来接受我们真心诚意的供养—实际(就是我们自己的本性)所持的供养，来帮助我们超度这个亡者。</p>\n<p>　　诸具大悲尊　智智与慈悲　所作诸事业　威力不思议</p>\n<p>　　诸具大悲尊，就是指很多的佛菩萨。在下面我们就可以看到东、南、西、北、中五方各有什么佛菩萨、什么圣母，非常多。智智是三智之一。三智即一切智，一切智智，一切种智。一切智就是说我们的本性是具足一切智慧，能知道一切。它包含了小乘道，就是罗汉、辟支佛的智慧在内，统称为一切智。一切智智就是撇开小乘的罗汉、辟支佛的智慧不算，只有佛菩萨的智慧叫智智。一切种智就是指差别界的所有种种不同的智智识识。要明白所有诸法的色相最终都归一，就是归到我们的佛性。所以一切智、一切智智、一切种智有这样的区别。佛菩萨是无比的慈悲，智慧圆满无碍，威力很大，不可思议。比如大势至菩萨的威力就很大，无所不能。我们修到那个程度就会有这么大的威力。这个力量不是我们思想所能想像得到的，所以叫‘威力不思议’。</p>\n<p>　　今有某姓名　舍现世往彼　离此界至他　已脱血肉躯</p>\n<p>　　我们度亡的时候，不能说：‘今有某姓名’，要说‘今有张三’或者‘今有李四’。亡者叫什么名字就说什么名字。这一段就是说亡者已离开现世的血肉之躯要到别的地方去了。</p>\n<p>　　无依复无怙　无救亦无援　最极大痛苦　今所现境相</p>\n<p>　　已日暮穷途　离家去异乡　如入幽冥地　迷惘赴悬崖</p>\n<p>　　人死后，中阴身一出来就四处飘泊，无依无靠了。因为人执著惯了，认这个身体是我。一旦脱离身体，看见尸首停在床上，听见家人在哭泣，他就知道自己死了。这时他心里很悲痛，还想要身体，想往身体里钻，但躯壳已经坏了，已钻不进去了。于是他六神无主，忐忑不安，东飘西飘，像无头苍蝇四处乱转。既没有依靠，也没有人护持他，援助他。真是痛苦极了！再加上这个时候，他生前所造的一切业障像电影一样一幕幕现前：恶犬追逐，黑风暴雨，冰雹交加，夜叉虎狼……，非常恐怖。还有像雷一样大的声音‘轰、轰、轰—’作响，还有强烈的光照射。真是无路可走，就像太阳要落山了—日暮穷途。家已不再是他的，恋著也没有用。只好离家去异乡，到另外一个黑暗无人的地方(幽是无人，冥是黑暗)。迷惘(惘就是不知所措)之中，看见自己贪、嗔、痴所化的三座大悬崖挡住他的去路，真是痛苦惊慌极了。</p>\n<p>　　惊狂奔林莽　业力追逐故　或落无边荒　或漂流大海</p>\n<p>　　莽是指无边无际。就是说亡者惊慌失措地往漫无边际的森林里奔跑。因为后面有很多的恶相追逐他：虎、狼、鬼、夜叉等等。这些都是他自己生前造业所变现的。有的人身不由己，为躲避这些恶境界，跑来跑去就被赶到地狱里，或者落到漫无边际的荒野里，或者躲到大海里去了。</p>\n<p>　　身不得自在　业风推荡故　或入战阵中　被恶仇执住</p>\n<p>　　业风就是指业力所感的大风。在《法华经》里就有这么一句话：‘业风吹堕罗叉鬼国’。就是说你们要做坏事，这个业风就会把你吹到罗叉鬼国，就是吹到饿鬼道里去。从前有一个大夫问一位禅师：‘这个“业风吹堕罗叉鬼国”是什么意思？’这位禅师说：‘你不配问这个问题’。这个大夫一听，就火了：‘啊！我不配问这个问题呀？！我虽然不是大善知识，总归是个大文学家，怎么不配问这个问题？！’这时这位禅师说：‘哎！这就是业风吹堕罗叉鬼国。我说你一句不配问这个问题，你马上就发火了，不就是业风吹堕罗叉鬼国了吗？’这位禅师讲得很好。我们一发火就是堕到罗叉鬼国去了。所以千万要当心！有的人说：‘发一次火可能不要紧吧？’还不要紧呢！发火就是业风，就会烧毁你的功德林，把你吹堕到罗叉鬼国去。由于业风吹荡之故，就会使中阴身不得自在，做不了主，或者被吹到了打仗的阵战里面，被敌人抓住吊起来，非常痛苦。</p>\n<p>　　无地可容入　或遭阎罗使　鬼卒备残酷　望之极可怖</p>\n<p>　　你们看，人到了这个地步，已没有地方可以容身，真是痛苦到了极点！或者是遇到阎罗王派出来的使者，就是白无常、黑无常、夜叉等等，这些鬼卒都残酷的很，他们把你扔进油锅、叉下刀山、打入十八层地狱。哎！真是不得了，令人望而生畏。</p>\n<p>　　业果诸苦受　无间死复活　撑扎力已穷　颠连极孤苦</p>\n<p>　　中阴阶段所受的种种痛苦，都是我们生前造业的结果。所以我们不能做坏事。造业包括善业和恶业。我们做好事就是善业。比如我们念佛、修法是净业，这是很好的。造善业就可以升天享福。做坏事就是造恶业，就要下地狱受苦。在无间地狱里就是让你永远的死又永远死不了。用刀子把你戳死，然后又让你复活。为什么？就是让你不停的受苦啊！活了之后又被扔下油锅，在油锅里被炸死后又活了，活了之后又该受炮烙刑罚，炮烙刑死后又复活，再去受泥泞刑罚去了。无间地狱就是让你死了复活，活了再死，没有一分一秒的间歇，叫你永远受苦。苦得你力已穷尽，再也没有力量支撑了。这就是我们常说的颠沛流离之苦。所以人在中阴阶段真是苦不堪言。</p>\n<p>　　愿诸佛菩萨　悲愍垂救护　于此待救者　为彼作依怙</p>\n<p>　　赐彼加持力　护免中有苦　遮止业红风　遣回阎罗怖</p>\n<p>　　我们发大愿祈求佛菩萨慈悲、可怜、救护这个死者。这个死者也正在期待著被救度。请诸佛菩萨恩赐他，加被他，保护他(这就是加持力)，让他有所依靠，免受中有境界的诸种痛苦。把中有境界的红风(就是业障所刮起来的大火光)止住，把阎罗的使臣(追命鬼卒等)都差遣回去，把业障所现的恶境界都变灭掉。</p>\n<p>　　中有险峡道　安全拯救出　嗟我大悲尊　愿不舍悲愍</p>\n<p>　　亡者处在中有险峡道(被两山夹住很危险的地方叫峡，就像长江三峡一样被两山夹在当中)，很危险。要把他们安全地拯救出来，使他们能脱离危险。‘嗟我’就是叹息，‘大悲尊’就是指佛菩萨。这段就是祈求佛菩萨不要舍离大悲的誓愿，可怜加被这些亡者，把他们都拯救出来。</p>\n<p>　　不忘宏誓愿　令彼脱诸苦　哀求佛菩萨　愿慈光照住</p>\n<p>　　佛菩萨发了宏誓愿之后，是不会再忘记的。我们众生也应该这样，要常常铭记四宏誓愿，即：众生无边誓愿度，烦恼无尽誓愿断，法门无量誓愿学，佛道无上誓愿成。‘令彼脱诸苦’就是为了让亡者能脱离痛苦，我们虔虔诚诚地哀求佛菩萨，愿佛菩萨慈悲的光照耀死者，加被一切众生。</p>\n<p>　　以大悲光钩　不令入三途　三宝最胜尊　愿慈悲摄受</p>\n<p>　　恩施大悲力　令脱中有苦</p>\n<p>　　这是形容佛菩萨大慈大悲的光就像钩子一样能勾住死者，不会让他落入三途。三途就是三恶道，即地狱、饿鬼、畜牲。在佛、法、僧三宝中最殊胜的就是佛。我们愿佛发大慈悲摄受死者的亡魂，施恩加被，以大悲力令死者脱离中有的痛苦，把他从中有恶境界中拯救出来，进而证得法身或报身，脱离三界和六道轮回。</p>\n<p>　　以上就是‘祈请诸佛菩萨加被偈’。这段偈文里面有很多内容是重复的，我们念的时候可以重编一下，简明扼要的几句就可以了。只要不离开它的重要意义就行。</p>\n<p>　　救脱中有怖畏险峡偈(此文在施法前念诵)</p>\n<p>　　(一)</p>\n<p>　　十方常住　诸佛菩萨　‘普贤’‘寂’‘怒’　海会圣众</p>\n<p>　　佛菩萨是十方常住。不是住在某一方，而是东南西北四维上下无所不在。偈文中的‘普贤’不是我们内地所说的普贤菩萨，藏文是指阿达尔玛佛，中文翻译就是普贤如来，也就是密宗所说的大日如来，即法身佛，在密宗里被奉为第一尊佛。‘寂’我们讲了是慈悲、庄严、圆满的正*轮身。‘怒’就是金刚身、愤怒身，是怖魔的，所以‘“普贤”“寂”“怒”’就是指普贤如来的正*轮身和教令轮身。‘海会圣众’就是指佛菩萨周围的眷属，多得就像大海一样。每一个佛都有很多眷属。比如我们说西方极乐世界也是海会圣众：教主是阿弥陀佛，上首是观世音菩萨，下首是大势至菩萨，还有其他很多很多的菩萨。</p>\n<p>　　上师本尊　空行护法　降临于此　哀请听许</p>\n<p>　　我们修一个法就有一个本尊。比如我们修‘颇哇法’，如果修观音颇哇法，就以观世音菩萨为本尊；如果修弥陀颇哇法，就以阿弥陀佛为本尊。再比如修‘<a href=\"/remen/zhunti.html\" class=\"keylink\" target=\"_blank\">准提</a>法’，就以准提菩萨为本尊。本尊就是我们最高的上师。本尊下面的菩萨眷属就是空行，就像我们画的飞天一样。我们哀请诸佛菩萨，空行护法能答应我们的要求，都降临到这个坛场上，来帮助我们救度亡者。</p>\n<p>　　至心皈命　上师空行　以大悲心　愍垂接引</p>\n<p>　　‘至心’就是恭敬之至，没有一点虚妄之心。‘皈’是回来，‘皈命’就是所有的生命都交给了上师及空行护法等众，就是说我们的本命元辰要完全依靠上师，所以我们祈求本尊上师以大悲心哀愍我们，接引我们。</p>\n<p>　　(二)</p>\n<p>　　缘于迷妄　流转生死　<a href=\"/remen/wensixiu.html\" class=\"keylink\" target=\"_blank\">闻思修</a>三　如实照耀</p>\n<p>　　一切色相都不可得，都是梦幻泡影，而众生却偏偏迷于声色之中，把它当成真的，生出种种妄情。妄情的根源就在于执著这个色身为自己，所以见到好的就有我要、我爱。爱就是妄情，爱生水往下流。要生西方极乐世界的人不能有爱情，有爱情就不能升天，所以爱最坏，是流转生死的根本。我们要出离六道轮回，就要听佛法，听过之后还应通过大脑来思惟：佛法讲的是不是真理？我从前所做所想是不是有错误？应不应该改正？想过之后就该实际修行了。如果只是听一下，大脑没有思惟，就等于没有听到。听也听了，想也想了，但不实际修行也等于没有听到一样。所以闻、思、修三样缺一不可。‘如实照耀’就是按照我们所听到，所理解的实实在在地去做。照耀者就是指观照。我们用心观照，光明就会现前。</p>\n<p>　　传承上师　导引在前　胜母空行　护持于后</p>\n<p>　　传承上师就是给我们传法的上师。他会帮助我们。导引我们如何去做。‘胜母’者能生万法。我们前面讲过，佛父表示佛性的主体，能生出种种的妙用的就是佛母。母者，能生的意思。小孩都是由母亲所生。所以说一切妙用都是由母体所生，而母体又是主体所具有的，这就是双身法。对此我们千万不可起淫欲心。这段偈文就是说有传承上师在前面导引，胜母和空行(一切天龙八部都包括在内)在后面保护我们。</p>\n<p>　　祈脱中有　怖畏险峡　送我往登　正觉佛土</p>\n<p>　　我们祈祷脱离中有的种种痛苦和恐怖的恶境，护送我们到佛菩萨的净土去。正觉就是成佛。</p>\n<p>　　(三)</p>\n<p>　　嗔恚炽盛　流转生死　大圆镜智　光明照耀</p>\n<p>　　嗔是发火，恚是发脾气。‘嗔恚炽盛’就是发怒、暴跳如雷，像猛火一样燃烧。这就是流转生死的原因之一。假如我们一点都不发火，那该多好。可就是做不到啊！人往往不由自主的发火，能不发火是很难做到的。我们修法的人就是要损之又损，把这个恶习消掉。当然一天、两天做不到，一天一天的做下去就能做到了。我们转第八识为大圆镜智，就能朗照大千，就转识成佛了。</p>\n<p>　　金刚萨埵 导引在前　‘玛嘛几’母　护持于后</p>\n<p>　　在密宗里有东南西北中五方五佛。金刚萨埵是东方的一尊佛。东方有升起之意，金刚表示不坏也。我们读过《金刚经》就知道，金刚能摧毁一切，而一切不能摧毁它。萨埵者是指觉有情，就是使一切有情都能觉悟。金刚萨埵和我们内地说的普贤菩萨同体异名。因为普贤菩萨为诸佛的长子。他在接受大日如来(密宗的普贤如来)摸顶授记时，大日如来给他手中一个金刚杵。所以叫金刚萨埵，也叫金刚手。金刚萨埵在密宗的地位很高，是密宗的第二尊佛。第一尊就是大日如来。这段偈文就是说金刚萨埵在前面引导我们，护持在后面的就是‘玛嘛几’母。‘玛嘛几’有的地方写成‘盲盲几’，还有的地方写成‘嫫嫫几’，虽然翻译的不同，但意思是一样的。‘玛’者，母义。‘嘛几’者，能生义。‘玛嘛几’母就是能生诸种妙行的母亲。她在后面保护我们。为什么这样呢？这是表法的，还是指佛父佛母双身。佛父在前引导，佛母在后护送。</p>\n<p>　　祈脱中有　怖畏险峡　送我往登　正觉佛土</p>\n<p>　　意思同(二)后四句。</p>\n<p>　　(四)</p>\n<p>　　我慢炽盛　流转生死　平等性智　光明照耀</p>\n<p>　　贪、嗔、痴、慢、疑就是五钝使，很难消除。我看大众一百个人就有一百个嗔。每个人都是这样想：只有我最好，我最高，你们都不行。贡高我慢！脾气很大，执著的很厉害，这就叫我慢炽盛。就是因为有我慢，不谦虚，心中不空净，光明就显现不出来了，生死轮回就无有了期。佛就没有我慢，他看一切众生都是佛。所以要是我们看任何众生都平等，就没有我慢了。但是我们人看人还不平等呢，更不要说看其他众生了。都是我高高在上，别人都不及我。其他种类的众生，像鸡呀、猫呀就更不相干了。所以这就是我慢。要转第七识为平等性智，把我执除掉，看一切众生都平等平等又平等，就能放大光明朗照大千了。</p>\n<p>　　宝生如来　导引在前　‘佛眼’佛母　护持于后</p>\n<p>　　宝生如来是南方的佛。因为我们的本性就是摩尼宝珠，能生众宝。修成就了，什么宝贝都有，就是宝生如来。宝生佛在前面导引，佛眼佛母护持于后。这个佛母的名字叫佛眼，《金刚经》中就讲有佛眼、天眼、法眼、肉眼、慧眼。佛眼佛母就是指无所不见，无所不包。</p>\n<p>　　祈脱中有　怖畏险峡　送我往登　正觉佛土</p>\n<p>　　意思同(二)后四句。</p>\n<p>　　(五)</p>\n<p>　　贪欲炽盛　流转生死　妙观察智　光明照耀</p>\n<p>　　我们人就是迷痴，贪得无厌，欲壑难填。有一千想一万，有一万想十万、百万、千万、万万。没有满足的时候。越多越好。可是贪的再多你也带不走！空空而来，空空而去。为什么说在天上享受之后还要下地狱？因为钞票太多，太享受了就是犯罪！我看还是多做善事好，可人们都不肯做。所以说贪欲炽盛，流转生死。这样就出不了三界。我们要转第六识(即我们的意识)为妙观察智。在我们的八识当中第六意识势力最强，特别容易著相，因为它无时无刻不跟著前五识跑。假如不是第六意识作怪，前五识都很好。比如我们的眼睛是眼识，它就像照相机照相，从不分别这个相是什么东西？也不分别这个相是好还是坏？更不会说这个相要不要？它只是将现量交给第六识，就是将信息传给第六识，让第六识来做主。第六识就时刻在分别：这是什么？这是好还是坏？这个要不要？然后它把信息再送到第七识，第七识又把信息传到第八识藏起来。就这样因循贮物。第八识种子越藏越多，永远不会饱满(就像我们的电脑，小小的一个软盘上不知道有多少信息藏在里面)。当一遇到有缘的事情，就反映出来了。所以第六意识势力很强。我们修行就是要从第六识下手。就是时时刻刻观照第六识，让它不要动。境界现前不理睬它，都是假的还执著什么？！随缘度日就是了。这样做就可以‘六、七因中转，八、五果上圆’。第六识、第七识在因地上转换了，第八识和前五识才能圆满。因此我们不要追求享受，享受就是造业。我们的心应时时空净，以慈悲为怀，救度众生才是最要紧的。要时时刻刻观照做功夫，这就是观心法门，就是禅法，就是禅宗。假如我们时时刻刻不忘观照，不用三年到五年就能成道。但人就是时时刻刻忘记，一遇到境界现前就忘记了，就跟著境界跑了。所以我们用功难就难在不忘记。假如能于行、住、坐、卧四维当中时时不忘观照，没有一个不成佛的。另一方面就是用功用死了也不行。我们做功夫还要活泼泼的。所以六祖大师说：‘对境心数起’‘不断百思想’，就是这个意思。我们做功夫应‘内不随妄念迁流，外不为事境所转，’即：对任何事情，不留在心里面盘算个不停，对任何境界不住著，都是过而不留。这样做功夫我们必定能成就。所以用功第一难就难在不忘记观照，第二难就难在不能死守，死守就是死水不藏龙，要活泼泼的才行。假如我们真正证成妙观察智，不住相了，就能大放光明而无所不照。</p>\n<p>　　无量光佛　导引在前　白衣佛母　护持于后</p>\n<p>　　无量光佛就是阿弥陀佛，是西方的一尊佛。阿弥陀佛翻译出来就是无量光、无量寿。就是阿弥陀佛在前面导引，白衣佛母在后面护持。白衣佛母就是观世音菩萨。我们都说白衣观世音，是因为清净无染叫白衣。</p>\n<p>　　祈脱中有　怖畏险峡　送我往登　正觉佛土</p>\n<p>　　意思同(二)后四句。</p>\n<p>　　(六)</p>\n<p>　　嫉妒炽盛　流转生死　成所作智　光明照耀</p>\n<p>　　嫉妒是我们最坏的习气。人的嫉妒心都很重。别人比我好一点点，我就要嫉妒。所以说人最容易得‘红眼病’，就是嫉妒的眼发红。你比我好一点我就要造谣言中伤你，把你拉下来，这样做很坏！所以嫉妒就像燃烧的大火一样厉害。我们流转生死都是由于贪、嗔、痴、慢、疑造成的。把前五识(眼、耳、鼻、舌、身)转成成所作智。到时无需分别，要看什么东西，什么东西就会现前；要听什么声音，什么声音就可以听到。这样就是光明照耀。</p>\n<p>　　不空如来　导引在前　多罗佛母　护持于后</p>\n<p>　　不空如来就是北方的如来。真空是空而不空，有而不有，不是断灭空。所以我们说的真空是空空，就是把这个空也要空掉。如果你住在空上就变成断灭空了。空也要空掉就叫不空如来。不空如来导引有前，多罗佛母护持于后。多罗者是指无所不有，没有一点点缺陷叫多罗。</p>\n<p>　　祈脱中有　怖畏险峡　送我往登　正觉佛土</p>\n<p>　　意思同(二)后四句。</p>\n<p>　　(七)</p>\n<p>　　愚痴炽盛　流转生死　法界性智　光明照耀</p>\n<p>　　人都有贪、嗔、痴。人之所以有贪、嗔还是因为痴的缘故。我们假如不愚痴就不会去贪了。知道都是空的假的，还贪什么呢？！就是因为我们不明白一切相都是空的假的，以为是真有就贪得无厌。所以贪、嗔、痴中痴是根本！假如真是愚痴炽盛的人，将来就会流转生死而堕入畜牲道。畜牲就是很愚痴。所以痴是流转生死的根本，法界体性智就是指我们的本性光明，它是本来具有的。去掉贪、嗔、痴本性光明就会显现。</p>\n<p>　　毗卢遮那　导引在前　法自在母　护持于后</p>\n<p>　　毗卢遮那就是法身佛。就是大日如来，也就是普贤如来。是中央一方的佛，他在前引导。法自在是所有法样样都自在，根本连法也没有。法本无法，都空掉了，所以就无所不自在。法自在母就是指一切法根本没有。所以释迦牟尼佛传法偈曰：‘法本法无法，无法法亦法，今付无法时，法法何曾法’。哪里有什么法？！只要有个法在，还是法执！法性空了，法执也没有了，都不可得，就叫法自在母，她在后面护持。</p>\n<p>　　祈脱中有　怖畏险峡　送我往登　正觉佛土</p>\n<p>　　意思同(二)后四句。</p>\n<p>　　(八)</p>\n<p>　　五毒炽盛　流转生死　四智和合　光明照耀</p>\n<p>　　五毒就是我们前面说的贪、嗔、痴、慢、疑。因为炽盛之故，所以流转生死。四智光明就是指大圆镜智、平等性智、成所作智、妙观察智。四种智慧的光明合到一起(不算法界体性智)，当然是光明朗照了。</p>\n<p>　　五部如来　导引在前　五部佛母　护持于后</p>\n<p>　　我们前面讲了东、南、西、北、中五部佛，东方是金刚萨埵，南方是宝生如来，西方是阿弥陀佛，北方是不空如来，中央是毗卢遮那。就是五部如来在前面引导，五部佛母，就是‘玛麻几’母，佛眼佛母，白衣佛母，多罗佛母和法自在母在后面护持。</p>\n<p>　　祈脱中有　怖畏险峡　送我往登　正觉佛土</p>\n<p>　　意思同‘二’后四句。</p>\n<p>　　(九)</p>\n<p>　　迷境炽盛　流转生死　解除恐怖　光明照耀</p>\n<p>　　迷境炽盛，是指生前的迷境和中有的迷境。我们生前著相，迷相就是迷境。死后的中阴身也迷在中有境界上，也是迷境。因为我们迷境，所以就造业受报流转生死。我们要解除中阴境界的恐怖相就要以光明来照耀，使我们能得到解脱。</p>\n<p>　　诸忿怒尊　导引在前　诸忿怒母　护持于后</p>\n<p>　　‘怒’就是忿怒身，也是明王身，非常害怕。就是忿怒尊在前面引导，诸忿怒母(有佛父就有佛母)也现的恐怖相在后面护送。</p>\n<p>　　祈脱中有　怖畏险峡　送我往登　正觉佛土</p>\n<p>　　意思同(二)后四句。</p>\n<p>　　(十)</p>\n<p>　　习气炽盛　流转生死　俱生智慧　光明照耀</p>\n<p>　　习气炽盛就是说，我们每个世俗人执著的习气都很厉害。总以为这样就好，不这样就不行。比如四川人、湖南人、贵州人都喜欢吃辣的。他慢慢就习惯于吃辣的，没有辣的，饭就吃不下去。习气就是这样慢慢养成功的一个习惯。这个习惯养成以后就很难改。比如吸烟。很多人改了又吸，吸了又改，三番五次都改不掉。最后还是要吸。所以俗话说：‘江山易改，秉性难移’。就是指我们的习气很难改。我们学佛的人就是要改这些习气，常常要拗强，违背它，和它做斗争。它要这样你非不这样，看它过不过得去。这样习气才能改掉，智慧光明才能显现。所以初初开悟的人，习气只是稍为摇动了一下，还是很深很重。要把习气改光必须在境界中经过多次磨炼，不是一天、两天就能改过来。所以圭峰禅师说：‘常需觉察’。这是古来大德用功所得的结论。‘常需觉察’就是长时期时时刻刻地观照考察自己，还犯不犯这个习气。损之又损，才能相应。人的习气就是太重了。比如人们要吃鸡、要吃虾，天天杀鸡不知造了多少业；一碗虾不晓得有多少生命。还有的人说：‘我不吃大荤，不吃猪肉，吃小荤，吃螺丝’。唉！你吃一碗螺丝不知有多少生命呀！所以习气至深一定要改。</p>\n<p>　　俱生智慧就是指我们本性光明是生来就有的，无始以来就有的。但俱生无明也随之而来。俱生智慧常常为俱生无明所遮盖。有人问：‘我现在用功修行成就了，将来会不会再有无明呢？’他不知道无明是俱生无明，就是无始以来随著佛性就有的。就像牛的两支角一样。小牛生出来就有两支角，不是一个一个生出来的。是这个俱生无明遮盖了我们的智慧，叫我们著相受报。假如我们把无明打破除尽了，就不会再迷误，就不会再造业受报了。就像出矿之金，金子没提炼之前是和砂石混在一起，经过提炼变成纯金，它就不会再和砂石夹在一块了。所以打破无明我们就不会再迷了。</p>\n<p>　　勇士持明　导引在前　空行会众　护持于后</p>\n<p>　　勇士是比佛菩萨低一等的忿怒身。但都是保护佛法的善众。比如夜叉很怕人，但他护法也很好。现在人做香功：‘香、香、香……’香从何来呀？他是天龙八部之中的一众，乾闼婆，焚香众。天龙八部都是保护我们的，就很好。他们导引在前，空行会众护持于后。</p>\n<p>　　祈脱中有　怖畏险峡　送我往登　正觉佛土</p>\n<p>　　意思同(二)后四句。</p>\n<p>　　(十一)</p>\n<p>　　愿诸空大　勿为我敌　愿我亲见　蓝光佛土</p>\n<p>　　愿诸水大　勿为我敌　愿我亲见　白光佛土</p>\n<p>　　愿诸地大　勿为我敌　愿我亲见　黄光佛土</p>\n<p>　　愿诸火大　勿为我敌　愿我亲见　红光佛土</p>\n<p>　　愿诸风大　勿为我敌　愿我亲见　绿光佛土</p>\n<p>　　佛性有地、水、火、风、空、根、识这七大种性。现在这段偈文讲的是五种：地、水、火、风、空。根、识就不讲了(根就是我们的五根，识就是我们的分别心)。地、水、火、风、空这五大种性是最重要的。所有的山河大地、草木<a href=\"/remen/conglin.html\" class=\"keylink\" target=\"_blank\">丛林</a>都是由地、水、火、风、空形成的。人们只是不知道，不相信山河大地怎么也是我呢？这个身体才是我，山河大地跟我不相干。他不知道山河大地也是地、水、火、风、空形成的。地、水、火、风、空就是佛性当中的五大种性，所谓种性者就好比种子，能够长出东西来。比如：稻种种下去，稻子就能长出来，结出很多大米。同样地、水、火、风、空的种性能生出很多很多东西。地球、日月、星辰都是由它生出来的。你们看地球就很明显：地壳就是地大；海洋河流地下水就是水大；地下有火会产生火山爆发就是火大；地球自转公转，属风大；地球里面是空的(不空它怎么转呢？！)属空大。所以任何事物都是一样，都是我们自己。就是因为无明，取了小部分的地、水、火、风为自己，认这个色身为我。其实这个色身是父精母血结合成的一个脓胞，在子宫里面长了个人体，人们就认这个身体为我。这都是因为妄想执著的缘故！佛性是布满虚空，周遍法界，无所不在。我们只要妄念不动，身心世界都化空，就什么都没有。那时我们就明白了，这个地球原来就是我自己！所以说：‘会万物归己者，其为圣人乎？！’圣人他明白这个道理，一切万物都是他自己。就像庞居士的妻子所说：‘易易易，百草头上西来意’。百草不光是指草，而是形容一切事物。就是一切事事物物哪个不是我？！都是我自己。我们要明白这个道理才行。</p>\n<p>　　经中说：‘愿诸空大，勿为我敌’。我们看见空洞不要害怕。有人告诉我：‘打坐的时候，忽然出现一个大空洞。我就要跌下去了。吓死了！’那就是空大现前，不要害怕。现在打坐用功还害怕，到了中阴境界就更害怕了。</p>\n<p>　　‘愿我亲见，蓝光佛土’。我们知道天睛的时候，天空就变蓝了。万里无云，蔚蓝色的晴空就是蓝光。为什么这样说呢？因为我们的本性本身就具有七彩光明，空大是属于蓝光佛土。</p>\n<p>　　‘愿诸水大，勿为我敌，愿我亲见，白光佛土’。水大是属于白光，也是我们本性所具有的，所以我们看见发大水也不要害怕。</p>\n<p>　　‘愿诸地大，勿为我敌，愿我亲见，黄光佛土’。地大为什么是黄光呢？因为佛的国土是黄金铺地，所以称黄光佛土。这些都是我们本性光明所具有的。因此当我们看到大地荒无人烟，没有边际时也不要害怕。</p>\n<p>　　‘愿诸火大，勿为我敌，愿我亲见，红光佛土’。大火是红光，我们看见大火也不要害怕，都是我们自性所显现的。</p>\n<p>　　‘愿诸风大，勿为我敌，愿我亲见，绿光佛土’。风大就是绿光现前，看见大风起了也不要害怕，这也是我们自性所显现的。</p>\n<p>　　愿诸虹光　勿为我敌　愿我亲见　一切佛土</p>\n<p>　　地、水、火、风、空过了之后就有虹光发现。虹光就是以上各色佛光合为一体而放射的大光明，就如同太阳的七彩光合在一起放射一样。愿此虹光，不要以我为敌，愿我亲见一切佛土。</p>\n<p>　　惟愿诸‘辉’　知为自辉　愿中有相　自己证知</p>\n<p>　　愿中有境 三身亲证</p>\n<p>　　在中阴时期还有爆炸声、雷轰声，大炮仗的声音。要知道这些声音都是自性显发出来的，不是外来的。所以不要害怕！我们的自性就具有这个本能，就具有这些声音。我们看见的红光、蓝光、白光、绿光、黄光等一切光明，也都是我们自己放的光，也不是外来的。辉是放射的光彩。闪闪烁烁射出来的光就叫‘辉’。中有时期的一切境想都是我们自己的本性所显现的，不是别的东西。愿中有的一切境相和法、报、化三身，我们都能亲自证到。</p>\n<p>　　中有六纲(此文在施法前念诵)</p>\n<p>　　(一)</p>\n<p>　　嗟！</p>\n<p>　　我今生处中有起现时 生世无暇懈怠当永断</p>\n<p>　　闻思修三不乱证实义 心境朗然当亲证三身</p>\n<p>　　于此一度获得暇满身 勿于迷离道中而抛弃</p>\n<p>　　‘纲’是指事物最主要的部分。‘中有六纲’就是告诉我们在生处中有、梦境中有、静虑中有、死位中有、法性中有及轮回中有这六处中有(在本书98页已作详细说明)显现时，我们主要应该注意哪些方面，应该如何去做。此‘中有六纲’要在施法前念诵三到七遍。</p>\n<p>　　‘嗟’是文言叹词，并无实义。生处中有是指我们住胎的这段时间，一般需要九个半月。‘无暇’就是指没有时间。因为我们活的时候，执著外境，追逐声、色、货、利，忙碌一生，借口‘没有时间’修习佛法。由于懈怠之故，前一世未能解脱，现在又重新投胎，落于生处中有，生死轮回又从头开始。因此，在生处中有起现时(即在我们住胎的时候)，我们应该发心：要永断‘无暇懈怠’，应好好修习佛法，不再追逐外境。‘闻思修三不乱’就是说我们首先应该听一听佛的教理，然后再经过大脑思惟，以前我们的所做所为是否有错？想过之后就应该切切实实按照佛的教导去做。所以，在修行的过程中，‘闻’、‘思’、‘修’这三个条件，缺一不可。我们果真能如此，就能够亲证佛性，这就是‘证实义’。正如《金刚经》所说：‘凡所有相，皆是虚妄’。唯有佛性是真实、永恒的，所以称之为‘实义’。当我们亲证佛性之时，大智慧云涌，心境豁然开朗，这就是‘心境朗然’。我们再进一步用功修行，就能够证得法、报、化三身，这就是‘亲证三身’。这段偈文的最后两句‘于此一度获得暇满身，勿于迷离道中而抛弃’就是说：如果我们能真正发心修习佛法，在我们这一生(‘于此一度’就指投胎出生后这一生)就能够圆满自在(‘暇’在此是闲暇、自在之意)，不再糊里糊涂的在六道轮回中被抛来抛去，自己就能作主了。‘迷离’是指糊里糊涂的不清楚。我们人就是这样浑浑噩噩、糊里糊涂的在六道中头出头没，所以‘迷离道’在这里就是指六道轮回。</p>\n<p>　　(二)</p>\n<p>　　嗟！</p>\n<p>　　我今梦境中有起现时 愚痴尸睡放逸当永断</p>\n<p>　　一心不乱定住实相中 保任梦境修幻化明光</p>\n<p>　　勿如傍生之状而长眠 爱惜睡眠现量合修持</p>\n<p>　　梦境中有就是指我们睡著了做梦的时候。这个时候人就糊涂了(即‘愚痴’)，忘记了用功(即‘放逸’)，身体像死尸一样(即‘尸睡’)。这样我们怎么能了生死呢？！所以我们要永断‘愚痴尸睡放逸’，要‘一心不乱定住实相中’。‘一心不乱’就是‘定’。‘住实相中’就是一直了了分明而不糊涂，不为境界所转。这样，梦中的幻相就转化为大光明，这就是‘保任梦境修幻化明光’。‘保任’是指修行的两个阶段。我们用功修行，打开本来亲证佛性后，就要时时观照保护，不为境界所转，这就是‘保’；等到保护圆熟了，就任运自如，不用保了，这就是‘任’。只要我们经过不断的精进用功，就能做到既使是睡著了，也仍然是了了分明，不为梦境所惑。‘勿如旁生之状而长眠’中的‘傍生’就是指畜牲。有很多动物，像熊、蛇等，冬眠时一睡就是几个月。我们人要有智慧，不能像动物一样愚痴，昏睡。我们知道：财、色、名、食、睡是五盖，是遮蔽我们本性光明的坏东西，所以要勤除五盖。但除‘睡盖’并不是不睡觉，只是我们大多数人睡著就糊涂了，在梦中生出种种分别，被梦境所转，这就是比量境。我们现在修行就是要做到，既使睡著时，仍然是了了分明，不为梦境所转，即现量境。所以说我们睡觉也是在做功夫。这就是‘爱惜睡眠现量合修持’。</p>\n<p>　　(三)</p>\n<p>　　嗟！</p>\n<p>　　我今静虑中有起现时 散乱昏沉种种当永断</p>\n<p>　　不乱无执定住离边中 ‘生’‘圆’二次愿能得宣示</p>\n<p>　　所作已断一心修行时 不为烦恼迷惑所随转。</p>\n<p>　　静虑中有就是在我们打坐入定时，识神所见的一切境界。这还是由于我们六根不清净，昏沉散乱的缘故。所以我们要永断‘散乱昏沉’。这样就是‘不乱’，就是‘定’。定就是指对境不生心，不为境界所转，而不是坐在那里很长时间不动。所以说大定无出入。如果我们执著追求入定，反而不能得定了。因此我们要‘无执定住’。‘边中’就是说，我们凡夫不是执著「有’，就是执著「无’，总是向两边倒。有两边就有‘中’，所以叫‘边中’。如果我们在日常动用当中能心空无住，赤裸裸、净洒洒，一丝不挂，这样就是‘离边中’。‘“生”“圆”二次愿能得宣示’中的‘生’是指生起次第，‘圆’是指圆满次第。生起次第和圆满次第是密法中修持的二个步骤。在修法前我们都会发愿，希望修法能够有所成就。如果我们果真能‘不乱’、‘无执定住’、‘离边中’，那么修法前所发的愿就能得到证实(‘宣示’就是指实现)；就能够时时刻刻了了分明，不为境界所转(即‘一心修行时’)；就能够做到作而不作(即‘所作已断’)，这也就是佛所证得的真空妙有的境界。这样就不会再有烦恼迷惑，就能潇洒自在，任运自如了(即‘不为烦恼迷惑所转’)。</p>\n<p>　　(四)</p>\n<p>　　嗟！</p>\n<p>　　我今死位中有起现时 一切贪求恋著当永断</p>\n<p>　　不乱契入显明教授义 游心自证无生太虚景</p>\n<p>　　即将舍离质碍血肉躯 无常死亡临头当了知</p>\n<p>　　死位中有就是指我们死后三天半或四天之内。在这段时期，我们仍然贪恋著自己的身体、妻财子禄、名誉地位等。一旦知道自己死了，心里就会很乱。所以这个时候，我们应当永断‘贪求恋著’之情。只有这样，在死位中有时期，才能不慌乱(即‘不乱’)，才能接受(即‘契入’，契是契合之意)别人为我们行此中有解脱密法。本密法教导我们：在死位中有这段时期，有两次光明显现，光明就是我们自己，这就是‘显明教授义’(‘显明’就是指光明显现的时候，‘教授义’就是教导、指示)。在这个时候，只要我们一醒悟即可证成法身佛，这就是‘游心自证无生太虚景’。‘无生’即不生不灭的法性身。‘太虚’就是指虽然有但实质是虚(即空)，‘太虚景’就是指真空妙有的境界，也就是证得法身时的境界。‘游心’就是指散乱的心，即妄心。证成法身佛就是舍妄归真。这段偈文的最后两句就是说：在我们的识神即将离开身体(即‘质碍血肉躯’)的时候，我们应该明白(‘了知’就是了解、知道)诸法无常，有生必有死，死亡是必然的道理。这样，就要求我们在日常生活中磨炼自己，断除自己的‘贪求恋著’之情，到死位中有时期，一切放下，与光明合上去就能证成法身佛了。</p>\n<p>　　(五)</p>\n<p>　　嗟！</p>\n<p>　　我今法性中有起现时 恐惧怖畏境相当永断</p>\n<p>　　一切显现认取为证智 中有境相即此当了知</p>\n<p>　　阻大义利千钓一发时 自识变相‘寂’‘怒’又何惧</p>\n<p>　　法性中有起现时，就是指死位中有之后，从第五天开始到第十八天这段时间，共计十四天。这时，亡者慢慢清醒过来，识神从身体里出来，见到强烈的‘光’‘声’‘辉’和佛菩萨寂、怒部的双身像，便产生恐惧和怖畏。所以我们应该明白‘一切显现认取为证智’。就是说，一切现相都来源于我们的自内证智(见本书120页)，都是我们的佛性所显现的，都是自识的变化。所以，在这时，我们要永断‘恐惧怖畏境相’。如果我们不惊不怖，在法性中有时期光明显现时，与光明合上去就可证成报身佛。如果我们恐惧怖畏，甚至吓得逃避佛光，那就阻碍我们证成报身佛。所以这个时候就是‘阻大义利千钓一发时’。‘千钓一发’就是非常关键的时刻，‘大义利’就是指成报身佛。</p>\n<p>　　(六)</p>\n<p>　　嗟！</p>\n<p>　　我今轮回中有起现时 意念纯一至心当保持</p>\n<p>　　善妙缘会尽力求延续 永断胎门回头须忆念</p>\n<p>　　努力净相唯一需要时 嫉妒永断修上师双身</p>\n<p>　　轮回中有就是指法性中有之后至投胎前的这段时间。这段时期，亡者的心念变化非常快，业力所幻现的境界纷纷现前。所以这时应注意保持‘意念纯一至心’。‘至心’就是一心一意，‘意念纯一’就是要注意自己的心念不随幻相变化而变。‘善妙缘’就是以前造的善因，比如生前修法、做好事等等，就是造善因。这些善因就会尽力帮助我们保持‘意念纯一’(‘求延续’就是保持)。‘回头须忆念’就是说我们要回忆生前善知识的教导和自己所修的法，要下决心‘永断胎门’(‘永断胎门’就是不再投胎)。在轮回中有时期要努力做到心里空净(‘净相’就是空净)，不要被幻相所迷惑，当我们看见男女交会的境界时，要断除嫉妒心，把他们观想成佛父佛母或上师双尊，这样就不会起淫欲心而投胎了。这就是‘嫉妒永断修上师双身’。</p>\n<p>　　死时无有决定极迅速　徒负此生所作无义事</p>\n<p>　　大利丧失意志不坚定　今兹既已空手而返回</p>\n<p>　　所需定解即胜本尊法　当下若不修胜本尊法</p>\n<p>　　或大成就亲口所宣说　上师教授亦不安心住</p>\n<p>　　自欺自身实所不应为　凡此六纲了知极为要</p>\n<p>　　人活的时候没有好好修法，时间转瞬即逝。死亡很快来临，这就是‘死时无有决定极迅速’。‘无有决定’就是没有选择。这时才会发现自己活的时候一直在追求短暂、虚妄的假相，白白荒费了宝贵的一生。这就是‘徒负此生所作无义事’。‘徒负’就是荒费，‘无义事’就是没有意义的事情。为什么会这样呢？都是因为我们没有智慧。我们人就是舍弃永恒而追求短暂，舍弃真实而追求虚妄，舍弃大利而追求小利，这就是‘大利丧失’；被身外的色、香、声、味、触、法牵著转来转去，这就是‘意志不坚定’；一生不停的求东求西，最后却不得不落得空手而归，这就是‘空手而返回’。所以死亡是人生最痛苦的事情。虽然现在已经如此(即‘今兹既已空手而返回’，‘今兹’就是现在。)，但我们还有可以解脱的唯一办法，就是这本《中有教授听闻解脱密法》，这就是‘所需定解即胜本尊法’。‘定解’就是一定能够解脱，‘胜本尊法’就是指本法(‘胜’是指殊胜之意)。如果现在不修此法(即‘当下若不修胜本尊法’，‘当下’就是现在)，或者对大成就者亲口所说的法和上师所传授的法不能安心的修持(‘不安心住’就是不能安心的实修)，这样做就是自欺欺人(即‘自欺自身’)，实在是不应该(即‘实所不应为’)。以上所说的‘中有六纲’极为重要，大家一定要记清楚。</p>\n<p>　　中有救怖愿偈(此文在施法前念诵)</p>\n<p>　　(一)</p>\n<p>　　我今报尽迁谢时 生前眷属无能助</p>\n<p>　　独自徜徉中有道 愿‘寂’‘怒’尊大悲力</p>\n<p>　　消除无明之幽暗</p>\n<p>　　‘报’是指业报身，就是指身体。‘迁’是指走，‘谢’是指凋谢，‘迁谢’在这里就是指死亡。‘徜徉’是指闲游、游徜。这一段偈文的意思是说：如今我的肉身实体已经坏了(即死了)，生前的亲朋眷属都无能为助。我只有独自在中有险峡道中漂来漂去。愿‘寂静’部、‘愤怒’部的佛菩萨以大悲力摄受我，把我从幽暗的中有道中解脱出来，消除‘无明’，直证明光。</p>\n<p>　　(二)</p>\n<p>　　别离爱伴独漂流　自识幻相将起现</p>\n<p>　　诸佛悲力垂救拔　不起怖畏中有难</p>\n<p>　　<a href=\"/remen/renshengbaku.html\" class=\"keylink\" target=\"_blank\">人生八苦</a>之一就是‘爱别离苦’。当亡者到了中阴境界，离开了他所爱恋的亲朋好友，孤苦伶仃，到处漂泊。这时亡者的识神幻现出各种各样的恐怖境界，令他非常痛苦。愿诸佛菩萨悲悯、救度亡者，使他面对各种中有境界能不惊不怖，能把他从中有的苦难之中超拔出来。‘垂’就是降临的意思。‘垂救拔’就是降临来救度超拔亡者。</p>\n<p>　　(三)</p>\n<p>　　五智光明此时现 不怖不畏认本面</p>\n<p>　　‘寂’‘怒’尊容已近前 确认中有当勿怖</p>\n<p>　　五智光明就是我们前面讲的法界体性智、成所作智，妙观察智，平等性智和大圆镜智。在法性中有时期，这五种智慧光明将伴随著佛菩萨的‘寂’‘怒’相现前。这时，我们要清醒，要明白这是法性中有时期的境界现前，不能害怕。要敢于认取，敢于承当，这些光明正是自己的本性光明，正是自己的本来面目。这样，当下即可证成报身佛。如果不敢承当，认为这是佛菩萨放的光来接引你，也可以升到佛的净土得真实受用。</p>\n<p>　　(四)</p>\n<p>　　若为业力所制时　愿大悲尊除苦厄</p>\n<p>　　法性本声雷震时　愿转六字大明声</p>\n<p>　　如果我们生前不好好修习佛法，没有定力，中有时期就会被业力幻现的各种境界所困扰，不得解脱。这就是‘为业力所制’。在这时，愿大慈大悲的佛菩萨能帮助亡者，把他们从痛苦的灾难中解脱出来(‘厄’就是灾难)。在这些境界中会出现雷震声，与我们在世时所听到的雷声不同。此声非常宏大，犹如千雷齐震。所以很多人到那时就会吓得到处乱跑。要知道这些声音都是由我们本性(法身)所发出的，所以本偈称之为‘法性本声雷震时’。因此，我们现在就应该好好用功修法，增强定力。到中有时期我们就可以把千雷之声转化为‘六字大明咒’的声音，这样就可以得到解脱了。这就是‘愿转六字大明声’之意。</p>\n<p>　　(五)</p>\n<p>　　若无救助业逐时　愿本尊天除其苦</p>\n<p>　　业力追逐失怙时　愿证净光三摩地</p>\n<p>　　中有时期，只有业力幻现的各种恐怖境界追逐我们，亲朋好友无能为助。这正是‘无救助业逐时’。再加上我们生前不好好用功修法，没有定力，到时就会惊慌失措，感到孤苦伶仃，无依无靠，非常痛苦。这就是‘业力追逐失怙时’。‘怙’就是依靠，‘失怙’就是没有依靠。所以，这时愿‘本尊天’(即本尊，)能帮助亡者，把他们从苦难中解脱出来，进而证得‘净光三摩地’。‘净光’就是本性之光明，‘三摩地’就是正定。</p>\n<p>　　(六)</p>\n<p>　　轮回中有化生时　授记愿不为魔转</p>\n<p>　　任所思力若至时　愿不为恶业迷怖</p>\n<p>　　‘轮回中有化生时’就是指轮回中有起现时。这个时候，业力幻现的各种境界非常多。尤其是自己生前所造的恶业，幻现出各种恐怖境界，把我们往坏的地方赶。所以我们希望佛菩萨能给我们‘授记’，使我们不为这些魔境所转。‘授记’本意是预先证言。佛菩萨为我们授记，具有极大的加持力，使我们决定能得到解脱。‘任所思力’就是业力导至亡者的心念任意变化，心念变化又导致幻现出更多更恐怖的境界。当这些业力出现的时候，愿佛菩萨加持我们，使我们不被幻境迷惑，不被恶境吓住。</p>\n<p>　　(七)</p>\n<p>　　猛兽怒吼声发时　愿转六字妙法音</p>\n<p>　　黑风雨雪追逐时　愿证智光之天眼</p>\n<p>　　这里就讲到我们看到的各种境界。当我们听到豺狼虎豹等猛兽怒吼的声音时，愿佛菩萨加持我们，能把这些声音转化为‘六字大明咒’的声音。当我们被黑风雨雪追逐时，愿佛菩萨加持我们，使我们证得智慧之天眼，照破各种恐怖境界。‘天眼’可以不受欲界、色界的业力约束，可以照破黑暗，所以称为‘智光之天眼’。</p>\n<p>　　(八)</p>\n<p>　　若见同类中有时　愿勿嫉妒生上趣</p>\n<p>　　极大烦恼饥渴时　愿除饥渴寒热苦</p>\n<p>　　在中有时期，由于业力所感，当生天道的，天道境界即将现前，亡者就会见到天道中的同类(其它道也是如此)，这就是见到‘同类中有’。所以在中有时期，亡者会见到将要去的地方的景象，并对这些景象产生好感，甚至对这些地方的人的生活方式(如吃、穿、住、行等)产生羡慕或嫉妒的心理。这就是快要投胎的征兆。所以这时候愿佛菩萨加持亡者，勿生嫉妒之心，不入六道轮回。在中有时期，由于业力之故，亡者有时饥饿口渴，有时寒冷，有时炽热，于是生出极大的烦恼。这个时候愿佛菩萨加持亡者，能除去亡者饥渴寒热之苦。</p>\n<p>　　(九)</p>\n<p>　　若见当来父母会　即观大悲双身尊</p>\n<p>　　生得自在为利他　愿得相好光明身</p>\n<p>　　当中阴身看到男女同房的情形时，淫欲心动，加入进去就投胎了。所见的男女就成为将来的父母。这就是‘若见当来父母会’。所以在这个时候，我们千万不能动心。要把他们观想成佛父佛母双身，并向他们顶礼，这就是‘即观大悲双身尊’。‘大悲’就是指大慈大悲的佛菩萨。我们果真能如此，不为境界所转，就可以‘生得自在’。‘为利他’就是为大众造福，使更多的众生能离苦得乐，得大自在，这样我们就可以证得光明报身。因为光明报身是很美好的，所以叫‘相好光明身’。如果我们不能救度众生，为大众造福，就不能证得光明报身。</p>\n<p>　　(十)</p>\n<p>　　若我已得妙生身　愿所见闻速了解</p>\n<p>　　一切恶业不随逐　励力增长诸福德</p>\n<p>　　如果我们已经投胎，生到一个能听到佛法，并能修持佛法的地方，这就是‘妙生身’。这时愿佛菩萨能加持我们，使我们对所见所闻(即一切色相)的本体能够迅速证见。这个本体就是我们能知能觉的本性，即佛性、法身。‘了解’在这里就是证见。‘一切恶业不随逐’就是说：如果我们能证见本性，并能做到时时见性，这样就能从所造的恶业中解脱出来。所以说‘一切业障本来空’。‘逐’是追逐、跟逐，‘不能逐’就是不受它的困扰、束缚。‘励力’就是精进、努力。‘励力增长诸福德’就是说，我们在哪里投胎就要在哪里努力为大众造福，这样自己的福德才能不断的增长。</p>\n<p>　　(十一)</p>\n<p>　　愿随所生彼彼处　世世面见本尊天</p>\n<p>　　生已能言知大义　宿命不忘得总持</p>\n<p>　　‘彼彼’即‘比比’，就是到处、各处之意。这一段就是说；愿佛菩萨加持我们，使我们无论出生在哪里(即‘愿随所生彼彼处’)，每一世都能见到佛菩萨或本尊(即‘世世面见本尊天’)，都能知能讲(即‘能言知’)佛法(即‘大义’，因佛法是人生唯一正确的指南，因而是‘大义’)，都能不忘过去世所发的大愿(‘宿命’就是过去世)，都能得到佛法的精髓。我们只有得到佛法的精髓，才能圆通佛所讲的一切法，这就叫总一切法、持一切义，即‘总持’。</p>\n<p>　　(十二)</p>\n<p>　　种种上中下功德　闻思一见即能知</p>\n<p>　　随所生处皆吉祥　一切有情俱安乐</p>\n<p>　　‘上中下功德’就是大大小小的功德。对于本经的种种殊胜功德，我们只要听一听、想一想就会明白了，这就是‘闻思一见即能知’。只要我们真正明白理解了本经的经义，并能按本经的教导去做，将来不论生在何处(即‘随所生处’)都会获得吉祥与安乐。‘一切有情’就是指一切众生。</p>\n<p>　　(十三)</p>\n<p>　　如佛‘寂’‘怒’尊形相 眷属寿量及刹界</p>\n<p>　　如彼最胜美名称 如是我等决能成</p>\n<p>　　‘寿量’即指无量寿佛，‘眷属’即指佛菩萨的眷属，‘刹界’即指佛的国土。所以‘如佛“寂”“怒”尊形相，眷属寿量及刹界’均代表我们尊贵无比的佛菩萨。我们为佛菩萨冠以这些最殊胜、最美好的名称，以示我们的尊敬。‘如是我等决能成’就是说，因为我们有与诸佛一样的无漏智性，只要我们发心修法，努力用功，就一定能够圆证佛果。</p>\n<p>　　(十四)</p>\n<p>　　邬金大师莲华生　撰此中有救怖愿</p>\n<p>　　乃至轮回未空寂　此深妙法永长存</p>\n<p>　　莲华生大师出生的陀曩俱舍海，在以前属于邬金国土(即当时的北印度)，故称莲华生为邬金大师。在中有时期(即从死亡之日起至轮回中有这段时间)，由于我们心里不空净(即‘未空寂’)，因而幻现出各种恐怖境界，缠住我们，使我们在六道轮回之中头出头没，无有了期。莲华生大师撰写的上述‘中有救怖愿’，可使我们在中有时期，得到诸佛菩萨的加持；能把我们从中有时期的恐怖境界中解脱出来。‘救怖愿’就是愿诸佛菩萨把我们从中有时期的恐怖境界中解救出来。所以本密法非常珍贵。这部深妙的《中有教授听闻解脱密法》，将永远在世间广为流传。</p>\n<p>　　以上讲述的《启请诸佛菩萨加被偈》、《救脱中有怖畏险峡偈》、《中有六纲》、《中有救怖愿》这四段偈文，要在设供坛场之后，行法者根据时间长短念诵三至七遍。以后每天行法之前就不需要再念了。而《谛实力偈》则需在每天行法前念诵。</p>\n<p>　　下面，我们开始讲述度亡时的具体行法。为了使读者易于理解，我们将原经文的次序略作调整，但经文内容未有删改和遗漏。</p>\n<p>　　四、行法须知</p>\n<p>　　若逢亡者、曾请传承密法灌顶上师来前，最为殊胜，次则当求一同受三昧耶戒之同学法侣，或同一法统之真善知识。如皆难遇，次则当求一智慧之人，于此文字句义，了解明白、口齿伶俐声音清朗者，依照经本，如法读诵多次。彼垂死之人，一闻此法，定能忆念上师所指授意义，当下无间，即可认取本体光明而得解脱，决无疑义。</p>\n<p>　　当我们遇到快死或已死(死亡在53天内)的人，最好请受过密法灌顶，有传承的上师来行此法。如果没有，就请一位一同受过戒的道友或同一法脉的善知识也可以。如果这两类人都难遇到，也可以请一位意气相投，明白本法的意义，口齿伶俐，声音清楚，有智慧的人，依照本经，为亡者多次念诵。这样快死的人或亡者听到经文后，就一定能回忆起上师的教导，当下即可认取本体光明而得解脱。</p>\n<p>　　第一章 命终时变化状态</p>\n<p>　　第一节 死位中有指授</p>\n<p>　　甲、初期中有第一明光指授</p>\n<p>　　‘命终时’就是指人从死相现前开始至识神完全离体这一段时间。‘命终时变化状态’就是指人对整个死亡过程的感受。为了让大家进一步了解这个过程，我们首先介绍一下附注二、附注三。</p>\n<p>　　附注二：人之全身，共有九孔道。即两眼孔、两鼻孔、两耳孔、一口、一尿道、一谷道。九孔道之外，顶上正中处，尚有一孔，名为梵穴。修颇哇法者，所谓开顶插草者，即此孔穴也。凡人在垂死时，其神识从此穴出体，方为往生之正道。若从其他处孔道出体者，即落在轮回道中。如经中说：‘顶圣眼生天，人胸饿鬼腹，傍生膝盖离，地狱脚板出。’此谓人当死亡时，外气已断，若从上而下，冷至脚心，抚之犹有暖相者，即为生地狱道之相。因其恶业深重，其神识即从谷道卑下处而离体，故知堕落地狱。若从眼孔中出，则生天道。其中因果轮回上下升沉之理，固如是也。</p>\n<p>　　附注三：人身为四大和合所成。四大者，谓地、水、火、风。人到死时，四大解体，有一定先后次第。最初地融为水，此时感觉如山压之痛苦。次则水融为火，感觉寒湿如浸水中。次则寒湿消失，变成潮热，如在汤中。次则火融为风，感觉体被风吹，化为微尘。四大解体之时，犹如生龟剥壳，最难忍受。惟平时有修持之人，预知时至，诸佛授手来迎，威力加持，可以减免。</p>\n<p>　　人身是由四大和合而成。当人快死的时候，四大解体，非常痛苦(参见本书131页第一阶段行法)。四大解体，有一定的先后次序(见附注三，这段文字容易理解，我们就不做具体解释了。)：首先地大融为水大，其次，水大融为火大，火大融为风大，最后风大消失，融入‘空大’。这个时候，人向外呼出长息三次，只有出气没有入气，直至外气断绝。此时外气虽然断绝，但内息尚存。内息集中于人体的中脉。中脉又名都帝，位于人体中央，从会阴直通到头顶梵穴。在中脉左右两侧约一寸处又有两条脉叫左右二脉。左右二脉与中脉并行从人体下丹田处起，经二耳后，绕至头顶，再从头顶经眼睛降至左右二鼻孔。在下丹田处，有一月牙，朝上弯曲，二端分别连接左右二脉，中脉从中间穿过。这样通过月牙将三条脉连接起来。修颇哇法成功的人，就能见到这三条脉管和月牙。人在外气断绝的时候，识神尚在人体中脉，偶尔外出，但还不知自己已死，这就是我们通常说的识闷绝位。如果功夫修得好，识神直接沿人体中脉，从头顶梵穴冲出去，就可以升到佛土(即‘正道’)。如果从其它地方出去，就落于六道轮回之中。对于中脉不通的人，识神通常通过月牙溢入左右二脉，沿左右二脉升至头顶，再从头顶降至眼睛，从眼睛出去的人，可以升天道。如果继续下降，从胸部出去者可以生人道。如果再继续下降从腹部出去者就是饿鬼道。如果再继续下降，从膝盖出去者就是畜牲道，从脚底出去者就是地狱道。最后识神从身体的什么部位出去，什么部位就是温的，而其他部位都是冰冷的。所以，通过测量体温就可以知道，亡者将要投胎到什么地方。</p>\n<p>　　命终时的变化状态可分两个阶段：第一个阶段就是死相现前而外气未断时；第二个阶段就是亡者外气已断而内息未绝时(这就是我们通常说的死位中有时期，即识闷绝位，常人有三天半到四天的时间)。为了加深死者对中有时期的印象，心里早有准备，死位中有时期的救渡方法必须在死相现前时就开始实施。法性中有时期的救渡方法必须在死位中有时期就开始实施。所以‘第一节死位中有指授’的内容要在死相现前时就开始实施，即第一阶段的行法。</p>\n<p>　　第一阶段(即亡者死相现前而外气未断之时)行法的目的就是为了告诉亡者，在外气断的时候有死光发现。在这个时候，我们与光明合上去就可以证成法身佛了。关于‘死光明’的含义我们可以通过附注四，附注五来了解：</p>\n<p>　　附注四：初死时四大融入次第，已见前‘附注三’中。当风大消融后，次则融入‘空大’。在最后之一呼吸终了时，身中之血，皆收摄于中脉都帝。斯时有血三滴，依次悸动，向外呼出长息三次。第一次呼出距离一肘远，第二次距离二肘远，第三次距离四肘远，而外气始断尽。乃从顶上有入胎时父所赋予之白分明点，由顶上急遽下降，于是生起能知之各种觉境。此分内外两觉性：外所觉者，有如月光朗照之景象；内所觉者，则如烟雾迷离之状。此为初死时光明起现之相。在密法中术语，称为‘明’‘增’‘得’境，为初死时所必经历之过程。初历明境，又从脐下有入胎时母所赋予之红分明点，急遽上升。外所觉者，有如日光照耀之景象；内所觉者，则如流萤之光。是谓‘增境’。未几之间，又转入‘得境’。此时白红两明点会合，心中之识，亦同时会合。外所觉者，有如月蚀日时、日中所现黑月光影；内所觉者，则如油灯外蒙半透明之罩，是谓‘得境’。由此又转入‘近得之境’。此时一切皆空无所有。外所觉者，现为如黎明时东方曙光景色；内所觉者，则如万里无云之晴空天色。以上明、增、得三境，乃至‘近得’，是在五大消融后，由‘地大’而至‘近得’，为死后初历之经过。至‘近得’时，即为明光出现之境相，又称‘死光明’，为时极暂。若平时有修持者，睹见此死光明，便可认识，如子遇母，母子两光，融会为一，则不经中有而现法性，否则中有又现矣。从风大融入空大……至近得境相起现时，是为死后第一刹那。所谓上根人不历中有、法身成佛，即在此时。此后降入第二刹那，故即为报身中有。人在死后呼吸全断，知觉全失，惟耳根听觉独明，生前耳聋，此亦无碍，故施此明光教授法，最易领悟而得救度也。</p>\n<p>　　附注五：母光是自己法性中所出，而非由外而来者。子光是由自己平时修持功夫所得，而非由内所出者。换言之，母光是自己本光，子光乃是佛光。死后三日半中，有两次明光起现，在<a href=\"/remen/xinshi.html&#9;\" class=\"keylink\" target=\"_blank\">心识</a>豁然开朗时，体会行法者所宣读此中教授意义，母子两光，互相摄入，如子遇母，投入怀抱而成佛矣。行者在生前修生起次第时，为练习两光融合起见，乃观想本尊之佛光请来，与自己之母光融合。如是由观想力所观想之光，名为‘空光’，而非真正之子光。假使生前修法，练习有素，则死后初期中有起现，真正之子光请来时，可以如子遇母，欢然会合，而无见面不识之虞矣。此为超度素无修持之亡人，故用此教授以导示之。</p>\n<p>　　前面已经讲过，四大分散有一定的次序，到最后风大分散。当风大分散时，人只有出气没有入气。向外呼出长息三次，第一次出气距离约有一肘远，第二次约二肘远，最后一次约四肘远，这时外气才断尽而融入‘空大’。融入空大时，父所赋予的白分明点急剧下降，而母所赋予的红分明点急剧上升，二者在中丹田处会合。在二者会合的同时，心中之识(就是识神，即八识)也会聚于人体中脉。这里的白分明点和红分明点就是道教中讲的阴极和阳极，也是我们前面说的阳电子和阴电子。在二者会合的过程中，死光明就慢慢出现了。但大部分人在此时因昏沉而无法见到。所以我们平时修法最为重要。</p>\n<p>　　按死光明显现的过程可以分为‘明’‘增’‘得’‘近得’四个阶段。如果亡者不迷闷的话，会同时看到两种景象，就像人同时看到室内室外的景象一样。这两种景象就构成了亡者的内觉与外觉。那么在经历死光明的过程中。亡者的内觉和外觉如何呢？我们可通过下表来表明：</p>\n<p>　　外　觉</p>\n<p>　　内　觉</p>\n<p>　　明　境</p>\n<p>　　如月光朗照之景象</p>\n<p>　　如烟雾迷离之状</p>\n<p>　　增　境</p>\n<p>　　如日光照耀之景象</p>\n<p>　　如流萤之光</p>\n<p>　　得　境</p>\n<p>　　如月蚀日，日中所现黑月光影</p>\n<p>　　如油灯外蒙半透明之罩</p>\n<p>　　近得境</p>\n<p>　　如黎明时东方曙光景色</p>\n<p>　　如万里无云的晴空天色</p>\n<p>　　上表说明了在死光明显现的过程中，内外两种觉境可分为明、增、得和近得四个阶段。总而言之，就是亡者见到的光经过由弱到强，由暗到明的变化过程。而且这个过程很短，约一顿饭的时间，这就是‘死光明’。如果平时修行用功的人在死位中有时期见到这个光明能够认取，就如子遇母，母子两光合而为一，而证成法身佛。所以说上根人不历中阴，就是在此时成就，就可以不受中有之苦。因此，我们称此时为死后第一刹那。在第一刹那证得法身后，以后再次放光就知道这是法身的妙用，进而证成报身佛。所以这里我们将第二次放光称为第二刹那，又叫报身中有。在藏密中，有观想子光与母光融合的修法，由观想所生之光，名为空光，并不是真正的‘死光明’。但通过此法我们可以熟悉‘死光明’显现的过程。</p>\n<p>　　平常人在呼吸断的时候，知觉全失，但耳根却很灵敏，即使生前是聋子，这时也能听到别人的说话声。所以‘中阴救渡法’第一阶段的行法，就是要教导并提醒亡者：现在死光明就要显现了，这就是你的本性光明，一定要抓住这千钧一发的大好时机，与光明合上去就可证成法身佛。这就是第一阶段行法的主要目的。下面我们具体来讲解。</p>\n<p>　　五、行法实施</p>\n<p>　　(一)、第一阶段行法(在死相现前时开始实施)</p>\n<p>　　行法之人，于亡者气息将断未绝时，先修迁识往生之颇哇法，令证迁转。若未证者，当呼亡者之名，念诵下文而告之曰：</p>\n<p>　　[1]指示明光寻求大道文(此文在外气将断未绝前念诵之)</p>\n<p>　　嗟！善男子(某某，如为女性，则改称：善女人。以后均同此例)。汝今寻求真实大道之时期已至，今汝气息，断而未绝，汝于‘中有’，所谓最初明光，先当忆念上师所指授义。今后气息断绝，于一切法，湛然空寂，无遗余中，起现明空，无中无边，通体透明，赤裸无垢。尔时，汝自内证智(此智乃吾人从本以来灵明之智，自内证悟之相。即自心智慧明体。详见般若华严等经)。忽然起现，当知即汝本来面目。我亦同时，佐汝指示。</p>\n<p>　　行法的人在亡者死相现前时，先帮助他修迁识往生法(即颇哇法)，如果没有成功，就为他念诵‘[1]指示明光寻求大道文’。</p>\n<p>　　‘[1]指示明光寻求大道文’内容如下：</p>\n<p>　　‘某某人(这是对亡者的称呼，采用亡者最易接受，最熟悉的称呼为好，以下类同)，你已经进入中有时期，寻求真实大道的时刻已经来到。在你气息断而未绝之时，你要回忆上师为你讲授的死后第一明光的含义。那时候一切空寂，湛然无边，只有了了分明的觉知性。这个觉知性就是你的法身，就是佛性！也就是自内证智！于空寂中忽然起现的明空景象，通体透明，这就是你的本性光明，即本来面目。我现在就在你身旁指示你，你要抓住这个大好时机，与光明合上去，即可证成法身佛！’</p>\n<p>　　如上嘱告，于外气将断未绝之前(即最后一次出息未终之先。)，附亡者耳，反复叮咛，不计遍数，深刻印入亡者之心。次于外气未断以前，即宜预移其体，当令右侧而卧，如狮子卧式(向右侧而卧，屈其左腿，而以左手掌覆在左腿膝盖上，以右手上托右腮，而以其小指塞闭右鼻孔，只留左鼻一孔出气，即密法中吉祥卧式。)，遂数其脉搏。设若亡者如入沉睡状，中间脉搏停止，亟强压之，止令勿眠。尔时风智之光，得留‘中脉都帝’，不复逆转，其神识定由顶上梵穴(详附注二)一道而出。</p>\n<p>　　我们要在亡者的外气将断未绝之前，在其耳边反复叮咛，不计遍数的念诵‘[1]指示明光寻求大道文’。使此文能深深印入亡者的八识田里。同时，在亡者外气未断以前，最好能移动他的身体成狮子卧式(狮子卧式，译者在括号里作了解释：即右侧身而卧，左腿弯屈，左手掌放在左膝盖上，右手上托右腮，并用小指堵住右鼻孔，只留左鼻孔出气，这就是密法中的吉祥卧式。但应注意，做这些事情要在亡者外气断以前做。如果亡者马上就要断气，就不要去踫他，另外，也可不必用小指堵住右鼻孔)。还要马上数他的脉搏，如果亡者进入沉睡状态，脉搏出现停止现象，则双手重叠轻轻挤压亡者的心脏部位，让他清醒，这样做可以使亡者的灵识保持在中脉内，而不沿左右二脉逆转。亡者一旦领受‘①指示明光寻求大道文’之意，便能立刻证见法身，得大自在，灵识定能沿人体中脉向上，从头顶梵穴出去而生佛土。风智之光就是指本性光明，在这里就是指灵识。</p>\n<p>　　行者在垂死时，若有力能自修，自即投合，证入明光，无须他人佐助。若自无力者，则择一心慧相合之法侣(意谓行者之心，与亡者之心合为一者)，留在身旁，为四大(详附注三)融入指示，再呼亡者之名，念诵下文而告之曰：</p>\n<p>　　[2]四大融入指示文(此文在外气未断以前合前[1]文同时念诵之)</p>\n<p>　　今者即为‘地大’融入‘水大’之微相起现矣！(按此处尚有‘水大’融入‘火大’、火大融入‘风大’两句，凡为修法喇嘛，俱能自行加入念诵，原经略而未载，但行法者必须次第诵之)。</p>\n<p>　　亡者之死相，一一呈现时，行法之人，务必软语低声，叮咛呼告，附其耳曰：</p>\n<p>　　善自作意！善自作意！请发胜心，谛听勿乱。</p>\n<p>　　如亡者为师长前辈，则但加嘱曰：</p>\n<p>　　师尊(或尊长)！请善自专意作念！</p>\n<p>　　在亡者外气快断时念诵‘[1]指示明光寻求大道文’。如果亡者领悟，有能力自修的话，就可以见到法身，证入明光，而不再需要他人的帮助了。如果亡者力量不够，不能解脱，就要为亡者继续念诵‘[2]四大融入指示文’。</p>\n<p>　　‘[2]四大融入指示文’内容如下：</p>\n<p>　　‘某某人，死亡之神将降临到你身上，四大分散的症兆已经出现。首先是地大融入水大，然后是水大融入火大，最后是火大融入风大。在这个痛苦的时刻，你要把握住自己，心里不要慌乱，要发心成佛，要专心致志的听我为你讲法，你就可以得到解脱。’</p>\n<p>　　‘善自作意’‘善自专意作念’就是要好好观照之意。</p>\n<p>　　为同门金刚弟兄或平常人，当呼其名念诵以下发心证认死位明光(详附注四)文而告之曰：</p>\n<p>　　[3]发心证认死位明光文(此文在外气将断时，连同前[2]后[4]两文念诵之)</p>\n<p>　　嗟！善男子(某某)，所言死者，今临汝矣！汝当作意思惟，发起如是胜心，而自念言：呜呼！我今死时已至，于兹死缘，惟当猛发慈悲菩提之心。为利乐尽虚空界一切有情，愿证圆满佛位。更当从今为始，为利一切有情，愿证死位明光法身，即于其中、证得大手印最胜悉地(大手印为西藏大成就法之一。悉地者成就义。)，证已，当利一切有情。此纵未证，当于‘中有’位中认证，而证‘中有双运大手印身’，随缘应化，利乐等空一切有情，专意作念，发心投合，坚持勿舍。汝先前所修上师所传教授，及平时自修常课，亦当忆持勿失。</p>\n<p>　　行法者以唇附耳，声音务极明朗，无一刹那涉及妄念，令其体验。当其外气断尽，即当紧压其两旁脉位，明言相告。如为师长，或较已尊之善知识，则言：</p>\n<p>　　尊长：今有如是本体明光，起现于前，请即开始修持。</p>\n<p>　　如为同辈或他人，则以下文‘明光直指教授’而告之曰：</p>\n<p>　　[4]明光直指教授(此文在亡者外气将断未绝时，附耳念诵多次。)</p>\n<p>　　嗟！善男子(某某)：谛听勿乱！汝今已有法性妙明净光、开始起现于前，亟当体认。嗟！善男子：汝今当下心识，自证智体，明明晃晃，实体、相状、形色、自性均不可得，空湛朗然，此即法性普贤佛母也。汝以自内证智，于本空中，空寂坦然；自内证智，寂照不灭，晃然灿然。此即证智普贤如来也。(普贤佛母普贤如来句，见后附注。)自内证智，全无实体可得，体相空寂！自内证智，灿然明住，无可分别。此即如来法身也。明空无别，住大光蕴，此即无有生死光明不坏佛也。认识此故，是为最胜。自内证智，体性空明，认识为佛，即于自内证智中自己亲见，此即住于佛心印中也。</p>\n<p>　　在亡者外气将断未绝之时，还要为亡者念诵‘[3]发心证认死位明光文’和‘[4]明光直指教授’</p>\n<p>　　‘[3]发心证认死位明光文’内容如下：</p>\n<p>　　‘某某人，我们平时所说的死亡，如今将降临到你的身上，你要这样想，这样发胜心：我与这个世界的缘份已尽，死亡已经到来。此时此刻，为了利益遍虚空一切众生，我要猛发慈悲喜舍菩提之心，精进不懈。在此死位中有时期认取明光，证得法身，这就是大手印最殊胜的果地。我成就之后，更应当利乐一切众生，进而圆证佛果。如果我在此死位中有时期未能成就，那么在法性中有时期，于佛菩萨双身显现之机，我也要证成报身佛(‘中有双运大手印身’即佛菩萨的双身)。我成就之后，要随机随缘利乐如同虚空一样多的众生。你要这样一心一意的思惟，坚持不懈，把握中有时机，发心认取明光。同时，对生前上师为你所传授的密法和平时自己修习的内容，要回忆修持，不可忘记。’</p>\n<p>　　‘[4]明光直指教授’内容如下：</p>\n<p>　　‘某某人，请你仔细听，不要慌乱！现在光明已经开始显现，这就是你的本性光明，你应当马上认取，与之合上去。</p>\n<p>　　某某人，显现在你面前的本性光明，无实体、无相状、无形色、无自性。体相空寂，均不可得，这就是如来法身，也就是普贤如来。虽然体相空寂，却尽虚空遍法界，含藏一切，这就是普贤佛母。本性光明空寂朗然却又明明晃晃，明空无别。寂而长照，照而长寂，这就是不生不灭，光明不坏的天真佛。能认证此光明就是佛，就是普贤如来，就是普贤佛母，就是如来法身，就能够住于佛心印中而成佛道。’</p>\n<p>　　这一段文字([4]文)主要讲的是佛的真空妙有的境界(可参见本书31页)。</p>\n<p>　　行法之人要靠近亡者的耳边，但不要踫著耳朵，为其念诵。念诵时，口齿要伶俐，声音一定要清晰明白，心里要空净，不能胡思乱想，要专心致志，这样才能帮助亡者，使亡者易于领悟。当亡者外气断尽的时候，应当立即用双手，按压左右二脉，并告诉他：</p>\n<p>　　‘现在，本性光明就在你面前显现，请立即开始修持！’</p>\n<p>　　上文朗声念诵，三至七遍，亡者一经领悟，最初忆念上师指授；第二体会自内证智，赤裸无垢，证知即是明光；第三认识自己本来面目，成为无有离合之法身，决定解脱。</p>\n<p>　　对上述[1]至[4]文要高声朗诵三到七遍，使亡者首先能够回忆起上师的指导教授，然后再体会自内证智(即本性显发的大智慧)，赤裸裸，净洒洒，无垢无净，就可证见明光，认识自己的本来面目。亡者一旦领悟上述教导，与法性光明合为一体，必定能够得到解脱。</p>\n<p>　　(二)、第二阶段的行法(即亡者外气已断内息未绝之时)</p>\n<p>　　初、于‘死位中有’(明光者、即法性中人人具足之本光，此时起现。详附注五)，如经指示尚难娴习纯熟者，或诸凡夫已受引导次第者，为行此法，令其认识本体光明，于无实义空性中，透澈本源，扶摇直上，立证无生法身。作法如下。</p>\n<p>　　行法之时，要在外气所已断，风智之光，融入‘中脉都帝’［风智之光，即张赵两居士据英文本所译之‘灵热’。梵文都帝，又称阿哇都帝，在人身之中脉管内，吾人之命根，即藏于此，外来之风，亦聚于此，而被持命根之风气所卷裹(即风智之光)，永远不动，一动即病，一开即死矣。］，神识更现为离戏光明(谓离戏之本体光明)。次则气息逆转，由中脉逸入左右两脉，斯时‘中有’境相，豁然起现，行法之时，必当左右二脉气息尚未消失之间，方适为之。所需之时，为内息尚存，约为一餐饭顷(大约二三十分钟)。</p>\n<p>　　先虽指示，届时仍当行法，其时所谓最初中有法性明光，亦即法身心印，不复返回。一切众生，轮回相续，同一根源，于中起现。</p>\n<p>　　又外气已断、内息未绝之际，即风(此风即指风智之光言)融入阿哇都帝之时，此即常人所谓‘闷绝位’也(泛称昏厥，或称闷绝。西医认为假死。斯时神识尚未完全出窍。)其停留时间，久暂无定，视身胜劣，及脉风之次第。大抵修持有素、寂定坚固、脉道较胜之人，则停住时间较久。当趁此重要关头，以此教授指示，不计遍数，殷勤嘱告，令其发心，须在诸根孔窍黄液未出之间(凡人在外气已断之后，必有一窍流出黄色液质。其在生前，多行恶行，色力定功劣弱者，此液流出特速，最快者，气断后即流出，稍缓者，能经食顷之久。但以迟缓为佳。)反覆施行。亦有罪大恶极及脉道劣弱等人，出液特速，弹指之间亦不住者。亦有能住一饭之顷者。依经教中说：‘常人闷绝为三日半’(其他经中亦有传述四日为期者，若有定力者，可延长至一七。)，以故常人可住三日半始证明光。于此指示，亟当殷重为之。</p>\n<p>　　如果经过第一阶段的行法，亡者已经证见法身，证入明光，就不需要行以下的法了。否则还要继续为亡者实施第二阶段的行法(经文中的‘无实义空性’‘本源’‘无生法身’都是指我们的佛性)。</p>\n<p>　　第二阶段的行法，要在外气已断，但内息尚存时进行。这就是我们通常说的死位中有时期，又称‘识闷绝位’，在西医又称为假死。这个时候人的识神并未完全出窍。识神从什么地方出去，什么地方就要流黄水，所以第二阶段的行法要在黄水流出之前反复实施。从外气断到识神完全离体这段时间的长短因人而异。如果是罪大恶极，或者定力很差，身体又很弱(即‘色力定功劣弱者’或‘脉道劣弱者’)的人，外气一断，识神很快就出去了，有的还能停留一、二十分钟。如果有定力的人，识神可以停留七天才完全离体。所以功夫越好的人，识神走得越慢。普通人一般需要三天半或四天，识神才能完全离体。</p>\n<p>　　在亡者外气刚断的时候，诸气息集中于人体中脉，本性光明(即风智之光)豁然起现，这就是第一次光明显现。大约一顿饭的时间，约三十分钟。而未能证入者就见为妄光(即戏光明，就是平时执著在光明相上，追求来的光明，此光明与本性光明无关)。所以这时应极当体认。一旦认取，即可证入明光，而证得法身。此后，亡者气息由中脉溢入左右二脉，第一次光明消失，中有境界就现前了。</p>\n<p>　　因此要把握第一次光明显现的机会，行法者一定要在气息溢入左右二脉之前，反复念诵以下各文三十分钟：</p>\n<p>　　‘[1]指示明光寻求大道文’</p>\n<p>　　‘[2]四大融入指示文’</p>\n<p>　　‘[3]发心证认死位明光文’</p>\n<p>　　‘[4]明光直接教授’</p>\n<p>　　这些经文在前面已经讲过，这里就不再复述。第一次明光消失后，中有境界现前，其间还会有第二次、第三次明光显现的机会。所以第二阶段的行法，又分两部分：第一部分就是在亡者外气刚断三十分钟内抓紧时间多次念诵[1]至[4]文，为亡者指示第一明光。这就是原书中讲的‘初期中有’。第二部分就是在亡者外气断了三十分钟以后，除继续念诵[1]至[4]文，同时对生起次第行者还要加诵[5]文，为亡者指示第二明光。这就是原书中讲的‘二期中有’。在第二部分的行法中还要加诵[6]、[7]文为法性中有时期的行法做准备。</p>\n<p>　　乙、二期中有第二明光指授</p>\n<p>　　若亡者于最初明光(即以上所示初期明光)能认取者，当下即可解脱。设若不能认取，惊疑恐怖者，所谓第二明光，即现其前。其光来时，为外气断后一餐饭之顷。随其生前或善或恶之业力，风智之光，由中脉逸入左右两脉，自诸根孔穴外出，心识豁然开朗，约为一餐饭顷，亦视脉道胜劣及修持有无而定。尔时，其识离体外出，自己已死，尚未认知，或见亲属，一如生前，亦闻哭声，斯时业力幻惑，凶猛境相，尚未显现，阎罗怖畏，尚未来临，行法之人，亟当指示如次。</p>\n<p>　　此中又分‘圆满次第行者’及‘生起次第行者’(已授密法之瑜伽士，初步入观本尊坛城修习者，谓之生起次第行者；次修自己身中气脉明点者，谓之圆满次第行者。)。若为圆满次第行者，当三呼其名，依照前节[4]‘明光直指教授’以导示之；若为生起次第行者，则当为其朗诵彼平时熟修娴习之本尊道场观，即呼亡者之名，念诵下文而告之曰：</p>\n<p>　　如果亡者在第一次死光显现时，能够认取，并与光明合上去，当下即可证成法身佛而得到解脱。如果不能认取，或惊疑恐怖者，就错过了第一次成就的机会。在外气断了大约一顿饭的时间以后，又会有第二次明光显现。这时亡者的气息(即‘风智之光’)由中脉溢入左右二脉，其间识神偶然外出。亡者同生前一样，也可以看见亲属，也能听到哭声，但还不知道自己已死。这时业力所幻现的各种境相还没有显现，可怖可畏的阎罗还没有来临，所以行法者应抓紧时间为亡者指示。</p>\n<p>　　根据亡者生前所修的密法不同，指示也有所不同。如果亡者生前修习圆满次第的法(即能够将观想成功的一切境相全部化空，归无所得)，在这时就要继续念诵[1]至[4]文，为其指示明光。如果亡者生前只修过生起次第的法(即修观想、本尊、坛城、三脉七轮、九节佛风等)还未曾修圆满次第的法。这时除为亡者念诵[1]至[4]文外，还要加诵经文‘[5]本尊道场观’。</p>\n<p>　　[5]本尊道场观(此文在亡者气断之后约半小时起，为之多次念诵。)</p>\n<p>　　嗟！善男子(某某)：汝当入观于汝自奉本尊(此指亡者生前所修奉之本尊。如修观音法，则观世音菩萨即其本尊；如修文殊法或弥陀法，则文殊菩萨、阿弥陀佛，即其本尊也。)心勿散乱，励力渴仰，专注本尊。当观一切境相，皆无自性，如水中月，切勿观为实质。</p>\n<p>　　以上明告，如为常人(即未受过显密各法之普通人。)则告之曰：</p>\n<p>　　汝当观修大悲观自在菩萨(藏密所传观自在菩萨，二头四臂，见本经卷首之图像。)</p>\n<p>　　告已，指示亡者如何观想。如是纵于‘先期中有’未认取者，此时亦能认取勿疑。又在生前，虽有师授，然未能熟修，于‘中有位’不能自证‘明光’者，当必由上师或同门道侣，导令解释。又自己虽能熟修，然以死时重病所缠，不能记忆而认取者，则此‘中有教授’，在所必需。又在生前，修道虽熟，然以曾坏<a href=\"/remen/lvyi.html\" class=\"keylink\" target=\"_blank\">律仪</a>，退失三昧耶(誓语)，遂入恶趣者，则此嘱告，万不可少！总之，‘初期中有’，若得证认，是为最上。若不能证，则于‘二期中有’，明白导示，证智开朗，仍得解脱。又在‘中有’时，所具一种‘幻身’，对于自死与未死，尚未认知。迨其心识豁然开朗，尔时，体会所说教授，则法尔母子两光(详附注五)会遇，炳然照耀，无能为染。譬如日光破除冥，光明照耀，摧破业力，即得解脱。次则所谓‘二期中有’乃渐起现为‘意生身’，亡者能见境相，犹如生前所见。尔时若能证认此教授，自能获益。因在此时，业力迷境，尚未现前，任何一切，易于转变也。</p>\n<p>　　‘[5]本尊道场观’内容如下：</p>\n<p>　　‘某某人，你现在应当观想生前所修持供奉的本尊。要专心致志，不要散乱，要竭力渴望瞻仰、专注本尊。同时你要明白现在所显现的一切境相，皆无自性、无自体，如水中之月，空中之花，都是因缘所生，决不可认为实有，不可执著，要一切放下。’</p>\n<p>　　如果亡者是没有修过显密各法的普通人，就告诉他：</p>\n<p>　　‘你现在应当专心致志的观想观世音菩萨(见本经卷首二头四臂观音像)，不要散乱。’</p>\n<p>　　并且指示他应该如何观想。这样，亡者即使于第一次明光未能证入，于第二次明光也能认取。需要注意的是，对于以下几种情况，一定要加强中有时期的行法，不能放松。</p>\n<p>　　第一，虽然生前拜过师父，受过密法灌顶，但未能精进用功修持的人。</p>\n<p>　　第二，虽然生前修法很用功、很精进，但由于业力缘故，到死的时候为重病所缠，非常痛苦，对生前所修之法，不能记忆认取的人。</p>\n<p>　　第三，生前修法很用功，很精进，但不守戒律。退失戒心，即乘急戒缓之人，死后很容易堕入恶趣(即三恶道)。</p>\n<p>　　总而言之，经过导示，亡者能在死后第一次明光显现时，认取光明，证得法身，最为殊胜。如果第一次明光显现的机会丧失，在第二次明光显现时，我们再为他反复念诵经文，提醒、教导他，让他明白，证入自内证智，亡者仍然可以得到解脱。因为此时，业力迷境还未现前，各种境界(即‘任何一切’)均容易转变。好比千年暗室，一灯即明，因业障本来空。只要我们一切放下，心空无住，与光明合上去，就可以从一切罪障中解脱出来。</p>\n<p>　　第二节 法性中有指授</p>\n<p>　　丙、三期中有指授(三期中有、即法性中有。)</p>\n<p>　　以上导示，虽未体认本体明光(即初期中有明光。)，而能认证二期中有明光者，当得解脱。若亡者为业所缚，经过以上多次导示，不能感其心识，未获解脱，次即所谓‘三期中有’，亦即‘法性中有’，立即起现。此三期中有，系从死位中有三日半或四日后计算，有业力所现之幻惑迷乱境相、现临于前，尔时亟当诵此法性中有指授密法，是为至要！此法威力，胜利极大。此时亡者灵识，如从睡梦初醒，较为清朗，凡其亲属哭泣哀号，以及撤除食器、脱换衣服、扫除床具、清洁卧室，自虽能见，而彼诸人，无能见己；他人所言，自虽能闻，而呼诸人，竟无应者。心遂懊丧，并知已死，将求重生，逡巡欲去。尔时，‘声’、‘光’、‘辉’三种境相，俱现于前，遂疲劳于‘怖’、‘畏’、‘惧’三种情况之下，莫知所适。尔时亟当施此‘法性中有指授密法’，高呼其名，念诵下偈，朗声明告：</p>\n<p>　　如果亡者为业力所缠，虽然经过行法之人的多次指示教导，仍不能认取明光，这样，亡者就失去了在死位中有时期得到救度的机会，而降入‘三期中有’。即我们前面述及的‘法性中有’时期。这是在亡者死后三日半或四日之后，即第五天开始。由于业力的缘故，亡者一经降入法性中有时期，识神所幻现的各种迷乱境界，接踵而来，像演电影一样，一幕一幕的出现在眼前。此时急需为亡者念诵法性中有时期的密法指授，这一点非常重要。因为此密法经文，威力极大，可加持亡者不被业力困扰，从而得到解脱。</p>\n<p>　　在法性中有时期，亡者的识神已渐渐清醒，不再迷闷。这时亡者能听见亲属悲痛至极的哭泣、哀号，能看见大家为他脱换衣物，撤掉食器，打扫床铺，清洁房屋等境相。亡者虽然能看见这一切，但周围为他忙碌的人却看不见他；亡者虽然能清清楚楚听见每一个人所说的话，也急于和大家说话，但大家却听不见他的声音，所以亡者感到非常懊丧。当他看到自己的尸体横在床上，大家为他哭泣，他终于明白自己已经死了，所以非常痛苦。想求重生，于是到处窜逡。这时强烈的‘声’‘光’‘辉’三种境相，同时在亡, 者面前出现，亡者感到万分恐怖和畏惧，不知道该如何是好。所以这时应当抓紧时间，为亡者实施法性中有时期的救度法。</p>\n<p>　　法性中有时期虽然是在亡者外气断后第五天开始，但为了让亡者心里早有准备，法性中有时期的行法必须在亡者外气断了30分钟后，在念诵[1]至[5]文的同时加诵‘[6]法性中有指授及六句要偈’和‘[7]令其认识本来面目教授’。</p>\n<p>　　[6]法性中有指授及六句要偈(此文在亡者四日以前，尽力为之多次念诵。)</p>\n<p>　　嗟！善男子(某某)：心勿散乱，励力谛听！夫中有者，凡有六种：所谓生处中有(一名处胎中有。)、梦境中有、静虑中有(一名禅定中有)、死位中有(一名命尽中有)、法性中有(一名实相中有)、轮回中有(一名生身四大轮回中有。)。善男子！汝于此时，当历后三种中有，所谓死位中有、法性中有、轮回中有、三皆现前。昨日以来，汝于死位中有所现法性明光，未能认取，故复于此，飘泊无依。今者法性中有及轮回中有二者已起，汝当于此教诫所指授者认取勿乱。</p>\n<p>　　嗟！善男子：所谓死者，今兹已临。夫脱离此世，非汝一人，一切皆尔。汝当于此生世，勿贪、勿著，纵欲贪著，亦无能久住。汝于流转生死轮回中，切勿贪恋，惟当忆念上师三宝。嗟！善男子：汝于法性中有境相，纵有如何恐怖现前，汝当于此文句，记持勿忘，至心正念，依文义行，此有指授要偈云：</p>\n<p>　　呜呼！</p>\n<p>　　此时法性中有现我前 惊惧怖畏境相皆当断</p>\n<p>　　所现境相认为自证智 当知即是中有之境界</p>\n<p>　　于此正逢阻碍大利时 自识所现‘寂’‘怒’勿生怖</p>\n<p>　　如上教授，说令听闻，俾其心中忆念其义，纵有种种恐怖现象，决定认识，知即我本来面目，牢记勿忘。</p>\n<p>　　‘[6]法性中有指授及六句要偈’内容如下：</p>\n<p>　　‘某某人，请你不要散乱，要专心致志听我为你讲法。关于中有可分为六种，即生处中有、梦境中有、静虑中有、死位中有、法性中有及轮回中有。现在你正面临著死位中有，法性中有及轮回中有时期。在死位中有时期开始时，我们已经为你指示有两次光明显现，但你没能认取，所以现在仍然飘泊无依。很快法性中有时期和轮回中有时期的境相就要在你面前显现。请你不要慌乱，应该认真听我对你的指示，极当体认，不要怀疑。</p>\n<p>　　某某人，我们平常所讲的死亡，如今已降临到你身上。生老病死是人生的必然规律，没有人能够例外。有生必有死，一切都如此。现在你应该放下一切，不要再贪恋这个世界，因为你已经死亡，即使贪恋也没有用！没有什么东西能够久住于世。所以在此流转生死的紧要关头，你一定要回忆上师对你的教导，依靠佛法僧三宝，才能从痛苦中解脱出来。</p>\n<p>　　某某人，当法性中有的各种境界现前时，无论它多么恐怖，你都不要害怕。一定要专心致志，去除杂念，要记住并依照下面的六句要偈去做。这六句要偈就是：</p>\n<p>　　呜呼！</p>\n<p>　　此时法性中有现我前 惊惧怖畏境相皆当断</p>\n<p>　　所现境相认为自证智 当知即是中有之境界</p>\n<p>　　于此正逢阻碍大利时 自识所现寂怒勿生怖</p>\n<p>　　(这六句偈文的意思是：如今你正面临法性中有时期，对于法性中有时期所显现的各种恐怖境相你都不要害怕。因为中有时期的一切现相都是我们的佛性(即自内证智)所显现的。对于佛菩萨的寂怒双身像更不要害怕，因为这正是佛菩萨放光来接引你了。所以你只要不惊不怖就可以从业力中解脱出来，证得报身而获得大利益。)’</p>\n<p>　　[7]令其认识本来面目教授(此文在亡者死后四日前，多次念诵。)</p>\n<p>　　嗟！善男子(某某)：汝于身心分离之时，法性清净净相，自性微妙明光，灿然照耀，惊心动魄，犹如春日原野，阳焰闪动，此中景象，人人皆现，勿怖勿畏，勿生惊恐，当知即汝法性本光。又从光内突发洪厉法性本声，犹如千雷一时齐震，应即认识，此亦汝自己法性本声也，镇定勿乱，勿怖勿惧。盖汝此时，已具有所谓习气意生之身，非复质碍血肉之躯，‘声’、‘光’、‘辉’三项，任起于前，亦于汝身无能为害，以汝此时无死因也。汝今若能认识自识所现本来境相，当可认知即是‘中有’。</p>\n<p>　　嗟！善男子！若未认识当下本来境相，纵于人间如何观修，而未遇此指授诀要，则定于‘光’生怖、于‘声’生恐、于‘辉’生惧。若不了知此教授之要点，则不认识‘声’、‘光’、‘辉’三项，仍当流转生死轮回苦海而已。</p>\n<p>　　‘[7]令其认识本来面目教授’内容如下：</p>\n<p>　　‘某某人，当你死亡约五天后，识神将从身体里出来。在此身心分离之际，从我们清净本性中显现出微妙的明光，光辉灿烂，犹如春日原野上闪动的阳焰，惊心动魄。如此景象，每个人死后都会经历。对此你不要惊慌害怕。要知道这些景象都是你本性光明所显现的。在光明闪烁的同时，又从光内发出千雷齐震之声，这是你本性光明所具有的宏大法声。所以你要镇定，不要慌乱，不要怖畏。因为你已不再是血肉之躯，而是中阴之身。再强烈的声、光、辉对你的身体也无能为害。你已经死过，不会再死。你要知道所有这些中有境相都是你自识变化所幻现的，正是你本来面目的体现。这就是中有教授密法的要诀！</p>\n<p>　　某某人，在生前无论你如何观修，若不知道此教授之要诀，则在法性中有时期，必定于光生怖，于声生恐，于辉生惧，最终不得不在生死苦海中轮回，无有了期。如果你能够明白此教授之要诀，就能够于声、光、辉中与光明合上去而证得报身佛。’</p>\n<p>　　在法性中有时期到来之前，行法的人要反复念诵以上[1]至[7]文，使经文含义深深印入亡者的八识田中。这样当法性中有时期种种恐怖境相到来时，亡者就能知道这都是我们的本性光明所显现的，这样就能从痛苦中解脱出来。</p>\n<p>　　(三)、第三阶段行法</p>\n<p>　　第二章 法性中有业力幻象</p>\n<p>　　丁、初周证入寂相部尊</p>\n<p>　　第一日诵法(亡者死后第五日、此日有佛两尊前来接引)</p>\n<p>　　嗟！善男子(某某)：汝已闷绝三日有半至四日，从闷绝而复苏，自设问曰：‘我今何故起现如是境相’？汝当了知、此即‘中有’。此时正际返入轮回，所有一切境相，悉皆现为明光佛身，虚空遍现蔚蓝色光。</p>\n<p>　　尔时中央密严刹土(一称明点勇现刹土，一称奥明天。)<a href=\"/remen/shizun.html\" class=\"keylink\" target=\"_blank\">世尊</a>‘毗卢遮那如来’(亦称‘大日如来’或称‘光明遍照佛’。)，其身白色，坐狮子宝座；手持八辐金轮，与虚空法界自在母面合交抱，来现汝前，此为‘色蕴’法尔清净蓝光，此光晃耀，严以明点及微光点，灿然明澈，自‘毗卢遮那如来’父母双尊胸中照临汝前，直射汝心，眩目难睁，不敢逼视。而与此同时，又有‘天道’白光不起怖畏者，并临汝前。此时汝为‘愚痴’业力所牵，怖畏蓝光，故于‘法界体性智’光，生起恐怖而欲逃避；反于‘天道’白光不生怖者，起欣乐想，而欲趋入。我今告汝，此时汝当于彼灿然明澈晃耀眩目之蓝光，勿怖勿畏，不可逃避，此即所谓如来光明法界体性智也。当于其中，深生信乐，起渴仰心，而自念言：‘此是世尊毗卢遮那大悲恩光’，亟起皈依，恭敬祈请。尔时世尊毗卢遮那、即接引汝出离‘中有险峡’。汝对‘天道’白光不眩目者，切勿欣乐，勿贪勿著。若生贪著，即沦天趣，复转六道，以是障碍，阻解脱道。故当于彼，眼避勿睹；而于闪烁眩目之蓝光，当起欣乐，发猛利心，渴仰世尊毗卢遮那如来，至心专注，念诵下偈，随我发如是愿：</p>\n<p>　　呜呼！</p>\n<p>　　愚痴炽盛 流转生死 法界性智 光明照耀</p>\n<p>　　毗卢遮那 导引在前 大自在母 护持于后</p>\n<p>　　祈脱中有 怖畏险峡 送我往登 正觉佛土</p>\n<p>　　如是虔敬猛利发愿，即化虹光，融于毗卢遮那父母双尊胸中，于中央密严刹土，以圆满受用行相而证佛位。</p>\n<p>　　‘第一日诵法’内容如下：</p>\n<p>　　‘某某人，经过三日半到四日的昏迷，你已渐渐清醒。但自己还不明白是怎么回事？为什么会见到这些境相？你应该知道：现在你正处在法性中有时期，快要进入六道轮回了。在法性中有时期的第一天，从中央佛土即密严刹土，有世尊毗卢遮那如来前来接引。毗卢遮那如来身体呈白色，坐在狮子宝座上，手持八辐金轮，和虚空法界自在母面合交抱，显现在你面前。从毗卢遮那如来父母双尊胸中放射出蓝色的光芒，使整个虚空呈现出蔚蓝色。这光芒正是从我们本性中显发的，色蕴清净时所显现的法界体性智光。此光非常强烈，绚耀夺目。光中有无数明点和微光点，跳耀闪烁。显现在你面前，直射入你的心中，使你眩目难睁，不敢逼视。在蓝色佛光闪耀的同时，天道白光也在你面前显现。由于你被愚痴业力牵缠，对于佛放射的强烈蓝光感到恐惧，甚至逃避。而对天道白光却感到欢欣喜悦，觉得天道白光不剌眼，很舒服，并准备投入。</p>\n<p>　　我现在郑重地告诉你：你不应逃避灿烂明澈，晃耀眩目的蓝光，不应对此产生怖畏之心。因为这正是毗卢遮那如来为接引你而放射的光明。当耀眼蓝光显现时，你应当深生敬仰、渴求之心，并想：这就是世尊毗卢遮那如来的大悲恩光，这是象征佛之法界体性智的光明。对此强烈的光明，你要恭敬祈请、立即皈依。这样，世尊毗卢遮那如来就会接引你脱离中有险峡之道。对于天道不剌眼的白光，你千万不可生欢喜之心，不要贪著，要回避勿视。否则，你就会沦落天道，再次陷入六道轮回之中，得不到解脱。</p>\n<p>　　所以，对闪烁耀眼的蓝色佛光，你应生欢喜之心，一心专注，渴望瞻仰世尊毗卢遮那如来双尊。并随我诚心诚意发愿，念诵以下偈文：</p>\n<p>　　呜呼！</p>\n<p>　　愚痴炽盛 流转生死 法界性智 光明照耀</p>\n<p>　　毗卢遮那 导引在前 大自在母 护持于后</p>\n<p>　　祈脱中有 怖畏险峡 送我往登 正觉佛土</p>\n<p>　　(这段偈文的解释请参见本书196页)</p>\n<p>　　你应该非常虔诚恭敬的发愿，义无反顾融入毗卢遮那如来父母双尊胸中。这样就可以化为虹光，与佛光水乳交融，无二无别，当下证得自受用报身，而成就报身佛。次一等也可以生到中央密严刹土得真实受用。’</p>\n<p>　　第二日诵法(在亡者死后第六日，此日有佛六尊前来接引。)</p>\n<p>　　又虽已如前指示，然缘于‘嗔’‘恚’业障，对‘光’与‘辉’、惧而逃避，虽发是愿，仍复迷而不悟，则第二日中，有‘金刚萨埵不动如来’圣众、及‘地狱’恶业之光，同时并来现前，此时当复指示，呼亡者之名，念诵下文而告之曰：</p>\n<p>　　嗟！善男子(某某)：谛听勿乱！此第二日，有‘水大’白色净光，来现汝前。尔时，东方蓝色‘现喜刹土’(梵名：阿比罗提。藏名：恩巴尔嘎哇。)世尊‘金刚萨埵不动如来’，其身蓝色，手执五钴金刚杵，坐大象宝座，与‘玛嘛几母’面合交抱，现临汝前；‘地藏’‘弥勒’二菩萨、与‘拉先女’(舞女)‘补[草/别]女’(花女)双尊围绕于虹光曼陀罗海，六尊齐现而来。此为‘识蕴’法尔清净白光，即‘大圆境智’。此光晃耀，严以明点及微光点，惊眩欲绝，自金刚萨埵不动如来父母双尊胸中，照临汝前，直射汝心，眩目难睁，不敢逼视。而与此同时，又有‘地狱道’不眩目之烟灰色光，亦与智光并临汝前。此时汝为‘嗔’‘恚’业力所制，怖惧白光而欲逃避；反于地狱道不眩目之烟灰色光，起欣乐想而欲趋入。我今告汝！此时汝当于彼晃耀眩目之白光灿然透明者，勿怖勿畏，不可逃避。彼即汝自内证智本体具足力用，应于光中明了任运，坦然而住，更当于彼，信乐渴仰。汝若认知自内证智本体光明，纵欠虔诚发愿，亦得一切诸佛光明与汝融合，无二无别，而证佛位。若不认知为汝自内证智本光，则当对之信乐渴仰而自念言：‘此是金刚萨埵不动如来大悲恩光’，亟起皈依，深心祈请，自维此即金刚萨埵不动如来大悲光钩，不可逃避。要知汝纵欲逃避，亦与汝身不能分离，故勿怖畏，当欣乐祈请。尔时金刚萨埵不动如来，即来接引，拔汝出离‘中有险峡’。又当于彼地狱烟光不眩目者，勿生欢喜。此为汝‘嗔’‘恚’炽盛所积罪障而来诱引之光，汝若贪著彼光，当堕‘那落迦’(地狱)处，陷于苦不堪忍泥涂之中，永无出期，此是障碍，阻解脱道。故当于彼，眼避勿视，断除‘嗔’‘恚’，勿贪勿著；而于炳然照耀之白光，深生敬仰，至心专注金刚萨埵不动如来尊前，生起猛利欲乐，念诵下偈，随我发如是愿：</p>\n<p>　　呜呼！</p>\n<p>　　嗔恚炽盛 流转生死 大圆镜智 光明照耀</p>\n<p>　　金刚萨埵 导引在前 玛嘛几母 护持于后</p>\n<p>　　祈脱中有 怖畏险峡 送我往登 正觉佛土</p>\n<p>　　如是至心虔敬发愿念诵上偈，则化虹光，融入世尊金刚萨埵不动如来父母双尊胸中，于东方现喜刹土，证得圆满受用身而成佛矣。</p>\n<p>　　在法性中有时期的第一日，我们已经为亡者做了指示，但由于亡者‘嗔’、‘恚’业障太重，对佛心放射出耀眼的‘光’‘辉’，感到非常害怕，反而逃避。虽按上述发愿，实际仍执迷不悟，不得解脱，所以到法性中有的第二天，有金刚萨埵不动如来圣众及地狱恶业之光，同时显现于亡者面前。这时应当呼唤亡者姓名，再次对亡者进行指示。</p>\n<p>　　‘第二日诵法’内容如下：</p>\n<p>　　‘某某人，请不要散乱，仔细听我为你指示！现在你正处在法性中有时期的第二天，这一天有自性发出的水大白色光明在你面前显现。这时，有东方现喜刹土世尊金刚萨埵不动如来，身体呈蓝色，手持五钴金刚杵，坐大象宝座，与玛嘛几母面合交抱；同时还有地藏、弥勒二尊菩萨相伴，和舞女、花女双尊环绕。以上六尊佛菩萨显现为美妙的虹光曼陀罗，前来接引你。从金刚萨埵不动如来父母双尊胸中放射出白色的光芒，此光明正是从我们本性中发出的、识蕴清净时所显现的大圆镜智光。此光非常强烈，绚耀夺目，光中还有无数明点及微光点跳耀闪烁。显现在你面前，直射入你的心中，使你眩目难睁，不敢逼视。在白色佛光闪耀的同时，地狱道不刺眼的烟雾似的光也来到你面前。因为你被嗔、恚业力所牵缠，对于佛放射的强烈白光感到恐惧，甚至逃避。而对地狱道不剌眼的烟雾似的光感到舒服，并想投入。</p>\n<p>　　我现在郑重的告诉你：你不应当害怕、逃避强烈耀眼的白色佛光，因为此光正是你的本性光明。你应当对此光明深生敬仰、渴望之心。纵然没有发愿，但只要能认取，与此强烈耀眼的白光合上去，就可与佛光水乳交融，无二无别，当下证成圆满自受用报身。如果你不能认识此光就是你的本性光明，那么就想此光明是金刚萨埵不动如来大悲恩光，应深心祈请，立即皈依，不要逃避。这样金刚萨埵不动如来就会立刻把你从中有险峡道中超拔出来，生到东方现喜刹土得真实受用。至于地狱道不刺眼的烟雾似的光，是由于你的嗔、恚业障深重而显现的，是专门引诱你进入六道轮回的光。所以对于此光你千万不要贪著，不要生欢喜之心，要回避勿视。否则，你就会堕入地狱道而陷入不堪忍受的痛苦之中，永无解脱之日。</p>\n<p>　　所以你要断除嗔、恚之心，应当对强烈耀眼的白色佛光，心生欢喜，至心专注，渴望瞻仰金刚萨埵不动如来双尊，并随我诚心诚意发愿，念诵以下偈文：</p>\n<p>　　呜呼！</p>\n<p>　　嗔恚炽盛 流转生死 大圆镜智 光明照耀</p>\n<p>　　金刚萨埵 导引在前 玛嘛几母 护持于后</p>\n<p>　　祈脱中有 怖畏险峡 送我往登 正觉佛土</p>\n<p>　　(此段偈文的解释请参见本书191页)</p>\n<p>　　你这样至心虔诚发愿，就可以化为虹光融入金刚萨埵不动如来父母双尊胸中，证成报身佛。或者生到东方现喜刹土得真实受用。’</p>\n<p>　　第三日诵法(在亡者死后第七日，此日有佛六尊前来接引。)</p>\n<p>　　又虽已如上指授，然有补特伽罗(即众生之异名)我慢贡高，罪业深重，于大悲光钩，怖而逃避。迨至第三日，则有世尊‘宝生如来’与圣众俱，前来接引；同时又有‘人道’之光，并来现前。其指示法，当呼亡者之名，念诵下文而告之曰：</p>\n<p>　　嗟！善男子(某某)：谛听勿乱！今第三日，有地大黄色净光，来现汝前。尔时，南方黄色‘光荣佛土’(藏文贝登，此云吉祥，或译具德)世尊‘宝生如来’，其身黄色，手持摩尼妙宝，坐宝马宝座，与‘佛眼母’面合交抱，现临汝前：‘虚空藏’‘普贤’二菩萨、与摩梨女鬘都毗女(香女)双尊围绕于虹光曼陀罗海，六尊齐现而来。此为‘受蕴’法尔清净黄光，即‘平等性智’。此光晃耀，严以明点及微光点，自宝生如来父母双尊胸中照临汝前，直射汝心，眩目难睁，不敢逼视；而与此同时，又有‘人道’之淡黄光不眩目者，亦与智光并临汝前，直射汝心。此时汝为‘我慢’业力所制，于彼眩目之黄光，生起惊怖而欲逃避；反于人道不眩目之淡黄光起乐著想、而欲趣入。我今告汝，此时汝于彼晃耀眩目之黄光灿然透明者，勿怖勿畏，不可逃避。彼即汝自内证智本体具足力用，应于光中明了任运、坦然而住，更当于彼信乐渴仰。汝若认知自内证智本体光明，纵欠虔诚发愿，亦得一切诸佛光明与汝融合，无二无别，而证佛位。若不认知为汝自内证智本光，则当对之信乐渴仰而自念言：‘此经是宝生如来大悲恩光’，亟起皈依，深心祈请。自维此即宝生如来大悲光钩，不可逃避。要知汝纵欲逃避，亦与汝身不能分离，故勿怖畏，当欣乐祈请。尔时宝生如来即来接引，拔汝出离中有险峡。又当于彼人道淡黄光勿生欢喜，彼乃为汝‘我慢’炽盛所积习气而来诱引之光，汝若贪著，当堕人道，复受生老病死之苦，沦没于生死泥涂之中，无解脱期，以是障碍，阻解脱道。故当于彼，眼避勿视，断舍我慢，并断习气，及对彼光，勿贪勿著；而于彼灿然眩目之黄光，深生信乐，至心专注，渴仰世尊宝生如来，念诵下偈，随我发如是愿：</p>\n<p>　　呜呼！</p>\n<p>　　我慢炽盛 流转生死 平等性智 光明照耀</p>\n<p>　　宝生如来 导引在前 佛眼佛母 护持于后</p>\n<p>　　祈请度脱 中有险峡 送我往登 正觉佛土</p>\n<p>　　如是至心诚敬发愿，则化虹光，融入宝生如来父母双尊胸中，于南方‘光荣刹土’，证得圆满受用佛身矣。</p>\n<p>　　虽然我们在法性中有时期，为亡者进行了两天的指示，但有些贡高我慢的众生，由于罪业深重，当佛放光来接引时，反而吓得逃避，因而不得解脱。所以等到法性中有时期的第三天，有世尊宝生如来及其圣众前来接引，同时人道之光也来到亡者面前。这时要呼唤亡者的姓名，对亡者进行指示。</p>\n<p>　　‘第三日诵法’内容如下：</p>\n<p>　　‘某某人，请不要散乱，仔细听我为你指示！今天已是法性中有时期的第三天，这一天有自性发出的地大黄色光明在你面前显现。这时南方光荣佛土世尊宝生如来，身体呈黄色，手持摩尼宝珠，坐宝马宝座，和佛眼佛母面合交抱；同时还有虚空藏、普贤两尊菩萨相伴，和摩梨女、香女双尊环绕。以上六尊佛菩萨显现为美妙的虹光曼陀罗，前来接引你。从宝生如来父母双尊胸中放射出的黄色光芒，正是从我们本性中发出的，受蕴清净时所显现的平等性智光。此光非常强烈，绚耀夺目。光中还有无数明点及微光点跳耀闪烁，显现在你面前，直射入你的心中，使你眩目难睁，不敢逼视。在黄色佛光闪耀的同时，人道不剌眼的淡黄色光也来到你面前。因为你被我慢业力牵缠，对佛放射的强烈黄光感到恐惧，甚至逃避。而对人道不剌眼的淡黄色光感到舒服，并想投入。</p>\n<p>　　我现在郑重地告诉你：你不应该害怕、逃避强烈耀眼的黄色佛光，因为此光正是你的本性光明。你应当对此光明深生敬仰、渴望之心，纵然没有发愿，但只要能认取，与此强烈耀眼的黄光合上去，就可与佛光水乳交融，无二无别，当下证成圆满自受用报身。如果你不能认识此光就是你的本性光明，那么就想此光是宝生如来大悲恩光，应深心祈请，立即皈依，不要逃避。这样宝生如来就会立刻把你从中有险峡道中超拔出来，生到南方光荣佛土得真实受用。至于人道不刺眼的淡黄色光，是由于我慢业障深重所显现的，是专门引诱你进入六道轮回的光。所以对此光你千万不要贪著，不要生欢喜之心，要回避勿视。否则，你就会堕入人道，再受生、老、病、死之苦，沉轮于六道轮回之中。</p>\n<p>　　所以我们要断除我慢习气，应当对强烈耀眼的黄色佛光，心生欢喜，至心专注，渴望瞻仰宝生如来父母双尊，并随我诚心诚意发愿，念诵以下偈文：</p>\n<p>　　呜呼！</p>\n<p>　　我慢炽盛 流转生死 平等性智 光明照耀</p>\n<p>　　宝生如来 导引在前 佛眼佛母 护持于后</p>\n<p>　　祈请度脱 中有险峡 送我往登 正觉佛土</p>\n<p>　　(此段偈文的解释请参见本书192页)</p>\n<p>　　这样至心虔诚发愿，就可以化为虹光融入宝生如来父母双尊胸中，证成报身佛。或者生到南方光荣佛土得真实受用。’</p>\n<p>　　第四日诵法(在亡者死后第八日，此日有佛六尊前来接引)</p>\n<p>　　如上指示，纵其根器如何下劣，亦必解脱无疑。然有曾造大罪之人、及失坏三昧耶戒等、或断善根之类，迄尚不能认取者，遂为‘贪欲’及罪障所制，对于‘声’‘光’，怖而逃避，则第四日有世尊‘无量光如来’(即阿弥陀佛)圣众，及由‘贪’‘悭’所酿成‘饿鬼道’之暗红光，同时并来现前。其指示法，当呼亡者之名，念诵下文而告之曰：</p>\n<p>　　嗟！善男子(某某)：谛听勿乱！今第四日，有‘火大’红色净光，起现汝前，尔时西方红色‘极乐刹土’‘世尊无量光如来’，其身红色，手执莲华，坐孔雀宝座，与‘白衣母’面合交抱，现临汝前，‘观自在’‘妙吉祥’二菩萨与‘吉地女’(歌女)‘阿洛哥女’(灯女)双尊围绕于虹光曼陀罗海，六尊齐现而来。此为‘想蕴’法尔清净红光，即‘妙观察智’。此光晃耀，严以明点及微光点，眩目难睁，自无量如来父母双尊胸中，照临汝前，直射汝心，不敢逼视，汝当对之，勿生怖畏；而与此同时，又有‘饿鬼道’暗淡红光不眩目者，亦与智光并来照临，当于其光，勿生欢喜，亦勿贪著。尔时，汝为‘贪欲’炽盛业力所制，于彼眩目之红光，生起怖畏而欲逃避；反于‘饿鬼道’暗淡红之光不眩目者，起乐著想、而欲趋入。我今告汝，此时汝当于彼晃耀眩目之红光灿然透明者，勿怖勿畏，不可逃避。彼即汝自内证智本体具足力用，应于光中，明了任运，坦然而住，更当于彼信乐渴仰。汝若认知自内证智本体光明，纵欠虔诚发愿，亦得一切诸佛光明与汝融合，无二无别，而证佛位。若不认知为汝自内证智本光，则当对之信乐渴仰而自念言：‘此是无量光如来大悲恩光’，亟起皈依，深心祈请，自维此即无量光如来大悲光钩，不可逃避。要知汝纵欲逃避，亦与汝身不能分离，故勿怖畏，当欣乐祈请。尔时无量光如来即来接引，拔汝出离中有险峡。又当于彼饿鬼道暗淡红光不眩目者，勿得贪著。彼乃为汝‘贪欲’炽盛所积习气而来诱引之光，汝若贪著，即堕饿鬼道，而受极难堪忍饥渴之苦，以是障碍，阻解脱道。故当于彼，勿生贪著，断除习气，勿起爱恋；而于灿然眩目之红光，对之生起欣乐，专注渴仰世尊无量光如来父母双尊，念诵下偈，随我发如是愿：</p>\n<p>　　呜呼！</p>\n<p>　　贪欲炽盛 流转生死 妙观察智 光明照耀</p>\n<p>　　无量光佛 导引在前 白衣佛母 护持于后</p>\n<p>　　祈脱中有 怖畏险峡 送我往登 正觉佛土</p>\n<p>　　如是诚敬殷重发愿，则化虹光，融入世尊无量光如来父母双尊胸中，于西方‘极乐刹土’证得圆满受用佛身矣。</p>\n<p>　　经过上述指示，既使是下下根器也应该得到解脱。但仍有一些罪大恶极之人，或者破坏戒律，或者缺少善根，因贪欲炽盛，虽经指示，仍然不能认取明光，得不到解脱。到第四日有世尊无量光如来(即阿弥陀佛)及其圣众，和由于贪、悭所变现的饿鬼道暗红色光，同时在亡者面前显现。这时应当呼亡者姓名，对亡者进行指示。</p>\n<p>　　‘第四日诵法’内容如下：</p>\n<p>　　‘某某人，请不要散乱，仔细听我为你指示！今天是法性中有时期的第四天，这一天有从自性发出的火大红色光明在你面前显现。这时，西方极乐刹土世尊无量光如来，身体呈红色，手执莲花，坐孔雀宝座，和白衣佛母面合交抱；同时还有观自在、妙吉祥两尊菩萨相伴，和歌女、灯女双尊环绕。以上六尊佛菩萨显现为美妙的虹光曼陀罗前来接引你。从无量光如来父母双尊胸中放射出红色的光芒。此光明正是从我们本性中发出的，想蕴清净时所显现的妙观察智光明。此光非常强烈，绚耀夺目。光中还有无数明点及微光点跳耀闪烁，显现在你面前，直射入你的心中，使你眩目难睁，不敢逼视。在红色佛光显现的同时，饿鬼道不剌眼的暗淡红光也来到你面前。因为你贪欲炽盛，受此业力牵缠，对于佛放射的强烈红光感到恐惧，甚至逃避。而对饿鬼道不刺眼的暗淡红光感到舒服，并想投入。</p>\n<p>　　我现在郑重的告诉你：你不应该害怕、逃避强烈耀眼的红色佛光，因为此光正是你的本性光明。你应当对此光明深生敬仰、渴望之心，纵然没有发愿，但只要能认取，与此强烈耀眼的红光合上去，就可与佛光水乳交融，无二无别，当下证成圆满自受用报身。如果你不能认识此光明就是你的本性光明，那么就想此光明是无量光如来大悲恩光，应深心祈请，立即皈依，不要逃避。这样无量光如来就会立刻把你从中有险峡道中超拔出来，生到西方极乐刹土得真实受用。至于饿鬼道不剌眼的暗淡红光，是由于你贪欲炽盛所化，是专门引诱你堕入饿鬼道的光。对于此光你千万不要贪著，不要生欢喜之心，要回避勿视。否则，你就会堕入饿鬼道，饱尝难以忍受的饥渴之苦而不得解脱。</p>\n<p>　　所以我们要断除贪、悭之心，应当对强烈耀眼的红色佛光，心生欢喜，至心专注，渴望瞻仰无量光如来父母双尊，并随我诚心诚意发愿，念诵以下偈文：</p>\n<p>　　呜呼！</p>\n<p>　　贪欲炽盛 流转生死 妙观察智 光明照耀</p>\n<p>　　无量光佛 导引在前 白衣佛母 护持于后</p>\n<p>　　祈脱中有 怖畏险峡 送我往登 正觉佛土</p>\n<p>　　(此段偈文的解释请参见本书193页)</p>\n<p>　　这样至心虔诚发愿，就可以化为虹光，融入无量光如来父母双尊胸中，证成报身佛。或者生到西方极乐刹土，得真实受用。’</p>\n<p>　　第五日诵法(在亡者死后第九日，此日有佛六尊前来接引。)</p>\n<p>　　如上指示、纵其根器如何下劣，未有不解脱者。又虽已指示，而有一类有情，久狃结习，终为强盛之习气所制，不能克服，而为‘嫉妒’恶业支配，于‘声’及‘光’生起恐惧，大悲光钩，未能认取。迄至第五日间，仍复飘泊无依。尔时有世尊‘不空成就如来’圣众大悲恩光前来接引；同时又有‘嫉妒’烦恼所感‘阿修罗道’之光，亦来诱引。此时指授之法，当呼亡者之名，念诵下文而告之曰：</p>\n<p>　　嗟！善男子(某某)：谛听勿乱！今第五日，有‘风大’绿色净光，来现汝前。尔时，北方绿色‘胜圆刹土’世尊‘不空成就如来’，其身绿色，手执交叉金刚杵，坐大鹏宝座，与‘三昧耶多罗母’(即绿度母)面合交抱，现临汝前；‘金刚手’‘除盖障’二菩萨与‘健第女’(涂女)‘尼得女’(食女)双尊围绕于虹光曼陀罗海，六尊齐现而来。此为‘行蕴’法尔清净绿光，即‘成所作智’。此光晃耀，严以明点及微光点，眩目难睁，自不空成就如来父母双尊胸中，照临汝前，直射汝心，不敢逼视；而与此同时，又有‘阿修罗道’暗绿光、乃‘嫉妒’为因所成不眩目之光，亦与智光并临汝前。汝当对之勿生爱憎而修等舍(安住于非苦非乐之境，谓之等舍。)；并当对之不可欢喜。尔时，汝为嫉妒炽盛业力所制，于彼眩目之绿光，惧而逃避；反于阿修罗道不眩目之暗绿光起乐著想，而欲趋入。我今告汝、此时汝当于彼晃耀眩目之绿光灿然透明者，勿怖勿畏，不可逃避。彼即汝自内证智本体具足力用，应于光中，明了任运，坦然而住，更当于彼信乐渴仰。汝若认知自内证智本体光明，纵欠虔诚发愿，亦得一切诸佛光明，与汝融合，无二无别，而证佛位。若不认知为汝自内证智本光，则当对之信乐渴仰，而自念言：‘此是不空成就如来大悲恩光’，亟起皈依，深心祈请，自维此即不空成就如来大悲光钩，不可逃避。要知汝纵欲逃避，亦与汝身不能分离，故勿怖畏，当欣乐祈请。尔时，不空成就如来即来接引拔汝出离‘中有险峡’。又当于彼阿修罗道不眩目之暗绿光，勿生贪著。彼乃汝嫉妒炽盛所积业力而来诱引之光，汝若贪著，则堕阿修罗道，感极难忍受斗争之苦，以是障碍，阻解脱道。故当于彼，断除习气，勿贪勿著；而于晃耀眩目之绿光、生起信乐，专注渴仰世尊不空成就如来父母双尊，念诵下偈，随发如是愿：</p>\n<p>　　呜呼！</p>\n<p>　　嫉妒炽盛 流转生死 成所作智 光明照耀</p>\n<p>　　不空如来 导引在前 三昧耶母 护持于后</p>\n<p>　　祈脱中有 怖畏险峡 送我往登 正觉佛土</p>\n<p>　　如是虔诚殷重发愿，则化虹光，融入世尊‘不空成就如来’父母双尊胸中，即于北方‘胜园刹土’，现证圆满受用身而成佛矣。</p>\n<p>　　经过上述指示，即使是下下根人，也应当得到解脱。但有一些人，因争强好盛，恶习难改，受嫉妒恶业支配，对声、光、辉感到恐惧，对佛菩萨的救度不能认取。到法性中有时期的第五天，仍然飘泊无依。于是，这一天有世尊不空成就如来及其圣众放光前来接引，同时由嫉妒烦恼所感的阿修罗道暗绿色光也前来引诱。这时应呼唤亡者姓名，对亡者进行指示。</p>\n<p>　　‘第五日诵法’内容如下：</p>\n<p>　　‘某某人，不要散乱，请仔细听我为你指示！现在你正处在法性中有时期的第五天，这一天有自性发出的风大绿色光明在你面前显现。这时北方胜圆刹土世尊不空成就如来，身体呈绿色，双手各持一金刚杵交叉胸前，坐大鹏宝座，和三昧耶多罗母(即绿度母)，面合交抱；同时还有金刚手、除盖障两尊菩萨相伴，和涂女、食女双尊环绕。以上六尊佛菩萨显现为美妙的虹光曼陀罗前来接引你。从不空成就如来父母双尊胸中放射出的绿色光芒，正是从我们本性中发出的，行蕴清净时所显现的成所作智光明。此光非常强烈，绚耀夺目。光中有无数明点及微光点跳跃闪烁，显现在你面前，直射入你的心中，使你眩目难睁，不敢逼视。在绿色佛光闪耀的同时，阿修罗道不剌眼的暗绿色光也来到你的面前。你由于嫉妒心重，受此业力牵缠，对于佛放射的强烈绿光感到恐惧，甚至逃避。而对于阿修罗道不剌眼的暗淡绿光感到舒服，并想投入。</p>\n<p>　　我现在郑重的告诉你：你不应当害怕、逃避强烈耀眼的绿色佛光，因为此光正是你的本性光明。你应当对此光明深生敬仰、渴望之心，纵然没有发愿，但只要能认取，与此强烈耀眼的绿光合上去，就可与佛光水乳交融，无二无别，当下证成圆满自受用报身。如果你不能认识此光就是你的本性光明，那么就想此光明是不空成就如来大悲恩光，应深心祈请，立即皈依，不要逃避。这样不空成就如来就会立刻把你从中有险峡道中超拔出来，生到北方胜园刹土得真实受用。至于不剌眼的暗淡绿光，是由于你嫉妒炽盛所化，是专门引诱你堕入阿修罗道的光。对于此光你千万不要贪著，不要生欢喜之心，要回避勿视。否则你就会堕入阿修罗道而受无休无止的争斗之苦，不得解脱。</p>\n<p>　　所以我们要断除嫉妒之心，应当于强烈耀眼的绿色佛光，心生欢喜，至心专注，渴望瞻仰不空成就如来父母双尊，并随我诚心诚意发愿，念诵以下偈文：</p>\n<p>　　呜呼！</p>\n<p>　　嫉妒炽盛 流转生死 成所作智 光明照耀</p>\n<p>　　不空如来 导引在前 三昧耶母 护持于后</p>\n<p>　　祈脱中有 怖畏险峡 送我往登 正觉佛土</p>\n<p>　　(此段偈文的解释请参见本书195页)</p>\n<p>　　这样至心虔诚发愿，就可以化为虹光融入不空成就如来父母双尊胸中，证成报身佛。或者生到北方胜园刹土得真实受用。’</p>\n<p>　　第六日诵法(在亡者死后第十日，此日共有佛四十二尊俱来接引)</p>\n<p>　　上来五日，经已多次指示，纵福缘如何薄劣，初次未能认取，再次亦当认取，只须认取其一，而未有不解脱者。然亦有如是指授多次，以习气深重，长夜伴随，净相智慧，向未熟稔，为业支配，虽得指认，仍为邪恶习气引导于外，大悲光钩，不能摄引，于‘光’及‘辉’，生起怖畏，复沦生死。则于第六日，复有五部如来父母双尊与眷属俱，一时齐现于前，其时六道之光，亦齐现前。其指示法，当呼亡者之名，念诵下文而告之曰：</p>\n<p>　　嗟！善男子(某某)：谛听勿乱！迄至昨日，五部如来，各现其相，虽已指示，而汝为恶习所牵，于彼起怖，故迄今日，仍留于此。汝先若能于五部如来智慧本光，识为本体境相，则于五部各佛身中，早已化为虹光，汝已成为圆满受用佛身。以汝无知，故今仍复漂泊于此，故当谛实观察，勿得散乱。今有五部如来具足境相，名为‘四智和合之光’，前来迎汝，当认取之。</p>\n<p>　　嗟！善男子：四大清净四色之光，今来现前。此时，中央‘密严刹土’‘毗卢遮那’父母双尊及与眷属，俱来现前；东方‘现喜刹土’‘金刚萨埵’父母双尊及与眷属，俱来现前；南方‘光荣刹土’‘宝生’父母双尊及与眷属，俱来现前；西方‘极乐刹土’‘无量光’父母双尊及与眷属，俱来现前；北方‘胜圆刹土’‘不空成就’父母双尊及与眷属，俱从虹光曼陀罗海，来现汝前。</p>\n<p>　　嗟！善男子：此五部双尊之外，又有四门守护明王：即‘降三世明王’‘大威德’‘马头’‘<a href=\"/remen/ganlu.html\" class=\"keylink\" target=\"_blank\">甘露</a>军茶利’等四大明王；及四门守护明妃：所谓持‘钩’女、持‘索’女、持‘锁’女、持‘铃’女；及天道之佛‘帝释’、阿修罗道佛‘诤心’(梵名毗摩罗质多。藏名塔桑日。或译净心。)、人道佛‘释迦狮子’、傍生道佛‘狮子善住’、饿鬼道佛‘焰口’、地狱道佛‘法王’等诸佛世尊，六道六佛，俱来现前；又有‘普贤如来’‘普贤佛母’，即诸佛之祖普贤父母双尊(详附注六)，亦来现前。以上共有报身佛四十二尊，自汝心内外出，来现汝前。此皆为汝本来清净境中之所显现，当认取之。</p>\n<p>　　［附注六：普贤如来，<a href=\"/remen/fanyin.html\" class=\"keylink\" target=\"_blank\">梵音</a>阿达尔嘛，义为无生法尔。藏文转音滚都桑波，为原始法身如来。(释迦佛为原始如来之应化身)谓法身本自如如，智德圆满，周遍法界，超思量，离言诠，无始无终，非修非证，现双身一丝不挂相，故有普贤佛母。西藏宁玛派九乘教义，奉为最高无上之尊。在本经中，居寂静部四十二尊之上首，即为普贤父母双尊，故称为诸佛之祖。又在本经前面‘明光直指’教授中，有‘法性普贤父母’及‘证智普贤如来’句，即可略明此双尊‘法性’及‘证智’之功用，与吾人本为一体，不可分离。此中义理，非深明西藏无上密义者，不能了解。惟因此尊之名号，为我汉地人所不习见，又因‘普贤’二字与八大菩萨中之普贤菩萨同一名号，恐为人疑误，故附注于此。］</p>\n<p>　　嗟！善男子：此诸刹土，亦非他有，乃汝自心四方与中央本来具足者，今自汝心，出现于外，现临汝前。彼诸佛身，亦非他来，乃汝自内证智本具力用，法尔所成，故当如是而认取之。</p>\n<p>　　嗟！善男子：彼诸佛身，亦复不大不小，形量相等，严具形色，坐势宝座，各具标帜。彼诸佛身，共成五聚，皆为双身；每聚周围，各具五色光辋；其中男尊，即为双持部之菩萨；女尊，即为双持部之明妃。如是形成整个曼陀罗，一时俱集，圆现汝前；此即与汝相依为怙之本尊也，汝当认取。</p>\n<p>　　嗟！善男子：从此五部如来父母双尊身中，流出四智和合之光，极为微妙；犹如日光眩耀，照临汝心，来现汝前。</p>\n<p>　　此中初自‘毗卢遮那’胸中，放射‘法界体性智’光，显为蓝色，晃耀眩目，有一光台，照触汝心，合而为一；其光台上蓝色明点，与光同俱；如覆翠盖，灿然眩目。其上亦以自性明点，各五为饰，无有边中，严以明点及微光点，来现汝前。</p>\n<p>　　自‘金刚萨埵’胸中，放射‘大圆镜智’光，显为白色；光台之上，白色明点，如覆明镜，严以明点及微光点，来现汝前。</p>\n<p>　　自‘宝生’胸中，放射‘平等性智’光，显为黄色；光台之上，黄色明点如覆金盏，严以明点及微光点，来现汝前。</p>\n<p>　　自‘无量光’胸中，放身‘妙观察智’光，显为红色；光台之上，红色明点，如覆珊瑚宝盖，严以明点及微光点，来现汝前。以上四佛智光之底，光彩具足，极为显明，眩目难睁；亦由自性明点，各五为饰，无有边中；遍严明点及微光点，悉与法界体性智光相同，此所显现，与汝自心，密切联系，和合相应，自然而来起现也。</p>\n<p>　　嗟！善男子：彼等诸光，皆汝自内证智，本体具足力用所现，非从外来；故当于彼，无碍印合，亦勿惊怖，摄心入定，于无分别中，坦然而住，即此状中，诸佛之身光与汝身融合为一而成佛矣。</p>\n<p>　　嗟！善男子：此中独无成所作智之佛光照临于汝者，以汝自内证智力用未圆，故不显现。</p>\n<p>　　嗟！善男子：此即所谓‘四智和合之光’，亦名‘金刚萨埵四密孔道’。此时汝当忆念往昔上师指授语诀，若能忆及所指授义，即于当前境界，生起信乐；犹如母子会遇，亦如亲旧故知，先已熟谂，今又相逢，立即认取，无可疑虑；于自己本体境相，认为本来面目，信为清净法性无可转变之正道，生起‘恒流三摩地’，融为证智大任运身，依受用报身而证佛位，永不退转。</p>\n<p>　　嗟！善男子：与智光同时，又有不净迷幻境相六道六光，亦来现前；所谓‘天道’白光不眩目者，‘阿修罗道’暗绿光不眩目者，‘人道’淡黄光不眩目者，‘傍生道’呆蓝光不眩目者，‘饿鬼道’呆红光不眩目者，‘地狱道’烟灰色光不眩目者，此六道之光，亦与智光并来现前。尔时，汝于其光，皆无取著，于无所缘中，坦然安住。汝若于彼清净智光，生起怖畏，而于不净轮回六道之光，起贪著者，当受六道众生之身，疲疗生死大苦海中，无解脱期。</p>\n<p>　　嗟！善男子：汝若未得上师教诫所指示者，于前所说佛身及清净光，恐惧怖畏，而于不净轮回之光，反而生起爱恋。今勿如是！应于清净智光，晃耀眩目者，恭敬信乐，而自念言：‘世尊五部如来大悲智光，乃为哀愍摄受于我而现在前，亟当皈依’。对于迷幻境相六道之光，勿贪勿著，至心专注渴仰世尊五部如来父母双尊，念诵下偈，随我发如是愿：</p>\n<p>　　呜呼！</p>\n<p>　　五毒炽盛 流转生死 四智和合 光明照耀</p>\n<p>　　五部如来 导引在前 五部明母 护持于后</p>\n<p>　　脱离六道 不净幻光 度我中有 怖畏险峡</p>\n<p>　　送我往登 五清净土</p>\n<p>　　如是发愿念诵，认识本体境相，即可无二交融而成佛矣。中根之人，虔敬殷重，自认取已，即得解脱；下根之人，则于清净誓愿之力，断绝六趣生门，悟解四智和合实境，于‘金刚萨埵’密孔道中，而成佛道。</p>\n<p>　　亡者经过法性中有前五天的多次指示，纵然福薄根劣，只要在这些指示中能认取一次，就可以获得解脱。然而有些人习气深重，如漫漫长夜，智慧之灯难以点燃；如乌云遮日，虽经多次指示，仍然为邪恶习气所支配。对佛光产生怖畏而得不到解脱。这样到法性中有时期的第六天，又有五部如来父母双尊及其圣众，共四十二尊佛菩萨一齐在亡者面前显现。同时六道劣光也一齐出现在亡者面前。这时应当呼唤亡者姓名，对亡者进行指示。</p>\n<p>　　‘第六日诵法’内容如下：</p>\n<p>　　‘某某人，请不要散乱，仔细听我为你指示！直到昨天，分别有五部如来双尊以不同形像显现在你面前，我已为你指示。如果于其中任何一尊你能皈依认取，即可化为虹光证得圆满自受用报身。但由于你为恶业所牵，对这些佛菩萨双尊形像产生恐惧而逃避，所以直到今天仍然未能得到解脱。现在你应当注意：今天有五部如来双尊及其圣众放射出四智合和之光，前来接引，不要再错过时机，一定要与光明合上去。</p>\n<p>　　某某人，今有四大清净四色之光现前。此时中央密严刹土毗卢遮那父母双尊及其眷属，东方现喜刹土金刚萨埵父母双尊及其眷属，南方光荣刹土宝生父母双尊及其眷属，西方极乐刹土无量光父母双尊及其眷属，北方胜圆刹土不空成就父母双尊及其眷属，前来接引。除此之外，还有四门守护明王：即降三世明王、大威德明王、马头明王、甘露军茶利明王；和四门守护明妃：即持钩女、持索女、持锁女、持铃女；和主持六道的六佛：即天道之佛帝释、阿修罗道之佛诤心、人道之佛释迦狮子、傍生道之佛狮子善住、饿鬼道之佛焰口、地狱道之佛法王；和诸佛之祖：普贤如来、普贤佛母双尊，一齐前来。以上共有报身佛四十二尊，汇聚成虹光曼陀罗显现在你的面前。</p>\n<p>　　某某人，以上所说的这些形像都是佛性(自性、法身)的妙用。东、南、西、北、中五方佛土，并非离开你的自性而另有方所。因为你的自性本来具足一切方位；这些报身佛也不是外来的，都是你自性的显现。从佛心中放射出的光芒，正是你心清净时才能见到的本性光明。你不要怀疑，一定要认取，与本性光明合上去，即可证成报身佛。</p>\n<p>　　某某人，以上四十二尊佛菩萨中的五方五佛。都是佛父佛母双尊齐现。其中男尊为双持部菩萨，女尊为双持部明妃。每尊佛身大小完全相等，但各有不同颜色，都坐在宝座上，手拿不同法器，各具不同标帜。在每一方佛父佛母双尊周围都有五色光辋，光光相映。如此形成一个美妙的虹光曼陀罗显现在你面前。这就是你可以依靠的，应当皈依的本尊。</p>\n<p>　　某某人，从上述五部如来父母双尊胸中，放射出极为微妙的四智和合之光，犹如日光眩耀，显现在你面前，直射入你的心中：</p>\n<p>　　从毗卢遮那如来胸中，放射出蓝色的法界体性智光，明亮耀眼。其放光处恰似一个光台，光台之上有许多蓝色明点和微光点，如覆翠盖，灿烂眩目。这些明点五个五个连在一起，无边无际，在你面前显现。</p>\n<p>　　从金刚萨埵如来胸中，放射出白色的大圆镜智光，明亮耀眼。光台之上有许多白色明点和微光点，如覆明镜。</p>\n<p>　　从宝生如来胸中，放射出黄色的平等性智光，明亮耀眼。光台之上有许多黄色明点和微光点，如覆金盏。</p>\n<p>　　从无量光如来胸中，放射出红色的妙观察智光，明亮耀眼。光台之上有许多红色明点和微光点，如覆珊瑚宝盖。</p>\n<p>　　以上所说四智和合之光，又叫‘金刚萨埵四密孔道’这四智之光，光彩具足，非常明亮，令人眩目难睁。光中明点，五个五个连接在一起，无边无际。这些光明都是从你的自性中发出的，是你的心与佛的心和合相应之时，自然而然起现的，这些光明并非离开你的自心从外而来。所以，对此光明，你要勿惊勿怖，摄心入定，坦然而住。你应与诸佛之光合而为一，这样即可与佛水乳交融而成就报身佛。</p>\n<p>　　某某人，今日佛光之中唯独没有成所作智之光，这是因为你的觉行不圆，所以没有显现。</p>\n<p>　　某某人，在此关键时刻，你应当回忆往昔上师对你的教诲。如果这时你能记忆上师指授之义，就会对当前的境相欢欣喜悦，生起信心。因为你早已熟悉，今又相逢，犹如遇见亲旧故知；又如母子相遇，会毫无疑虑，立即认取：这就是我自己的本来面目，这就是清净法身！于是，你就会生起正定，义无反顾与光明融为一体，证得自受用报身而成佛。</p>\n<p>　　在四智之光照射的同时，不剌眼的六道六光也显现在你面前。你应注意，这些不剌眼的六道之光，是你心不清净时显现的迷乱幻境，是专门引诱你堕入六道轮回的光。这六道之光就是：天道不剌眼的白光，阿修罗道不剌眼的暗绿光，人道不剌眼的淡黄色光，傍生道不剌眼的呆蓝光，饿鬼道不剌眼的呆红色光，地狱道不剌眼的烟雾似的光。这时，如果你对此六道之光生欢喜贪著之心，而对耀眼的四智之光产生恐惧，那么你就会受生六道，在生死苦海中轮回，永无解脱。所以对此六道六光你应勿贪勿著，对四智之光应发永远皈依之心。</p>\n<p>　　某某人，如果你没有得到过上师的教导，现在又不听我的指示，你就会对佛的双身相和清净智光产生恐惧，对不剌眼的六道轮回之光反生贪恋之心，这样你就会堕入六道轮回而饱受诸种苦难，得不到解脱。所以，对不剌眼的六道之光你应该回避勿视，对耀眼灿烂的四智之光应恭敬信乐。并想：‘这就是世尊五部如来为了哀愍我，为了接引我而显现的大悲恩光，我应立即皈依’。现在，你应当专心致志，渴望瞻仰五部如来父母双尊，并随我诚心诚意发愿，念诵以下偈文：</p>\n<p>　　呜呼！</p>\n<p>　　五毒炽盛 流转生死 四智和合 光明照耀</p>\n<p>　　五部如来 导引在前 五部明母 护持于后</p>\n<p>　　脱离六道 不净幻光 度我中有 怖畏险峡</p>\n<p>　　送我往登 五清净土</p>\n<p>　　(此段偈文的解释请参见本书197页，虽然文字略有增加，但意思基本一致)。</p>\n<p>　　这样至心虔诚发愿，中根之人即可当下认取本体境相而得解脱。下根之人借此清净誓愿之力，也可断绝六道生门，认取四智合和之光，于‘金刚萨埵四密孔道’中成佛。</p>\n<p>　　第七日诵法(在亡者死后第十一日，此日有持明十佛前来接引。)</p>\n<p>　　复次，如是详明指示，由此认识而得解脱者，为数极多。然有下下根器，其在人间，对于正法，素未薰习，有大罪障，及失坏三昧耶等人，为业力迷惑，虽有指示，亦不认取，终仍漂转。兹第七日，有‘清净空行刹土’‘持明部’圣众，前来接引。尔时，为烦恼愚痴所酿成之‘傍生道’光，亦来诱引。</p>\n<p>　　嗟！善男子(某某)：谛听勿乱！兹第七日，有法尔清净杂色光明，起现于前；此时‘清净空行刹土’‘持明’诸尊圣众，前来接引，融为虹光曼陀罗海。</p>\n<p>　　曼陀罗中央‘异熟无上持明’名‘莲华舞自在’，其身具五光绚彩；明妃‘红色智慧空行’，拥抱尊身；右持弯刀，左持注满血液之颅器，而作舞式；以瞪视印相，注目虚空，来现汝前。</p>\n<p>　　曼陀罗东，‘地居持明’，其身白色，微含笑容，明妃‘白色空行’，拥抱尊身；右持弯刀，左持注满血液之颅器，而作舞式；以瞪视印相，注目虚空，来现汝前。</p>\n<p>　　曼陀罗南，‘寿自在持明’，其身黄色，妙好庄严，明妃‘黄色空行’，拥抱尊身；右持弯刀，左持注满血液之颅器，而作舞式；以瞪视印相，注目虚空，来现汝前。</p>\n<p>　　曼陀罗西，‘大手印持明’，其身红色，微含笑容；明妃‘红色空行’，拥抱尊身；右持弯刀，左持注满血液之颅器，而作舞式；以瞪视印相，注目虚空，来现汝前。</p>\n<p>　　曼陀罗北，‘任运持明’，其身绿色，半怒半笑容，明妃‘绿色空行’，拥抱尊身；右持弯刀，左持注满血液之颅器，而作舞式；以瞪视印相，注目虚空，来现汝前。</p>\n<p>　　此诸持明之外围，有无量空行天母会集；所谓八大尸林空行，四种姓空行，三居处空行，十居处空行，二十四境空行母等，以及勇男、勇女、矜羯罗、护法使者众俱；彼诸一切，悉著六骨骼之衣，腿骨号筒，颅骨小鼓，罗刹皮幢，人皮幡盖，人皮旗帜，人脂香膏，种种乐器，为数无量；一切世界，充填血满，震天撼地，俱来现前，一切乐声，亦复震脑欲裂，喧闹而来，作种种舞蹈。亡人三昧耶具足者，则来迎接；三昧耶失坏者，则来惩诫。</p>\n<p>　　嗟！善男子：习气法尔清净俱生智光，具足五色，如五彩线，荡漾天际，闪烁动摇，灿烂透明，惊眩夺目；从五部持明部主胸间，直射汝心，不敢逼视，现在汝前；而与此同时，又有‘傍生道’蓝色不眩目之光，亦与智光，俱来现前。尔时，汝为习气所感，迷幻境相所牵，于彼所具五色之光，惧欲逃避；反于‘傍生道’不眩目之光，生起爱著，而欲趋入。然汝于彼所具五色眩目之光，勿得惊怖！当认为智光；于其光中，所发一切诸法自性本声，犹如千雷一时俱鸣，轰声震撼，啸吟洪厉，杂以忿怒咒声，俱来现前。汝于此境，当勿生怖！勿避勿惧！当即认取，为汝本来境相证智力用。而于‘傍生道’不眩目之蓝光，勿贪勿著；苦生贪著，汝当堕落愚痴‘畜道’，而受愚暗无知驱役之苦，永无出期；故于其光，勿得贪著！当于五色具足之光，灿明眩目者，生起欣乐，一心专注谛求，渴仰世尊持明阿阇黎众！当自念云：</p>\n<p>　　‘持明圣众，勇士空行，诸圣尊前，今为接引，入彼清净空行居处，来住我前；祈诸圣尊，愍垂听许，如我有情，未积资粮，过去已有，三世如来，五部圣众，以大悲光，来摄受我，惜我无知，未能认取，蹉跎至今，诚堪嗟叹！兹当持明诸圣尊前，恳求今后，万勿舍我！愿以悲钩，摄受于我！引我往生净空行刹’</p>\n<p>　　如是专注谛求，念诵下偈，随我发如是愿：</p>\n<p>　　呜呼！</p>\n<p>　　持明圣众 幸垂听许 请运悲心 导入正路</p>\n<p>　　习气炽盛 流转生死 俱生智慧 光明照耀</p>\n<p>　　勇士持明 导引在前 空行佛母 护持于后</p>\n<p>　　祈脱中有 怖畏险峡 送我往登 正觉佛土</p>\n<p>　　如上虔诚殷重发愿，则化虹光，融于‘持明’部众胸中，当生‘清净空行刹土’，无可置疑；诸有一切善知识种姓，唯依上文之指示，而认取之，即可解脱，纵有恶业习气，亦定解脱。</p>\n<p>　　以上为‘死位中有’明光直指教授，及‘法性寂相中有教授听闻解脱密法’，全文已竟。</p>\n<p>　　经过法性中有前六天的详细指示，可以认识自性光明而得到解脱的人为数极多。但还有一些下下根人，在世时从未修习过正法，并且破坏戒律，罪障很大。这些人被业力迷惑，虽然经过前六天指示仍然不能认取，还在到处漂泊。如今到了法性中有时期的第七天，有清净空行刹土持明部圣众前来接引。同时，由于烦恼愚痴所造成的傍生道光也来引诱。所以此时当对亡者继续进行指示。</p>\n<p>　　‘第七日诵法’内容如下：</p>\n<p>　　‘某某人，请不要散乱，仔细听我为你指示！今天是法性中有时期的第七天，这一天有清净空行刹土持明部诸尊及其圣众，放射出本性清净杂色光明，汇聚成虹光曼陀罗前来接引你。在此曼陀罗中央，有异熟无上持明，名为莲花舞自在，其身放出五彩绚烂之光。明妃红色智慧空行拥抱尊身，右手持弯刀，左手持注满血液之颅器，作舞蹈状，以瞪视印相，注目虚空，在你面前显现。</p>\n<p>　　在曼陀罗东方，有地居持明，其身体呈白色，微含笑容。明妃白色空行，拥抱尊身，右手持弯刀，左手持注满血液之颅器，作舞蹈状，以瞪视印相，注目虚空，在你面前显现。</p>\n<p>　　在曼陀罗南方，有寿自在持明，其身体呈黄色，相好庄严。明妃黄色空行，拥抱尊身，右手拿弯刀，左手拿注满血液之颅器，作舞蹈状，以瞪视印相，注目虚空，在你面前显现。</p>\n<p>　　在曼陀罗西方，有大手印持明，其身体呈红色，微带笑容。明妃红色空行，拥抱尊身，右手拿弯刀，左手拿注满血液之颅器，作舞蹈状，以瞪视印相，注目虚空，在你面前显现。</p>\n<p>　　在曼陀罗北方，有任运持明，其身体呈绿色，半怒半笑容。明妃绿色空行，拥抱尊身，右手拿弯刀，左手拿注满血液之颅器，作舞蹈状，以瞪视印相，注目虚空，在你面前显现。</p>\n<p>　　在上述东、南、西、北、中持明的外围，还有无数空行天母会集：即八大尸林空行母，四种姓空行母，三居处空行母，十居处空行母，二十四境空行母等。还有勇男、勇女、矜羯罗和护法使者，他们都穿的是用六骨骼做的衣服；拿著腿骨做的号筒，颅骨做的小鼓等各种乐器；举著罗刹皮幛，人皮幡盖，人皮旗帜，人脂香膏等，作种种舞蹈，为数无量。整个世界充满血腥，一切乐声震天撼地，震脑欲裂，喧闹而来。如果亡者具足戒行，持明部圣众则来迎接，反之，则进行处罚。</p>\n<p>　　某某人，我们的本性光明，具足五色，从五部持明部主胸中发出，犹如五彩线，在天际荡漾，光辉灿烂，惊眩夺目，直射入你的心中。这时，有傍生道蓝色不剌眼之光，也一齐在你面前显现。由于习气所感，你被迷乱幻境所牵，对于五彩眩目之光，害怕逃避。而对傍生道不剌眼之光，反生贪爱之心，准备投入。某某人，你不应当逃避五彩眩目之光，要知道这正是你的本性光明。在此光中发出的法性本声，犹如千雷一时齐鸣，轰声震撼。其间夹杂忿怒咒音，啸吟洪厉。要知道，这些声音就是从我们本性中发出的法音，这些境相就是我们本性的显现，并非外来。所以当我们听见这些声音时，千万不要害怕，不要逃避，要能认取。对于傍生道不剌眼的蓝光，应勿贪勿著。一旦贪著，就会堕落到愚痴畜牲道，饱受愚暗无知的驱役之苦，永无出头之日。因此，对五彩绚烂之光，应心生欣乐，专心致志渴仰持明诸圣尊。并念诵下文：</p>\n<p>　　持明圣众，勇士空行，诸圣尊前，今为接引，入彼清净空行居处，来住我前；祈诸圣尊，愍垂听许，如我有情，未积资粮，过去已有，三世如来，五部圣众，以大悲光，来摄受我，惜我无知，未能认取，蹉跎至今，诚堪磋叹！兹当持明诸圣尊前，恳求今后，万勿舍我！愿以悲钩，摄受于我！引我往生净空行刹。</p>\n<p>　　这样专心致志的恳求，再随我发愿，念诵如下偈文：</p>\n<p>　　呜呼！</p>\n<p>　　持明圣众 幸垂听许 请运悲心 导入正路</p>\n<p>　　习气炽盛 流转生死 俱生智慧 光明照耀</p>\n<p>　　勇士持明 导引在前 空行佛母 护持于后</p>\n<p>　　祈脱中有 怖畏险峡 送我往登 正觉佛土</p>\n<p>　　(本段偈文的解释见本书198页)</p>\n<p>　　这样至心虔诚发愿，就可以化为虹光，融入持明部圣众胸中，证成报身佛。或者生到清净空行刹土得真实受用，无可置疑。一切善知识只要依照上文指示，能够认取，即可得到解脱。纵然恶业深重亦定能获得解脱。’</p>\n<p>　　戊 次周证入怒相部尊</p>\n<p>　　概说</p>\n<p>　　兹当宣说‘法性中有’怒相起现之相。此亦如前述寂相，依次有七次险峡，于所历之境，经已逐次指示；纵昧其一，当证另一而得解脱者，为数无量。如是虽有众多得解脱者，然亦有多人，恶业深重，罪障山积，狃于结习，无明幻惑，无尽无减；于如是人，纵予指示，仍不解脱，转复漂沦，其类实繁。</p>\n<p>　　复次，以前寂相圣众，持明空行，来接引者，已经逝没。次有饮血忿怒五十八炽然尊，即前‘寂相部众’转依所依(怒部居方位与寂相部同，特变现之形貌相状有不同耳。)来现在前，与先不同；此种怒相，为‘恐’‘怖’‘畏’三种增上力所转，指证极难；自内证智，不得自在，而入闷绝，迷而复醒，醒而复迷，循环往复，不能自主。若有于其清醒之际，能认取者，解脱亦易。何以故？以‘恐’‘怖’‘畏’三种境界现前，自内证智，无复驰乱，专一奋勉而住故。在此情景，若不遇此教授，纵复多闻如海，亦徒无益。亦有持律大德，显乘大师，若于此际迷不认取，仍当漂转生死轮回；诸凡庸人，为数更多；于‘恐’‘怖’‘畏’三种境界，生起惊惶，堕恶趣涧，永受大苦，然密乘真言瑜伽士则不同，纵为下下根器，一见忿怒饮血圣众，如遇亲知故旧，深信为自本尊，即可无二交融而证佛位。</p>\n<p>　　又有在人间时，于此忿怒饮血圣众诸像，曾修现观(即生起次第)，供养赞叹，乃至曾见绘画尊形，或雕塑等像，亦于此时，尊形现前；即认知已，即得解脱。</p>\n<p>　　又有在人间时，持律大德，显乘大师，任于正法行为如何精进，及于说法如何善巧，其于死时，不现灵骨、<a href=\"/remen/sheli.html\" class=\"keylink\" target=\"_blank\">舍利</a>、虹光等相。以于生时，对于秘密真言，未尝用心，及于真言，毁谤侮慢，真言圣众，未结因缘；由是中有境界，虽已现前，亦不认知，先所未见，倏尔睹见，如逢怨敌，立起嗔心；以此为缘，遂趋恶道。如是戒律及性相教理，虽极精娴，内心若无真言修持，则不现有灵骨、舍利、虹光等相，其理固如是也。若是真言行者，纵为下下根器，举止威仪粗鄙无状，亦不善巧说法，亦不如理实行；虽然如是，但于真言乘法深生信仰，则于彼境不生邪见、不生疑虑、能修持者，彼于此际，仍得解脱。其在人间，行为纵有不检，然于死时，至少呈现一种瑞相，或为灵骨、舍利、虹光佛像等随一现前，以真言加持威力最大故。</p>\n<p>　　真言瑜伽行者，中根以上，曾修‘生起’‘圆满’两次第，持诵心咒等诸修持，则不需沦入‘法性中有’，而于气息将断未绝之时，定为持明勇士空行等众，迎归清净空行刹土。其所表相，天无片云，虹光耀目，花雨缤纷，薰香馥郁，天乐齐呜，音声嘹亮，灵骨舍利及佛像等，皆复呈现，斯其所表之异微也。是故诸持律者、显乘大师、或有失坏三昧耶真言行者及诸凡夫，除此‘听闻解脱密法’，更无其他方便。其有修习‘大圆满’(为西藏宁玛派最高成就之法)‘大手印’(为西藏噶迦派最高成就之法)等大修行人，则于‘死位中有’时，已能认取明光，证得法身，不需诵此听闻解脱密法，以于死位中有认取之时，即已证得法身，已如前述。迨至‘法性中有’‘寂’‘怒’境界显现时，既认取已，即证‘圆满报身’；再若认取‘轮回中有’，即证‘应化之身’，生往善趣；得逢此法，于后生中，可能有修行缘会故。</p>\n<p>　　此听闻解脱密法，为无修成佛之法；亦即仅赖听闻即得解脱之法；亦为罪障大者、导出险峡之法；又为一刹那间差别立判之法；又为一刹那间即证等觉之法；诚为深懊！有情遇此而堕恶趣者，未之有也。此法与‘答卓’咒本(藏名‘答卓’，义为假名解脱如意宝，又名无为刹那妙智经，为佩带于身而得解脱之咒本)二者合用，则如金曼达上严以玉饰，更为美妙矣！</p>\n<p>　　如是依上师所授口诀，认知为本体境相，唯是自内证智，譬如狮子之皮，若曾见者，知其为皮，立即释然；其有未明此系狮皮，即生恐怖；如为此人解说其义，指示明白，惊怖立除。此法亦尔。饮血圣众，身形庞大，肢体粗壮，量等虚空，当其现前，定生惊怖。若闻此教授，明白指示，无间即证为本体境相，或认为自之本尊，则生前所修之明光(子光)，及后起自然之明光(母光)，子母两光会遇，于朗然释然中，如遇故知，恍然大悟。若不得此教授，虽诸贤者，亦复难免退堕，流转生死大海而已。</p>\n<p>　　在法性中有时期的前七天，亡者看到的都是佛菩萨的寂静相。在这七天中亡者只要有一次能够认取，即可获得解脱。所以法性中有前七天成就者为数很多。但有很多人，恶业深重，罪障如山，由于无明愚痴，纵然为他们指示，仍然未能认取，错过法性中有前七天的解脱时机。</p>\n<p>　　到了法性中有时期的后七天，佛菩萨不再显现庄严肃穆的寂静相，而是显现为忿怒饮血的明王相。这些忿怒饮血的明王相共有五十八尊，与法性中有前七天的方位相同，每一方位均为同一佛菩萨的化身，只是显现的相貌不同。但对于这些忿怒形像，亡者一见，容易产生‘恐’、‘怖’、‘畏’，再加上亡者一会儿迷闷，一会儿清醒，不能自主。所以在法性中有时期后七天，要指示亡者认取，非常困难。但如果在亡者清醒之际，为亡者指示，亡者一经认取，即可得到解脱。因为尽管亡者见到佛菩萨的忿怒尊，产生‘恐’、‘怖’、‘畏’，但其本性智慧，并不因此而迷乱。本性智慧是不垢不净，不生不灭的。所以，对法性中有后七天的行法，应殷勤修持为要。</p>\n<p>　　需要注意的是，对于一些显乘大师，持律大德，无论他们生前修法多么精进，持戒多么精严，说法如何善巧，但由于他们对密法真言未曾用心，与佛菩萨寂怒圣众，未结因缘，尤其是没有遇到此‘中有教授听闻解脱密法’，所以，当他们见到佛菩萨诸忿怒尊时，便产生迷惑，如遇怨敌，立起嗔心。甚至诽谤轻慢，因此之故他们将堕入恶道，而不得解脱。为数更多的诸凡夫，见到佛菩萨的忿怒尊更是惊慌失措，逃入恶道，永受生死轮回之苦。与此相反，对于修过密法真言之人，纵然是下下根器，举止粗俗，也不善巧说法，但对密法真言深生信仰，不生邪见，不生疑虑，并能虔心实修。尤其对佛菩萨忿怒诸尊，曾修观想，或者见过绘画尊形，雕塑等，在法性中有时期的后七天，一见到佛菩萨忿怒形像，便瞻养赞叹，如遇亲知故友，深信为本尊。即可水乳交融而证佛位。这就好比狮子之皮，若见过之人，知道它是狮子皮，就不会害怕。如果不明白，见了就会害怕。由于佛之忿怒诸尊，身形高大，肢体粗壮，恐怖可畏。如果不遇此中有教授密法，亡者一见，就会怖而逃之，错过成佛的机会。所以在法性中有时期的后七天，应立即实施以下诵法。</p>\n<p>　　第八日诵法(在亡者死后第十二日，此日有佛六尊前来接引。)</p>\n<p>　　如上已就‘听闻解脱’示其重要，兹当指示‘法性中有’怒相起现之时。于此又呼亡者之名，念诵下文而告之曰：</p>\n<p>　　嗟！善男子(某某)：谛听勿乱！以前‘法性中有’寂相起现、汝未认取，故今仍复漂泊无依。兹第八日，有饮血忿怒圣众，来现当汝前，当勿迷乱。而认取之。</p>\n<p>　　嗟！善男子(某某)：此大吉祥主尊为饮血佛部世尊，名‘佛陀兮噜迦’。身深棕色，三面、六臂，四足展立。其面右白、左红、正面深棕色；周身光蕴，如火炽然。九目圆睁，怒视可怖；眉耸如电；獠牙外露，吼声大笑，作‘阿拉拉’及‘哈哈’声；又发‘嘎呜’及宏大尖锐之声；头发红黄，炽然上竖；冠饰骷髅，象征日月；黑蛇及鲜显人头为身严。六手之中：右上持‘轮’，右中持‘钺’，右下持‘剑’；左上持‘铃’，左中持‘颅’，左下持‘犁’。明母名‘佛陀讫洛底湿缚哩玛’，拥抱尊身；右搂尊颈，左捧‘红螺’(红色螺贝之碗)，内贮阳精，献于尊口，吮咂作响，并发轰声，犹如雷震。于金刚炽焰毛孔中，发出智火，熊熊有光；两足右卷左展，立于大鹏座上。此乃从汝脑内‘中央’所出，以如是状，现临汝前。汝当于彼，勿惊勿怖！勿生恐惧！当即认取为汝自证智身，即汝本尊；勿惊勿惧！实则仍为世尊‘毗卢遮那’父母双身之体，故勿生畏怖；若能认取，立即解脱。</p>\n<p>　　如上明告，认取为本尊已，即可交融无二，而证圆满受用佛身。</p>\n<p>　　在法性中有时期的第八天怒相起现时，行法之人应呼唤亡者姓名，对亡者进行指示。</p>\n<p>　　‘第八日诵法’内容如下：</p>\n<p>　　‘某某人，请不要散乱，仔细听我为你指示！在前七天佛菩萨显现寂静相的时候，你未能认取，至今仍漂泊无依。现在已进入法性中有时期的第八天，佛菩萨将在你面前显现忿怒饮血的形像。你千万不要迷乱，要敢于认取。</p>\n<p>　　某某人，此时有大吉祥饮血世尊，名‘佛陀兮噜迦’，身为深棕色，三面、六臂、四足展开站立。其面右白、左红、正面为深综色；周身放光，如燃烧的火焰。佛陀兮噜迦世尊，九目圆睁，怒视可怖，眉耸如电，獠牙外露，吼声大笑，发出‘啊拉拉’‘哈哈’‘嘎呜’等宏大尖锐之声。头发红黄，炽燃上竖，头戴骷髅，象征日月，身饰黑蛇及血淋淋的人头。六手之中：右上持‘轮’，右中持‘钺’，右下持‘剑’，左上持‘铃’，左中持‘颅’，左下持‘犁’。明母名‘佛陀讫洛底湿缚哩玛’拥抱尊身，右搂尊颈，左捧红色的螺贝，内贮阳精，献于尊口，吮咂作响，并发出轰声，犹如雷震。佛母于金刚炽焰毛孔中，发出智火，熊熊有光，两足右卷左展，与佛父面合交抱，一同立于大鹏座上。在你面前显现的如此境相是从中央佛土所出，也是你自心所显现的，你当于此勿惊勿怖！勿生恐惧！应当下认取这就是世尊毗卢遮那佛父佛母双身忿怒之相，就是你的本性光明所现，这就是你的本尊。你应当发心皈依，与世尊水乳交融，无二无别，而证圆满自受用报身。’</p>\n<p>　　第九日诵法(在亡者死后第十三日，此日有佛二尊前来接引。)</p>\n<p>　　又复于彼，怖而逃避，而不认者，则于第九日，有饮血金刚部世尊，前来接引。其指示法，当呼亡者之名，念诵下文而告之曰：</p>\n<p>　　嗟！善男子(某某)，啼听勿乱！今第九日，有饮血金刚部世尊，名‘金刚兮噜迦’。身深蓝色，三面、六臂，四足展立。其面右白、左红、正面蓝色。六手之中：右上持‘杵’，右中持‘颅’，右下持‘钺’；左上持‘铃’，左中持‘颅’，左下持‘犁’。明母名‘金刚讫洛底湿缚哩玛’，拥抱尊身；右搂尊颈，左手捧红螺，内贮阳精，献于尊口，双身交抱。此乃从汝脑内东隅而出，来现汝前。汝当于彼，勿惊、勿怖，勿生恐惧！当认为汝自证智身，即汝本尊，故当认取，切勿生怖！实则仍为世尊‘金刚萨埵’父母双身之体，当起欣乐；若能认取，立即解脱。</p>\n<p>　　如是明告，若认取为本尊，即可交融无二，而证圆满受用佛身。</p>\n<p>　　如果有人在法性中有时期的第八日，见到饮血忿怒尊，感到非常可怖，甚至逃避，就不能解脱。这样到了法性中有时期的第九天，有饮血金刚部世尊前来接引。在这一天，行法之人应当呼唤亡者姓名，为亡者进行指示。</p>\n<p>　　‘第九日诵法’内容如下：</p>\n<p>　　‘某某人，请不要散乱，仔细听我为你指示！你于昨日毗卢遮那佛父佛母忿怒双尊，怖而逃避，不能认取。今天是法性中有第九日，有饮血金刚部世尊前来接引。饮血金刚部世尊名‘金刚兮噜迦’身为深蓝色，三面六臂，四足展开站立。其面右白，左红，正面蓝色。六手之中，右上持‘杵‘，右中持‘颅’，右下持‘钺’，左上持‘铃’，左中持‘颅’，左下持‘犁’。明母名‘金刚讫洛底湿缚哩玛’，拥抱尊身，右搂尊颈，左捧红色螺贝，内贮阳精，献于尊口，双身交抱。在你面前显现的如此境相，是从东方佛土所出，也是你自心所显现的。对此你应勿惊勿怖！勿生恐惧！当下认取，此即是金刚萨埵佛父佛母双身忿怒尊，也就是你的本尊，是你本性光明所化。你应当生欢喜心，发心皈依，与世尊水乳交融，无二无别，而证圆满自受用报身。’</p>\n<p>　　第十日诵法(在亡者死后第十四日，此日有佛二尊前来接引。)</p>\n<p>　　如上所示，亦有诸人，业障深重，遂于其境，生起怖畏，避而未证。今第十日，有饮血宝部世尊前来接引。其指示法，当呼亡者之名，念诵下文而告之曰：嗟！善男子(某某)：善自谛听！今第十日，有饮血宝部世尊、名‘珍宝兮噜迦’。身深黄色，三面六臂，四足展立，其面右白、左红、正面深黄。六手之中：右上持‘宝’，右中持‘天杖’，右下持‘棒’；左上持‘铃’，左中持‘颅’，左下持‘钢叉’。明母名‘珍宝讫洛底湿缚哩玛’，拥抱尊身；右搂尊颈，左捧红螺，内贮阳精，献于尊口，双身交抱。此乃从汝脑内南隅所出，来现汝前。汝当于彼，勿惊、勿怖、勿生恐惧！当认为汝自证智身，即汝本尊，当即认取，切勿生怖！实则仍为世尊‘宝生如来’父母双身之体，故当虔敬信乐；若能认取，立即解脱。</p>\n<p>　　如上明言实告，若认取为本尊，则可无二交融而证圆满受用佛身。</p>\n<p>　　有些人，由于业障深重，对忿怒境相感到怖畏，经前面指示未能认取，到法性中有时期的第十天，有饮血宝部世尊前来接引，行法之人应呼唤亡者姓名，为亡者进行指示。</p>\n<p>　　‘第十日诵法’内容如下：</p>\n<p>　　‘某某人，请不要散乱，仔细听我为你指示！你于昨日金刚萨埵佛父佛母忿怒双尊，心生怖畏，避而未证。今天是法性中有时期的第十日，有饮血宝部世尊，前来接引。饮血宝部世尊名‘珍宝兮噜迦’，身深黄色，三面六臂，四足展开站立，其面右白，左红，正面深黄。六手之中，右上持‘宝’，右中持‘天杖’，右下持‘棒’，左上持‘铃’，左中持‘颅’，左下持‘钢叉’。明母名‘珍宝讫洛底湿缚哩玛’，拥抱尊身，右搂尊颈，左捧红螺，内贮阳精，献于尊口，双身交抱。在你面前显现的此种境相是从南方佛土所出，也是你自心所显现的。你当于此，勿惊勿怖！勿生恐惧！当下认取，此是宝生如来佛父佛母忿怒双尊，也就是你的本尊，是你本性光明所化。你应当生欢喜心，发心皈依，与双尊水乳交融，无二无别，而证圆满自受用报身。’</p>\n<p>　　第十一日诵法(在亡者死后第十五日，此日有佛二尊前来接引。)</p>\n<p>　　又虽如上指示，然为习气所薰，生起怖畏，仍复逃避，不识为本尊而见为阎罗法王，故未证取；则第十一日，有饮血‘莲花部’世尊前来接引。其指示法，当呼亡者之名，念诵下文而告之曰：</p>\n<p>　　嗟！善男子(某某)：谛听勿乱！今第十一日，有饮血‘莲花部’世尊，名‘莲花兮噜迦’。身深红色，三面、六臂、四足展立。其面右白、左青，正面深红。六手之中：右上持‘莲’，右中持‘天杖’，右下持‘棒’；左下持‘铃’，左中持‘满血颅器’，左下持‘兆鼓’。明母名‘莲花讫洛底湿缚哩玛’，拥抱尊身；右搂尊颈，左捧红螺，内贮阳精，献于尊口，双身交抱。此乃从汝脑内西隅所出，来现汝前，汝当于彼，勿惊、勿怖、勿生恐惧！实则仍为世尊‘无量光如来’父母双身，故当欣敬；若能认取，立即解脱。</p>\n<p>　　如是明告，当可认取为自本尊，则可交融无二，而证圆满受用佛身。虽经上述指示，但有些众生习气深重，对忿怒相不认为是本尊，而认为是阎罗王，仍然逃避，而未能认取。这样到了法性中有时期的第十一天，有饮血莲华部世尊前来接引。行法之人当呼唤亡者姓名，为亡者进行指示。</p>\n<p>　　‘第十一日诵法’内容如下：</p>\n<p>　　‘某某人，请不要散乱，仔细听我为你指示！你于昨日宝生如来佛父佛母忿怒双尊，生起怖畏，避而未证。今天是法性中有时期的第十一日，有饮血莲花部世尊前来接引。饮血莲花部世尊名‘莲花兮噜迦’，身深红色，三面六臂，四足展开站立。其面右白，左青，正面深红。六手之中，右手持‘莲’，右中持‘天杖’，右下持‘棒’，左上持‘铃’，左中持‘满血颅器’，左下持‘兆鞀’。明母名‘莲花讫底湿缚哩玛’拥抱尊身，右搂尊颈，左捧红螺，内贮阳精，献于尊口，双身交抱。在你面前显现的此种境相，从西方佛土所出，也是你自心所显现的，你当于此勿惊勿怖！勿生恐惧！当下认取，此即是无量光如来佛父佛母忿怒双尊，也就是你的本尊，是你本性光明所化。你应当心生欢喜，发心皈依，与世尊水乳交融，无二无别，而证圆满自受用报身。从此你就可以永脱轮回诸苦！’</p>\n<p>　　第十二日诵法(在亡者死后第十六日，此日有佛二尊前来接引。)</p>\n<p>　　又虽如前指示，然为恶业习气，牵引于外，生起怖畏，仍复逃避，以不识为本尊，故不认取；则第十二日，有饮血‘羯摩部’圣众，及在此日以后，又有八大‘寒林’女神‘吉坞哩玛’，八境兽首女神‘颇罗闷玛’，兽面忿怒女神四门守护，及异类面首女神二十八自在女‘汪鸠玛’等，前来接引；若不认取，即生怖畏；故当指示。此时呼亡者之名，念诵下文而告之曰：</p>\n<p>　　嗟！善男子(某某)：今第十二日，有饮血羯摩部(梵文羯摩此云事业)世尊，名‘羯摩兮噜迦’。身深绿色，三面、六臂，四足展立。其面右白、左红、正面深绿，现威猛可怖相。六手之中：右上持‘剑’，右中持‘天杖’，右下持‘棒’；左上持‘铃’；左中持‘颅’，左下捧‘犁’。明母名‘羯摩讫洛底湿缚哩玛’，拥抱尊身；右搂尊颈，左捧红螺，内贮阳精，献于尊口，面合交抱。此乃从汝脑内北隅所出，来现汝前，汝当于彼，勿惊、勿怖、勿生恐惧！当即认知为自证智身，即汝本尊，故当勿怖。实则仍为世尊‘不空成就如来’父母双身之体，故当虔敬，深生渴仰；若能认取，立即解脱。</p>\n<p>　　如上明告，即可认知为自本尊，无二交融而证圆满受用佛身。</p>\n<p>　　虽经前面指示，但有些众生被恶习所牵，仍然逃避本尊，不能认取。这样在法性中有时期的第十二天，有饮血羯摩部圣众前来接引。行法之人当呼亡者姓名，为亡者进行指示。</p>\n<p>　　‘第十二日诵法’内容如下：</p>\n<p>　　‘某某人，请不要散乱，仔细听我为你指示！你于昨日无量光如来佛父佛母忿怒双尊，怖而逃避，不能认取。今天是法性中有时期的第十二日，有饮血羯摩部世尊，名‘羯摩兮噜迦’，身深绿色，三面六臂，四足展开站立，其面右白，左红，正面深绿，现威猛可怖相。六手之中，右上持‘剑’右中持‘天杖’，右下持‘棒’，左上持‘铃’左中持‘颅’，左下持‘犁’。明母名‘羯摩讫洛底湿缚哩玛’，拥抱尊身，右搂尊颈，左捧红螺，内贮阳精，献于尊口，双身交抱。在你面前显现此种境相，是从北方佛土所出，也是你自心所显现的。你当于此勿惊勿怖！勿生恐惧！当下认取，此即是不空成就如来佛父佛母忿怒双尊，也就是你的本尊，是你本性光明所化。你应当发心皈依，与世尊水乳交融，无二无别，而证圆满自受用报身。’</p>\n<p>　　第十三日诵法(在亡者死后第十七日，此日有佛十六尊前来接引。)</p>\n<p>　　尔后有八大‘寒林’‘吉坞哩玛’，及种种面形兽首女神‘颇罗闷玛’，皆从亡者脑中出现，来临其前；其指示法，当呼亡者之名，念诵下文而告之曰：</p>\n<p>　　嗟！善男子(某某)：谛听勿乱！今汝脑中八方位，复出八尊‘吉坞哩玛’，来现汝前，汝当于彼，勿生怖畏！详述如下：</p>\n<p>　　汝脑东隅：出白色‘吉坞哩玛’，右手高举人尸骨杖，左手持颅，满贮鲜血，来现汝前；汝离南隅，出黄色‘资坞哩玛玛’，手张弓矢。</p>\n<p>　　汝脑西隅：出红色‘波罗谟诃’，手持‘摩羯幢’；</p>\n<p>　　汝脑北隅：出黑色‘培多梨玛’，右手持杵，左手持颅盖，满贮鲜血；</p>\n<p>　　汝脑东南隅：出红黄色‘布斯迦私玛’，右手持‘人肠’，左手取食；</p>\n<p>　　汝脑西南隅：出深绿色‘伽斯摩哩玛’，右手持颅盖，满贮鲜血，左手持杵搅动，现威吓状，取而饮之；</p>\n<p>　　汝脑西北隅；出淡黄色‘赞驮哩玛’，裂人身首，右手摘取其心，左手食其躯体；</p>\n<p>　　汝脑东北隅：出深黄色‘斯迷奢梨玛’，撕裂腐尸身首，取而食之。</p>\n<p>　　以上八方位所住之‘吉坞哩玛’，亦围绕五方饮血部尊，从汝脑中现出，而临汝前；汝当于彼，勿怖勿畏！</p>\n<p>　　嗟！善男子(某某)：其在外围(即上说之八方位之外)复有八境兽首女神‘颇罗闷玛’出现汝前：</p>\n<p>　　东：有深紫色‘狮首僧贺女’，双手交叉，口衔死尸，摇震鬃发；</p>\n<p>　　南：有红色虎首‘毗耶讫哩目佉女’，双手下叉，目睛凝视，露齿蹙眉；</p>\n<p>　　西：有黑色狐首‘悉哩罗目佉女’，右举利刃，左持人肠，咀食吮血；</p>\n<p>　　北：有深蓝色狼首‘湿缚南目佉女’，双手撕尸，目睛凝视；</p>\n<p>　　东南：有淡黄色鹫首‘讫哩陀目佉女’，肩负巨尸，手举骸骨；</p>\n<p>　　东北：有蓝色枭首‘呼鲁目佉女’，右手持杵，左手举刀，割食人肉；</p>\n<p>　　西南：有深红色鸱□首‘冈迦目佉女’，亦负巨尸；</p>\n<p>　　西北：在黑色鸦首‘佉佉目佉女’，左举颅盖，右持昨剑，割取心肝。</p>\n<p>　　以上八境兽首女神‘颇罗闷玛’、亦复围绕五饮血尊，从汝脑中现出而临汝前；汝当于彼，勿怖勿畏！当知任何一切所显现者，皆当认取为本来境相，证智力用。</p>\n<p>　　到法性中有时期的第十三日，前五天所显现的五方五佛忿怒双尊，今天一齐显现。在其外围又有八大寒林‘吉坞哩玛’，及种种面形的八兽首女神‘颇罗闷玛’环绕，如此形成一虹光曼陀罗前来接引。行法之人，当呼唤亡者姓名，为亡者进行指示。</p>\n<p>　　‘第十三日诵法’内容如下：</p>\n<p>　　‘某某人，请不要散乱，仔细听我为你指示！你于昨日不空成就如来佛父佛母忿怒双尊，生起怖畏，避而未证。今天是法性中有时期的第十三日，前五日所显现的五方五佛忿怒双尊，今天一齐出现。在其外围又有八大寒林女神‘吉乌哩玛’围绕五方忿怒饮血双尊，分别从佛土八方而出，显现在你面前，前来接引。这八大寒林，‘吉乌哩玛’分别是：</p>\n<p>　　从佛土东方所出：白色‘吉坞哩玛’。右手高举人尸骨杖，左手持颅，满贮鲜血。</p>\n<p>　　从佛土南方所出：黄色‘资坞哩玛’，手张弓箭。</p>\n<p>　　从佛土西方所出：红色‘波罗漠诃玛’手持羯摩幢。</p>\n<p>　　从佛土北方所出：黑色‘培多梨玛’，右手持杵，左手持颅盖，贮满鲜血。</p>\n<p>　　从佛土东南方所出：红黄色‘布斯迦私玛’，右手持人肠，左手取食。</p>\n<p>　　从佛土西南方所出：深绿色‘伽斯摩哩玛’，右手持颅盖，贮满鲜血，左手持杵搅动，现威吓状，取而饮之。</p>\n<p>　　从佛土西北方所出：淡黄色‘赞驮哩玛’，撕裂人身，右手摘取人心，左手掏取其躯体。</p>\n<p>　　从佛土东北方所出：深黄色‘斯述奢梨玛’，撕裂腐尸身首，取而食之。</p>\n<p>　　在以上八方位所出的‘吉乌哩玛’外围又有八境兽首女神‘颇罗闷玛’环绕。这八境兽首女神分别是：</p>\n<p>　　东：有深紫色‘狮首僧贺女’，双手交叉，口衔死尸，摇震鬃发；</p>\n<p>　　南：有红色虎首，‘毗耶讫哩目佉女’，双手下叉，目睛凝视，露齿蹙眉；</p>\n<p>　　西：有黑色狐首‘悉哩罗目佉女’，右举利刃，左持人肠，咀食吮血；</p>\n<p>　　北：有深蓝色狼首，‘湿缚南目佉女’双手撕尸，目睛凝视；</p>\n<p>　　东南：有淡黄色鹫首，‘讫哩陀目佉女’，肩负巨尸，手举骸骨；</p>\n<p>　　东北：有蓝色枭首‘呼噜目佉女’右手持杵，左手举刀，割食人肉；</p>\n<p>　　西南：有深红色鸱□首‘冈迦目佉女’也负巨尸；</p>\n<p>　　西北：有黑色鸦首‘佉佉目佉女’左举颅盖，右持利剑，割取心肝。</p>\n<p>　　以上境相均从佛土而出，显现于前。你当于此勿惊勿怖！勿生恐惧！当下认取诸佛饮血忿怒尊及其眷属，都是你本性光明所化，你应当发心皈依，与诸佛水乳交融，无二无别，而证圆满自受用报身。‘</p>\n<p>　　第十四日诵法(在亡者死后第十八日，此日有佛三十六尊前来接引。)</p>\n<p>　　嗟！善男子(某某)：此第十四日者(按、此句英译本有，藏本无。)有兽面忿怒女神四门守护，自汝脑中，出现于外，现临汝前，亟当认取；详如下述：</p>\n<p>　　汝脑东隅：出白色‘虎面女’，右手持钩，左举‘红颅’，满贮鲜血；</p>\n<p>　　汝脑南隅：出黄色‘猪面女’，手持‘绢索’，</p>\n<p>　　汝脑西隅：出红色‘狮面女’，手中持‘锁’，</p>\n<p>　　汝脑北隅：出绿色‘蛇面女’，手中持‘铃’，</p>\n<p>　　以上四女，左手均持满血颅器。此四门守护忿怒女，皆自汝脑中出现，当知即汝本尊，故当认取。</p>\n<p>　　嗟！善男子(某某)：三十忿怒相‘兮鲁迦’之外围，复有异类面首二十八瑜伽自在女‘汪鸠玛’，形相面首各异，手持种种兵器，自汝脑中来现汝前；汝当于彼，勿生怖畏，一切所现，皆当认取为汝本来境证智力用；临此时机，正逢阻碍大利时，当细加审量，故当忆念上师教授！</p>\n<p>　　嗟！善男子：汝脑之东，出：深紫色‘牛首罗刹女’，手中持‘杵’及‘颅器盖’；红黄色‘蛇首梵天女’，手执‘莲花’。墨绿色‘豹首大天女’手执‘钢叉’，青色‘猿首欲天女’，手中执‘轮’，红色‘熊首童贞女’，手执‘短矛’，白色‘熊首帝释女’，手执‘串肠’。如是东方六瑜伽自在女，皆自汝脑东隅而出，现在汝前；汝当于彼，勿生怖畏！</p>\n<p>　　嗟！善男子：汝脑之南，出：黄色‘蝙蝠首金刚女’，手举‘利刃’，红色‘摩竭鱼首寂静女’，手执‘宝瓶’，红色‘蝎首甘露女’，手执‘莲花’，白色‘鹞首月明女’，手中执‘杵’，绿色‘狐首持棍女’，手中执‘棍’，深黄色‘虎首罗刹女’，手执‘血颅’。如是南方六瑜伽自在女，皆自汝脑南隅而出，现在汝前；汝当于彼，勿生怖畏！</p>\n<p>　　嗟！善男子：汝脑之西，出：‘墨绿色鹫首肉食女’，手中持‘棍’；红色‘马首欢喜女’，手执‘体腔’；白色‘鹏首大力女’，手中执‘杖’；黄色‘犬首罗刹女’，一手持‘杵’，一以‘刀’割；红色‘戴胜鸟首爱染女’，手张弓矢，绿色‘麋首护财女’，手执‘宝瓶’。如是西方六瑜伽自在女，皆自汝脑西隅而出，现在汝前；汝当于彼，勿生怖畏！</p>\n<p>　　嗟！善男子：汝脑之北，出蓝色‘狼首风神女’，手展旌旗；红色‘羊首妙鬘女’，手持‘人签’(剌人的一种尖杆刑具。)；黑色‘猪首亥女’，手持‘齿索’(以齿穿贯之绳索。)红色‘鸦首金刚女’，手持‘孩尸’；墨绿色‘像首大鼻女’，手持‘巨尸’，饮其颅盖之血；青色‘蛇首水天女’，手持‘蛇索’。如是北方六瑜伽自在女，皆自汝脑北隅而出，现在汝前；汝当于彼，勿生怖畏！</p>\n<p>　　嗟！善男子：此外复有四门守护四瑜伽女，从汝脑中来现汝前。汝脑东隅，出白色‘杜鹃首金刚女’，手中持‘钩’；汝脑南隅，出黄色‘山羊金刚女’，手中持‘索’；汝脑西隅，出红色‘狮首金刚女’，手中持‘锁’；汝脑北隅，出绿色‘蛇首金刚女’，手中持‘铃’。此四门四瑜伽女，皆自汝脑中出，而来现前。以上二十八自在女，亦为‘兮噜迦’忿怒尊自生之身力用所现，故当认取。</p>\n<p>　　嗟！善男子！自‘法身’空寂之分，而现‘寂’相之尊，当知即汝本来面目；自‘法身’显明之分，而现‘怒’相之尊，故当认知。当汝脑中出五十八尊饮血圣众，现临汝前之时，若了知一切所现，皆是自内证智之本光，无间即与饮血之尊无二交融而证佛位。</p>\n<p>　　嗟！善男子：若不当下认取，汝则对之必然惊惶欲遁，复受大苦而难解脱；若不如是认取，则见一切饮血圣众为阎罗法王，而于饮血本尊，生起怖畏，震栗闷绝，本体境相，认为魔相，遂沦生死之海；若能不怖不畏，则证佛位矣。</p>\n<p>　　嗟！善男子！此诸‘寂’‘怒’两部圣众：身形大者，量等虚空；身量中者，量等‘须弥’；下者，亦等自身累积十八倍之高。汝当于彼，勿生恐惧。对于‘情’‘器’世间，现为光体，一切境相，现为光身，皆当认为自内证智本来光明，自光与身，无二交融而证佛位。<a href=\"/remen/fozi.html\" class=\"keylink\" target=\"_blank\">佛子</a>！汝所见者，随起任何可惊惧相，皆当证认为自识所现，勿生怖畏；皆当认取明光为自内证智本光。若如是认取，当下即身成佛无疑；所谓‘刹那即证等觉’，即此时也；故当至心信受。</p>\n<p>　　嗟！善男子：汝于此时，若不认取而惊怖者，则一切‘寂部’之尊，现为依怙‘嘛哈嘎拉’(藏密大护法神，即‘大黑天’。)之身；一切‘怒部’之尊，现为‘阎罗法王’之身；本来境相，转成魔相，遂沦生死苦海。</p>\n<p>　　嗟！善男子：汝若不能认识本相，纵复精娴一切经论，历劫修法，终不成佛；若认识本相，可籍一精要之点及一字句，而证佛位；若不认识本相，死后无间于‘法性中有’时，即现有‘阎罗王’之身；阎罗法王、身形大者，量等虚空；中者亦等‘须弥山王’；下者亦当汝身累积十八倍之高；为数无量，充塞世间，而现汝前。其相咬唇切齿，目如玻璃，头发上绾，巨腹细腰，束发结顶，手持刑板，口发杀……声，饮啖脑髓，撕裂身首，剜食心脏，以如是相，充塞世间，而来汝前。</p>\n<p>　　嗟！善男子：如是境相现前之时，汝当勿怖，勿生恐惧。要知汝今自身，已成为‘习气意生之身’，虽逢砍杀，亦不致死，实则乃汝空性本色，故当勿惧。即所现之阎罗王等，亦从汝自内证智之本光中之所起现，故无实体可得；空性于空，无隙可乘也。除汝证智力用所现外，所有‘寂静’‘忿怒’‘饮血’诸部，及异类面首形相、虹光、阎罗诸可怖之象，决无实体可得。若能如是认取，则一切怖畏，当下释然，即可无二交融而成佛矣。若或不能认取，则当自念云：‘此乃我之本尊，前来接引，拔我出离中有险峡，故当皈依’。又必深心信乐，忆念三宝，随念汝所自奉之本尊(如亡者生前不修密法，无自己一定之本尊，则以观世音菩萨为其本尊可也。)，并呼圣号，唱云：</p>\n<p>　　本尊圣者，祈垂听许！我今漂泊，‘中有’难中，</p>\n<p>　　惟祈圣者，速来拯救；大悲摄受，护持于我！</p>\n<p>　　又当忆今汝之上师名号，作启请云：</p>\n<p>　　我今漂泊‘中有’，惟祈速来拯救，不舍大悲，垂赐恩怙。又当对于饮血部圣众，祈请发愿；随我念诵下偈：</p>\n<p>　　呜呼！</p>\n<p>　　习气炽盛漂泊中有时 恐惧怖畏境相当舍弃</p>\n<p>　　唯愿‘寂’‘怒’圣众前引导 法界自在忿怒母后护</p>\n<p>　　祈请度脱中有怖畏峡 送我往登正等觉佛位</p>\n<p>　　我今独行别离诸亲友 现前惟有自心映空相</p>\n<p>　　恳祈诸佛大悲力救拔 愿除中有诸怖畏恐惧</p>\n<p>　　当兹所现五智光明时 勿怖勿惧认识为本相</p>\n<p>　　‘寂’‘怒’两部身相起现时 坚信勿怖认取为中有</p>\n<p>　　倘缘业力备受诸苦时 愿本尊天消除我苦厄</p>\n<p>　　法性本尊如千雷震时 愿即转成六字大明声</p>\n<p>　　业力追逐失所救护时 愿大悲尊为我作依怙</p>\n<p>　　任为业习所受苦痛时 愿证净光安乐三摩地</p>\n<p>　　五大种界不与我为故 愿我得见五部佛刹土</p>\n<p>　　如是虔敬殷重发愿，则一切恐怖，定即消失，决定证报身佛位，故极重要；至心念诵三至七次，纵亡者罪业如何重大，福缘如何劣弱，其不解脱者，未之有也。若竟有其人，虽经多次为之作法，然仍未认取而得救度者，以后即入‘后期中有’，即‘轮回中有’。其指示法，详下卷。</p>\n<p>　　‘第十四日诵法’内容如下：</p>\n<p>　　‘某某人！昨天，有八大寒林‘吉坞哩玛’和八大兽首女神‘颇罗闷玛’围绕五方饮血忿怒双尊，前来接引你，而你未能认取。今天是法性中有时期的第十四天，昨日，佛菩萨所显现的曼陀罗形像今又现前，在其外围又增加四兽面忿怒女神，四门守护。她们分别是：</p>\n<p>　　从东方而出：白色虎面女，右手持钩，左举‘红颅’，贮满鲜血；</p>\n<p>　　从南方而出：黄色‘猪面女’，右手持‘绢索’，左举‘红颅’，贮满鲜血；</p>\n<p>　　从西方而出：红色‘狮面女’，右手持‘锁’，左举‘红颅’，贮满鲜血；</p>\n<p>　　从北方而出：绿色‘蛇面女’，右手持‘铃’，左举‘红颅’，贮满鲜血。</p>\n<p>　　在以上曼陀罗外围又有二十八瑜伽自在女‘汪鸠玛’环绕，她们形像面首各异，手持种种兵器，均从佛土而出，具体形像如下：</p>\n<p>　　从东方而出：深紫色‘牛首罗刹女’，手中持‘杵’及‘颅器盖’；红黄色‘蛇首梵天女’，手执‘莲花’；墨绿色‘豹首大天女’，手执‘钢叉’；青色‘猿首欲天女，手中持轮’；红色‘熊首童贞女’，手执‘短矛’；白色‘首帝释女’，手执‘串肠’。以上是东方六瑜伽自在女。</p>\n<p>　　从南方而出：黄色‘蝙蝠首金刚女’手举利刃；红色‘摩竭鱼首寂静女’，手执‘宝瓶’；红色‘蝎首甘露女’，手执‘莲花’；白色‘鹞首月明女’，手中执‘杵’；绿色‘狐首持棍女’，手中执‘棍’；深黄色虎首罗刹女，手执‘血颅’。以上是南方六瑜伽自在女。</p>\n<p>　　从西方而出：墨绿色‘鹫首肉食女’，手中持‘棍’；红色‘马首欢喜女’手执‘体腔’；白色‘鹏首大力女’，手中执‘杖’；黄色‘犬首罗刹女’，一手持‘杵’，一手以‘刀’割；红色‘戴胜鸟首爱染女’，手张弓矢；绿色‘麋首护财女’，手执‘宝瓶’。以上是西方六瑜伽自在女。</p>\n<p>　　从北方而出：蓝色‘狼首风神女’，手展‘旌旗’；红色‘羊首妙□女’，手持‘人签’(剌人的一种尖杆刑具)；黑色‘猪首亥女’，手持‘齿索’(就是穿贯牙齿的绳索)；红色‘鸦首金刚女’，手持‘孩尸’；墨绿色‘像首大鼻女’，手持‘巨尸’，饮其颅盖之血；青色‘蛇首水天女’，手持‘蛇索’。以上是北方六瑜伽自在女。</p>\n<p>　　在以上二十四瑜伽自在女外围，又有四瑜伽女四门守护。她们是：</p>\n<p>　　从东方所出：白色‘杜鹃首金刚女’，手中持‘钩’；</p>\n<p>　　从南方所出：黄色‘山羊金刚女’，手中持‘索’；</p>\n<p>　　从西方所出：红色‘狮首金刚女’手中持‘锁’；</p>\n<p>　　从北方所出：绿色‘蛇首金刚女’手中持‘铃’。</p>\n<p>　　至此，以上所述共五十八尊饮血圣众，于法性中有第十四天，一齐在你面前显现。你当于此勿惊勿怖，勿生恐惧！当下认取，此即是诸佛饮血忿怒尊，是你本性光明所化，你应当发心皈依，与诸佛水乳交融，无二无别，而证圆满自受用报身。</p>\n<p>　　某某人，从你死亡至今已有十八天了，今天是法性中有时期的最后一天。从死相现前开始，你便饱受死亡的痛苦，在外气断绝时，由于痛苦至极，处于闷绝昏迷状态，此时，你疲惫不堪，无力再生妄念，一片空寂。于空寂之中，本性光明大放，这时你若能醒悟，当下即可证成法身佛。可惜这段时间你昏迷不醒，错失良机。你于外气断三日半至四日后，渐渐清醒，心也随之妄动，于空寂中本性光明伴随影象而现前，由于欲界众生以淫欲心为根本，所以所见现相均为双身之尊，同时由于贪、嗔、痴、慢、疑等业力支配，感得六道之光也一同现前。由此可见，一切现相都是由于我们的心不空寂，妄心乱动而产生的，但从根本上讲还是从我们的法身中生出来的。</p>\n<p>　　法身所生寂、怒诸尊，身形高大。大者，犹如虚空；中者，犹如须弥山；小者，也比你自身高大十八倍以上。他们身上有无数光点闪耀，发出强烈的光明，你要认识此光明正是你的本性光明，就是你的本来面目！你当于此勿惊勿怖，发心皈依，与寂、怒诸尊合上去，犹如水乳交融，无二无别，当下证成报身佛。</p>\n<p>　　如果你不能认识本来面目，无论你对一切经论如何精熟，虽历劫修法，也不能成佛。由于你对寂、怒诸尊产生恐惧怖畏，则一切寂部诸尊就变现为嘛哈嘎啦护法神(汉地叫大黑天)，一切怒部诸尊则变现为阎罗法王之身体，本来境相转成魔相。阎罗法王身形高大，大者，犹如虚空，中者犹如须弥山，小者，也比你的身体高大十八倍以上。你若于佛寂、怒诸尊，心生恐惧，就会有无数个阎罗法王充塞世间。他们各个咬唇切齿，目如玻璃，头发上绾，巨腹细腰，束发结顶，手持刑板，口发杀……声，同时还饮啖脑髓，撕裂身骨，剜食心脏。种种可怖境相在你的面前显现。对如此境相，你一定要镇定，不要恐惧。你应该知道，现在你已是习气意生之身，即使被砍杀，亦不致死。因本性是不生不灭的，凡所有相都是从你的法身(佛性)中生出来的。所以，所有寂静、忿怒、饮血诸尊，及异类面首、虹光、阎罗法王等诸可怖形像，均无实体可得。你若能这样思惟，则所有的恐怖形像当下就消失了。如果你不能认取，就观想：所有这些形像都是本尊为救我出离苦海而显现的。所以应当虔心皈依，并同我一起念诵以下偈文：</p>\n<p>　　本尊圣者，祈垂听许！我今漂泊，‘中有’难中，</p>\n<p>　　惟祈圣者，速来拯救；大悲摄受，护持于我！</p>\n<p>　　(这段偈文的意思是：本尊圣者，祈请你降临听我诉说，如今我在中有苦难中漂泊，祈请本尊圣者以大悲力摄受、护持我，把我从中有苦难中拯救出来。)</p>\n<p>　　同时，还应当回忆上师名号，祈请上师前来救护，并急诵下文：</p>\n<p>　　我今漂泊中有，惟祈速来拯救，不舍大悲，垂赐恩佑。</p>\n<p>　　(这段偈文意思是说：如今我在中有苦难中漂泊，祈请上师本尊迅速降临，来拯救我，以大悲力摄受我。)</p>\n<p>　　还应当在饮血忿怒诸尊现前之际，同我一起祈请发愿，念诵以下偈文：</p>\n<p>　　呜呼！</p>\n<p>　　习气炽盛漂泊中有时 恐惧怖畏境相当舍弃</p>\n<p>　　唯愿‘寂’‘怒’圣众前引导 法界自在忿怒母后护</p>\n<p>　　祈请度脱中有怖畏峡 送我往登正等觉佛位</p>\n<p>　　我今独行别离诸亲友 现前惟有自心映空相</p>\n<p>　　恳祈诸佛大悲力救拔 愿除中有诸怖畏恐惧</p>\n<p>　　当兹所现五智光明时 勿怖勿惧认识为本相</p>\n<p>　　‘寂’‘怒’两部身相起现时 坚信勿怖认取为中有</p>\n<p>　　倘缘业力备受诸苦时 愿本尊天消除我苦厄</p>\n<p>　　法性本尊如千雷震时 愿即转成六字大明声</p>\n<p>　　业力追逐失所救护时 愿大悲尊为我作依怙</p>\n<p>　　任为业习所受苦痛时 愿证净光安乐三摩地</p>\n<p>　　五大种界不与我为故 愿我得见五部佛刹土</p>\n<p>　　(这段偈文大意是：由于我习气炽盛，所以漂泊于中有苦难之中。此时此刻，我应当舍弃种种恐惧怖畏之情，愿寂怒圣众在前面作引导，法界自在忿怒母在后面护持，使我摆脱中有诸苦，送我往登正觉佛土。如今我已离开亲朋好友，独自漂泊。所见的各种境界都是我的心所生，实际上根本就没有，这就是‘自心映空相’。恳请诸佛以大悲力救护我，除去我在中有时期的怖畏恐惧之情。当五智光明及佛菩萨寂、怒两部形像显现时，使我能够不恐惧，不慌乱，而能认取本性光明。当我受业力牵缠而受苦时，愿诸佛本尊能消除我的苦厄。当出现千雷齐震的宏大法音时，愿佛菩萨加持我，使它转变成‘六字大明咒’的声音。当业力追逐使我失去救护时，愿诸佛菩萨作我的依靠，当我被业力习气折磨受苦时，愿诸佛加持我，使我证入安乐详和的光明中。愿地、水、火、风、空五大种性，不与我为敌，使我能见到东、南、西、北、中五方佛土。)</p>\n<p>　　就这样和我一起竭诚发愿，则一切恐惧境相就会消失，进而可以证成报身佛。’</p>\n<p>　　以上各日诵法，每天诚心诚意念诵三至七遍，无论亡者有多大的罪业，福德如何低劣，也可以得到解脱。如果有人虽经多次指示，仍然不能得度，就会降入轮回中有时期。在轮回中有时期，我们仍然有救度的方法，这就是下面要讲述的第四阶段的行法。</p>\n<p>　　己 综述本法之胜妙功德</p>\n<p>　　本密法乃一切法中续部心要，中有教授要诀；仅由耳闻即得解脱。若获目见，亦得解脱。凡在临命终时，多为每一种习气之所惑乱；除此‘听闻解脱密法’，更无其他方便。惟诸胜上修行人，平日熟修薰习，于证智上，曾有指证及觉受者，到身心分离时，法性显现，则于‘死位中有’明光初现之时，在认识上极为有力，故此法当于在生之时，奉为课诵，明记勿忘，是为至要！并于此文字句义，涵泳玩味，通达了解，如理作意，三时念诵，习以为常；如能明白句义，牢记于心，纵有百鬼驱逐，于此句义亦不忘失。若复有人，经过一次听闻，虽其人曾积无间大罪，亦得解脱。故对此微妙密法，当于大众中，广为朗诵，令其一度听闻；虽复不解其义，但在‘中有’时，自内证智，豁然开朗，记忆力强，较在生前，超过九倍，其在尔时，一字亦不忘失而能记忆。故当于世间之人，广为详说；诸病人前，当为朗诵；亡者耳旁，亦当朗诵。对此妙法，广为流通，有缘之人逢遇此法，极为庆幸！其有未积善根资粮，或未净垢障者，甚难遭遇，纵使得遇，亦难容心信受，坐失大利而已。凡有阅此法者，仅需对之不起颠倒妄见，即可解脱，是故对之极宜珍重！</p>\n<p>　　法性中有指示终。</p>\n<p>　　(此段解释参见本书117页)</p>\n<p>　　五、行法实施</p>\n<p>　　中有教授听闻解脱密法　藏名巴多脱卓</p>\n<p>　　西藏密教初祖莲华生大士心传宝典</p>\n<p>　　取库藏者持明羯磨洲大师自黄金河畔堪波达山请出流通</p>\n<p>　　诺门金刚乘弟子寿固金刚孙景风敬译</p>\n<p>　　(四)第四阶段行法</p>\n<p>　　正编下卷 轮回中有教授</p>\n<p>　　◎皈敬偈</p>\n<p>　　皈命依怙尊　上师及三宝　愿慈悲摄受　中有得解脱</p>\n<p>　　上卷中有教授，已至法性中有，兹当开演轮回中有解脱法。</p>\n<p>　　正编下卷讲的是第四阶段的行法，即轮回中有时期的救度方法。这一阶段的行法，要在亡者断气十八天之后开始实施。‘皈敬偈’的意思就是表示我们愿皈依佛菩萨并请求加被之意。这段‘皈敬偈’的意思就是：我愿皈依上师及佛、法、僧三宝。祈请诸佛菩萨慈悲摄受我，做我的依靠，把我从中有苦难中解脱出来。</p>\n<p>　　第一章 死后之境界</p>\n<p>　　前卷关于法性中有，经已详细导示。除已能了悟真实法相及具净<a href=\"/remen/xingshan.html\" class=\"keylink\" target=\"_blank\">行善</a>业之人、如说实行而得解脱者外，然仍有未能了悟及具恶业之人，缘于业力炽盛，不解实相；或为业力所牵，恐惧怖畏；虽经导示，自失得度之机，延至二七终了、而仍未能证入者，当诵下文，印入其心。</p>\n<p>　　甲 中有身之生起及其特能</p>\n<p>　　作法者，先于三宝前，尽力设供，如法举诵启请诸佛菩萨加被等偈，悉照前卷‘诵法实施’中所规定，应呼亡者之名，如下导示，三至七遍。</p>\n<p>　　经过前三个阶段的行法，亡者应该了悟实相，认取光明。但仍有恶业深重之人，为业力所牵，虽然经过多次指示，仍然对各种境相感到恐惧怖畏，失去得度的机会，而落入轮回中有。行法者应该继续为这些人实施轮回中有时期的救渡方法。在行法时，同以前一样，每日念诵‘谛实力偈’(见本书178页)三或七遍，召唤亡魂前来听法。然后再念诵以下导示三至七遍。导示一至导示四介绍了中阴身的形成及其特能。</p>\n<p>　　导示一</p>\n<p>　　善男子(某某)：谛听勿乱！人于死后，沦入地狱，或生天道，乃至转成‘中有之身’，如是名为‘超常之身’。汝于死后，初则经过三日半或四日之昏迷，迨汝苏醒，经历‘法性中有’‘寂相’‘怒相’诸部圣众，智光炳照，种种示现，方便接引，惜汝愚而无知，惧不证入，蹉跎自误迄至今时，犹自以为如梦初醒，同时转成发光之体，类似生前所具之色身，此如密典教示偈云：</p>\n<p>　　当得相似幻色身　类乎前身当生身</p>\n<p>　　六根觉能齐赋有　行动无碍任游行</p>\n<p>　　具有业通神变力　同类天净眼见形</p>\n<p>　　此偈教示，即今汝之现在境相也。发光之体，经文解为‘类乎前身当生身’，意指亡者将赋之身，恰如前世宿业所感，亦得相当福报庄严相似之身，名曰：‘意生之身’。惟幻不实，随业而转。故如汝因己前业力当感生天趣，天趣境相，立即现前。或生修罗道、人道、傍生道、饿鬼道、地狱道，各道境相，无不随感而现，此皆由业感果，如影随形。所谓‘类乎前身’者，‘前身’二字，隐指汝死后三日半或四日前之血肉色身；‘当生’二字，则指所感将来投生之处情景。是以经句‘类乎前身当生身’，应即解为类乎已弃之色身，与夫将来重复受生应赋之色身。惟汝如遇有如是生身境相，无论如何，勿起贪求生身之念，亦勿怯弱；设因怯弱而生贪求，则汝又将沦入生死轮回之中，受苦无休矣。</p>\n<p>　　迄至昨日，汝仍不悟‘法性中有’，以致漂泊至今，尚无归宿之所。今者汝当依奉上师所传教授，心不散乱，善自安止，任运无为，则自内证智，元明光照之境，自得现前。果能如是，自得解脱，不再蹈入受生胎门。设若不能，则当信乐虔敬，观想汝之上师本尊、或‘大悲怙主’，在汝顶上，荫庇于汝，而以猛利欲乐之心，诚恳祷求，专一信仰，执持勿失为要。如上导示，彼亡者但能了悟，依说坚持，自得解脱，不再沦入生死苦海中。设因业力所牵，仍未了悟而证入者，当再呼亡者之名，念诵下文而告之曰：</p>\n<p>　　‘导示一’内容如下：</p>\n<p>　　‘某某人，请不要慌乱，仔细听我为你讲法！人死后，有的直堕地狱，有的直生天道。除这两种人没有中阴身，其余的人都会有中阴身。因中阴身不同于我们的肉体，所以又叫“超常之身”。你死后经过三至四日的昏迷，清醒后又经历了十四天的法性中有时期。由于你对寂部、怒部佛菩萨的种种示现，愚而无知，惧不证入，延误至今，实在可惜。当你渐渐从昏迷中清醒过来，就会发现，自己已不再拥有原来的身体，而是变成以风大为主，发出淡色光的中阴身。这个中阴身正如密教精典中偈文所描述的那样：</p>\n<p>　　“当得相似幻色身，类乎前身当生身</p>\n<p>　　六根觉能齐赋有，行动无碍任游行</p>\n<p>　　具有业通神变力，同类天净眼见形”</p>\n<p>　　这段偈文告诉我们，中阴身是由于我们六根不清净，第七识执著有我而幻现出来的身体。因第七识为意根，所以又称中阴身为意生之身。这个意生身虚幻不实，它的形状开始就类似于我们死亡前的身体(即“前身”)。以后，中阴身会随著业力的变化而变得与将要投生的身体(即“当生身”)相似。在人死后，由于业力所感，当投生哪一道，哪一道的境界就会现前。亡者的自识就会随著境界的变化而发生变化，于是引起意生身的变化。比如贪心重的人将投生饿鬼道，饿鬼道的恐怖境界就会现前，这时随著亡者心念的变化，其中阴身慢慢就会变成饿鬼的形像。所以无论我们身体发生什么变化，无论我们看见什么境相，我们都不要贪求或者惧怕，否则就会再次投入生死轮回之中，无有了期。</p>\n<p>　　由于你在法性中有时期未能认取光明，以致漂泊至今，无有归宿。现在你应按照上师对你的教导，心要空净，不要散乱。本性光明就会再次现前。你如能当下认取，即可解脱，不会再蹈入受生之门。如果你做不到，则要以愉快的心情，一心一意，虔诚恭敬观想你的上师本尊，或观世音菩萨，在你的顶上或面前保护你。’</p>\n<p>　　按照上文导示亡者，如果亡者能按照导示的要求去做，就能够得到解脱，而不再沦入生死苦海。如果亡者被业力所牵，不能自主而未证入，则要继续为亡者念诵以下导示。</p>\n<p>　　导示二</p>\n<p>　　善男子(某某)：谛听勿乱！上偈所云：‘六根觉能齐赋有’者，谓汝生前，或为目盲，或耳重听，或不良于行，乃至诸根残缺，今在‘中有’境中，汝目能视，耳亦能闻，六根无损，聪明伶俐，一切具足，所以证明汝已离世，漂泊中有，了悟此理，记持勿失。</p>\n<p>　　复次，所谓：‘行动无碍任游行’者，谓汝现今已受得中有意生之身，业已脱离质碍血肉之躯，故具种种特能，意念所至。通过磐石、山陵、丘垄、地土、房屋乃至须弥四洲，任汝游行，无有阻碍，惟除‘菩提迦雅’(指印度金刚座，为贤劫诸佛如来共成佛道示现之处。)及母体子宫不净之门，不能穿过外，纵如须弥山王，往来穿过，亦无窒碍。即此可证汝已沦泊‘中有’。惟汝今者，当善自了知，恳切忆念上师本尊，竭诚祈祷于‘大悲怙主’，是为切要！</p>\n<p>　　‘导示二’内容如下：</p>\n<p>　　‘某某人，请不要散乱，仔细听我为你讲法！在导示一的偈文中，提到中阴身“六根觉能齐赋有，行动无碍任游行”。这句话就是说：尽管你生前六根残缺不全，是盲人，或者是聋子，或者行动不便，但中阴阶段的你却聪明伶俐，六根完好无损，能看，能听，而且行动无碍，可以任意游行。只要意念一动，就可以穿越磐石、山陵、土地、房屋乃至须弥四洲。除佛的金刚座和母体子宫外，没有什么东西能阻碍你。千里万里往来穿逡，一飘就到。所以种种迹象表明，你已脱离血肉质碍之躯而拥有中阴之身。现在，你只有恳切忆念上师本尊，竭诚祈请观世音菩萨，才能脱离中有之苦。这一点你一定要牢记勿忘！’</p>\n<p>　　导示三</p>\n<p>　　嗟！善男子(某某)：所谓‘具有业通神变力’者，此非谓汝修持功德或禅定所证之通所致，盖由业力所感之神通，属于业等流(由因流出果，由本流出末，因果本末相类似，谓之等流。)一刹那间，能绕‘四洲须弥’，于所意欲任游境地，一刹那顷，皆能应念而至，犹如壮士手臂伸屈之顷，即能到达。一切忆求，或忆或不忆，无有不能示现者。今汝已能无碍示现，当认取之，祈请上师印证。</p>\n<p>　　‘导示三’内容如下：</p>\n<p>　　‘某某人，你现在的中阴身“具有业通神变力”。一刹那间，能绕须弥四洲。无论什么地方，远隔千里万里，你一动念即可飘到，就像身体强壮的人伸出手臂一样容易。你以前记不住、想不起来的事情，现在只要一动念，即可回忆起来。这种突如奇来的神通完全是由业力所致，而不是你修行功德或禅定功夫所证的神通，所以称为业通。这只是小小的神通，不可与佛的六通相提并论。你现在虽能无碍示现，但仍处在生死轮回苦海之中。你应诚心祈请上师，佛菩萨的加被，使你脱离中有诸苦(业等流就是由业力所致的果)。’</p>\n<p>　　导示四</p>\n<p>　　嗟！善男子(某某)：所谓‘同类天净眼见形’者，此谓在‘中有’时业力相等之同类，诸相毕见，又感生天道之同类，彼此互相能见，他趣亦然。惟汝对之不可贪恋，当观修‘大悲怙主’。又所谓‘以天净眼见形’者，谓由天等福德之力所成。又凡如实修习禅定之天净眼，固亦能见，然非一切能见，于所见前，专注则见，不专注则不见，若心神外驰，亦不能见。</p>\n<p>　　‘导示四’内容如下：</p>\n<p>　　‘某某人，你要注意，中阴身可以“同类天净眼见形”。这就是说，你可以看到业力相等的同类。比如，由于业力的缘故，你将投生天道，就可以见到天道的同类和天道的境相。应投生其他道的也可以见到其它道的同类和境相。所以你对所见境界不要贪恋，应时时观修观世音菩萨。“同类天净眼见形”既不同于“天净眼见形”，也不同于修习禅定功夫所得的“天净眼”。“天净眼见形”是由福德业力所得，而修习禅定所得的“天净眼”，也不是一切都能见，要专注才能见到，不专注，心神外驰就见不到。’</p>\n<p>　　乙 中有身特殊状态</p>\n<p>　　导示五</p>\n<p>　　嗟！善男子(某某)：汝将藉是中有之身，目观尘世熟谙之境，亲属故友，犹如梦见，汝虽目睹，就之而语，悉皆无闻，置之不答。但见汝家，已在举哀，亲属人等，悲号哭泣；遂自计曰：‘吾今岂已死乎？为之奈何！’此念甫生，遂感极剧烈之痛苦，犹如热釜中被煎之鱼，汝今正已亲历矣！然汝今者，已经隔世，虽徒自苦，亦复何益，当勿贪恋！汝在生前，若有上师，则当祈请上师，同时观修本尊或‘大悲怙主’而作祈请，则痛苦自止，怖畏自除。</p>\n<p>　　导示五至导示九，介绍了中有身在轮回中有时期的境界。</p>\n<p>　　‘导示五’内容如下：</p>\n<p>　　‘某某人，现在凭借你的中阴身，就能看见生前你所熟悉的地方和环境，能看见你的亲朋好友，虽然你能看见他们，并和他们讲话，但他们却听不见你的声音，对你不予理睬。当你看到家里人们已在为你举哀，亲属等人，为你悲号哭泣。这时你才会想：难道我已经死了吗？！怎么办呢？！此念一动，遂感极剧烈的痛苦，就像在锅中被煎炸的鱼一样。你应该明白，你已与世隔绝，只有自己痛苦，但痛苦又有什么意义呢？！现在你应立即断除贪恋之情，如果生前归依过上师，你应当祈请上师，同时观修本尊或观世音菩萨，这样痛苦就会解除，就不会再感到恐惧害怕了。’</p>\n<p>　　导示六</p>\n<p>　　嗟！善男子(某某)：汝被业风吹送，鼓动追逐，甚难自主，失其自由，自内证智，无所凭依，正如风卷毛羽，任其起落；又如疾乘野马之上，颠苦奔驰，喘息不定，漂泊无依。忽又闻呼汝之名而哭泣者，汝虽止之勿哭，惟彼哭者，置若罔闻，终不理会；又自计曰：‘我已死乎？’于是又感极大苦痛。惟汝今者，切勿悲痛。又汝所见之光，不分昼夜，皆如灰白淡色之曙光，如是逗留‘中有’，或一七、或二七、或三七、或四七、或五七、或六七、乃至七七四十九日，惟普通‘轮回中有’之苦，为二十二日，但随业力，久暂无定。</p>\n<p>　　‘导示六’内容如下：</p>\n<p>　　‘某某人，你现在被业风鼓动、吹送、追逐，难以自主，本性智慧已被业力遮盖。就像被风吹卷的羽毛，任其起落，漂泊无依；又像疾乘在野马之上，颠苦奔驰，喘息不定。忽然你又听到有人一边叫你，一边在为你哭泣，你虽然劝他们不要哭，但他们却置若罔闻，终不理会。你终于明白，自问：我已死了吗？！于是感到极大的痛苦。你应知道，你现在正处在轮回中有时期，所见到的光，不分昼夜，如同浅淡灰白的曙光。一般说来，轮回中有时期为三十五天。但随业力，或长或短，并不一定。在这个阶段，你千万不要悲哀痛苦，这是最重要的！’</p>\n<p>　　导示七</p>\n<p>　　嗟！善男子(某某)：在此时期，业海红风，极可怖畏，不堪忍受，自汝身后，猛烈推荡，吹送而来。汝当对之勿生怖畏，要知此实为汝自识迷幻境相所现也。又有极可怖畏之黑暗处，最难忍受者，今临汝前，此时发生‘击’‘杀’之声，种种怨敌怖畏，亦临汝前，汝当对之勿生恐怖。复次，又有罪大恶极者，出现肉食鬼啖人罗刹，各持种种兵器，口喊‘击’‘杀’喧声，呼啸汹涌，直扑而来，状极凶猛；又有种种可怖猛兽，作追逐相，亦复临前；狂风暴雨，大雪深雾，群众追逐，狂扑而至；又复发出巨响，有如山崩海啸，或如烈火喷轰，又如狂风怒吼，种种巨声，惊怖欲绝。于是汝四窜逃奔，不择去路，终遇三大绝壁，一白、一黑、一红，悬崖千丈，深不见底，生路俱穷，势将下坠三大绝壁之中，岌岌可危！嗟！善男子：三绝壁者，即‘贪’‘嗔’‘痴’，非为实质，此时当知已为‘轮回中有’，当念大悲怙主名号，称自己名，唱言</p>\n<p>　　依怙大悲　圣观自在　上师三宝　慈悲加被</p>\n<p>　　惟乞拯救　脱离险峡　令勿随转　三恶趣处</p>\n<p>　　如是恳切祈祷，不可忘失！</p>\n<p>　　‘导示七’内容如下：</p>\n<p>　　某某人，在此轮回中有时期，业海红风，自你身后吹送而来，猛烈推荡，极为可怖。在难以忍受的黑暗之中，会突然发出非常恐怖的打、杀之声，许多充满怨怒的敌人，也追杀而来，使你不堪忍受。对此你千万不要恐惧害怕，要知道这些境相都是你自识变化所幻现的。还有一些罪大恶极之人，会见到许多食肉鬼怪和吃人的罗刹，形状极为凶猛。他们手拿各种各样的兵器，口喊：打！杀！汹涌呼啸，直扑而来；种种可怕的猛兽也在后面追逐；与此同时，还有狂风暴雨，大雪深雾，人群追逐，狂扑而至；再加上种种巨声，犹如山崩海啸，烈火喷轰，狂风怒吼，使你惊怖欲绝。于是，你不择去路，四处躲避逃窜。最终遇到三大悬崖绝壁：一白、一黑、一红，深不见底。你就要掉入三大绝壁之中，岌岌可危！哎！可怜你已到了穷途末日，没有生路了。</p>\n<p>　　某某人，你应该明白，现在你正处在轮回中有时期，这三大绝壁正是由你的贪、嗔、痴三毒所化，并非实有。此时你应当以自己的名义恳切祈请大悲怙主观世音菩萨，并念诵下文：</p>\n<p>　　依怙大悲　圣观自在　上师三宝　慈悲加被</p>\n<p>　　惟乞拯救　脱离险峡　令勿随转　三恶趣处</p>\n<p>　　(这段偈文的意思是说：祈请大悲怙主观世音菩萨，上师及三宝，慈力加被，作我的依靠。拯救我脱离中有险峡，使我不入三恶道。)</p>\n<p>　　导示八</p>\n<p>　　复次，若有集积资粮，奉行佛教纯洁之士，则有以福德为后护，及以安乐为前导者，来迎于前。至若生前善恶相等者，则不受任何苦乐，唯是显现昏蒙愚昧平淡之相而已。</p>\n<p>　　善男子(某某)：如是对于任何境相，凡是五欲色、声、香、味、触，随一安乐现前，汝当于彼，勿贪勿著，屏除一切贪求之想，惟自念言：</p>\n<p>　　以此一切善乐　供奉上师三宝</p>\n<p>　　此谓汝若得乐受，一心思惟上供上师三宝，切勿贪求自受。若现不苦不乐平等之相，则自内证智以不修、不整、不散乱、安止于‘大手印’境中，是为至要！</p>\n<p>　　‘导示八’内容如下：</p>\n<p>　　‘某某人，如果你生前奉行佛教，为世人造福，而积累了福德资粮，那么，在你死后就会有安乐景像前来迎接。这些安乐景象以色、声、香、味、触等多种形式在你面前呈现。对此，你应屏除一切贪求之想，切不可生欢喜之心，应一心思惟供养上师三宝，并发心：以此一切善乐，供养上师三宝。</p>\n<p>　　某某人，如果你生前所做善恶相等，那么死后就不受任何苦乐，只有昏蒙愚昧平淡之相显现而已。对此不苦不乐平等之相，你要以了了觉知性，照破昏蒙愚昧，以不修不整，不散乱而安止于了了分明的境界中，这一点非常重要。’</p>\n<p>　　导示九</p>\n<p>　　善男子(某某)：尔时如遇桥梁，八大灵塔寺庙等处，仅能暂一停憩，不能逗留过久，以汝之神识、已与躯体分离、不能自主之故，因此，汝辄懊丧，烦恼悲痛，能知之识，恍惚不定，失所凭依，尔时遂自念云：‘吁！我已死矣，为之奈何！’此念一生，心灰意冷，不胜悲叹，猛利痛苦，猬集于前。今者汝既不能逗留一地，必须他往，故勿作种种希求，惟当安住于自内证智本元无动之境。至于食品，若为汝特设者，始得享受；其他供物，无权尝食。此时亲朋，无一可以引为己助，凡此皆为‘轮回中有’意生之身漂泊之相也。此时苦乐，随业起现，汝且自见家宅境地、亲属等人、乃至汝之尸身，又自痛念云：‘我今已死，奈何奈何！’不胜绝望，遂生忧闷，自维：‘若得我一身，何不能为？’如是作念，住复流荡，觅取色身，如是境相，汝今已有。惟汝之尸身，纵复趣入九次以上，然因所历‘法性中有’已久，其尸在冬已冻，在夏已腐，否则已为亲属火化，或已土葬，或投水中，或施与鹏鸟野兽吞食，汝复欲住入，不可得也。汝因无处可栖，心极不乐，顿觉自身被推掷于山崖石缝之中，如是汝今备尝诸苦，即为‘轮回中有’，汝寻自身，所得惟是苦耳。当勿起恋身之心，于任运无为上，坦然处之。</p>\n<p>　　如上导示，死者之灵识能依教奉行者，则于‘中有’境中，自得解脱。</p>\n<p>　　‘导示九’内容如下：</p>\n<p>　　‘某某人，如果这时你遇到桥梁，八大灵塔，寺庙等建筑物，只能暂时停下来休息一会，不可逗留太久，这是因为你的神识已与身体分离，不能自主之故。因此你感到非常懊丧和烦恼。因为神识失去依靠，恍惚不定，便自言自语：哎！我已死了，怎么办呢？此念一生，心灰意冷，不胜悲叹，猛利痛苦，猬集于前。既然你不能在一处逗留太久，必须他往，于是生出种种希求。所以这时你不要胡思乱想，应安住于自性本元如如不动的境界，不要再到处漂泊。至于食品，如果是为你特设，你可以享受。其他供物，你无权尝食。现在亲朋好友没有一个人能帮助你，苦乐随业而现。你能看见你的家人及亲属，还会看到你的尸体，于是你痛苦绝望，心生忧闷而想：我要是能再有一个身体就好了，怎样才能再找到一个身体呢？此念一生，便到处游荡，寻找色身。这时你纵然往你的尸体里钻很多次，也不可能再复活了，因为你的色身已坏。已经过了法性中有时期，时间太久。在冬已冻，在夏已腐，或已为亲属火化、土葬，或已投入水中，或已喂鹏鸟野兽吞食。你已无处可栖，觉得自己好像被掷于山崖石缝之中，备尝诸苦。你想寻找身体，所得却只有痛苦！所以你绝对不要生恋身之心，对轮回中有时期的各种境界应以无为之心坦然处之。’</p>\n<p>　　经过行法之人以上导示，亡者灵识能依教奉行，则可从轮回中有苦难中解脱出来。</p>\n<p>　　丙 冥界裁判情景</p>\n<p>　　如上导示，然有缘于恶业之力，虽已指示而不能证入者，则又呼亡者之名，念诵下文而告之曰：</p>\n<p>　　导示十</p>\n<p>　　嗟！善男子(某某)：善自谛听！汝今备受如是诸苦，乃汝自作之业，非他人所能代之也。惟有竭诚祈请三宝，始能救护。如是既不祈请，又不知观修‘大手印’，亦不观修本尊，则有与生俱来司善之神，以白色石子，计量生前所作之善；又有与生俱来司恶之神，以黑色石子，计量生前所作之恶(按司善司恶之神，在藏密中，简称为俱生五神，即与生俱来不离自身司人，善恶身中五处之神，类似中国道经中之三尸神，在藏密中有修法专轨)，前来引导。斯时汝对之极度惊惶失措，悚然战栗，试为谎言，我未作恶，于是阎罗王发言：‘吾有业镜，可以鉴照’，遂与镜照，凡在生时所作一切善恶两业，悉于镜中朗然毕现，丝毫不爽，汝虽谎言，毫无利益。于是阎罗王以绳系汝颈，自后拖曳下堂，断汝之首，剖汝之心，抽汝之肠，吮汝脑汁，饮汝之血，食汝之肉，啮汝之骨，汝虽痛苦，但不致死，汝身虽碎，复又完整，重受斫切，复感大苦。汝在斯时，当其以石子计量善恶拖曳而行时，当勿惊怖，亦勿谎言，对于阎王狱卒，亦勿怖畏，要知汝今已为‘意生之身’，纵经斫杀碎割，无死因也。其实汝身本为空性本色，何须惊怖。所见境相，乃自识迷幻境相，空中之色耳。汝自习气为‘意生身’，当体本空，本来无相。由无相故，触不可得。以上所述，皆由自识迷幻境相所变，故在外界则有阎罗狱卒神鬼饮血罗刹牛头等，其实毫无实事可得。当知此时即是‘中有’，当修‘大手印三摩地’。若不知修习，当于汝身能生怖畏之自性为何，随力观照而勘破之，即证自性全不可得之空，此即‘法身’也。此空非是空无所有之空，乃‘如实不空’之空。念觉朗然起现，即为‘报身’密义也。‘明’‘空’无二，本不分离；当体即空，‘空’‘明’无别，赤裸通脱。汝于当下安住难忍状中，即‘自性身’也。复于其中本来力用，不灭遍现，即大悲‘化身’也。</p>\n<p>　　嗟！善男子：静以观待，不可散乱。设若证认上述四身，决定解脱，成佛无疑。此为佛与众生差别之分界。当此之时，心不散乱，最为重要！否则永久陷于泥涂之中，求出无期。所谓‘于一刹那分差别，于一刹那成正觉’，今正其时。汝昨日以前，由于散乱，已失得度之机。故‘中有’甫一现出，不能认识，旋即发生怖畏。今者若再因散乱而失此机，则大悲圣者慈眼注照之视线，即将中途阻断，汝则不能解脱，惟有逐业而行矣。</p>\n<p>　　以上导示，纵不证认，亦得解脱。若为俗人，不知观修者，当再呼亡者之名，念诵下文而告之曰：</p>\n<p>　　虽经过以上导示，但由于恶业牵缠，亡者不能自主，难以证入明光。这样，就要呼唤亡者的姓名，为其念诵以下导示。导示十、导示十一介绍了亡者在冥界受裁判时的情景。</p>\n<p>　　‘导示十’内容如下：</p>\n<p>　　‘某某人，请仔细听我为你讲法！你现在所受的这么多苦难，都是你自己所造业力的结果，并非他人的错误，也不是他人所能代替的。现在你只有竭诚祈请皈依上师三宝，才能得到救护。如果你既不祈请上师三宝，又不知观修本尊或“大手印”，就会出现与生俱来的司恶之神和司善之神，来记录你的善恶之事。司善之神会以白色石子计量你生前所做善事，司恶之神会以黑色石子计量你生前所作的坏事。对此你会惊惶失措，悚然战栗，并竭力掩饰撒谎说：我没有做过坏事。这时阎罗王就会说：“我有业镜台，可以照见。”然后拿出业镜台来鉴照。这样你生前所做的一切好事、坏事都清清楚楚的显现在业镜台中，不会有丝毫的差错。仅管你仍继续说谎狡辩，但已毫无意义。阎罗王会用绳索系住你的脖子，然后被狱卒拖下公堂。先砍下你的头，再剖开你的心，抽出你的肠子，吸你的脑浆，喝你的血，吃你的肉，啃你的骨头……。仅管如此，你却不死，一直备受痛苦的折磨。你的身体被粉碎之后，很快又恢复完整，再重新饱尝粉身碎骨的痛苦。所以当司善、司恶之神出现时，你不要惊慌，也不要说谎。当狱卒拖你下公堂的时候，更不要害怕。你应该明白，如今你已是意生之身，纵然被斩杀割碎也不会受损，因为你的血肉之身已经死了，不会再死！实际上，你的身体是四大假合，本来就是空，你还怕什么呢？！你所见的境相，如阎王狱卒、饮血罗刹、牛头鬼神等形相，都是由于你自识迷乱而幻现出的境相。如空中之花、水中之月，无有实体。你的这些痛苦正是由于你习气深厚所致，自以为有身体可得。即使肉身已坏，仍然执著有我，才生出意生之身。实际上，一切现相本来没有，本体是空。所以在此轮回中有时期，应按上师对你的教导修习，将一切境相化空。如果你不能将此境相化空，就应注意观照，现在你能生起怖畏之心的本体是什么？随力参究，若能照破一切境象，证得本体空性，即是法身佛，也就是自性身。但此空并非空无所有之空，而是空而不空，有而不有。于空寂中忽觉明光朗然，此光明即是报身佛。明、空无别，本不分离，当下即空，赤裸裸、净洒洒、一丝不挂。能于中有苦难之中安然自在，则一切境界即是化身佛。</p>\n<p>　　某某人，你若能心不散乱，认证法、报、化三身，当下即可解脱成佛。所以说于一刹那成正觉，于一刹那成众生，成佛就在当下。你若能当下成佛，就能于一切中有境界中安然自在而不散乱，这就是佛与众生的差别。所以，现在最重要的是，你的心不要散乱。否则，智慧光明就会被这些境界遮蔽，这样你就会产生恐惧怖畏之心，随业流转于生死泥涂之中，而不得解脱。’</p>\n<p>　　以上导示，若能认证即可解脱。否则还要呼唤亡者姓名，为其念诵以下导示。</p>\n<p>　　导示十一</p>\n<p>　　嗟！善男子(某某)：以上导示，若汝不知如何观修，则当念佛！念法！念僧及‘大悲怙主’而作祈请！所有一切怖畏境相现前之时，只有观修‘大悲怙主’及汝之本尊。若在生前曾已请求某种灌顶上师所赐之名号，并念汝之根本上师名号，对阎罗法王陈说，则汝虽已堕入悬岩绝壁险峡之中，亦无能为害，必可远离痛苦。</p>\n<p>　　‘导示十一’内容如下：</p>\n<p>　　‘某某人，经过以上导示，你若仍不明白，那么当恶境界及阎罗法王现前时，你就念佛、法、僧，或者念大悲怙主观世音菩萨，或者念你根本上师的名号，这样既使你已堕入悬岩绝壁，也不会受到伤害，可以远离痛苦，而得解脱。’</p>\n<p>　　丁 转移一切心念力</p>\n<p>　　如上导示，自能认识，无不解脱者。如仍未能解脱，兹为殷重叮咛故，再呼亡者之名，念诵下文而告之曰：</p>\n<p>　　导示十二</p>\n<p>　　嗟！善男子(某某)：当下境相，刹那欢喜，刹那愁苦，苦乐之感，最为猛烈，犹如弩炮急射而来。凡此一张一弛，汝当任凭机运，净除爱憎之念，境相自息。设汝有生天之因，天界境相，立即起现。如汝生前眷属，不明因果，杀害多数生命，而作布施，为汝祈福，汝则生起不净之境相，猛起嗔心，因此结生相续(谓投生)，感生地狱(为死者而杀生，则此杀生之业，重累死者受报。死者在中有身时，一见是事，立即呼止，然其眷属，置若罔闻，杀生如故，于是猛起嗔念。故今导示亡者，嗔念万不可生，否则即感生地狱。)，因之嗔心决不可起！</p>\n<p>　　又汝对于生前遗产，生起贪恋，或于汝之财物，知为他人侵占享用，于是对之生起嗔心；要知汝纵起贪嗔，亦无法过问，于汝无益。故当对于生前遗产，勿贪勿著，惟有断然决然，弃而掷之，任为何人享用侵占，当勿吝惜，而抱施舍之心。诚敬思惟，供献上师三宝，住于无贪无著之境。</p>\n<p>　　复次，若有为汝修作度亡仪轨，念诵‘冈嘎尼陀罗尼’及‘灭一切恶趣王咒’(此为度亡用两大要咒。冈嘎尼即东方不动佛往生咒，俱见附编。)等等修法，但不清净合法。作法者或昏沉，或懈怠、或缺犯三昧耶、或律仪不净、或行为放逸轻慢正法、或用黑教追荐之法亵渎正教。汝有微细业通，故能目睹，对于修法<a href=\"/remen/senglv.html\" class=\"keylink\" target=\"_blank\">僧侣</a>，退失正信，萌生邪见，恐惧不安，既了知已，于是汝自念云：‘噫！我竟为彼等所欺罔矣！’心遂失望，沮丧不乐，于是对于清净境相，不生信解，萌生邪见，退失正信，因此，结生相续，定生恶趣，与汝无益。盖汝嗣续所延诸善知识，为汝修作佛事，虽如何不净，当自念言：‘此是我自识境相不净，佛经圣语，宁有不净之处，譬如自形垢污，以镜鉴照，乃我本相不净。况彼诸善知识，身为僧伽，语为正法，意为佛之体性，故当皈依，作胜解想，至心爱乐净相，随汝嗣续修作佛事，定获利益。’如是生起净相之念，切勿忘失。</p>\n<p>　　复次，汝若有生恶道之因，恶道境相，即时起现。赖汝嗣续及诸眷属，为汝罪业，修作不杂邪巫之纯净佛事，所延上师阿阇黎，身语意三，善妙仪轨，汝睹见已，心生欢喜，感大愉乐。此心甫生，则结生相续，虽为堕入恶趣之因，然由此功德，定能转升上界，故汝勿生不净之心，而于信乐净相，亦勿偏向而加分别，须极端留心为要。</p>\n<p>　　嗟！善男子(某某)：总而言之，现在汝之自内证智，失所凭依，于其轻微摇动，则随善与非善之境相起现，即能起大力用。若为非善，意勿思惟，但忆生前任何修持之一种。设无修持，心应欢喜，至诚皈命，祈请‘大悲怙主’，恳切欣求发如下愿：</p>\n<p>　　嗟！</p>\n<p>　　我今独行别离诸亲友 眼前惟有自心映空相</p>\n<p>　　恳祈诸佛大悲力救拔 愿除中有诸怖畏恐怖</p>\n<p>　　倘缘业力备受诸苦时 愿本尊天消除我苦厄</p>\n<p>　　法性本声如千雷震时 愿即转成六字大明声</p>\n<p>　　业力追逐失所救护时 愿大悲尊为我作依怙</p>\n<p>　　任为业习所受苦痛时 愿证净光安乐三摩地</p>\n<p>　　依上愿文，坚切持诵，定能如愿获蒙引导，决无欺罔。如是诵说，一经认证，即得解脱。</p>\n<p>　　导示十二介绍了指示亡者转移心念的各种方法。</p>\n<p>　　‘导示十二’内容如下：</p>\n<p>　　‘某某人，你正处在轮回中有时期，喜怒哀乐，变化极快。刹那欢喜，刹那愁苦，就像急射的弓箭，忽张忽驰。比如：你有生天的福报，天界境相就会出现在你面前。如果这时你又看见亲朋好友，因不明因果，为祭奠你，为给你祈福，而宰杀许多生命。对此不净之境相，你嗔心一起，天界境相就会马上消失，而感生地狱境相。所以，于此中有时期决不可起嗔心。对于你生前财物，决不可起贪恋之心。尤其当你看到自己财物被他人侵占享用，也勿生嗔恨之心。你应当明白，你现在正处于中有时期，即使怒火万丈，也无济于事，对你更是毫无意义。所以，对于你生前的财物，应勿贪勿著，断然抛弃，任何人享用侵占也不吝惜。要有施舍之心，诚心诚意恭敬观想，将你所有之一切奉献于上师三宝。而住于无贪无著之境。</p>\n<p>　　如果有人为你举行度亡仪式，或修度亡等法，比如念诵“冈嘎尼陀罗尼”或“灭一切恶趣王咒”等，但不清净合法，或, 行法者昏沉，懈怠，犯戒，律仪不净；或者行法者行为放逸、轻慢正法；或用邪教之法亵渎正法。因你具有业通，可目睹一切，于是对行法之人，退失信心，萌生邪见，恐惧不安，而自言自语：哎！我竟被这些人欺骗！此念一动，心遂失望，沮丧不乐，并对清净境相，产生邪见，退失正信。这样，你就会堕入恶道，轮回生死，对你无益。所以对亲朋好友为你作佛事而请的善知识，尽管有什么不妥之处，你也应该正确对待和理解。应这样想：佛经圣语，是不会有不净之处的。就像照镜子，镜中的污垢，是由于我本身不净的缘故。行法者是善知识，身为僧侣，语为正法，意为佛之智慧，我应当皈依。无论他们如何为你作佛事，你都要这样想，诚心诚意，心境朗然，这样你就可以获得大利益，这一点很重要，请不要忘记。</p>\n<p>　　如果你生前作坏事，造了恶因。中有时期恶道的境相就会现前。这时，如果你的亲朋好友为了减轻你的罪业，而请善知识为你做佛事，行法者身、语、意均如同上师阿阇黎一样，<a href=\"/remen/fuhui.html\" class=\"keylink\" target=\"_blank\">福慧</a>具足。行法不加杂邪巫等不纯净之事，律仪规整，清净合法。你虽造有堕入恶趣之因，由此功德，这时也一定能转升上界。如果目睹这一切你心生欢喜，此心一动，则重新卷入生死轮回。所以，对于这些善妙境相，你千万不要有所偏好，不要心生分别，这一点极为重要。</p>\n<p>　　总而言之，你现在失所凭依，善与非善境相随业起现，你的心也随境相，时喜时悲，摇摆不定。这时你应消除爱憎之心，轮回中有境界自然就会消失。因为这些境界都是你本性所显现的。本来没有自体。就像水中之月，空中之花，如果你能空净其心，本性光明就会再次显现。</p>\n<p>　　所以，当你见到好的境相，不要起贪恋之心，见到坏的境相，也不要感到恐惧害怕。尤其面对恐怖境界，心不要乱动，要回忆你生前所修之法，来转移你的注意力。如果你生前没有修过什么法，那就要诚心诚意的皈依大悲怙主观世音菩萨，而念诵以下偈文：</p>\n<p>　　嗟！</p>\n<p>　　我今独行别离诸亲友 眼前惟有自心映空相</p>\n<p>　　恳祈诸佛大悲力救拔 愿除中有诸怖畏恐惧</p>\n<p>　　倘缘业力备受诸苦时 愿本尊天消除我苦厄</p>\n<p>　　法性本声如千雷震时 愿即转成六字大明声</p>\n<p>　　业力追逐失所救护时 愿大悲尊为我作依怙</p>\n<p>　　任为业习所受苦痛时 愿证净光安乐三摩地</p>\n<p>　　(这段偈文的意思是：如今我离别亲朋好友，独自在中有险峡道中徘徊。各种中有境界虽然本体是空，但却历历在目。恳请诸佛菩萨以大悲力救护我，把我从中有时期诸种苦难中超拔出来。当我被业力束缚而受苦时，愿诸佛菩萨能救度我，消除我的痛苦。当千雷齐震的宏大法声出现时，愿佛菩萨加持我，把这种声音转化成“六字大明咒”的声音。当我被业力幻现的恶境追逐时，愿佛菩萨救护我，做我的依靠。当我被自己的习气支配，造业受苦时，愿佛菩萨加持我，使我证得安详，自在的境界。)’</p>\n<p>　　亡者按上述偈文深切发愿持诵，一经认证，定能如愿获得解脱。</p>\n<p>　　戊 六凡道劣光现前</p>\n<p>　　复次，如上多次修诵，应得解脱。若被业力所制，仍难领悟者，可再为之反复申述，多次念诵，自得大益。此时再呼亡者之名，念诵下文而告之曰：</p>\n<p>　　导示十三</p>\n<p>　　嗟！善男子(某某)：若于如上诸般导示，忆而不持，则于此时，前有之身形，逐渐消散，隐没不见，而后有之身，将益明显，不胜愁闷。遂自念云：‘伤哉！我已备受诸苦，任投何身，当往觅之。’此念一生，往来奔驰，飘飘荡荡，不知所之，六道轮回，即于此时起现。业感何道，何道之光起现愈强。</p>\n<p>　　嗟！善男子(某某)：谛听！何谓六道之光？此谓天道之光，其色灰白，修罗道光，其色黯绿；人道之光，其色浅黄；傍生道光，暗蓝为色；饿鬼道光，色为淡红；惟有地狱，光如烟雾。当诸光起现时，汝之身色，感生何道，亦即现何道之光色。</p>\n<p>　　嗟！善男子(某某)：在此时际，教授之法，最为重要，任何光现，皆当观为‘大悲怙主’放光，存想其光冉冉而来者，即是大悲至尊(圣观自在菩萨)，此为最极深要之导示，而能遮闭投生之处。又或汝已曾修习随一之本尊，观如幻境，毫无自性，持久观修，则知此所谓‘净幻身’也。次观本尊身形，自外而内，渐渐隐没，至不可得，则于‘明’‘空’无执之状，安住顷刻于法界中。再次观本尊，次观明光，如是轮流观想；再观自内证智，亦自外而内，渐皆隐没，空遍一切，明遍一切，法身遍一切，平等安住于法身离戏境相中。在此境上，自能遮止投生之处而成佛矣。</p>\n<p>　　经过如上多次导示，亡者一经领悟应得解脱，如果业力深重之人，仍难领悟，可再次呼唤其名，念诵如下导示。</p>\n<p>　　‘导示十三’内容如下：</p>\n<p>　　‘某某人，由于你对以上种种导示不明白，未能修持，故沦落至今，以前的中阴身形逐渐消失，新的中阴身形日益明显。这就是中阴身的生死。所以你日感愁闷，自言自语：哎！我已备受中有之苦，现在随便投个什么胎都行。此念一动，往来奔驰，四处飘荡，不知所措。此时，六道轮回即将开始。你业感何道，何道之光将显现于前。某某人，请你注意，这六道之光，颜色各不相同：天道的光是灰白色，修罗道光是暗绿色，人道的光是浅黄色，傍生道的光是暗蓝色，饿鬼道的光是浅红色，地狱道的光犹如烟雾状。</p>\n<p>　　某某人，在此紧要关头，你要听我为你指示！要记住：无论什么颜色的光现前，你都应当观想，此为大悲怙主观世音菩萨所放的光，或者选择一个你曾修法观想成功的本尊，观想：此光是由本尊之身冉冉而来，然后再观想大悲观世音菩萨或本尊身形，自外而内，渐渐隐没，至不可得。由此“明”“空”之中，“有”“无”之间而悟一切皆幻，毫无自性的道理。所观想出的观世音菩萨和本尊身形也是幻相，但这些是清净之相，所以又称“净幻身”。你就这样从无观想到有，再从有观想到无，反复轮流观想。一时空遍一切，一时明遍一切。顿觉“明”“空”无二，均是法身的显现。由此你就可以安住于法身离戏境相之中，关闭投生之处而证佛位。’</p>\n<p>　　第二章 转生方式</p>\n<p>　　己 避免生死闭塞胎门</p>\n<p>　　又有虽已修习，亦能猛切希求，惟因平时未能熟修娴习，仍不认识，则昏迷无知，徘徊胎门者亦多有之。于此有闭塞胎门之教授，最为重要。再呼亡者之名，念诵下文而告之曰：</p>\n<p>　　导示十四</p>\n<p>　　嗟！善男子(某某)：如上导示，仍不认识，则于斯时，缘于业力，或往上行，或平面而行，或向下注视，如是境相，即将起现。此时汝当观修忆念‘大悲至尊’。</p>\n<p>　　复次，如前所说，狂风暴雨，大雪深雾，冰雹黑暗，群众追逐，种种境相起现，虽欲逃避，其福德薄弱者，反逃往苦难之地；福德具足者，则能到达安乐之处。善男子！当此之时，投生何洲，或生何道，一切境相，即时起现于前，临此时机，则有极多甚深教授要义，当勿散乱，一心谛听！因汝以前对于导示种种要义，既不认识，对于修习，又极劣弱，故当择处而往，一心谛听。此有闭塞胎门之法，极为重要。此中闭塞胎门法有二：(一)能入补特伽罗闭塞法。(二)所入补特伽罗闭塞法。</p>\n<p>　　(一)制止亡者勿入胎门之教授</p>\n<p>　　嗟！善男子(某某)：汝曾修过随一之本尊，即观所现如幻化，毫无自性，如水中月，朗然映现。若无一定本尊，则以‘至尊大悲圣观自在菩萨’为我本尊，观想明了，晃然灿然。次观本尊由外而内，隐没无形，随其所至之处，观为归于不可得之明空，此乃甚深要义，而为不入胎门之妙法，故当如是作观。设于尔时，仍不能闭，则有入胎之准备，再听下文导示：</p>\n<p>　　(二)闭塞所入胎门之教授</p>\n<p>　　复次，闭塞所入胎门甚深教授，此中分为五步，汝当谛听！</p>\n<p>　　又有一些人，虽然也急切希望从中有苦难中解脱出来，但因平时未能熟修娴习本密法，对于指示，昏迷无知，不能认识，仍徘徊在胎门之外。因此本章将讲述闭塞胎门之教授，此时应再次呼唤亡者姓名，念诵如下导示。</p>\n<p>　　‘导示十四’内容如下：</p>\n<p>　　‘某某人，经过以上导示，如果你仍未醒悟，这时可能会往上升，或者向下降，或者平行移动，这都是由于你的业力所致。同时还有可能出现狂风暴雨，大雪深雾，冰雹黑暗，人群追逐等境相。你虽想逃避，但由于你福薄德弱，反而逃往苦难之地。当然如果你是福德具足之人，则能到达安乐之处。此时缘于业力，你将投生到什么洲或哪一道，其相应的境界就会现前。这些境界将引诱或者逼迫你前往。如果你对以上种种导示要义不明白，对于修行，又比较懒散，不能证入佛之真空妙有的境界，你就要仔细听我为你讲解闭胎的法门，小心选择去处。这一点，对你极为重要。闭胎之法可分两种：一是制止亡者勿入胎门，二是闭塞所入之胎门。</p>\n<p>　　1 制止亡者勿入胎门的方法</p>\n<p>　　当中有境界现前时，你应一心观想你曾修过的本尊。如果你生前没有修过任何本尊法，则观想大悲怙主观世音菩萨为自己的本尊。首先，观想本尊光彩夺目，晃然灿然；然后再观想本尊，由外而内，渐渐消失无形，随之所有一切境相均如幻化，渐渐消失，归无所得。这样观想就可以将中有境界转化为明空境相，从而关闭所有入胎之门，这是非常重要的方法。如果你做不到，就有入胎的可能。请继续听我为你指示—关闭所入之胎门的方法。</p>\n<p>　　2 关闭所入胎门的方法</p>\n<p>　　关闭所入胎门的方法，又分为五种，下面我将为你逐一指示，请仔细听。’</p>\n<p>　　[1]闭塞胎门第一步 导示十五</p>\n<p>　　此有偈云：</p>\n<p>　　嗟！</p>\n<p>　　我今轮回中有起现时　意念纯一至心当保持</p>\n<p>　　善妙缘会尽力求延续　永断胎门回头须忆念</p>\n<p>　　努力净相唯一需要时　嫉妒永断修上师双身</p>\n<p>　　以上偈语，以清朗之声，为之念诵，策发其意，如文观想，依次修习，至要！至要！</p>\n<p>　　此中义理，所谓‘我今轮回中有起现时’者，谓汝今已沦为‘轮回中有’之相，于其境相，自可证知；汝今试向水中或镜中观之，均不见汝之形色，亦无身影可见者，盖由汝已舍离生前质碍血肉之躯，而为意生之身，漂泊无依，即为汝已沦入轮回中有显著之相，故当意念纯一至心保持，唯以‘一心虔诚’为主。臂如以缰御马，一心专注，向前驰行，诚恐为恶业所牵而致转变意念。其在人间，若已对于正法及上师灌顶教授、或圣教经典、与此《中有听闻解脱密法》随择一种，发心忆念，而‘善妙缘会尽力求延续’，不可散乱。要知上升与下降之界限，即在此时。于此一刹那间，因懈怠而丧失者，即为示现痛苦来临之时；于此一刹那间，意念专一而能保持者，即为示现安乐来临之时。故当‘意会纯一至心当保持’与‘善妙缘会尽力求延续’。今者闭塞胎门，时期已至，即‘永断胎门回头须忆念’‘努力净相唯一需要时’也。</p>\n<p>　　如上所说，其在此时，初当清净胎门，次说闭塞之法，共有五步。已说第一步，次说二三四五步，当善自忆持。</p>\n<p>　　关闭胎门的第一种方法，即‘导示十五’。</p>\n<p>　　‘导示十五’内容如下：</p>\n<p>　　‘某某人，为了关闭所入之胎门，你要按照我为你念诵的偈文去做，这段偈文就是：</p>\n<p>　　嗟！</p>\n<p>　　我今轮回中有起现时　意念纯一至心当保持</p>\n<p>　　善妙缘会尽力求延续　永断胎门回头须忆念</p>\n<p>　　努力净相唯一需要时　嫉妒永断修上师双身</p>\n<p>　　这段偈文的意思是说：你现在已经进入“轮回中有”时期，你可以站在镜子前面，或俯身看水中，均看不到你的身影，这就证明你已经离开质碍血肉之躯，而成为中有意生之身。中有意生之身失所凭依，尤其在轮回中有时期，各种境界纷纷现前，你的心念也随之变化极快。所以此时你应当竭尽全力保持意念纯一。就像驾御脱缰之马，一心专注，不要被恶业所幻化的各种境界迷惑，不要让意念随境而转。现在你应当一心回忆生前所修之法，或上师对你的教导，或者自己所熟悉的佛教经典，或者本《中有听闻解脱密法》，不要散乱。要知道，因散乱，于一刹那遂堕入生死轮回而受苦；因保持意念纯一，于一刹那可脱离生死苦海而得安乐自在。解脱的关键在此一举！在此紧要关头，你要按我的指示去做，在佛菩萨的加持下，即可永断胎门，这就是关闭胎门的第一种方法。’</p>\n<p>　　[2]闭塞胎门第二步 导示十六</p>\n<p>　　嗟！善男子(某某)：此时男女交会行相，又现汝前，当睹见时，应抱定坚持不入其间之念。当观男女父母双身，即为上师父母双尊，向之敬礼，意存供献，竭诚恭敬，请求正法，至心专注，定能闭塞胎门。若仍不闭，将有必当入胎之势，则观男女父母双身为我本尊，或观本尊即‘大悲怙主’父母双身之体，对之供养，意变供物(谓以自己意所变现之供品为供养)而伸供献，请求赐我悉地。如是竭诚为之，即能闭塞胎门矣！</p>\n<p>　　关闭胎门的第二种方法，即‘导示十六’。</p>\n<p>　　‘导示十六’内容如下：</p>\n<p>　　‘某某人，当你看见男女交会的情景时，你要抱定不入其间的心念。并把他们看成是上师父母双身，或者是双身本尊，或者是大悲怙主观世音菩萨的双身之体。并竭诚恭敬向他们敬礼，同时用意念观想出许多上妙供品，来供养他们。并请求他们赐给你智慧，使你不为境界所转。就这样竭诚恭敬的观想，即能闭塞胎门，否则就有入胎之势。’</p>\n<p>　　[3]闭塞胎门第三步 导示十七</p>\n<p>　　复次，如上所示，胎门仍未闭塞，将有投入之势。今第三步，宣示遣除爱憎之教授。其中生门，共有四种，即卵生、胎生、化生、湿生。四生之义，卵生胎生，二者相同。如前所说，男女交会，已现于前，当在尔时，乃由贪爱或由憎嫌而入其胎。一入其胎，受生为马，或为鸡犬，或为人等，随其一处，俱有可能。若受生为男，则自现男相，对于其父，深生憎嫌，对于其母，则生贪爱之念；若受生为女，自现女相，对于其母，深生嫉妒，对于其父，则生贪恋之心；由此因缘，遂入胎门，适为男女红白两明点交会时期，感受‘俱生喜’已(俱生喜是密法中四喜之一。)，则安乐与意想，遂起昏沉颠倒之相，则凝结为‘羯罗兰’(胎儿在母腹中一周，谓之羯罗兰。)‘遏部昙’(胎儿在母腹中二周谓之遏部昙。)之胎身。迨至从胎而出，张目而视，反为一犬，在犬窝中受苦。如是或在猪圈，或在蚁巢，或生为牛犊、羔羊，欲返不得，愚蠢无知，绝望之际，备受种种苦恼，如是展转无期，或入地狱，或生饿鬼，六道之中，轮回不已，为无量诸苦之所逼恼，又或为摩目侯罗伽(大腹行)，如是之人，执著不悟，毫不畏惧，可悲可叹，言之心悸。若无上师胜妙教授者，几何不堕入如上所述悬崖险窟之中乎。一经堕入，则沉沦生死，求出无期，是故当听我说，对此教授，牢记在心；今者所示遏止爱憎闭塞胎门教授，善自谛听而保持之。上述‘永断胎门回头须忆念，努力净相唯一需要时，嫉妒永断修上师双身’，即谓此也。上不云乎！若受生为男，爱母憎父，受生为女，爱父憎母，故为嫉妒所生之相。其在此时，有甚深教授要诀。嗟！善男子，爱憎妄念生起之时，应即观修如左：</p>\n<p>　　哀哉！如我有情，恶业深重，沦没生死，爱憎为依，设不自拔，耽著爱憎，自陷生死。长劫沉溺大苦海中，无量无边，永不得出。我自今后，当弃爱憎，永不需作。噫！今后爱憎，决不再作。</p>\n<p>　　如是思惟，自呵自责，至心专一，猛利保持，此如教典云：</p>\n<p>　　惟有此誓愿　可闭塞胎门</p>\n<p>　　嗟！善男子(某某)：心勿散乱，意念纯一，至心保持，是为最要！</p>\n<p>　　关闭胎门的第三种方法，即‘导示十七’。</p>\n<p>　　‘导示十七’内容如下：</p>\n<p>　　‘如果经过以上导示，胎门仍然未闭，还有投入之势。在此我将为你讲授关闭胎门的第三种方法—即断除爱憎之情。</p>\n<p>　　生门共有四种：即卵生、胎生、化生和湿生。其中卵生、胎生两者相同，都是看见男女交会的情景。如果这时，你由于贪爱或憎嫌而加入其间，就投胎了。一入其胎，就有可能受生为马、为鸡、为犬，或为人等。如果受生为男，则现男相，贪爱其母，而憎嫌其父；如果受生为女，则现女相，贪爱其父而憎嫌其母。所以，投胎受生还是由于你不能断除爱憎之情的缘故。</p>\n<p>　　如果你执迷不悟，不按上师的教导去做，不断除爱憎之情，则在男女交会(即红、白两明点交会)时期，你会感到“俱生喜”。这短暂的安逸快感，使你昏沉颠倒，这样你就住胎了。当你生出来的时候，睁开眼睛，才发现自己已变为一犬，在犬窝中受苦；或者是在猪圈、蚁巢；或者变为牛犊、羔羊等，欲返不得。绝望之际，倍受种种苦恼。由于愚蠢无知之故，死后，会再次被投入地狱，或生为饿鬼，或生为摩目侯罗伽(意译为地龙、大蟒蛇、大腹蛇等)，堕入苦难的深渊，受无量诸苦。实在是可悲！</p>\n<p>　　因此，你要认真牢记我对你的导示，永断爱憎之情，即可关闭胎门，这就是关闭胎门的要诀。上述偈文中，“永断胎门回头须忆念，努力净相唯一需要时，嫉妒永断修上师双身，”就是这个意思。所以，当你爱憎忘念生起时，你要自呵自责按下文发愿：</p>\n<p>　　由于我恶业深重，对各种境相心生爱憎，故长劫沉沦于无量无边的生死苦海之中，永无出头之日。由于爱憎之故，使我饱受诸苦，自陷泥潭，实在是可悲、可叹！从今往后，我一定要永远抛弃爱憎之情，断除情欲之心。</p>\n<p>　　你要这样思惟，至心专一，不要散乱！只有这样勇猛精进的发愿，方可闭塞胎门。至为重要！’</p>\n<p>　　[4]闭塞胎门第四步 导示十八</p>\n<p>　　又虽已如上导示，然胎门未闭，将有投入之势，则又有‘如幻不实’之教授，令其闭塞胎门，观修如左：</p>\n<p>　　嗟！嗟！男女父母双身也，暴雨狂风也，霹雳巨声也，怖畏境相也，一切情器世间，所有实体相状，自性如幻，虽其如何显现，终非实有，一切虚幻不实，如梦如幻，无常无定，何用爱著？何用恐怖？此是无中见有，一切诸法本从心生，心性如幻，本来即无，欲到彼岸，岂有是处。嗟！汝从本以来，在迷不悟，故执无为有，执假为实，执幻为真，由来已久，沉沦生死，以迄于今。如再不知如幻不实，则永久沉沦苦海，陷入众苦泥涂之中，岂有穷期。是故当观此一切。如梦如幻，如空谷回声，如海市蜃楼，如镜中形影，如眼中空花，如水中之月，虽刹那间，欲求真实，亦不可得。故当意念纯一，至心保持，屏除执实之念，专注相续，汝必废然知返，及早回头矣。如是一心决定，了知非实，胎门自闭。</p>\n<p>　　虽然经过以上指示，但胎门仍然未闭，亡者还有投胎之势，这时要继续为亡者指授关闭胎门的第四种方法。此段导示又称‘如幻不实’之教授，就是告诉亡者不要执著，一切境相都是虚幻不实的。其具体指示如下。</p>\n<p>　　‘导示十八’内容如下：</p>\n<p>　　‘某某人，你今天所看见的男女双身，狂风暴雨，霹雳巨声，怖畏阎罗等境相，及情器世间所有的实体相状，无论它如何显现，但其自性如幻，终非实有。所以，一切相都是虚幻不实的，如梦如幻，无常不定。你为什么还要贪恋？！为什么还要憎嫌？！为什么还要恐惧？！你应明白，所有境相都是无中生有，一切诸法本从心生，心性本身就是幻，本来即无，所以也用不著到彼岸，也没有生死可了，也用不著解脱。可是，由于无始以来，你执迷不悟，执无为有，执假为实，执幻为真，沉沦生死，以至于今。如果你现在还不明白一切境相虚幻不实的道理，就会永远沉沦于生死苦海，陷入痛苦的泥潭之中，无有了期。所以你应视一切境相，如梦如幻，如空谷回声，如海市蜃楼，如镜中形影，如眼中空花，如水中之月，虽刹那间欲求真实，亦不可得。因此之故，你应当至心保持意念纯一，屏除执实之念，必然能了悟实相，可及早回头。了悟实相就是了知实相非相，一切相并非实有，如此去做则胎门自闭。’</p>\n<p>　　[5]闭塞胎门第五步 导示十九</p>\n<p>　　又虽如前导示‘如幻观’要妙，仍执为实，胎门未闭，将有入胎昏迷之相，则又有如左‘明光’之教授。</p>\n<p>　　善男子(某某)：虽如是作，唯胎门未闭，今第五步，则有观修‘明光’闭塞胎门。观想之法如左：</p>\n<p>　　嗟乎！</p>\n<p>　　观彼一切法　即是我自心　此心即是空　无生无断灭</p>\n<p>　　如是观想，将心安住于‘无所作’之本然界中，譬如注水于水，自然和合，安心于本元上，随其自然，游戏其间，坦然处之，于本来不整治中，如如不动，则四生胎门，决定能闭。</p>\n<p>　　虽然经过‘如幻不实’的导示，但亡者仍然执境相为实有，胎门仍然未闭。亡者将有入胎昏迷之相，这时急需为亡者做‘明光’观修之导示，即导示十九。这是关闭胎门的第五种方法。</p>\n<p>　　‘导示十九’内容如下：</p>\n<p>　　‘某某人，虽然经过以上导示，但胎门仍然未闭。现在为你指授观修“明光”闭塞胎门之法。具体做法如下：你先观想一切境相，都是由你的心所显现的，然后再观想你的心不生不灭，本体是空！就这样观想，无所造作，譬如注水于水中，自然和合。以平常心安住于一切境界中，随其自然，游戏其间，坦然处之。于本来之中，如如不动，无需整治，则四生胎门一定能够关闭。’</p>\n<p>　　上来已将闭塞胎门甚深教授，导示多种，凡诸上中下三根补特伽罗，未有不能解脱者。何以故？一因中有之识，各具‘有漏神通’，对我所说，一经听闻，即来现前；二因生前虽为盲聋，斯时六根齐具，任何言说，俱能了悟；三因常为恐惧怖畏之所追逐，善自为计，心不散乱，记忆力强，对我所说，一经思惟，即来现前；四因神识已失恁依，欣求欲乐，一经嘱告，立时即至，易于调御。又于此时记忆之力，明晰灵敏，九倍生前。生前鲁钝，此是缘于业力，自内证智，光明显照，对于一切教诲，均有串解之功能，而能达到其要害故。尔时，若为亡者修作佛事，必能奏效，助益亦同，是故亡者在七七之中，以此《听闻解脱密法》为其殷重读诵，是为至要。若于一次不能导示，次一导示，即得解脱，次一不能解脱，多次为之，亦得解脱。</p>\n<p>　　我们对亡者已经进行了多次导示，无论亡者是上根人，还是中根人或者是下根人，均应得到解脱。因为：</p>\n<p>　　第一，中有身具有‘有漏神通’，一听到你与他说法，就会应呼而至，立刻现前；</p>\n<p>　　第二，即使亡者生前是盲聋之人，中有时期也会六根具足，你为他说法，他会听得清清楚楚；</p>\n<p>　　第三，中有身常被恐怖境界追逐，吓得惊慌失措，不知如何是好。这时你为他讲法，帮助他，他一定会集中精力，一心聆听，并欣然从命；</p>\n<p>　　第四，中有时期，亡者识神脱离肉体，无依无靠，他愿意听从你的教导，容易接受你的忠告。</p>\n<p>　　总之，生前即使是愚钝之人，中有时期记忆力也很强，六根具足，聪明伶俐九倍于生前。再者亡者已脱离血肉之躯，卸下了一个大包袱，‘五盖’虽在，但较生前有所减弱，本性智慧易于显发。对于行法者的教诲能够融会贯通，能够悟到要害之处。所以，中有时期为亡者做佛事，对亡者帮助很大。尤其在人死后五十三天内，为亡者实施‘中阴救度法’，更为重要。如果亡者不能在第一次导示中得到解脱，也决定能够于第二次、第三次，或者多次导示中得到解脱。</p>\n<p>　　庚 选择胎门</p>\n<p>　　复次，众生业力不可思议，其有从本以来，善业薰习太少，恶业薰习力强，缘于罪障太重，纵复指示，至心缘想，仍难解脱者，所在多有。前既不能闭塞胎门，今有选择胎门甚深教授，导示如左：</p>\n<p>　　于此先诵‘启请诸佛菩萨加被偈’，次诵‘四皈依’(均见附编)，次呼亡者之名，念诵下文而告之曰：</p>\n<p>　　嗟！善男子(某某)：谛听！汝于以前所遇之导示，虽已一度授与，唯汝不了解，今则胎门未闭，已临受生时期，故汝当自行选择胎门，竭诚信乐，善自谛听，信受勿失。</p>\n<p>　　常言道：愿力无边，法力无边，业力无边。可见众生业力不可思议。无始以来，由于薰习善业太少，恶业太多，罪障太重，纵经多次指示，自己也苦思冥想，但不得法要，仍不能解脱，这样的人也实在是很多。对于经过以上指授，胎门仍然未闭之人，我们还有以下选择胎门的一些方法。这些方法可以帮助亡者选择一个好的地方去投胎，对亡者非常有益。</p>\n<p>　　在念诵这些导示之前，应先念诵‘启请诸佛菩萨加被偈’(见本书83页)和‘四皈依’(见本书附编355页)。然后再呼唤亡者姓名，念诵以下经文：</p>\n<p>　　‘某某人，请仔细听我为你讲法！以前我曾多次对你指示，但你未能了悟法要。以至胎门仍然未闭。这样你将面临受生时期。现在你应仔细听我为你指示，审慎选择胎门，这样就可以投生到一个好的地方。请听我如下导示。’</p>\n<p>　　[1]各种生处之概观 导示二十</p>\n<p>　　嗟！善男子(某某)：今者受生何处之微相，起现于前，当即认识、善自观察，何洲为胜，以便选择。</p>\n<p>　　汝若受生‘东胜身洲’者，将见严饰之湖，中有鸿雁，雌雄追逐，水面游戏，彼处不可前往，当即转念回头。若至彼处，纵有安乐可逢，但为佛法不能流布之洲，故当勿入。</p>\n<p>　　若生‘南瞻部洲’者，则见宫室辉煌，设若求生，差可投入。</p>\n<p>　　若生‘西牛贺洲’者，则见牝牡马群严饰之湖，彼处亦不可往，当即回头。此洲虽为富饶，但为佛法不能流布之洲，故当勿入。</p>\n<p>　　若生‘北俱卢洲’者，则见牛为严饰之湖，或见有树木为严饰之湖。若生彼处，为五取见(五取见，为身见、邪见、边见、见取见、戒禁取见。参见佛学实用辞典三六七页五见条。)，当即认识，彼处亦不可投入。彼洲虽有寿量福德，亦为佛法不能流布之洲，故当勿入。上来四洲，受生概况，一一导示，汝须了别，慎勿轻投。</p>\n<p>　　又若生天道者，则见众宝所成天妙宫殿，心意悦乐，福感此土，可往受生。</p>\n<p>　　若生修罗道者，则见悦目林树，或见火圈，相向旋转，亦不可入，当即转念回头。</p>\n<p>　　若生傍生道者，则见山穴石窟，可怖深洞，烟雾弥漫，决不可入。</p>\n<p>　　若生饿鬼道者，则见漠漠原野，荒无人烟，上无草木，地裂浅洞，黑暗深邃，或睹稠森洲岛，若往彼处，则生饿鬼道中，领受种种饥渴之苦，无论如何，决不可入，当即转念回头，勇决勿往。</p>\n<p>　　若生地狱道者，则由恶业所感，闻得歌声，或身不自由，无法抗拒，必须投入。或见幽暗洲鸟，或见黑屋，或见红屋，或见黑暗地穴，如是种种境相起现，若一投入，即将领受地狱中不能忍受寒热之苦，求出无期。当抱定勇决之心，万勿前往。</p>\n<p>　　以上导示，尔时轮流念诵为要。</p>\n<p>　　‘导示二十’内容如下：</p>\n<p>　　‘某某人，你马上就要受生了，各种境界即将在你面前显现。你应认真了解受生各处的特征，要仔细观察，才能选择一个最好的受生之处。</p>\n<p>　　如果你要受生“东胜神洲”，则会看到庄严妙饰的湖泊。湖泊之中，有鸿雁雌雄追逐，水面游戏。你若投生这个地方，可以享受安乐。但此洲为佛法不能流布之处，所以你应立即转念回头，不能在此处受生。</p>\n<p>　　如果你要受生“南瞻部洲”，则会看到辉煌的宫殿，你如果为了求生，勉强可以在此处受生。</p>\n<p>　　如果你要受生“西牛贺洲”，则会看到庄严妙饰的湖泊，湖中或湖边有雌雄马群在游戏，此地虽富饶，但亦为佛法不能流布之洲，所以应当立即转念回头，不能在此处受生。</p>\n<p>　　你若受生“北俱卢洲”，则会看到庄严妙饰的湖泊，湖边有牛群，或者是树林。你若在这个地方投胎，寿命比较长，也比较有福，但会被五取见(即：身见、邪见、边见、见取见、戒禁取见)所迷惑。所以你要认识清楚，此地仍为佛法不能流布之洲。应当立即转念回头，不能在此处受生。</p>\n<p>　　以上我们讲了须弥四洲的受生概况，你应该一一了解，审慎选择，切勿轻率投生。</p>\n<p>　　你若受生天道，则会见到由众宝装饰成的美妙宫殿，心情愉悦，这是由于你的福德所感而现此土，可以在此处受生。</p>\n<p>　　你若受生修罗道，则会看见悦目树林，或看到相向旋转的火圈，这时应立即转念回头，不能在此处受生。</p>\n<p>　　你若受生傍生道，则会看见山穴石窟，可怖深洞，烟雾迷漫，应立即转念回头，千万不能在此处受生。</p>\n<p>　　你若受生饿鬼道，则会看见漠漠原野，荒无人烟，草木不生，地裂浅洞，黑暗深邃，或者看见稠林洲岛。你若在此处投胎，则将投入饿鬼道中，而饱受种种饥渴之苦。所以，你应断然转念回头，无论如何，也不能在此处受生。</p>\n<p>　　你若受生地狱道，则会闻得歌声，或见幽暗洲岛，或见黑屋，或见红屋，或见黑暗地穴等等境相。这些境相都是由你的恶业感招的。使你身不由已，无法抗拒，必须投入。如果你在此处受生，即将领受地狱中难以忍受的寒热之苦，求出无期。所以当这些境相现前时，你应鼓足勇气，断然转念回头，千万不要前往。’</p>\n<p>　　以上导示应时时念诵，不可马虎。</p>\n<p>　　[2]防护追命鬼卒法门 导示二十一</p>\n<p>　　嗟！善男子(某某)：汝纵欲求不往，但不自主，已被业感之狱卒自后追逐，丧失自由，难以抗拒，又有狱卒与勾命鬼卒，自前拖曳，复有黑雾，大红业风，呼啸巨声，暴风狂雨，大雪深雾，雹石冰刀，相逼而来，无处逃遁，境现汝前，汝欲遁逃，寻求救护之处，则又睹见如前所说之华屋，或见崖穴，或见地洞，或黑暗僻道，或莲花等(天界中亦有莲花中化生而出者)，为欲逃避，不加细择，一入其中，遂被封闭，潜藏其中，惟恐外出，然自此以后，欲出无能矣！汝之所以不欲出离，以为一经出离，即遭苦难，而于彼所栖处，心生念著，若外出者，则又怀疑‘中有’怖畏之相，于是疑怖横生，故潜伏不动，然一经入内而受任何之一身，则领受种种苦痛，凡此于汝，皆鬼魅留难之相也。此时亦有一甚深要妙教授，汝当谛听，记持勿失！</p>\n<p>　　当此之时，若被狱卒追逐，不能自主，起现种种怖畏相时，于刹那间，务必深具信念，观想‘大胜兮噜迦’(即饮血之尊)‘马头明王’(密宗忿怒之尊)‘金刚手菩萨’等，或汝生前所修奉之本尊，观其伟大身形，粗壮肢体，能令一切障难碎为微尘之忿怒明王可怖畏者，起立于前。由其大悲威力加持，汝可与狱卒脱离，而有<a href=\"/remen/congrong.html\" class=\"keylink\" target=\"_blank\">从容</a>选择胎门之自主，此为甚深真实教授，保持勿失。</p>\n<p>　　善男子(某某)：复有静虑诸天，乃缘三摩地之力受生也。至若饿鬼邪魅罗刹之类，乃是在‘中有’时，变易心念，故为饿鬼邪魅罗刹之身，能现种种神变，而成意生之身。上下空间所住饿鬼及在空中幻现之饿鬼等像，有八万四千之多，皆属‘中有意生之身’变易心念，遂具此体。尔时若能忆念‘空性大手印’之义，斯为最上。如不能修，则修‘如幻瑜伽’，此并不能，当对任何一切心无贪著，观修本尊‘大悲怙主’，自能证得报身佛矣。(如幻瑜伽、亦藏密迦居派中最高成就之密法。)</p>\n<p>　　‘导示二十一’内容如下：</p>\n<p>　　‘某某人！当地狱道的境界现前时，由于恶业所感，你会看见狱卒从身后追逐，还有狱卒和追命鬼卒，自前拖拽，使你丧失自由。你纵然不想前往，却难以抗拒，不得不被迫受生于地狱之中。或者，你会见到黑雾弥漫，大红业风，呼啸巨声，狂风暴雨，大雪深雾，雹石冰刀等恶境相，相逼而来。使你无处逃遁。欲寻求避护之所，会忽然看见前面所说的黑屋、红屋，或者看见崖穴地洞，或者看见黑暗僻道，或者看见莲花等。你为逃避可怖境相不加选择，投入其中。一入其中，遂被封闭。而你潜藏在里面还唯恐外出，因为你遭受此难后，疑怖横生。于此栖身之所，心生贪著。另外，还担心出去后，又会被恶境追逐，所以潜伏不动。但是，你一定要明白，一经入内，无论受生何身，都将领受种种痛苦。这些痛苦即使是空中的鬼魅也难以忍受。所以对我为你讲的解脱方法，你应记持勿失。当你被狱卒、追命鬼卒等种种境界追逐逼迫，不能自主时，你要深生信念，观想“大胜兮噜迦”(即饮血尊)或“马头明王”或“金刚手菩萨”，或你生前所信奉的本尊，站立在你的面前。他那伟大的身躯，粗壮的肢体，能令一切障碍及苦难碎为粉尘。对此你要深具信心，那怕是一刹那的观想，在这些忿怒明王的威力加持下，你也可以摆脱追命鬼卒等恐怖境相的追逐，从而可以从容的选择生门。此法至深至妙，你一定要记持勿失！</p>\n<p>　　某某人，如果你修习禅定，就会受生于静虑诸天(即初禅天、二禅天、三禅天、四禅天)。相反，如果你不修习禅定，中有时期被境界所转，心念变异，就会变现为居住在上下空间的饿鬼、邪魅、罗刹之类。因为它们是意生之身，能现种种神变，故形像各异，有八万四千多种。所以当中有境界现前时，若能领悟一切境相本体是空，这样就可以于一切境相中如如不动，而不被境界所转。这就是“空性大手印”之法，是最好、最彻底的解脱方法。如果你不能领悟，则观想一切境相，从有到无，慢慢消失，由此觉知一切皆幻。这就是观修“如幻瑜伽”之法。这样你也可以不被境界所转，从而得到解脱。如果这样还不行，那就至心观想大悲怙主观世音菩萨，这样也可以得到解脱。’</p>\n<p>　　辛 迁识往生及转生人道选择法</p>\n<p>　　嗟！善男子(某某)：如上所说，设若缘于业力，必须入胎，今有选择胎门之教授，为汝宣示，谛听勿失。汝于任何可生之胎门，不可投入。设有狱卒现有不能自主时，则观‘马头明王’；又汝自己，今已赋有微细神通，一切处所，次第了知，当加选择。</p>\n<p>　　复次，有两种选择法，一为清净佛土迁转法；一为不净轮回之胎门选择法。两法门中，任择其一，导示如左：</p>\n<p>　　‘某某人，在轮回中有时期，还有迁识往生清净佛土及投胎人道两种选择。这两种方法你可以任选其一。如果此时有狱卒追逐等恐怖境界现前，使你不能自主，则可观想“马头明王”等忿怒尊。在诸忿怒尊的威力加持下，可使你摆脱困境，这样你就可以从容的进行选择了。’</p>\n<p>　　[1]迁识往生佛国净土法 导示二十二</p>\n<p>　　今初导示迁转清净空行处法，如下发愿，而自念云：</p>\n<p>　　呜呼！我何痛哉！<a href=\"/remen/wuliangjie.html\" class=\"keylink\" target=\"_blank\">无量劫</a>来，迄于今日，此身沦没生死泥涂之中，今当厌弃。往昔生中，久值诸佛，而我未能解脱，诚可嗟叹。今于轮回，已生嫌恶，可怖可厌，亟应逃避，时机已至，故我愿于西方极乐世界阿弥陀佛世尊足下，莲华化生。</p>\n<p>　　如是思惟，猛切祈求，至心专注，渴诚渴仰。或复随其自所信乐之佛土，愿生东方‘现喜国土’(不动如来佛土)，或中央密严国土(毗卢遮那佛土)，或北方‘有财城’(金刚手菩萨及毗<a href=\"/remen/shamen.html\" class=\"keylink\" target=\"_blank\">沙门</a>天王居处)，或西方‘莲华光明宫’邬金莲华生大士尊前，或择一随我所信乐之佛土，欣求专注，至心虔敬，心勿散乱，发愿往生，无间即生彼土。又若乐往‘兜率内院’，亲近‘弥勒慈尊’，惟自念曰：‘我今在中有时，时机已熟，当往兜率内院亲近弥勒慈尊’，如是猛切欣求，至心专注，即于慈尊前，莲胎化生。</p>\n<p>　　‘导示二十二’内容如下：</p>\n<p>　　‘某某人，如果你要往生清净佛土，就要按下文发愿：</p>\n<p>　　自无量劫以来，我沉沦于生死轮回的泥潭之中，实在是可怖可畏，痛苦至极！虽历劫多生遇到诸佛，但因未好好修行，至今仍然未能解脱。如今我对六道轮回已生厌弃之心，极欲出离生死苦海。逢此中有良机，我愿往生西方极乐世界阿弥陀佛世尊足下，精修成佛。</p>\n<p>　　就这样至心专注，竭诚渴仰祈求发愿(最好能加诵“往生广咒”或“阿弥陀佛心咒”)。</p>\n<p>　　你也可以选择自己喜欢往生的其它诸方佛土。如东方不动如来的现喜国土；中央毗卢遮那如来的密严国土；北方金刚手菩萨和毗沙门天王的有财城；西方邬金莲华生大士的莲花光明宫等，你要一心专注，至心虔诚发愿往生诸方佛土(最好能加诵上述诸佛心咒)。一弹指顷即可生到诸佛净土，得真实受用。</p>\n<p>　　你还可以选择往生“兜率内院”，亲近弥勒慈尊，与弥勒菩萨结胜缘。你要这样发愿：逢此中有良机，我愿往生兜率内院，亲近弥勒慈尊。只要你至心专注，竭诚祈求发愿(最好能加诵“慈氏咒”)，瞬间即可生到兜率内院弥勒慈尊前。’</p>\n<p>　　[2]转生人胎复入尘世 导示二十三</p>\n<p>　　复次，若不能往生佛土而乐入胎，或有必须入胎之势，今有选择不净轮回胎门教授，汝善谛听！此如前说，何洲之中，善自选择，由汝通力，周遍观察，佛教正法昌盛之地，当可投入。若于某一胎门中受生者，则有一种不净血块，对之生香味想而贪爱之，遂即受生。是故对于上说种种一切起现之时，勿起贪著，亦勿起爱憎之相，唯当选择善胎，至心专注而欣求之，是为至要！此时当发愿云：</p>\n<p>　　嗟！我为<a href=\"/remen/154932.html\" class=\"keylink\" target=\"_blank\">饶益</a>有情，愿生为转轮王，或生为婆罗门种族如大娑罗树王，或为大成就者之子，或生净无垢染正法传承之族性，或生父母具足正信之族性，为利乐一切有情而受取一种福德具足之身。</p>\n<p>　　如上发愿，然后坚定心愿以入其胎，同时放光加持其胎，观成上妙宫殿，复观十方诸佛本尊及‘大悲怙主’慈悲加持以入其胎为要。</p>\n<p>　　复次，选胎之时，缘于业力，每以善胎误认恶胎，恶胎反误认为善胎，故在尔时，选择要义，极为重要！导示如左：</p>\n<p>　　当善胎相起现时，不可生贪爱心；恶胎相起现时，不可生憎嫌心；当于善恶，勿取勿舍，爱憎两离，安住于等舍状中，此为入胎甚深要义。</p>\n<p>　　‘导示二十三’内容如下：</p>\n<p>　　‘某某人，如果你不能往生佛的净土或缘于业力，必须投胎的话，我现在再告诉你不净轮回胎门的选择方法(因人道为生死轮回之胎门，故称为不净轮回胎门)，请你仔细谛听：</p>\n<p>　　某某人，对于受生上述何洲，你要仔细了解，考查清楚，审慎选择，一定要选择佛教正法昌盛之地投胎。一旦选定，则会看见一种不净血块，闻之清香，于是心生贪恋，这样就投胎了。但应注意，在你选胎之时，由于业力牵制，你常常把善胎误认为恶胎，而把恶胎误认为善胎。所以选胎之时，你一定要按如下指示去做，即当善胎相起现时，你勿生贪恋之心；当恶胎相起现时，不可生憎嫌之心。于善恶两种境相应勿取勿舍，爱憎两离；于一切境界之中如如不动。同时，要至心专注，竭诚祈求而发愿：我为救渡众生，愿生为转轮圣王，或生为大成就者之子，或生于不染邪法有正法传承的家族，或生于具足正信的家庭，或生于富贵之家，我愿为利益一切有情，而得福慧具足之身。</p>\n<p>　　你要坚定信念，按如上发愿。同时观想十方诸佛本尊和大慈大悲观世音菩萨放光前来加持，并观想其胎门为美妙宫殿，你入住其间。这就是投入不净胎门的法要，你一定要记清楚。’</p>\n<p>　　以上导示，除有一类能领受者，其余为恶劣结习之病难以清除、亦或不能舍离爱憎、下根罪重之人及蠢如畜牲者，则当令其皈依三宝以遮止之。再呼亡者之名，念诵下文而告之曰：</p>\n<p>　　导示二十四</p>\n<p>　　嗟！善男子(某某)：汝既不能选择胎门，亦不能舍离爱憎，如上所示，任起如何境相，惟有念诵‘三宝名号’，虔敬皈依，祈请大悲尊者，昂首专注前行，认识中有本来面目，对汝生前亲属子女，至亲密友，当即遣除贪恋之心，以彼种种皆于汝无益也。天道之光白色，人道之光黄色，皆可入住。妙宝宫殿，快乐园林，皆可投入。</p>\n<p>　　如上导示，反复多次宣说，乃至七遍，即举诵(一)启请诸佛菩萨加被偈，(二)救脱中有怖畏险峡偈、(三)中有六纲，(四)中有救怖愿偈各三遍。次诵：(五)解业习颂、(六)答卓咒本(以上四种见附编，五、六两种见续编。如因时间及促、略去念诵亦可)</p>\n<p>　　以上种种导示，亡者只要能领受其中的任何一种即可，但仍有恶习难改、不舍爱憎之情、或下根罪重、或太愚痴的人，对以上导示仍然不能领受。对于这些人，我们可以呼唤其姓名，为他念诵以下导示，令其皈依三宝。</p>\n<p>　　‘导示二十四’内容如下：</p>\n<p>　　‘某某人，如果你既不能选择胎门，也不能舍离爱憎，那么，在中有境界起现时，只有念诵三宝名号，虔敬皈依，祈求诸佛菩萨威力加持。要认识中有境界本体是空，要舍弃你对亲属、子女的贪恋之心。因为他们现在对你已毫无益处。当你见到天道之白光，或人道之黄光皆可投入，或者看见美妙的宫殿和快乐的园林，也可以投入。’</p>\n<p>　　如上所有导示，均要反复多次为亡者宣讲，乃至七遍之多。最后，还要念诵以下偈文各三遍。(一)、‘启请诸佛菩萨加被偈’，(二)、‘救脱中有怖畏险峡偈’，(三)、‘中有六纲’，(四)、‘中有救怖愿偈’。至此，《中有教授听闻解脱密法》实施完毕。</p>\n<p>　　［后］结归</p>\n<p>　　本法如理修作，诸有已证高深瑜伽士，临命终时，已能迁识往生(颇哇)，即不须趋入‘中有’，自能洞达本源，顿证法身。次为一类已有修持补特伽罗在‘死位中有’之后，认识‘法性明光’亦可扶摇直上。又次者在‘法性中有’时，七天之中，‘寂’‘怒’境相逐步起现时，由于缘会与根器之不同，得一亦能解脱。因在‘中有’期内，险峡甚多，在何处认悟，即可于何处解脱。至若其他根器滞钝，恶业障重者，降入‘轮回中有’，独自漂泊，疑惧横生，其中指示种类，不止一次，如登梯然，得其一层，纵不认识，当于另一层而能认识，即得解脱。又若业重根劣者，因不认识，而为恐惧怖畏所制，犹有选择胎门之教授，逐步导示，各各不同，虽于一次不能认识，而能认识另一次者，如说实行，缘观得力，亦能有生上界无量功德。又若再下卑如畜生之类，亦有皈依三宝之胜利，一入恶趣，仍可回头，返入人胎，而得暇满具足之身(暇谓八有暇，满谓十圆满)，于后生中，得遇喇嘛上师善知识等，而得律仪不缺，如愿解脱。</p>\n<p>　　在‘轮回中有’时，施行此教授密法，正为善业有情，令其延续善因，犹如已经阻断之水沟，疏导通利，令其入槽。诸凡罪大恶极者，一经听闻此法，未不有能解脱者。何以故？由于彼时‘寂’‘怒’胜尊，俱来接引，魔障伴随，尔时甫经听闻此法，即得转变境相，而得解脱。次因亡者已舍血肉之躯，失所恁依，故易转变。在‘中有’时，虽在任何远地漂泊，以有微细神通，而可睹见，一闻呼召，立即现前，一经回忆，立即顿悟，刹那之间，即可转移心意，故此法有极大胜利。犹如弩炮，发必中鹄；又如巨木，百人莫举，设浮水面，须臾之间，任意游行，到达各地；又如烈马难驯，以缰御之，自能调伏。是故此法对于一切新亡之人，近其尸旁，如有尸在，直至其尸鼻孔流出血液或黄色液体时为止，为之反复朗诵。但在此时，不可移动其尸，并于其间，对其所信奉本尊三昧耶，为亡者修法回向，不可宰杀一切生命。亲属人等，不得在尸旁哀哭泣。当为亡者尽力广作佛事。又此《中有教授听闻密法》以外各法，亦可于文末加入念诵，更为善妙。</p>\n<p>　　复次，此法当在生前常时念诵，对于文句，熟记于心，一旦报尽命终，证知定时死相起现时，若自有气力，自己念诵，思惟句义；若自力不继时，则由侣伴照此经本宣读，高声朗诵，务必字句分明，定得解脱，决无疑义，又此法为不需修习禅观、见法即得解脱之甚深教授，又为罪障深重者、从狭道中救度之甚深教授，有缘见者，对此深妙之法，纵有七犬吠逐，于此文句，当勿忘失！临命终时，诸佛言教，三世佛力，亦无有胜于此者。</p>\n<p>　　中有教授能度同体一切有情名曰中有教授听闻解脱密法终</p>\n<p>　　一切吉祥，善哉！</p>\n<p>　　实施本‘中有教授听闻解脱密法’，对于修行较好的人，在临命终时就能洞达本源，顿证法身，或者迁识往生佛土而不落入中有阶段。次一等的众生，修行有一定的功夫，经本法指示，在死位中有时期也能认识法性明光，扶摇直上，证成法身佛。再次一等的众生，经过本法指示，可以在法性中有时期，诸佛‘寂’‘怒’尊显现时，根据各人的因缘和根器，于法性中有十四天中的任何一天，认取光明而证成报身佛。但由于一些人根器滞钝，业障深重，于法性光明显现之机不能认取，因此陷入轮回中有时期。在轮回中有时期，业力幻现的各种境界纷纷现前，于是亡者疑惧横生，独自漂泊，惊慌不定。但在轮回中有时期，本经仍有多种指示。如果亡者能认取其中任何一种指示，也可获得解脱。可惜有一些人业重根劣，被恐惧怖畏所制，不得自在，准备投生。所以在此轮回中有时期，还有选择胎门的教授，可以逐步引导亡者。如果亡者错过一次指示，但于另一次指示能认取者，即使蠢如畜牲，也可令其皈依三宝。即使已入恶趣，也可返入人胎，获得相好有福之身。于受生之后，得遇上师善知识，上上升进而得解脱。</p>\n<p>　　在中有时期，为亡者施实本中有解脱密法，功德无量，因为它可以帮助众生解脱成佛，至少可以延其善根。既使是罪大恶极之人，一经听闻此法，也未有不能解脱者。这是因为：第一、中有时期有佛菩萨‘寂’‘怒’诸尊放光接引，尽管亡者恶业深重，还有魔王捣乱，但经过此经文指示，亡者即可转变境相而得解脱。第二、亡者这时已脱离血肉之躯，失所凭依，愿意听从行法者的指示。加上亡者有微细神通，虽漂泊远地，一闻呼唤，也能立即现前。第三、亡者这时记忆力极强，一经提醒，刹那之间就可转移心意，立即顿悟。所以此法犹如弩炮，百发百中；又如巨木，百人莫举，设若漂浮水面，须臾之间即可任意游行到达各地；又如烈马难驯，以缰御之，自能调伏。因此，对于此法，我们生前应时常念诵，熟记于心，一旦报尽命终，死相现前，若有气力就自己念诵，思惟句义。若自力不继，则由侣伴照此经本高声朗诵，但必须字句分明，你一经听闻就能够得到解脱。由此可见，此法为一切法中续部心要，三世诸佛所说，也未有胜于此者！</p>\n<p>　　至此，《中有教授听闻解脱密法》讲解完毕。</p>\n<p>　　最后，十分虔诚恭敬顶礼观世音大菩萨！祈求大菩萨广施法雨，使我娑婆同仁得普闻此秘法，于最后生死关键时刻得度而脱离生死苦轮。此又不胜馨香祝告者也。</p>\n<p>　　净 明　佛历2543年二月(1999年4月)</p>\n<p>　　附编：汉文咒音表</p>\n<p>　　(一)四皈依</p>\n<p>　　南谟古鲁贝(皈依上师)</p>\n<p>　　南谟布达雅(皈依佛)</p>\n<p>　　南谟达而嘛雅(皈依法)</p>\n<p>　　南谟僧嘎雅(皈依僧)</p>\n<p>　　(二)莲华生大士根本咒及心咒</p>\n<p>　　(1) 根本咒：嗡、阿、吽、别渣古鲁、贝嘛、悉地、吽。</p>\n<p>　　(2) 心咒：嗡、贝嘛、别渣、吽。</p>\n<p>　　(三)五方佛心咒</p>\n<p>　　(1) 中央毗卢遮那佛心咒：嗡、啊、枝那枝嘎、嗡、吽。</p>\n<p>　　(2) 东方不动佛心咒：嗡、啊、别渣、职嘎、吽、吽。</p>\n<p>　　(3) 南方宝生佛心咒：嗡、啊、列那、职嘎、梭、吽。</p>\n<p>　　(4) 西方阿弥陀佛心咒：嗡、啊、阿落列嘎、阿、吽。</p>\n<p>　　(5) 北方不空成就佛心咒：嗡、啊、煎渣、爹嘎、哈、吽。</p>\n<p>　　(四)寂怒百尊海会圣众咒</p>\n<p>　　嗡、阿、吽、波的智达、嘛哈苏卡加纳、达杜阿、嗡、路噜路噜吽、觉、吽。</p>\n<p>　　(五)六道金刚咒</p>\n<p>　　啊、阿、下、萨、嘛、哈。</p>\n<p>　　(六)听闻解脱咒</p>\n<p>　　阿、比、甲、当、嘎。</p>\n<p>　　(七)本觉大密咒</p>\n<p>　　嘛、嘛、郭、林、萨、敏、达。</p>\n<p>　　(八)药师如来咒</p>\n<p>　　爹雅他、嗡、贝卡者、贝卡者、嘛哈贝卡者、惹杂、萨蒙噶迭、梭哈。</p>\n<p>　　(九)东方不动佛往生神咒</p>\n<p>　　南谟惹达纳、答惹鸦雅、嗡、冈嗄呢、冈嗄呢、诺渣呢、诺渣呢、卓扎呢、卓扎呢、卓扎呢、卓萨呢、卓萨呢、巴惹底哈纳、巴惹底哈纳、萨尔瓦、嘎尔嘛、巴染巴纳、呢美、萨尔瓦、萨哆喃、杂梭哈。</p>\n<p>　　(十)无量寿佛(长寿佛)心咒</p>\n<p>　　嗡、阿嘛惹尼、节温爹野、梭哈。</p>\n<p>　　(十一)阿弥陀佛往生咒</p>\n<p>　　南谟拔噶瓦德、阿弥答巴雅、答他噶他雅、阿尔哈德、三木雅、三布达雅、爹雅他、嗡、阿弥德、阿弥多巴未、阿弥答、三拔未、阿弥答、别煎德、阿弥德、噶弥呢、噶噶纳、格列德、嘎累、萨尔瓦、嘎列、下插央、嘎累、梭哈。</p>\n<p>　　(十二)阿弥陀佛心咒</p>\n<p>　　嗡、贝嘛打咧吽。</p>\n<p>　　(十三)<a href=\"/fozhou/emituofoyizixinzhou/\" class=\"keylink\" target=\"_blank\">阿弥陀佛一字心咒</a></p>\n<p>　　嗡、阿米爹瓦、啥。</p>\n<p>　　(十四)释迦牟尼佛灭一切恶趣王咒</p>\n<p>　　南谟拔噶瓦德、萨尔瓦、都尔嘎德、巴咧勺达呢、口罗渣雅、答他噶打雅、阿尔哈德、三木鸦三布达雅、爹雅他、嗡、勺达呢、勺达呢、萨尔瓦、巴邦、比勺达呢、许爹、比许爹、萨尔瓦、嘎尔嘛、阿瓦惹纳、比勺达呢、梭哈。</p>\n<p>　　(十五)能断金刚经陀罗尼</p>\n<p>　　南谟拔噶瓦德、般若杂巴惹密答雅、嗡、纳当底答、依哩唏、依哩唏、米哩希、米哩希、比纳烟、比纳烟、南谟拔噶瓦德、不惹达邓鸦不惹地、依日地、依日地、米日地、米日地、许日地、许日地、乌许日、乌许日、布又也、布又也、梭哈。</p>\n<p>　　(十六)地藏王菩萨心咒</p>\n<p>　　(1) 嗡、清、嘻惹渣吽。</p>\n<p>　　(2) 嗡、不惹嘛呢、达惹、梭哈。</p>\n<p>　　(十七)<a href=\"/fozhou/jingangsaduoxinzhou/\" class=\"keylink\" target=\"_blank\">金刚萨埵心咒</a></p>\n<p>　　嗡、别渣萨吽、阿。</p>\n<p>　　(十八)百字明</p>\n<p>　　嗡、别渣萨埵萨嘛雅、嘛奴巴拉雅、别渣萨埵、爹洛巴的插、借佐美巴瓦、苏多卡欲美巴瓦、苏布卡欲美巴瓦、阿奴日多美巴瓦、萨尔瓦、悉地美不惹雅擦、萨尔瓦、嘎尔嘛、苏渣美、即登使以央、姑鲁吽、哈哈哈哈、和、拔噶汪、萨尔瓦、答他噶打、别渣嘛美门渣、别渣拔瓦、嘛哈萨嘛雅、萨埵阿吽、呸。</p>\n<p>　　(十九)补阙真言</p>\n<p>　　嗡、都噜都噜、渣鸦穆克、梭哈。</p>\n<p>　　《后记》</p>\n<p>　　尊敬的上师，上元下音老人，应门人之请，慈悲敷演《中有教授听闻解脱密法》一经。老人广征博引，精细之极，实乃自性般若无私之流露。同侪等恭聆之后，叹为希有，不忍私密，乃思公诸于世。愿我娑婆同仁，得见是经，得闻是讲解，躬味斯法，即可于人生最后时刻，就路归家，圆证菩提，共成佛道而免虚度一生，幸何如之！</p>\n<p>　　以法实乃密法门中不可多得之密宝。今有幸闻此，若非宿世广植善根，曷克得之！门人车睿等，幸赖上师之慈悲与智慧，得以完成此辑之整理工作，但文长义丰，难免卦一漏万，复由于整理者水平有限，疏误之处，又岂能免！渴望海内外仁者，不吝指而告之，幸甚幸甚！</p>\n<p>　　门人　车睿</p>\n<p>　　吴昊</p>\n<p>　　金慨夫</p>\n<p>　　佛历二五四三年(1999年)观世音菩萨圣诞日</p>\n</div>"
    }
]