[
    {
        "title": "前言",
        "author": "李炳南",
        "html": "<div class=\"B1_text\"><p class=\"text-indent\">佛学十四讲表是李炳南老师特别为大专学生所编，把整个佛法做一个轮廓，简单的介绍。十四讲表共有十四个单元，具有完整的体系；前面七个单元是属于一般常识，后面七个单元是佛学。这个课程有很精密的体系，前后的顺序一脉相承，有层次、有条理；在思想上来说、在文章上来说，都是属于第一流的。这部佛学十四讲讲记，是由净空法师讲述，藉由李炳南老居士的十四讲表，将佛法的大意阐释出来，非常适合大专学生，配合讲表与讲记，获得佛法概括且正确的认识。</p><strong>前言</strong><p class=\"text-indent\">十四讲表是李炳南老师特别为大专学生编的，把整个佛法做一个轮廓，简单的介绍给同学，好像是说明书一样，佛法的说明书。<br>十四讲表共有十四个单元，具有完整的体系；前面七个单元是属于一般常识，后面七个单元是佛学。第一讲说明「佛」这个字的定义；换句话说，就是认识佛教。我们要想学佛，佛是什么？首先要把这个搞清楚才不致于误会，才不致于迷信。第二讲是讲研究的方法，这种方法不但可以应用在佛法上，乃至于可以应用在世间许许多多的学术方面。第三讲是破除一些障碍，这里面略举五个例子，这五种都是学佛的障碍。在近代，诸位学佛可以说这些障碍都没有了；在当年，学生们学佛都怕人家说他迷信，所以学佛都偷偷的学。现在不会了，现在也有很多老师学佛，学佛变成很时髦，不像以前障碍多。第四讲与第五讲是讲人生观，第六讲与第七讲是讲宇宙观，这四讲是非常重要的科目。我们为什么要学佛？主要就是要解决人生宇宙的问题。<br>人生宇宙的探讨，就好像大夫治病一样，先要诊断病源，我们的毛病究竟发生在什么地方？知道自己有病，这才去对治，治病先得找一个好大夫。十四讲表前半部是发现病，后半部就等于治病。第八讲就是佛教的内容，等于介绍医生。第九讲到第十三讲是讲解脱的方法，好比是用药治病。这里面第九讲是属于总论，向下四讲是别论。别论里第十、十一、十二讲，这是普通的法门，我们讲通途法门，是八万四千法门的纲领。第十三讲提出一个特别法门，那就是「净土法门」，这个法门实实在在是特别的。到这个地方都是讲佛法如何解决人生宇宙的问题，如何达到佛法修学的目标。第十四讲是结论，劝勉我们要以最高度的警觉心来修学。所以这个课程有很精密的体系，前后的顺序一脉相承，有层次、有条理；在思想上来说、在文章上来说，都是属于第一流的。这是把十四讲表整个的内容结构给诸位说出。<br>佛教是佛陀的教育，它不是宗教，也不是学术。佛教本身称宗教是指「宗门」、「教下」；宗是宗门，就是禅宗；教是教下，十个宗派，除禅宗之外，其余九个宗派都叫做教下。如果拿佛教当作宗教看待，一开头就迷，这一迷就迷到底，麻烦就大；不但佛教真实的利益你得不到，甚至于佛教所有经典你都会错解。现在有很多外道注解《金刚经》、《心经》，简直是胡说八道，那是宗教，那不是佛法。<br>现在的佛法，在全世界有三种不同的形态。第一种是纯正的佛法：大概只有中国人才保存着。第二种是宗教的佛法：佛法变成宗教，在全世界相当普遍，那是迷信。第三种是学术的佛法：把佛法当作世间学问来研究，在日本特别多，走学术道路。这一变把佛法变作世间法，都不是佛法的本来面目。我们今天要找的，是找佛教的本来面目，才能真正解决问题。佛法是以破迷开悟为宗旨，以离苦得乐为归趣（结果、大用）；我们也可以说破迷开悟是佛法的大学问，离苦得乐是佛法真实的果报。我们哪一个人不是希望离苦得乐？所以佛法追求的是快乐，如果学佛的人一天到晚愁眉苦脸，这佛法谁要学它？十四讲表的内容，主要就是说明佛法的宗旨与果用，所以这个小册子可以说是学佛的指南，是学佛的基础。<br>古人说：读书如果不能够向自家身心上做功夫，虽然是读尽天下之书也没益处。把书里的道理变成我们自己的生活，变成生活就是享受；不能变成生活那就变成书呆子，带来是苦不是乐。所以在佛门里面，古圣先贤教诫我们，闻法最要紧的是「消归自性」，修行最要紧的是「转识成智」，这两句是最好的修学态度。</p></div>"
    },
    {
        "title": "第一讲 先明佛义",
        "html": "<div class=\"B1_text\"><p class=\"text-indent\">甲、佛之释义<br/>第一段是「佛之释义」，解释「佛」这一个字的意思。这一个字是从印度梵文音译过来，音是「弗」的音，旁边加一个人，当时是新字。这一个字是梵文「佛陀耶」的略称，中国人把尾音省略，单称一个「佛」字。「佛」这个字的意义可以说是把整个宇宙人生都包括进去，这里面有本体、有现相、有作用。体就是我们讲的「佛性」，唯有佛性是真实的。实在讲，佛性应该只讲一个「性」，所以佛经常讲「自性」。有情众生（动物）的自性称为佛性，无情众生（植物、矿物）的自性称为法性。「佛」的意思是智慧、觉悟。「智」是体，是性体；「觉」是自性起用。自性的本体是智慧，自性的作用是大觉。虽然中国文字里面，智觉这两个字能够翻译出「佛」这个字义的一部分，还是不能翻得圆满，不得已只好保存原音再加以注解；这个智不是我们普通讲的智慧，这个觉不是我们普通说的觉悟，这都是我们中国文化概念里面所没有的。<br/>先讲「智者」的含义。智，包括三类：一切智、道种智、一切种智，这些都是佛学术语。第一个意思是「一切智」，用现代哲学名词来讲，就是正确的了解宇宙的本体；这样的智慧，在佛法里称为一切智。一切智，括号里面就是简单的注解，「知法总相」。「法」这一个字在佛学里是一个代名词，是整个宇宙人生的总代名词；宇宙人生一切的理论、一切的现象、一切的过程，一切的一切，大到整个宇宙，小到一微尘，我们今天所讲的原子、基本粒子，皆称为「法」，所以法是宇宙万有的总代名词。「总相」就是共同的现象，无论哪一法都不例外，都有共同的现象，这个相我们就称为总相。每一个法不相同，我们就称为别相，差别的现象。佛法讲「缘生性空」，性空就是总相，缘生就是别相。<br/>总相相当于现代哲学所探讨宇宙的本体，别相相当于哲学所讲的现象。本体是什么样子？本体是空相，佛法讲空寂；但是这个空不是当作「无」讲，空不是什么都没有。佛法里面讲空，空里头有；空不是无，空是有。那奇怪了，有怎么能说空？说空是因为我们眼睛看不见，耳朵也听不见，我们没有办法接触到，但是真的存在。譬如电波，我们拿个无线电收音机，频道一对马上就有声音，电波充遍空间，我们看不到。电波在哪里？抓也抓不到，但它确实有。所以佛法讲空，它有，它不是无。《心经》里面讲：「色即是空，空即是色。」一切法的总相是「万法皆空」，无有一法不空。从本体上讲，一切法都是空的，现代科学家也似乎体会到这个意思，但是没有佛法说得那么样的精深博大。现代科学家承认，一切的物质都是基本粒子组合，组合的方程式不一样才有种种元素，有元素再加上不同的方程式，所以才有宇宙万有、森罗万象。追根究柢都是同一个物质—基本粒子；这个东西，科学家发现这是最小的物质，所有东西全是它组合的。它从哪里来的？它的究竟又如何？科学家不懂。佛法里说得更深，这个基本物质从哪里来的？从见分变现出来的，这就是精神跟物质是同一体。唯识里面讲「见相同源」，见分跟相分都是从自证分变现出来的，同一个本体；自证分就是自性，见分就是我们今天所讲的精神世界，相分就是物质的世界。<br/>佛法讲物质，它是讲四大：地、水、火、风，四大就是说明物质有四种特性，所以它才能够变现万法，变现十法界依正庄严。「地大」，它是一个物质，虽然很小，它还是有体积，地是有体积的物体，所以地是代表它是一个物体。「火大」代表它有温度、能量，「水大」代表它有湿度；我们现在讲带阳电、带阴电，佛经讲火大、水大。「风大」，它是动的，不是静止的。最基本的物质有四种特性。<br/>这个世间所有一切物象没有不变的、没有不动的，一切物象都是在那里变化、变动。为什么？因为它组成的基本粒子是个动相。从这上面来看，一切法是空相，万法皆空，这是讲分析空。科学家今天所观察出来是一种分析空，分析到最后都是一个基本粒子。佛法更深入去观察，基本粒子是从哪里来的？从法性里面无中而有。无中能有，有又能归于无，所以空有不二，空有是一不是二。换句话说，精神能够变物质，物质又可以化为精神。决不是今天所讲的质能互变的质与能，那是物质之能，不是真如本性之能、精神之能；精神之能可以能够变成质能，质能可以变为物质。这一层，科学家还没有发现，相信科学不断的进步，一定能够发现这个原理。所以从一切法的本体去观察，它是一个空相。<br/>如果真正了解一切法的空相，有什么好处？好处太多，你的烦恼没有了，你的分别、执着没有了，心能够在境界里呈现出清净平等。佛的心是清净的、平等的，他从哪里得来的？他知法总相。怎么会得清净？一切法里，他不执着、不分别，他晓得一切法原来是一样，没有两样。一切境界没有好丑，同是基本粒子造成的，造成的原料是一样，所以一切法无有一法不平等，平等心从这里起的；心平等，当然就清净。这是第一种智慧，这一种智慧，阿罗汉就得到了。佛法所追求的是「无上正等正觉」，一切智现前叫做「正觉」，真正觉悟，正确的觉悟。对于宇宙人生不迷，正确的认识，称之为正觉。<br/>这个正觉并不圆满，为什么？只知道一切法的总相，晓得一切法是平等的、是空寂的，但是不知道现象怎么来的。晓得皆是基本粒子组成，没错！基本粒子怎么会组成这么多东西？十法界依正庄严、森罗万象怎么来的？这就讲现象，这个学问又高一层。能够正确明了宇宙万象的智慧，称为「道种智」。道种智：「种」就是种类；在宇宙之间，无论是动物、植物、矿物，种类无量无边。这么多的种类怎么来的？一般人想不出来，以为一定有个神在那里制造。神造万物，神就太忙了，一天到晚忙着制造，造了这些人后来又反对祂，这不是自己找麻烦吗？这些宗教家们找不到答案，就想出一个神来制造。神是从哪儿来的？是人心里变现出来的。上帝能造万物，什么人造上帝？我们大家造了上帝。我们要是不承认祂是神、是上帝，祂也无可奈何。所以不是上帝制造的。「道」就是道理、程序。什么道理，怎么样一个过程，会演变到现在的森罗万象？这个学问就相当复杂，这种智慧就是道种智，这是菩萨的智慧。道种智现前就叫做「正等正觉」，比正觉要高一层，他不但知道宇宙的本体，还晓得一切现象发展的过程。知法总相就是理体上的认识，「知法别相」就是现象的认识。<br/>第三种智慧，这是最圆满、最究竟。对于宇宙人生的真相，究竟圆满的明了，没有一丝毫的迷惑，也没有一丝毫的差误，这样的智慧称为「一切种智」；一切就是前面所讲的一切智，种智就是道种智。我们讲本体跟现象是分开来说，其实本体跟现象是一桩事情。如果拿《心经》上的话来说，一切智就是「空」，道种智就是「色」，一切种智就是「色不异空，空不异色；色即是空，空即是色」，原来是一不是二。假如诸位能够发现到一，你就入门；佛法的门称为不二法门，你就入不二法门。你晓得总别不二，这就入了佛门；如果总别是二，你就无法入门。这是说性相不二，性相一如，这是起用当中的正知正见，就是我们讲的佛知佛见，《法华经》里面所说的「开示悟入佛之知见」。这个智慧现前，这才叫做「无上正等正觉」，唯有佛圆满证得。<br/>三种智有密切的关系，是一而三、三而一。罗汉偏在一切智，菩萨偏在道种智，唯有佛才圆满。我们学佛最聪明的修学法，知见要圆不要偏；主观就偏，客观就圆。诸佛如来没有丝毫主观观念，他是圆融自在，阿罗汉有他的主观观念，菩萨也有一些主观观念，所以他不圆。这是说明我们如果想学聪明，就要学客观，不要有主观观念存在，才能够成就圆满的智慧。<br/>这三种智，从什么地方得到？从一心当中得到。行门里面，直截了当求无上正等正觉的，就是《弥陀经》使用的方法—一心不乱。在中国，无论哪一宗、哪一派，没有不念佛，包括禅宗；禅宗的课诵本晚上都念《弥陀经》，都念阿弥陀佛。《华严经》里修行的方法有两千多种，可以说是相当之多，但是最重要的就是念佛法门。善财童子五十三参，自始至终就是修念佛法门；而普贤菩萨导归极乐，显示出无论哪个法门，可以成就正觉，可以成就正等正觉，但是不能成无上正等正觉，如果要成无上正等正觉，一定要修念佛法门。念佛法门代表一心不乱，唯有一心不乱才能达到一切种智。所以念佛法门是修学一切种智的方法、手段，实实在在不可思议。<br/>「觉者」，这是讲智慧的作用。智是体，觉是用。有体就有用，如果没有作用，这个体要是得来也没有意义、没有价值。这个作用就是佛法里面讲的解脱；如果用三德（法身、般若、解脱）来说，佛（佛性）就是法身，智者就是般若，觉者就是解脱；解脱就是得大自在。作用又分两方面：一个是对于本身，一个是对于环境；对本身的是「觉察」，对环境的是「觉悟」。这里有两个专有名词，第一个是「烦恼障」，第二个是「所知障」。烦恼本身就是障碍。所知本身不是障碍，所知是我们应该要知道的，但是所知现在变成不知，这里面必定有一种障碍，障碍所知，我们称它为所知障。这两个名词的含义一定要清楚。<br/>「烦恼障」：烦恼障就是见思烦恼的总称。「见」是见解，「思」是思想，见解跟思想错误，会带来许许多多的烦恼。见思烦恼里，以「我见」为第一。《唯识论》说了一百二十八根本烦恼，以及等流与随烦恼，数目繁多。《百法明门论》把它归纳为二十六个，六个根本烦恼，二十个随烦恼。可是诸位要记住，这是归纳为大类，每一类里面包含的头数是说不清楚的，烦恼无量无边。<br/>我们要想断烦恼，这烦恼像树一样，无量无边是枝叶，能够找到它的根本，从根本上断就容易。烦恼障的根本是「我执」。有我才有烦恼，如果没有我，烦恼就没处落脚。烦恼障的根源是我执，所知障的根源是法执，这两种执着要是破了，这两种障碍就没有了，这才能明心见性，成佛作祖。种种烦恼，它能够扰乱我们的身心，能够障碍涅槃。涅槃是梵语，通常翻作圆寂；圆是功德圆满，寂是清净寂灭。我们的真如本性（佛性、自性、清净心），确确实实是圆满功德、是清净寂灭，就像六祖所说的「本来清净，本来具足」。现在我们的心不清净，不清净是因为你有烦恼；你有烦恼才不清净，有烦恼才不自在，有烦恼才有无量无边的苦报。所以学佛，首先就要断烦恼。<br/>学佛最低的限度要能够改造命运，要能够转业，这是最起码的；如果连这一点都做不到，我们就白学。像袁了凡，确确实实把自己的命运改过来。在台湾，许多学佛的人，后半生的命运都是自己学佛当中改造的。李炳南老师今年九十六岁，他说他的寿命没有这么长，顶多也不过六十九岁而已，今年九十六岁，自己修得来的。我在没有学佛之前，有很多人给我看相算命，说我过不了四十五岁，我今年五十九岁（注：民国七十五年），也是修得来的。这就是学佛最起码的好处，我们已经得到了。如果连这一点都不能转，学佛就没有效果，没有成绩可言。<br/>转业从哪里转？就是转这两种障碍。这两种障碍都要靠智慧—一切智、道种智、一切种智，智慧能破障。这两种障，障智慧，障碍我们的清净心，障碍我们圆满的功德，障碍的结果就变现出六道轮回。六道轮回是谁造的？烦恼障造的，烦恼障要是打破，六道轮回就没有了。阿罗汉用禅定的功夫成就第九定；六道里面有四禅八定，没有第九定，第九定超越六道；第九定将我执破了，烦恼障断了，就没有六道轮回，所以阿罗汉没有六道轮回。这就说明六道轮回是自己造作的，自作自受，决定不可以怨天尤人。到后面第五讲讲到十二因缘，再告诉诸位轮回是怎么一桩事情。烦恼能够发动业力，使你在轮回里面生生不息，在这里面轮转。烦恼的性质是束缚，使你不自在，束缚这一些有情的众生。这个束缚是无形的，譬如你烦恼了，心里牵肠挂肚的事情很多，就不自在。只要有烦恼，你就没有办法离开轮回生死。烦恼障涅槃、障生空（人我空）。<br/>「所知障」：所知障是以法执为根本。世出世间一切法，你对它起执着，这也是麻烦事情。它的头数有多少？跟烦恼障一样，无量无边。所知障把我们本来所知的境界变成无知。佛在《华严经》上说：「一切众生皆有如来智慧德相。」我们的智慧跟佛一样大，佛是无所不知，我们原本也是无所不知，现在我们是将本能失掉，无所不知变成一无所知，学都学不会，糟糕不糟糕！为什么会失掉？这当中有一个障碍，这个障碍就是「法执」，对一切法起分别、执着，所以就变成障碍，把我们的一切智丧失掉。<br/>也许我们听了会怀疑，凡是知识一定要学习才会知道，那不学就会知道吗？真正的智慧不要学。佛经里常说「无师智」，师就是学习，不要学习；「自然智」，也不需要修学，自然就知道。这个话说起来你不相信，不是你常识能想象得到，你在一生当中也没见过这样的人，你当然不相信！可是这事情是真实的。《六祖坛经》记载，六祖大师没念过书，不认识字，也没有到外面参学过。他善根深厚，卖柴的时候，听人家念《金刚经》，听了几句就开悟。我们读了几百遍、几千遍都不开悟，他是人，我也是人，为什么他能，我不能？他听经的时候没有我执、没有法执，所以一听就开悟。我们今天听经、读诵，有我执、有法执，统统是障碍，障碍很严重，当然开悟不了。所以要晓得，佛法是破执着的。如果一切不执着，一听就开悟，一看就开悟，悟了以后的境界就变成无所不知、无所不能。多少人向六祖请教，问经典里面道理，六祖说：「我不认识字，你念来我听听。」他就念一遍，念了之后，六祖就为他讲解；他没学过，意思完全明了。因为没有障碍，所以六根接触外面六尘境界，都变成智慧，这是无师智、自然智。<br/>心要清净，心里不能有一点点东西，有一点点就是障碍，不是烦恼障就是所知障。所知障能障菩提（觉性），使你对于一切法不觉，迷惑了。烦恼障起来的时候，一定带着所知障；所知障起来的时候，不一定带着烦恼障。这两种障碍，虽然说一个障涅槃，一个障菩提，其实严格的讲，烦恼障涅槃也障菩提，所知障障菩提也障涅槃。我们只能够说，哪一种障对某一方面障得多一点，其实都是障碍。<br/>「觉察」：觉察是「对烦恼障」。对是对治，烦恼障是病，觉察就是药，拿这个药来治这个病。觉就是觉悟，察就是观察，我们现在所讲的反省，做反省、省察的功夫。如果不能够深深的去反省，我们在境界里常常迷惑，起无量的烦恼。下面两句是比喻，比喻烦恼障的害处，「侵害如贼，觉贼无能」。贼是小偷，混到这里来，我们的财物要受损失；就好比烦恼障起来之后，我们真性里面的功德不能够现前，清净心不能现前。心本来是清净的，蒙上这一层烦恼，心就显得不清净，觉了就能够恢复。觉贼无能：你若觉察，贼就发挥不了作用，能力使不出来。所以烦恼不怕，就怕觉迟，你要觉悟得快。<br/>怎么觉法？这就是我们修学关键所在。首先要晓得烦恼的形相，要认识它。烦恼的形相，大经大论里有很长的文字讨论，简而言之，中国人所讲七情五欲就是烦恼的相，七情是喜、怒、哀、乐、爱、恶、欲。如果我们读《唯识论》、《百法明门论》，对于烦恼的形相就有一个概略的了解。然后这些形相一现前，我们自己立刻就觉悟到，我烦恼起来了；只要你一觉悟，烦恼就不起作用，就转变了。还有一个最简单区别的方法，我们的心是清净光明的，如果在一切物质环境、人事环境里面，我们这个心不清净、不光明，这就有烦恼，就有障碍，这个时候一定要提起观照；这一观照，烦恼就没有了。<br/>什么是观照？怎么观照法？我告诉诸位，一句「阿弥陀佛」就是观照，就是观照的方法。南无阿弥陀佛这六个字，「南无」是皈依，「阿」是无，「弥陀」翻作量，「佛」是觉，这一句名号翻成中文意思是「皈依无量觉」。我样样都要觉悟，岂不是这一句佛号帮助你回头；从不觉喊回来，你要依觉，不能依烦恼。譬如我们遇到一个顺心的境界起了贪心，你立刻就觉察到贪心是烦恼，清净心里没有贪爱；贪心才起来，南无阿弥陀佛，从贪欲里回头。贪是不觉、是烦恼、是迷，从这里回头，依觉；觉心清净，不生烦恼。这个佛号就管用，念念将我们从烦恼里唤回来。只要一把佛号忘掉，烦恼就起作用，一个接一个来，烦恼就增长、相续。<br/>所以念佛是断烦恼的功夫，念佛要这样的念法，才能够得一心不乱，因为这种念法，念到有相当功夫，烦恼不起现行。虽有烦恼，你念佛功夫念得很好，佛号完全把烦恼降伏住，这就是「功夫成片」，净宗讲带业往生就是这种程度，决定往生。没有往生之前，我们身心很自在，因为一天到晚没烦恼，没有烦恼就快快乐乐，很自在。功夫再深一点，把烦恼念断，烦恼障整个破掉，没有我执，就得念佛三昧，就叫做「事一心不乱」。如果功夫再深，连所知障也破掉，那就得「理一心不乱」。理一心不乱就成佛（分证佛），因为理一心不乱是明心见性，见性成佛。可见得这一句佛号妙不可言。<br/>有很多念佛的人迷信，一天到晚念阿弥陀佛，以为阿弥陀佛会保佑他，没想到阿弥陀佛没理他！怎么晓得没功夫？纵然一天念十万声佛号，脾气还挺大的，你得罪他，他生气好几天，你赞叹他几句，他欢喜好几天，这怎么行！这就是烦恼一点都没断，烦恼还是常常起现行，佛号压不住烦恼，不能往生。往生西方极乐世界，阿弥陀佛没说你一天念多少声佛号，我就来接引你，查遍净土经论没这个说法。人家的条件是一心不乱、心不颠倒，哪怕一生就念了一声佛号，这一声佛号就念到一心不乱，可以往生；一天念十万声佛号，没有念到一心不乱，去不了。《弥陀经》上讲得清清楚楚，往生的标准是一心不乱、心不颠倒；破烦恼障就一心不乱，破所知障就心不颠倒。净土法门与教义完全相应，不能够通达教义，这一句阿弥陀佛念不好。所以无量法门都是要破二障，净土法门念阿弥陀佛不例外，也是要破二障。<br/>马鸣菩萨告诉我们：「本觉本有，不觉本无。」本有当然可以恢复，本无当然可以断掉，我们一定要相信，这叫做自信，信自己。佛法里面讲信心，信解行证，第一个就要相信自己，然后相信诸佛菩萨能够为我们做增上缘，能够帮我们的忙，帮助我们自信，帮助我们自悟，帮助我们自修自证。一切要依靠自己，不依靠自己，别人是帮不上忙的。<br/>「觉悟」：觉悟是对治「所知障」。这里也有一个比喻，「昏昧如睡，觉即分明」。我们睡着了，什么都不知道，可是醒来之后又恢复了。这个意思就是说明，我们在一切境界里面起了分别、执着、妄想，对于外面环境的真相就不能够认识，好比睡着了；如果我们在一切境界里面没有分别、执着、妄想，我们的能力又恢复，就好比又清醒了。可是分别、执着说来容易，要想真正把它断除，的确不容易。所以初学一定要在定功上下手，那就是一定要修禅定。可是修禅定之前，一定要修戒律，戒律帮助你禅定。我们无始劫以来的习气太深，习气就是烦恼，烦恼太重一定要依戒条勉强来修学，来约束自己，把恶业先断除；恶业断除之后，善业也不执着才能得定，你的心才能恢复到清净。清净心里面自然就生智慧，智慧现前就能够破除二障，恢复我们自性里面本来具足的大智大觉，这就是成佛。<br/>下面有三句，「自行、化他、行满」。自行是自己学习，依照理论方法来修行。化他是教化众生；教学相长，教化众生就是帮助自己觉悟，不肯发心帮助别人，自己就没有办法圆满的觉悟。行满就是自行化他圆满。如果只有自行，不肯化他，这是小乘；像阿罗汉不肯主动化他，他一定要你去向他请教，他不主动教你。菩萨就不一样，菩萨作众生不请之友，众生不请他，他上门来教你；自行又能兼之以化他，则是大乘的菩萨。自行化他圆满，那就是佛。</p><p class=\"text-indent\">乙、二障略举<br/>这一段是讲觉悟的内容，也就是整个佛法的内容。佛法的内容就是现在哲学里所讲的两个大范围：一个是人生观，一个是宇宙观。佛法不是哲学；哲学里面所研究，它有对象，它是相对的，有能、有所；佛法里面没有能所，是自己研究自己，所以它不是哲学，不是研究别人，是研究自己。佛法里面讲的人生观，只讲自己，不讲别人。宇宙观就是环境，有人事环境、物质环境，别人是我们自己宇宙观里的人事环境。<br/>「人生观」：佛法里讲人生只是讲我们本身，本身以外是环境，属于宇宙。这就是觉用里面第一项所讲的觉察，我们要觉察「本身烦恼」。说到烦恼，这里头有因有果，过去、未来我们不说，只讲现前容易觉察、容易理解的。「当前所受」：所受的是果报，就是我们现前在生活里面种种的感受，这是我们应当要觉察到。感受的、所受的也是太多，此地只略举三条：第一个是「众苦」，我们现在所感受的是苦，身也苦、心也苦，这是果报。第二个是「不自由」，我们想想是不是不自由？第三个是「不平等」。这三条是非常明显，显而易见。底下讲，这是应觉之一，学佛一定要时时提醒这个觉心，不能让它昏迷。庄子说：「智人用心如镜，不将不迎。」这跟佛法里面所说的观照，功夫是相同的，这就是觉的意思。我们要觉悟，我们现前的果报为什么这么苦？有这个苦果，当然有造成苦果的因素，我们进一步要去找，有果必有因。<br/>「当前所造」，这就是因。此地也是略举三条，是针对前面三种苦果而说的。第一个是「苦因」。你现在所造的都是苦因，既然造因，哪有不受果报的道理？苦因是迷惑造业。我们现在对于自己迷惑，不认识自己，对环境也迷惑，迷惑之后就妄动，妄动就是造业。造作的时候称为事，结果称之为业；像你们在学校念书，把所有的学分学完，毕业了，就叫做业。六道轮回这些因果报应，业力在主宰，业力在推动，这业力是自己制造的，自作自受，你能怪谁？正因为是自作自受的，所以自己可以改变。我自己造的，别人不能帮我改；所以佛菩萨没办法替你改。业是我们自己造的，果报还是自己受，这才是一个正理。所以你造苦因就得苦果。<br/>第二是「缚具」。你有许多束缚的工具，你就不自由。缚具是什么？浅而言之，烦恼、牵挂。你心里有很多牵挂就不自由，没有牵挂得大自在，一个人要学无牵无挂。某人福报很大，福报就是缚具，有福报就不自由，没有福报、没有牵挂就自由。<br/>我出家受戒的时候，道场里有一位法师给我们讲一个故事，他是江苏人，他说他们寺庙附近有一个人家很有钱，他的父亲在外面要饭；大概最初家境也不很好，父亲常常在外面要饭。以后儿子发了财，总觉得父亲在外面要饭，自己很没有面子，想尽方法把老头子找回来，供给他衣食，养尊处优。他过不惯，住了几天，又偷偷的跑出去要饭。人家问他为什么？我这个自由自在。被儿子关在笼子养，不自在；回到家里，总觉得人家伺候着，不自在。他说：我一天到晚，走到哪里玩到哪里，肚子饿了，向人家讨点饭吃，晚上睡觉，走到哪里睡到哪里，好自在。这真想得开，真是看得破、放得下，自在！所以要晓得，有家，家就是缚具，你有了家就有牵挂，就不自由。我学佛从来没有动一个念头，将来要搞一个道场。为什么？那就是一个缚具，有了道场就不自由，就有牵挂、有约束。像虚云老和尚，他老人家一生到处建庙，到处修庙，建好了马上请一个人作住持；他移交了，他得大自在，所有道场始终没有变成缚具。<br/>第三是「分别业」。有分别心就不平等，如果你在一切法里都没有分别，万法平等。分别就是两种执着—我执、法执，偏见偏爱，造成不平等。<br/>凡事都有因果，果报要觉悟，修因更要觉悟。如果我们不造因，当然就没有果报；造了业因，后来必定感果。经上常说：「众生畏果，菩萨畏因。」众生造作的时候，胡里胡涂不知道，果报现前时害怕。菩萨不怕果报现前，晓得没法子，只好逆来顺受。菩萨怕造恶因，所以菩萨绝不造恶业，这就是觉悟的人。人生观这一小段，是对于本身的觉察，也就是人生的觉察。<br/>「宇宙观」，对环境的觉悟。「环境所知」：这是讲所知障，前面是烦恼障；所知障是对环境说的。环境，我们一般叫宇宙观；观就是觉悟，宇指空间，宙指时间，整个时空里面所包括的一切现象。分为两大类：「森罗万象」是讲物质环境；「人情事理」是讲人事环境。<br/>在物质环境里面，略举三条。第一是「恶难遣」。恶劣的环境，不好的环境，我们总想离开它，能不能离得开？不容易。为什么？这里头有因果。有福的人，不管到哪个地方，福报都是现成的；造作罪业的人，不管到哪个环境都要受罪。这个事情总脱不了因果的定律，我们一定要明了。环境恶劣，真正觉悟的人知道是自作自受，他逆来顺受，不求离开，在这里面断恶修善、改造业因。因改了，果报自然就转变，这才是正理，才是一个真正改造命运的途径。<br/>第二是「好难求」。谁都要好，可是好毕竟是不容易求得的。佛门里常说，「佛氏门中有求必应」，这是千真万确的事实。求，要懂得理论方法，如理如法的求才能够得到，才能够有求必应；如果不懂得理论方法，盲修瞎练求不到。佛法绝不迷信；世间有不少发财的人，天天拜神，认为他是拜神而发财的，神保佑他，赐给他财富，所以他要去报答神明，这是迷信。实在说，他命里头该那个时候发财，他在那时候拜神凑巧碰上；这个神也很走运，所以他常常去供养祂。这是碰巧碰上，不是神给他的；如果是神给他的，每一个人去拜神，神应该都给他。譬如你命里没有财，到神那里去拜一拜，告诉神：他发了一千万的财，只供养你一百万，我发一千万，供养你三百万；那这个神应该马上就把财给你，结果你还是发不了财。可见得你发财是前世修财布施的因，这一生得的果报，不是神给你的。儒家云：「聪明正直谓之神。」神不会受贿赂，不会受你巴结。如理如法的修学，福报是可以求得，功名富贵也可以求得，甚至于健康长寿也可以求得。诸位好好的去念《了凡四训》，我的朋友当中，有人依照这个理论方法来修学，改变自己的命运，改变自己的环境。<br/>第三是「得易逝」。恶的环境，我们很厌恶，希望离开；好的，希望能够得到。可是得到之后又很容易丢掉，因此凡是得到的人，无不是患得患失。得到不容易，又怕它丢掉，这里面就生烦恼，这就苦了。没有钱的时候想发财，很苦；发了财之后，又怕台币贬值，又怕灾难；患得患失，苦不堪言。这是讲物质环境上，我们应该要觉悟的。其实，最麻烦的不是物质环境，而是人事环境。处事难，处人更难，更不容易。<br/>「人情事理」，列举三条。第一是「情多异」。情绪非常不稳定，变化太大，早晨跟你很好，晚上就闹翻了；这个事情很麻烦，但是现在这个社会非常的普遍。人与人相处难啊！<br/>第二是「事多变」。事情多变化，为什么？没有原理原则可寻，这个事情麻烦；当然这个与教育有关系。中国古代，人情事理它有个范围，绝大多数不出这个范围，这个范围就是我们中国固有文化的道统—五伦八德，人人都能够遵守，所以国家能够长治久安。翻开中国历史，跟全世界每一个国家民族的历史比较，我们安定的时候多，那就是我们有一个道德的范围，大家都愿意遵守，都尊重。中国自古以来，治国是礼治，不是法治；自古以来中国人讲礼，现在变成最不讲礼的民族。在我们中国，人与人之间没有礼貌，远不如外国人。我们在外国，不相识的外国人在马路上碰到，他跟你笑笑，跟你点点头，很客气。到商店里买东西，觉得不好退回去，人家笑嘻嘻的接受，钱马上退给你。不像我们这里，你买了东西退回去，面孔板得好难看，甚至于他还不肯退货。外国人非常有礼貌，中国曾是礼义之邦，现在把礼义都丧失掉了，这真正值得我们反省。从前它是有一个范围、有一个原则，总不会超出太多，现在礼乐都崩溃，都没有了，没有原则可寻。从前的读书人，能够判断十年、二十年之后的事情；现在，今天都不能料定明天出什么事情，都预料不到，事情变化莫测，变化太大了。但是情与事都是现象，里头一定有个道理。</p><p class=\"text-indent\">丙、宇宙人生范围<br/>宇宙人生范围，实际上就是觉之范围。前面一段是觉之内容，这一段讲觉之范围，这个范围太大了。「空间十方，时间三际」，除这个地球，太空里有无量无边的星球，有无量无边的世界，都是我们智觉的范围。<br/>先说空间，空间与我们的关系非常密切。「方皆有生」：有生，不是说十方都有外星人，其他星球也许有比我们还高明的生物，不是讲这个，说这个与我们的关系毕竟不太密切。佛法讲方皆有生，是有我们自己，意思就是我们这一世在地球上出现，说不定来世我们到别的星球去投胎，这么一来十方世界与我们关系太密切了。譬如说我们现在在台湾，也许过几年移民到美国，那个地方变成我们生活的环境，可见那个地方与我们关系密切。我们念阿弥陀佛修净土法门，希望将来能生到西方极乐世界，西方极乐世界不在地球上，西方极乐世界也不在我们银河系里，而是距离我们这个银河系非常遥远的一个星系，经典里面佛给我们介绍得很清楚。这样遥远的星系，我们怎么能达到？这里面就妙极了。殊不知灵魂的速度太大了，比光速、电速大得太多。光的速度一秒钟才三十万公里，很有限，速度太小了，而我们灵魂的速度，一剎那、一弹指就能周遍法界，光速、电的速度怎么能跟它相比？没法子相比。「方皆有生」，十方世界都是我们生活的环境。<br/>「互为依缘」：十方世界是互为依缘的。底下举个例子，譬如「国际动态」，虽然距离我们很远，某个地方发生事情，一定影响我们的政治、经济，可见得全世界每一个地区的动态，与我们都是息息相关。底下是比喻。「风向气压」：冬天天气冷，与西伯利亚来的高气压有关系；台风亦是从其他地方生起，而吹至台湾来的。「太阳黑子」：太阳黑子多的时候，会影响我们的磁场，影响我们的通讯，太阳距离我们虽然这么远，星球与星球当中有影响。「推之无尽」，空间是无尽的，世界是无尽的。这是「觉之空间」，可见得这范围之大。<br/>「时间三际」：在时间上讲有过去、现在、未来。「三皆有生」，这个生跟前面那个生是一样的意思，过去世有自己，现在、未来世还有自己。有一些人想不开去自杀，以为这样就自了，给诸位说，死了就不得了。这一世苦，去自杀，四十九天投胎再来更苦，苦上再加苦，永远没完没了，这个事情可怕。佛常常赞叹：「人身难得，佛法难闻。」为什么赞叹人身？人最容易觉悟，人修学佛法最容易成就。你得人身这是大好的一个机会，不在得人身这个阶段求解脱，求了生死、出三界，胡里胡涂自杀，真是冤枉。所以道业没有成就之前，决定不能死，死不得也！这个很重要很重要。<br/>「生各环境」：我们的生命，一生一生环境不一样。每一个星球情况不相同，我们认为那个星球是死寂的，也许那个星球里面有很多众生，我们肉眼看不到。譬如说，我们地球是五趣杂居地，有地狱、有饿鬼，但是我们见不到，绝对不能说见不到就没有，这个太武断了；见不到可以存疑，这是做学问的态度。<br/>可是鬼这个事情真有，许许多多人遇到过。我初学佛的时候，朱镜宙老居士对我帮忙很多，他告诉我他学佛的因缘就是因为见到鬼，他才相信。其实他在年轻的时候，这一些传说他听了很多，但是他都不相信；他非常的执着，一定要自己见到才相信，果然他真的见到。抗战期间，他那时是公务员，晚上跟朋友一起玩，玩得很晚才回去。当时重庆那个地方路很暗，虽然有路灯，都是二十烛光，好远才一个，若有若无。他在路上遇到一个女人，走在他前面没多远，走了半个小时他忽然想起来，半夜怎么会有一个女人出来？这个念头一起来，他就寒毛直竖，吓得一身冷汗，再仔细一看，前面这个女人有上半身没有下半身，吓得他全身发抖。他遇到这么一桩事情，他就学佛了，他学佛的因缘是这么来的。学佛之后，他讲那个鬼大概是观世音菩萨变化的，菩萨示现这个样子来度他，要不然他不会学佛。那个时候我初学，他讲这些故事讲得很多很多，说明这事千真万确，确实是有。这是讲凡圣同居土，人见不到鬼，鬼也见不到人。<br/>我们由此就可以体会到，也许有的星球很适合于某种众生居住，例如太阳，温度很高，是一个火球，也许有众生适合那个温度，到我们这儿都冻死了，很有可能的；不能说这个星球上没有有情众生，有许多有情的众生是我们肉眼看不见的。有出家人来问我：「法师，现在美国人登陆月球，发现月球上什么都没有，我们以后还要不要念月光菩萨？」菩萨住在月球里，凡人见不到。正如同菩萨住在我们这个地方，我们肉眼凡夫见不到，只有少数有特别因缘的人见到。《慈悲三昧水忏》里面，悟达国师见迦诺迦尊者，他有这个缘分，他见到了，别人见不到。古时候确实有不少人见到佛菩萨、罗汉的道场，确实在我们这个世界，我们要相信，这是相信圣言量，这些人不会欺骗我们，像悟达国师他不会骗人的。佛法最重视的就是戒妄语，如果他用这种手段来弘法，纵然是好心，他也犯了戒，这个罪过就太大，这是破根本大戒。<br/>在《聊斋》、《子不语》、纪晓岚的《阅微草堂笔记》所记的那些神怪的故事，在我看起来寓言很少，十之八九是真实的。这些事情，现代的知识分子比较难以接受，但是你们也很好奇，如果发现有一点点小神通的人，往往你就上当。如果你真正想见鬼，跟鬼打交道，我告诉诸位，只要用三年功夫就可以跟鬼往来。可是你要晓得，往来之后决定没好处，对你自己本身不利。我在过去有一个老同参，我在台中学讲经，他就跟我说：「现代人劣根性很重，你把嘴皮讲破了，他都不相信，学这个没有意思。」我说：「那怎么办？」他说：「我学神通，神通学会，一现神通，他就相信。」他这个想法也很难得，于是他就去修神通。修了三年，神通没有，得鬼通，跟鬼道天天往来。他告诉我，他能够看到鬼，说我们平常都市里，下午五点钟以后街上就有鬼往来，不过数目不多，到八、九点钟的时候满街都是，鬼都出来了，很热闹。他在鬼里头也有认识一些人，他是个出家人，很奇妙的他说找到一个女鬼，是他前世的太太，所以我们到他那儿去参观，他在旁边供了一个牌位，牌位上供了女人的化妆品。这是前生的太太找来了，跟他在一块住了一个多月，鬼通。我就跟他讲：「你能够见到鬼，我没看到，我还是不相信！你还是不能度化众生。」<br/>我们那个时候同参三个人，三个人同年，三个人都短命；算命的说，三个人都过不了四十五岁，所以我们那个时候学佛很精进。两位同参都是四十五岁那年走的，眼看轮到我了。我那一年在基隆大觉寺讲《楞严经》，讲了三卷，就害了一场大病。我想时间到了，所以不看医生，也不吃药，我想那都没用，一心一意念佛求往生。可是过了一个月之后病好了，一直到现在没生过病。我没有求长寿，这都是这一生修来的，确确实实能转变命运。修神通的确不难，但是没有什么用处，不但不能帮助你定慧，连转眼前的业力都做不到。所以佛在一切经论上，处处教诫我们不要修神通，你自己定慧成就之后，神通是本能，自然会现前，不要修，到时候你的本能就恢复。<br/>这是说出我们这个世间，有一些我们肉眼看不见的有情众生存在，他方世界其他的星球当然有可能。我们只可以说，与我们人类，或者与我们地球上不相同类的这种生物，在许多星球上没有；但是除这个不相同类之外，另外我们肉眼不能够见到的众生，不能说没有。世界无边，每一个世界是我们居住的环境，过去、现在、未来都有我们自己的生命。<br/>底下是比喻，「古今政治风俗」，虽然不相同，它有密切的关系。「六道身寿依报」，六道里面每一道的身形、寿命、生活环境，状况也各个不相同，我们到后面再来讨论。「澈之无穷」，就是「觉之时间」。<br/>从这一个讲表来观察，我们就晓得佛法里面绝对没有迷信，佛法是破迷开悟的。苦，是迷才有苦；乐，一定要觉悟之后才能够获得。佛法的修学完全在自觉，觉他也是自觉，自觉圆满这叫成佛，所以成佛就是成就「无上正等正觉」。<br/>学佛跟佛学是不相同的。佛学可以说是学术、是哲学；但是学佛就不一样，学佛是要学作佛，要学成佛。目标完全不相同，修学的方法当然也不一样。如果把它当作一门世间学问来研究，目的不是成佛，目的也不是求无上正等正觉，可以拿世间的方法来研究它。依照欧阳竟无大师的说法，如果是「佛学」，那是邪知邪见，若是「宗教」，那是完全迷信，所以他说，佛法就是佛法，佛法不是宗教，佛法也不是哲学。他这个见解、这个说法，很合道理，值得我们深思。全世界佛法有三种不同的形式出现在这个世间，我们要有能力辨别。我们要学什么？是学宗教的佛法，还是学学术的佛法，还是学佛法的佛法，这是一定要辨别清楚的。佛祖代代相传是佛法的佛法，至于学术、宗教的佛法都是变质的，都是将佛法误解，也都是迷惑了纯正的佛法，修学那个浪费时间精力，而一无成就，这是我们应当警觉的。<br/>眼前的祸福，佛法里给我们说得清清楚楚、明明白白。我们中国古圣先贤也告诉我们，「吉莫吉于知足」，知足的人处处吉祥如意；「苦莫苦于多怨」，多怨是不知足，不知足就苦。「福在积善，祸在积怨」，所以我们与一切人，千万不要结冤仇，古人教给我们「冤家宜解不宜结」，冤仇积多了，一定是祸害。所以要修善、要断恶，心胸要扩大，要能够原谅人，要能够容忍，才能成就自己定慧，成就自己的福慧双修。<br/>第三是「理多祕」。这个祕不是祕密，是深祕，有很深的道理。必须要很深的智慧，才能够看破这些道理，然后才能应付得了多变异的人情事故。</p></div>"
    },
    {
        "title": "第二讲 研究佛学须先略知别相",
        "html": "<div class=\"B1_text\"><p class=\"text-indent\">第一讲介绍佛教定义，认识佛教。第二讲要讨论研究的方法，这也是非常重要的。佛法有性、相两宗，也就是总相与别相，也称为空、有两门，这两门都可以下手；但是空门下手，不是一般人能够办得到。古今的学者告诉我们，性宗入门必定要具足上根利智，就是最聪明的人；这个聪明不指世间的聪明智慧，因为世间的聪明智慧是障碍。真正所指的是心地清净、具足诚敬之人，这是学佛的上根，这样的人才可以从空宗下手。如果是喜欢研究、喜欢动脑筋的人，不宜从空宗下手，因为空宗不需要动念头，不起心、不动念，你喜欢起心动念当然就不相应。也有办法，就是从有宗入门，有宗就是别相，从别相入门。佛法博大精深，总持法门就是性相两宗而己。李老师在此地，给我们提出一个入门的途径，就是从有门。「研究佛学须先略知别相」，这是从别相下手。修学实在说态度重于方法，这是我们应当要注意的。态度就是诚敬，印光大师说：「一分诚敬就有一分收获，十分诚敬一定有十分的收获。」可见得诚敬是入佛门的关键。有诚敬的态度，再加上良好的方法，我相信我们修学佛法不会有太大的障碍。</p><p class=\"text-indent\">甲、佛学难解<br/>「佛学难解」，这是事实。为什么难解？先从它本身的内容去观察，它的内容是整个宇宙人生，宇宙人生本来就复杂，所以说「复杂宇宙，复杂人生」。复杂的宇宙人生简直是无有穷尽，以有尽的言说（言说有限度、有范围），要去探讨无尽的事理，实在是太难。所以底下讲：「复杂即难说，难说自难解。」因为它太复杂，所以要将这些复杂事情说明白，不是一件容易事情。说都说不明白，你怎么会听懂？虽有困难，这个事情还是要解决。「说听有方便」，这就是要求善巧方便，善巧方便就是最好的教学法。用最好的、很巧妙的方便法，教我们初学从「信」、「解」入门。「信」要「依总相」，「解」要「从别相」。我们现前每一位同学，都可以从这个地方入门。<br/>为什么说「信依总相」？总相非常的难解，我们要信它。凭什么信它？凭圣言量信它。这是佛说的，佛以他的人格来作保证，他不会欺骗我们，这个事情是事实，只有他知道，我们现在境界还不到。譬如说，佛跟我们讲「万法皆空，万法皆如」，我们听了之后，的确没有法子体会得到。佛给我们讲「不生不灭」，我们眼看一切现象都是生灭法，怎么会不生不灭？这种甚深之理与真实的事相，有待我们逐渐提高自己的境界，到时候自然就明了；可是还要靠自己在解行上去努力。<br/>古德给我们提示，学佛有四个层次，那就是信、解、行、证，分成这四个阶段。首先要建立信心，因为信心不建立就会怀疑，你就不肯去研究，或者研究就会懈怠放逸、不认真。无论做什么事情，如果对这个事情有怀疑，没有坚定的信心，这个事情就注定要失败，不会成功。无论大事小事，这个事情要做得很圆满、很成功，必定是具足充分的信心。佛在《华严》上说，「信为道元功德母」，信是大道的根源，是一切功德之母，无量无边的功德从信心而生的。信能生功德，好比是功德的母亲一样，它能生。这个比喻，比喻得非常好。<br/>信心的建立，不是一桩容易的事情。我们现前所说的信佛，信仰三宝，都是属于迷信。信是信了，三宝、佛法究竟是什么？还不晓得。不晓得就是迷！但是你能够信它，这个不容易。所以这种迷信是有条件的，不是没有条件的，有哪些条件？第一个我们相信佛是具有很大智慧的人，具足很高的德行，他不骗我们，他能够教我们，我们将来也能跟他一样的成就，我们相信这个，这就是有条件的迷信，不是无条件的。其次，佛教传到中国也有一千多年，这一千多年当中有许多聪明智慧的人，依照这个方法来修学都有成就，这些人都是我们的见证。我们看到这么多人修行，这么多人成就，信心是由这些条件促成的，我们对他有信心。这个信的确是迷信的，有条件的迷信。<br/>有条件的迷信，也可以称为强信；勉强的相信，不能称为正信。什么叫正信？这个信仰的产生，不是依赖于释迦牟尼佛的人格，也不是历代这些高僧大德的成就，是对它的理论产生了信仰，明白这个道理，这个道理是真的不是假的，这种信才叫做正信。正信从理解产生，对于佛法有研究，确实明白它的道理，这个信心生起来，这是正信。这还不是真信，真正的相信是什么？这个事情见到了，明心见性，我也见了性；见了性，这是真信，不是假的。解悟，正信现前；证悟，真信现前。信心从我们现在开始是强信，一直到成佛，真信才圆满。我们学佛无非就是修信心而已，建立真正的自信心。<br/>求解非常重要，求解有两个途径：一个是读诵；一个是听讲。这里面还有一个最重要的关键，我们一定要牢牢的记住，那就是要有一个好老师来指导，这是我们成败关键所在。古今中外不管是佛法、世间法，他之所以有成就，一定有个高明的老师指导他。佛在《阿难问事佛吉凶经》里，一开端就说明一定要接受明师教诫。这个「明」不是有名气的名，名气大了，知名度高，也未见得有真正的学问；这个「明」是光明的明，就是一定要有一个明心见性的老师。这个老师是过来人，唯有过来人指导，我们才不会错；路他走过，而且他走通了，他走到了，可见得他没有迷路，他指我们这路子，决定不会错。如果你找到一个老师，他自己走这个路没走到，自己迷了路，你再找他，他指你的路子，也是一条迷途。所以一定要找高明的善知识去亲近他，这就是所谓的师承，这一点非常重要。</p><p class=\"text-indent\">乙、诸法三分<br/>这一段提示我们研究的方法。「诸法三分」：诸法是指宇宙人生一切法（世出世间一切法）。这是教我们在一切法里面观察，要面面俱到，不能只看一面，看一面就会发生误会，如果面面都看到就圆融。「三分」：大到整个宇宙，小至一微尘，都有这三个部分，那就是体、相、用。它的本体、它的相状，以及它的作用，这三桩事情是一而三，三而一；三方面都能正确的理解，才将这个法看透，得到它的真相。<br/>第一是讲「体」。体里面有性体、有质体；性体是真的，不生不灭，质体是有生有灭。性体是空寂的，那就是总相，万法皆空；这里面没有生灭相，而且是常恒的，所以没有断灭相。不但没有断灭相，也没有相续相，如果有相续相，相续就是生灭，就不是真常，真常里面没有相续相，这是讲本性。本性，佛经上常常讲「法尔如是」，法尔就是自然的意思，自然而然，本来就是这样，这是什么都加不上；如果你在这个地方起了一念疑情，这一念疑情就叫做无明。所以这个境界，佛经里面常讲「不可思议」，思是思惟想象，议是言说议论，不能够思议，一思就是无明，一议就是戏论，戏论就是开玩笑。这是讲到纯真无妄，是体空，是真空。<br/>性体「空而无质」，质是物质，它没有质。此地举了两个比喻：如花之香、如镜之光。比喻只能比个彷彿，没有法子比到恰好，没有东西能比喻真如本性，没法子比的。这两个比喻说出空的意思，但是空不是无，空是有。「如花之香」：香是六尘之一，香怎么能比？实在是不能比，但是无可奈何，拿这个来做比喻。香是一种气味，可以远闻。花有香气，我们很远的地方就闻到花香，但是花并没有来，香的气味你闻到了，你看不到，你也捉不到它，确实有花香。这比喻空的意思。「如镜之光」：镜有光明，有光明它才能照。镜子是一个物体，有形相，它能照；「光」是没有迹象，再远的距离它也能照，都照在里面。这是实在不得已，用这两个比喻。我们在讲席中，常常用电波来做比喻，更容易体会。电波遍满空间，我们眼不能见，耳不能听，手也摸不到它，心里头也无法想象，它确实存在，无处而不在。可见得「空」是有，空不是无。<br/>但是我们无论用什么方法来说明，质的空不能变成有。性空，它能变成物质，这个太妙了！其实我们现代的科学家也相当聪明，发现质可以变成能量，能可以变成质，质与能可以互相转变。那是「体」里头第二个意思，就是「质」，质体，质与能可以互相转变。我们以《心经》的话来说，质就是色相，能量是空寂的，「色即是空，空即是色」，很容易能体会得到。可是质与能是一桩事情，这个质能从哪里来的？质能的本体是什么？再往上追究一层，质能的本体就是性能，就是本性，科学家到现在还没发现这个问题。性能是活的；质能不是活的，所以它是物质。唯识里面讲，质能属于相分，性能属于见分，见相同源，前面也说过，见分与相分是相当不容易辨别的。性体是形而上，质体是形而下。<br/>「析之本无」，质体也是空的，你要是把它分析分析，它就不存在了。性是当体即空，「万法皆空」，这是从性体上说的。又说「缘生无性」，缘生无性的性，不是此地性体之性，而是质体，缘生无性就是说缘生性空。「因缘所生法，我说即是空」，这是《中观论》上所讲。因缘生法，这一法是许许多多条件集合，离开这些条件，这个物体就不存在；所以它是许许多多条件凑合而现的假相，是暂有的现象，不是永存的相，只是暂时有的相。<br/>我们在质体上下手。佛经里面常说质体「双持性相，轨生物解」，双就是讲性与相，持是保持，它能够将性相集合在一起，就是见分跟相分集合在一起。特别是在有情分上，像我们这个人身，身是质体，这个肉身是物质，许许多多细胞组织成的；今天研究电子，里面有软件、有硬件，我们这个人身就是软件、硬件组合的，就是这么回事情！这里面有相、有性，我们的精神就是性体，六根的根性就是性体，我们这个色身就是质体，可见得的确双持性相。这个组织是有条不紊，虽然复杂，它有条理。因为它有条理、有规则，所以就能够理解。不但我们人可以理解，诸天也能理解，甚至于饿鬼、畜生也能理解，九法界有情的众生都能够理解它。佛经里面的本体有两种：一种是性体，一种是质体，我们要把它认识清楚。<br/>质体是分析空，一分析它本来没有，本来没有，现在它有了，虽有还是没有，有跟无是一不是二。譬如我们看一栋房子，这个房子是砖造的，迷人一看，喔！这是栋房子。他的看法有没有错？也不能算错。建筑师到那里去看，他没有看到房子，他只看到这个地方多少砖、多少瓦、多少钢筋、多少水泥。他有没有看错？也没看错。他的看法比我们一般人就看得深入，我们一般人只能看到外表，他将屋子里头都看透了，他看到砖头、瓦块、钢筋、水泥是真的，房子是假的。懂不懂这个意思？这是排列组合的。拆开来还是那么多砖头，还是那么多瓦块，可见得房子这个相是假的，假有。再看砖头、瓦块也不是真的，是许多分子、原子、电子组合的。看到最后，一切万法无非是一些原子、电子、基本粒子而已，除这些东西，什么都没有，这就是「色即是空，空即是色；色不异空，空不异色」。所以不是说把房子拆掉之后，你才晓得，喔！没有了，建筑起来的时候一看就没有，当体即空，这个观察才能观察到它的真实相。<br/>观察到真实相的好处太多，不会在妄相里面起分别、执着；换句话说，不会在妄相里面去造业、去打妄想，你的心就清净。晓得一切法是平等相，一切法俱不可得，你的心清净。清净心就生智慧，智慧心见一切境界相就叫做「观照」。我们现在见色闻声不是观照，因为我们里头有分别、有执着；离开了分别、执着，见闻觉知皆是观照。所以观照的心，是用真心；失去观照的心，是用意识心，就是分别执着心。「观」是观察，根尘相接触称为观；「照」是明了，一接触就明了，没有通过思惟，不用心意识。<br/>底下是比喻：「丝非布质，布非衣质。」说明分析空。「丝非布质」：质就是我们讲的质料、体质。丝可以织布。这块布什么质料？丝织品，可以这么说法。如果说布的质料就是丝织品，能不能讲得通？讲不通，还有棉、麻、尼龙，很多种质料都可以做布。这个意思就是古人所讲的「白马非马」，就是这个意思，如果你说白马是马，黑马就不是马了。「布非衣质」：我们这个衣服什么质料？布的，布衣。如果说衣的质料就是布，这也讲不通，还有皮衣、毛衣，所以衣的质料不只布一种。丝除了做布之外，还可以做其他东西；布除了做衣服之外，也有许许多多的用途，它不是仅有一个用途。<br/>仔细分析，一切法本来就不是一个定法。所以这种有，佛家称之为「妙有」，妙有是无有而有、有而无有，就是这个意思它才妙。真空跟妙有是一桩事情，不是两桩事情，所以「真空不空，妙有非有」，这就是一。一，就开悟，就入进去；二就是障碍，就不会开悟。这对我们修行人是一个很大的启示，你要想入门，一门才能开悟，你要学二门，这一生就别指望开悟。佛法八万四千法门，只容许一门才能悟入。为什么要开那么多门？每一个人根性不相同，喜欢从哪个门入，门门都能入得进来。最怕的是搞两门、三门，你自己怀疑这一门不行，那一门大概还可以，那就糟糕。一悟一切悟，这是绝对正确的。譬如我们讲堂，四周围开十个门，无论从哪一个门进来，进来之后等于都进来了，一切都悟入，随便从哪一个门进来都一样。如果同时走两个门，你能进得来吗？<br/>古来的大德最初学得很多，到后来都放弃，只留一门，他悟入了。为什么最初学很多？最初不了解，在摸路、在探索，到最后一门深入，这才能成就。我自己过去也是如此，虽然有个好老师指导，自己还是摸索二十年，才真正明白这个道理，于是才把一切经论舍掉，晓得搞这些东西决定害了自己，所以在一切法门里面选一门。我选念佛法门，为什么选这个法门？当年李老师劝我修念佛法门，我也念过《印光大师文钞》，我对他很赞叹，也信，但是不是真信。不是真信就不肯真修，还要搞别的大经大论，到以后发现这是真的，一切法门里面念佛法门确实高明。怎么发现的？在《华严经》上发现的。如果不读《华严》，不讲《华严》，我对于净土不能产生真正的信心。华严会上，普贤菩萨与文殊菩萨也是念阿弥陀佛、求生西方极乐世界，善财童子修的也是念佛法门；《华严》到最后，普贤菩萨十大愿王导归极乐。我在华严会上把这个事情搞清楚了，对于净土才产生真正的信心，这才把所有经论舍掉，专门讲净土法门。<br/>一门深入，其他的经论可不可以看？可以看，可以听，要把力量会归在一门上。这一门是主修，与这一门有关系的可以参考，像善财童子五十三参，到处去听，到处去请教，但是都是充实这一门，真正是一门深入；帮助深入，这个可以。如果一听心就动摇，那不能听，没有资格听。譬如学净土，佛念得已经不错，听禅师讲禅，不错！也去参禅，那就坏了，那就没有资格去听。听了，把禅的道理帮助念佛，这就对；藉它的道理帮助念佛，帮助达到理一心不乱，提高自己境界，决定不参禅，这才对。无论什么法门，全都帮助念佛法门，这样才能入得深，才能够悟得透彻。今天想学这个，明天想学那个，一辈子都不能成就。<br/>从体上用功夫属于性宗，无论是性体或者是质体，都是属于空宗，一个是当体即空，一个是分析空。相上下手的则是有宗，别相就是在相上用功夫。<br/>「相」是讲「现象」。相是「暂起幻有」，是暂时现起，是假有不是真有，你要是把这东西当作真有，就看错了！晓得是假有，假有可以享受，不可以执着，享受就得乐，执着就有苦。受用是对的，决定不执着，才能做到受用自在。为什么不执着？因为它是假的。假的怎么可以受用？那我要问你，你们常常看戏，戏是真的还是假的？假的。假的，为什么你要看？看得很开心。这不是受用吗？戏里头这些人物事情，你并没有把它当真，所以你不烦恼，看了很快乐。人生就是在演戏，都是假戏！你要是不当真，怎么会不快乐？你要是当真，那一天到晚就生气了，你就不快乐。这个地球一切森罗万象都是假的，就好像戏台上表演一样，一下就过去了，你要是把它当真，那是迷惑颠倒。明白「相」是「暂起幻有」，人生就有乐趣。知道这一切是假相，千万不能当真，在这里面成就自己的定慧；如果你当真，成就你自己的惑业苦报。可见得观念差一点点，结果就不相同。观念一错就迷，就把暂起幻有的假相当作真的，他就迷惑、造业、受报。所以佛菩萨在九法界、在六道里面，游戏神通，自在！真正快乐！他这个自在快乐从哪里得来？就是晓得一切都是假的，他一样也不执着，一切受用现成，一切受用自在。<br/>底下是比喻。「氢氧化水」：水是假的，不是真的，是氢氧化合物。「土石积山」：山也是假的，不过是土石堆砌起来的而已，把土石拿掉就没有山，可见得山不是真的。这是比喻所有的现象都不是真实的，都是暂时而有的。<br/>《法华经》云：「是法住法位，世间相常住。」这两句话不好懂，这两句话说的是真相。这两句话就是说世间一切法不生不灭，入了这个境界，就是证得无生法忍。譬如这间房子把它盖好，这个房屋生了；拆掉，这个房屋灭了，它是有生有灭。为什么有生有灭？因为你着了相，着了这个假相，觉得这个假相有生有灭。而觉悟的人，他没有着这个假相，他只看到砖头瓦块，堆起来是砖头瓦块，拆掉之后还是砖头瓦块；不生不灭，他看到的是不生不灭。《法华经》里面讲，「是法住法位，世间相常住」，这是实相、真实相；其他一切组合是幻相、假相。既然是假的，哪有生灭可言？本来不生，什么时候有灭？这个意思更深一层了。虽然现的是假相，假相有作用，起相它就有作用，所以我们一定要把它的作用认识清楚。<br/>「用」是「力量」，「能变现状」；力就是能变化。「水与气冰，功各不同」，水在零度之下结成冰，温度加高变成水蒸气，它是一个东西三种形态，三种相不一样，气体、液体、固体；相不一样，作用就不相同。蒸气可以推动火车、推动轮船，可以把它当作动力来利用；水，渴了可以解渴，水蒸气不能解渴；冰块它可以有障碍，水蒸气没有障碍。「相」不相同，作用也就有变化，各有各的作用。总起来讲，就能够看出来，佛法里面讲「万法无常」，一切法确实是无常的，无常里面你要想求得一个天长地久，那是痴人说梦，没有那回事情。<br/>这是教我们，对于任何一法都要从体相用三方面观察。三方面观察到了，才真正觉悟—万法皆空、万法无常、缘生无性，佛法里面常常讲的这三句，你就真正明白，真正开悟了。悟入就是智慧，智慧能断烦恼、能破无明，就能帮助你离苦得乐。</p><p class=\"text-indent\">丙、生起三由<br/>体相用里面，特别从相上下手，研究差别的现象怎么来的？「生起三由」：现象的发生有三个条件，这三个条件就是「因、缘、果」。这一段就是体相用三分里面「相」的注解，就是对于相的深入观察；它有因、有缘、有结果，结果就是这个相（幻相）形成。<br/>佛法里面平常讲因果，把当中「缘」省略了。因如果没有缘，不会结果，一定要有缘才会结果。佛法的修证，或者再讲浅一点，改造命运，可能吗？可能。有什么理论依据？就是依据缘。因已经造了，没有法子，不能改，可是因要是没有缘不能结果，如果你能把缘控制住，就能控制结果。我过去造恶因，晓得恶因一定会感恶果，但是没有缘，它不会结果。我把缘控制，不让它有缘，虽有恶因，它不会结果。我造善因，想得善果，我把善因再加上善缘，善的果报一定现前。佛法讲改造命运，理论依据就在缘上。所以佛法不讲因生法，讲缘生法，特别强调缘。<br/>「因」，是「动机」、是「造作」，这两种都是亲因缘。在佛学术语里面讲，这个因是种子（唯识论上称动机为种子）、是现行。种子就是习气，我们每一个人阿赖耶识里面，都含藏有十法界的习气，佛、菩萨、声闻、缘觉、天、人、修罗、饿鬼、地狱、畜生都有。十法界的种子统统具足，种子具足就是因具足，十法界无论哪一界的果报都有可能，你要到哪一道就看缘。人能不能成佛？当然能成佛。为什么能成佛？因为你有佛的种子，你有成佛的因。你现在为什么不能成佛？你没有成佛的缘，你缺少助缘，所以你不能成就，道理在此地。<br/>「造作」就是现行，就是我们现前一切造作，这个造作又在阿赖耶识里落下种子，所以现行也是亲因缘。因，有过去跟现在；动机是讲过去的因，造作是现在的因。现行，一现九隐。我们不是十法界的种子都有吗？现在我们得的是人身，在十法界里面我们是人法界这一个种子现行，其他九法界的种子在，并没有消失，但是它不起作用。一个法界现，九个法界隐；九个法界不现，只现这一个法界。这种情形就叫做业报身，业报。如果能把业报转变成智慧，那就得大自在。怎么自在法？就可以同时在十法界都现身，像那些佛与大菩萨无时无处不现身，我们讲分身，得自在了。可惜我们现在没能做到，真正能做到，那就像我们念《华严经》、念《梵网经》：「千百亿化身」，这多自在！就不会感觉到很苦，分身无术。「因」是亲因缘，是最主要的一个因素。<br/>「缘」，就是讲机会。缘里面包括有三种。第一种是「所缘缘」：就是所缘之缘，所缘就是我们所希望的。我们今天念佛，希望成佛，希望成无上正等正觉，无上正等正觉就是我们所缘的。我们现在为什么不能成就无上正等正觉？你现在所缘的不只这一样，好多好多，还有名闻利养、五欲六尘都是你所缘的。比较起来，恐怕名闻利养所缘的心还特别强，求无上菩提的心只用个一分、两分而已，不甚强烈，心里是希望，现在不得到还不要紧，还不想急着得到，所以菩提这个所缘缘的缘力量薄弱。但是你对于烦恼的所缘缘很浓厚，缘贪瞋痴慢，这个力量太强了。无上菩提跟贪瞋痴慢，你阿赖耶识的种子都具足，但是你现在想要无上菩提的心念不强，在时间上来讲很短暂。现在在讲堂里面心里想，我要求无上菩提，下了课马上就求贪瞋痴慢去了，这不行。一天二十四小时，想到无上菩提只有几分钟，想到贪瞋痴慢几十个钟点，那怎么行？当然贪瞋痴慢作主，因为它的时间太长，力量太强大了。<br/>所缘缘非常的重要，就是你有了期望。有期望，还得要一个重要的因素，就是「无间缘」；无间缘是你这个期望不能间断。我们对于无上菩提常常间断，所以不能成就；不是不想成佛，成佛这个念头常常会被打断。就拿念佛来说，不是不想念佛，佛号常常间断，不能够二六时中相续不断，没有这个条件，纵然想念佛也是空的。可是你的贪瞋痴慢是从来不间断，所以你想想，后来有什么果报？这是成败关键的所在。<br/>亲因缘（因）、所缘缘、无间缘都是自己本身具备的，外面的条件就是「增上缘」。诸佛菩萨帮助我们，是属于增上缘。亲因缘是每个人具足的。所缘缘跟无间缘如果自己不具足，佛菩萨帮不上忙；你自己真正具足这两个条件，佛菩萨就帮上忙。我们现在，佛法里头这两种缘有，但是不足；烦恼习气，这两种缘很具足。外面境界，你六根一接触就起贪心，就起瞋恚心，因为因缘具足。外面境界帮助你贪、帮助你愚痴、帮助你瞋恚、帮助你造业，这是增上缘，都帮上忙。佛菩萨帮不上忙，因为你所缘缘跟无间缘力量不足，太薄弱。<br/>因加上缘，后面就有「果报」，果报是「结成、起相」。经论上告诉我们，一切法可以归纳为色、心两大类。心法（包括一切心理现象），一定要具足四种缘才会起相，那就是亲因缘（因）、所缘缘、无间缘、增上缘。如果是色法，就是讲物质，植物与矿物，不需要所缘缘跟无间缘，它只要两种：一个是亲因缘，一个是增上缘，它就结果。<br/>下面是以植物来作比喻。植物只有两种缘，不具足四缘。「如种下地」：种是种子，种瓜得瓜，种豆得豆。以瓜来说，瓜子是它的亲因缘，这是长成瓜最重要的一个条件。瓜子能不能结成瓜？它必须得到缘，如果得不到缘，不会结成瓜。我们把瓜子装在玻璃瓶里，装上一百年它也不会长成瓜，那就是缘不具足，虽有种子而没有缘。它的增上缘「如日水肥」，要土壤、肥料、水分、阳光，这些条件具足，它一定能长得很好，才能成熟，才能结果。「常暂不同」：种子成长时间长短不一样。瓜，三、四个月就长成，就结果，桃李树要三年才能结果，这就是时间有长短不一样。增上缘有「强弱之判」，土壤有种种不相同，质地不一样，阳光充不充足，水分够不够，对于它的生长有密切关系，所以结果「迟早有时」。同一棵树，每一个枝条它所得的增上缘都不一样，有的偏在阳光那边，它的花开得好，果实先熟；背着阳光这边，它结的果就比较小，它熟得比较晚。这全是缘的充足与否，所以果报不相同。<br/>如果是在有情众生（动物），除增上缘之外，所缘缘跟无间缘是决定的因素。这就是在别相上给我们透出一点修学的消息，让我们在这下功夫。人生如是，不出因果定律，善因一定得善果，恶因必定得恶报；因是自己造的，果报当然要自己受。我们一切的际遇，自作自受，不能够怨天尤人；怨天尤人自己又造重罪了，后来的苦报，那是不堪想象。转业的方法，就是控制缘；缘要是控制住，境界就转变，果报就转了。<br/>末后两句：「有因同果异，有果同因异。」这也是普遍所见到的现象，特别是在有情分上，无情不会，无情是种瓜一定得瓜，瓜不会长成豆，稻的种子也不会结成瓜，可是在有情分上就不一样。譬如你们同学在一个班上念书，同一个学系，现在你们因相同；毕业之后到社会上，各人有各人的事业，发展到最后不一定能相同，这是因同果异。为什么会果异？缘不相同。每一个人的际遇不一样，将来在社会上，种种因缘不相同。也有果同的，譬如政府里面的部长，都是部长阶级，可说是果相同，但他因不相同，这是什么原因？这些部长并不是都念政治，并不是都念同一个学校，这里头也是缘，可见得缘占决定的因素。所以佛法说缘生论，要我们特别重视缘，缘能够改变因果。<br/>对于一切现象一定要懂得这样来观察，就不会迷惑。</p><p class=\"text-indent\">丁、法有两端<br/>「法有两端」：一切法不外乎「事」、「理」，事理是一不是二。「事」是「迹象」、是「行动」，迹象就是现象，行动就是力用，就是三分里面的相与用。相与用都是属于事，理是讲体，还是三分里面的理体、事相、事用。事属于科学，理属于哲学，理事不二，圆融无碍。经典里面「有时说理」，有些经论偏重在理论上，像《金刚经》、《百法明门论》、《般若心经》，都是偏重在理上。读这些经典，明白这个道理，要把这个理会归在事相上就有用处，从理要悟到事，这就圆融。「事成于理」，一切事都有理论的依据。<br/>「无理事不能通，不可滞事昧理」，这是很重要的求学态度。有一些念佛的人心里想，念佛只要老实念佛就可以，何必还要研究这些教理？那就错了，就滞事昧理。他不晓得，如果不懂得念佛的理论，这一句佛号念不好，念久了没有感应，他觉得不灵，就懈怠、退转，一定要懂得它的道理。所以佛说那一些偏重在理论上的经，有它的用意。<br/>「理」是讲「义趣」，义就是道理，趣是讲它的趣向、归趣；这是「解说」，讲堂里面的教学。「有时说事」，像《弥陀经》说的是事，《地藏菩萨本愿经》也说的是事。在知识分子来说，凡是说理的经容易接受，认为满有道理，说事的经不容易接受，认为都是迷信。「理依于事」，理事是分不开的。<br/>一切经可以分为理事这两大类，讲理的经好讲，疑问少，讲得有兴趣；讲事的经难讲，讲事的经一定要说出一番道理，这个事人家才会相信，这个不容易。说理的经，一定要把理说在日常生活当中，如何能够显现出来，这个理才不致于落空；理与事要相应。有理有事的经也不少，像《华严经》，说理也说事，理事圆融，理事无碍，事事无碍；这样的经是非常完整的经典，既不偏于理，也不偏于事。莲池大师注解《弥陀经》，就是「有时说理」，这部经是说事，他就说理，他要不说理，事没人相信，理说得很透彻，事人家就相信。<br/>「无事理何所立，不可执理废事。」执理废事是病，这个病比滞事昧理这个病还要严重。因为执理废事容易落在狂慧，堕落在恶取空并不了解佛法的真实义，它的方向走偏差，错误了，反而不如滞事昧理。滞事昧理，他执着一端，执着念佛，纵然不能往生，来生还得福报；如果执理昧事，来生必定堕落，连福报都得不到。但是佛法的修学一定要圆融，要懂得理事无碍，事事也是无碍，原本就是无碍，如果觉得有障碍，那是本身出了毛病，一定要把毛病找出来，把毛病改掉，你才有门路可入，才能真正达到理事无碍、事事无碍，那就得大自在。这个无碍的法界，在净土里面是实报庄严土、常寂光土；如果你还没有往生，现在在这个世间得大自在，游戏神通，与诸佛大菩萨住世无二无别，这一种受用（享受）真正不可思议！<br/>这个表介绍完，我们做一个总结。表里面提出八个项目：体、相、用、因、缘、果、事、理，这就说明无论观察哪一法，你要观察到八个方面，八面玲珑才能得到真相，缺少一面都是迷惑，不能得其真相。可见得学佛并不盲目，学佛人对于一切法的观察确实相当的细密。八面观察也不过是看一个外表而已，略知，还谈不上深度。如果是深一层观察，这八面，每一面里头都有八面。单单说体，体里面有体之体、体之相、体之用、体之因、体之缘、体之果、体之事、体之理，每一条里头都有八条，六十四面。六十四面观察，才算足有一点深度，还不太深。再深一层观察，这六十四面，每一面里头又有八面，五百一十二面，算不算最深？不算，其深无底。佛观察这个世间真是不可思议，我们怎能比得上？我们连一个表层都没有顾及到，只看到一面、两面，就以为自己很了不起，所以佛说我们邪知邪见。连表层的八面都没看清楚，怎么能说自己有智慧？从这里你就能体会到，佛菩萨智慧之大，不可思议，我们不能不佩服！学佛特别贵重全体圆融，面面观察到就是全体圆融，这是真正开智慧。如果是圆解初开，智慧现前，这个时候的境界，如同佛在经论里面常常告诉我们，「不起于见，不着于相」，实际上就是《金刚经》上所讲「不取于相，如如不动」；「不起于见」就是如如不动。不生知解，不着一切相，心行处灭，言语道断，这个时候的境界就是实相现前，也就是一真法界现前，也就是实报庄严土现前，或者说清净法身现前。佛跟我们讲的，真是清清楚楚、明明白白。<br/>世尊说法的本意，就是在破我们现前的执着—人我执、法我执。人我执演变成烦恼障，法我执演变成所知障，这两种障碍使我们的清净心不能现前，使我们的法身、般若都不能现前，这是病根的根源。没有这两种执着，真性就现前。所以情执如果不断，再要执着言说、名字相，又生了疑惑，又起了错误的解释，就是又起了邪见，那是病上加病。这是我们学佛一定要注意到的，不要学成病上加病，一定学了之后，那个病要减轻。要晓得听佛法是破执着，是把我们妄想分别从心地里清除，可不能增加！</p></div>"
    },
    {
        "title": "第三讲 消除几种误会",
        "html": "<div class=\"B1_text\"><p class=\"text-indent\">凡是误会都是学佛的障碍，这里面略举的几种，范围非常广大，而且很普遍。误会不消除，不但信心不能建立，对于修学必定也是茫然而无所适从，所以必须将它消除。李老师当年编这个教材的时候，这几种误会是最普遍的，二十年后的今天，这些误会依然存在。</p><p class=\"text-indent\">甲、误会<br/>首先要解释，什么是误会？第一种是「我假理想」，就是个人的假想、想象，以为是某一种情况，这是不可靠的。佛在经典里告诉我们，没有证到阿罗汉之前，决定不能相信自己的理想，为什么？都是妄想。理想应该是有道理的、如理的；上面有一个「假」字，假理想，不是真理想。真的理想，那就好了，是正知正见；就怕把妄想当作理想，这是误会。第二种是「听信妄谈」，这是误会的来源，道听途说，现在也非常普遍。真正的佛法是什么样子？不知道。凭自己的想象是想不出来的。<br/>下面用比喻来说明。「未见而言」，这个不可靠，这就是我假理想。「见蛇为龙」，这是误会，发生错觉。「未究其理」，对这个理没有深入究竟，只走粗粗的浅尝，就以为是如是。这三类「自非其真」。佛法许可你研究，希望你研究，佛法不怕怀疑、不怕问，要破疑开悟。可是问，要问明白人，如果问的那个人也是未见而言，或者未究其理，那就糟糕，你要是听信他的话，误会就更深。现在佛教出的书、杂志，可以说太多太多，当然有些可以看，有些看了会增长你的误会，这都是要注意的。正是《楞严经》上所说：「末法时期，邪师说法如恒河沙。」一般人无法辨别，以致产生许多误会。</p><p class=\"text-indent\">丙、迷信属他<br/>佛法不迷信，佛法是正信。「迷信属他」，他迷佛不迷，这是说佛以外都是迷信。什么是迷信？第一、「无谓有」：本来没有的事情，他以为有，这是迷信。如「渴鹿阳焰」，阳焰是地上的一种气，远看好象是水一样，大陆中原地带常见的现象；鹿是畜生，牠没有知识，口渴了想喝水，看到阳焰以为是水，阳焰就在牠面前不多远，可是走到前面，还在前面，永远也找不到水。根本没有水，牠误会以为有水。这是迷信，这是举一个例子来说。第二、「有谓无」：确实是有，但是他认为没有。「近视斥星」，这是比喻。近视的人没见过天上的星星，天上有星星，他因为近视看不到。看到太阳，他承认有；月亮在满月的时候，那个光也不小，大概是有；星星没有，他没见到。确实有的，他不相信，他说没有，这也是一种迷信。第三、「偏陋执」：偏是偏见，陋执是执着；偏见的固执。往往见事情只见一边，见事、见理都不圆满，他坚固执着一端，这也是迷信。举个比喻，「轿付前价」。从前有钱的人出门坐轿子，轿子是两个人抬的，抬到目的地，他付钱给前面的人，后头的人来问他要钱，他不给，他说：「我只看到他抬我，没有看到你。」这就是固执，他没有看到后面抬轿的人，他就不给他钱。这是举比喻来说，这些都是迷信。<br/>从前编这个表的时候，是破除迷信，消除对于佛法这种误会，是劝我们学佛。现在我在此地讲，意思跟以前不一样。现在你们入门了，进到佛门来，还有迷信；这个迷信若不破除，对于你修学是一大障碍，这个迷信的破除，比已往那个迷信破除更难。真如本性真有，一切万法当体皆空，你不能认识清楚，迷信！你把这一切事相都认为是有，在这里面起心动念、得失取舍，都是迷信。还有一种执着，修学先入为主造成了成见，这就是偏陋执。法门无量无边，我们以什么样的慧眼去选择，使我们这一生短短几十年真正有成就？那是要正信，迷信是做不到的。迷信的人纵然学佛，一生往往空过。李老师说：台中莲社莲友二十万人，真正能往生恐怕三、四个而已，不容易！原因在哪里？迷信，不是正信。<br/>「正信属佛」。佛经是世尊从真如本性流露出来的言语文字，不是从心意识里流出来的，所以完全是现量的境界。底下讲：「现量」、「比量」、「圣言量」，这是讲佛说法的善巧。其实佛的境界，完全是现量，没有比量；菩萨以下的说法就要用三量。而菩萨当中，见了性的菩萨，大多数也是现量；没有见性的菩萨，尤其是像我们现在在凡夫位，我们看佛法、讨论佛法，是要根据这三个条件。「现量」是眼前的事实道理，大家都承认的，为一般人公认的。「比量」是正确的推理，也能够为大家所公认的；例如见烟知火，推理得之。「圣言量」：这个理太高深了，不是现前境界，也没有办法用比量来推测，那只有引用佛菩萨的教诫；佛菩萨是圣人，不会妄语、不会欺骗我们，所以我们相信佛菩萨的圣言。<br/>可是这三量，一定要有理智加以辨别。无论在中国、在外国，我常常听说，某个人是阿弥陀佛化身来的，某个人是释迦牟尼佛化身来的，又是这个菩萨、那个菩萨，好多好多！你一听，赶快去亲近他。给诸位说，这决定是胡造谣言，骗那些愚痴、没有知识、迷信的人。你要是跟他去，就是愚痴、无知、迷信的人。佛菩萨会不会到我们这个世间来？会。经典上说得很清楚，佛菩萨到这个世间来，绝对不会暴露身分，如果身分暴露，他马上就走。中国古代有很多例子，身分一露，马上就走，那是真的；他要是不走，决定是假的不是真的。<br/>以前章嘉大师告诉我，满清亡国就是亡在扶鸾，因为慈禧太后与王公大臣都相信这一套，国家大策谁也不敢拿主意，怎么办？扶鸾，完全听命于鬼神，所以满清亡国。《左传》云：「国将亡，听于神；国将兴，听于民。」听命于鬼神、妖魔鬼怪，国家将亡；如呆能听老百姓的意见，这个国家一定兴旺。<br/>学佛的人怎么可以听信鬼神？佛是教我们信自己的自性。佛教导我们修自己的清净心，三皈依—觉而不迷、正而不邪、净而不染，修这个才能成就。佛来了，我给他磕头作揖，求他赐予我什么，都是假的。他给你摩个顶，你就开智慧？我不相信！假如他摩个顶就开智慧，佛大慈大悲，一天到晚伸出千手摩一下大家的头顶，不都开智慧了，你还要修个什么？不要修了！迷信，千万不要被人骗了。佛法是理性的，不是感情的；是理智的，不是迷惑颠倒的。经典里面佛摩顶表示一种安慰、亲切的意思，大人对小孩摩顶表示爱护，千万不要搞错。<br/>佛门里确实存在严重的迷信，尤其是密宗这些神咒。神咒在从前是非常灵验，呼风唤雨，役使鬼神，《高僧传》里记载这些神僧确实有这个能力。我学佛这么多年，我不念咒，我怀疑念咒不灵。咒是佛菩萨或鬼神的言语，必须要口传；把它翻成中国字，照这个字去念，他听不懂，我不相信他能听懂。你不懂，他也不懂，白念了。西藏喇嘛来传授，靠得住吗？我不相信，因为释迦牟尼佛距离我们现在三千年，三千年来一个传一个，音早就变了，而且每一个人还带着地方的方言，所以传到三千年后的今天，我不相信这个咒子会灵验。这些东西很迷人的，因为人都好奇，都喜欢自己有点神通，别人所没有的，去学。李老师过去在大陆上，也像你们一样很好奇，他学东西认真，修学的态度确实是令人敬佩。他告诉我，他学了二百多个咒，而且都是跟西藏、西康这些活佛大喇嘛学的，学了八年，因为不灵，放弃了。有一次他在讲堂跟我们讲，他在密法里学过隐身咒，这咒一念别人就看不见。他把这个咒子一念，看见没有？我们都看见他了。不行！这太难了。以后他遇到印光法师，跟印光法师学念佛法门；他今天得成就，是从念佛法门成就的。他学过八年的密不灵，参过八年的禅没有得定，所以他说：走了好多冤枉路！<br/>佛陀教我们四依法：「依法不依人」，法是经典。「依义不依语」，不执着言说、文字，要体会经典里所讲的道理。「依了义不依不了义」，与真如本性相应的是了义；讲世间祸福吉凶的是不了义，那是小道，没有办法超越生死轮回，只能得一点人天福报。「依智不依识」，智是智慧、理智，识是感情，要理智不要依感情，这非常重要。</p><p class=\"text-indent\">丁、消极两属<br/>有人说学佛是消极，李老师告诉我们：消极彼此都有，他说我们消极，他自己又何尝积极？<br/>「善消极属于他」，那些人说学佛的人消极，他自己对于善事不肯做，不肯做就是消极。「进德修业，济困扶危，为众牺牲」，这都是好事，他不肯做，可见得他消极。「恶消极属于佛」，学佛的人也消极，哪些地方消极？「纵欲享受，营私害公，争名夺利」，学佛人都不要，这消极。他看到我们这一些方面是消极，好像在社会上没有进取心，不跟人争名夺利。「恶积极属于他」：「身杀盗淫」，「口四种恶」就是妄语、两舌、恶口、绮语，「意贪瞋痴」，这是十恶业。世问人积极在造，这是恶的积极。<br/>「善积极属于佛」—「离欲出家，庄严地狱，不舍一人，带果行因」，这是积极到极处。「离欲出家」，我们看到这一条，学佛要不要出家？学佛一定要出家，不出家决定不行；家是累赘，是烦恼的根源。可是这个家，不是家庭之家，那个家出了没用处；你出了自己的家，到寺庙变成大家，小家换成大家，更糟糕了！出什么家？出五欲之家—财、色、名、食、睡，离开五欲就是出家；出三界之家，出生死之家。<br/>出家有四种。一、「身在家心出家」：大乘菩萨居士是心出身不出。你现在有家庭，身在家庭，心超越了，这是真出家。二、「身出心不出」：如果身出家，住在寺庙里，心还是贪图世间名闻利养，那就糟糕了。三、「身心俱出」：就是我们现在讲出家人，这是非常难得。可是这是相当不容易的事情，决不是说剃了头、受了戒，就是出家；家是出了没错，出了家以后多半都入了魔王的圈套。出了家之后很容易堕地狱，为什么？出家之后，把佛教的形象败坏，这个罪多大，不得了！出家众是代表佛陀续佛慧命、弘法利生，是代佛住持佛法，教化众生，如果没有把这个责任肩负起，没有把这个事情做好，护法神不会饶恕你。出家好不好？当然好。真正如理如法的修行，把这个责任真正肩负起来，尽心尽力去做，福报非常之大，诸佛护念，龙天拥护。如果没做好，就非常的麻烦，罪过无量无边。因此，出家这个事情不能劝，真正明理之后，他自己发心。四、「身心俱不出家」。<br/>从前出家不像现在这么容易，以前是经过帝王的考试。出家除了要考进士课程之外，还要考三藏经典，所以出家人为社会大众所尊敬。考试及格，皇帝发给文凭准许你出家，这文凭就是「度牒」。皇帝发度牒给你，就是承认你有资格做他的老师、有资格做全国老百姓的老师，所以度牒决不是轻易发的。从前出家人有这么高的素质，才能够将如来正法流传到今天。所以一定要晓得出家的意义，真正发心出家弘法利生，是无量无边的功德。<br/>「庄严地狱」：地狱是没人愿意去的，菩萨愿意去。我不入地狱，谁入地狱？入地狱救度那些苦难的众生。到地狱里面说法度众生，这是庄严地狱。「不舍一人」：一个人发心，度你一个，多人发心，度多人，一个人都不舍弃。「带果行因」：这就是倒驾慈航。他圆满菩提成了佛，退居到菩萨地位上，还是念念不舍众生。因就是菩萨道，从如来果位上，再退回菩萨地位来教化众生。像我们所熟悉的观世音菩萨，他早就成佛，在西方极乐世界他是等觉菩萨的地位，在华严会上他是第七回向的地位，在楞严会上他是圆教初住的地位，这都是带果行因。肯贬低自己的地位来帮助众生，这是积极。</p><p class=\"text-indent\">戊、他尚神权<br/>神权在佛法里决定没有。佛法相信有神，譬如此地讲的天帝、神鬼，佛法相信祂确实有。可是祂也是凡夫，祂的福报比人大，也有一点小神通，不足以信畏。所以佛法对鬼神，跟孔子一样，敬而远之。我们对祂尊敬，可不能学祂，学祂就错误。一般宗教认为「天帝」是「造物主」。前天，有两位美国人提到上帝是造物主，问我看法如何？我说我同意，上帝这个造物主造天堂就像华盛顿造美国，像孙中山先生造中华民国，这个意思、这个看法就对了。如果你说这一切万物都是祂一个一个做出来的，那祂太无聊了，做出这个干什么？做出之后又不听话，又要背叛祂，那祂就太颠倒了。所以造物主这个概念要搞清楚。真正造物，佛法讲是「心」，一切法唯心所现、唯识所变。就好像我们作梦，梦中境界是我们心造的。宇宙森罗万象、十法界依正庄严，是我们真如本性变现之物。天主教这些年来开放，现在他们讲上帝意思不一样了，他说上帝就是佛教讲的真如本性。这就是尽量吸收佛教的教义，改变他们的思想，充实他们的教义；因为科学越发达，它的教义有很多的困难。<br/>「神鬼司赏罚」：像我们讲十殿阎王，他是不是真管？也得有因缘。譬如刑警队管惩罚，你不犯罪，他不敢加给你刑罚，要犯罪他才能判你罪。由此可知，善恶还是自己做的，他在当中得其便，他有这个权势；你做善，他赏你；你造恶，他惩罚你；你善恶都不做，他对你一点办法都没有。「神」是鬼道里面的官吏而已，城隍是鬼道里的县市长，土地公就是鬼道里的乡镇长、邻里长，就是这一类的，管的是鬼，是鬼里面有福德、有地位的，他退休后跟普通的鬼没有两样。所以对鬼神决定不能迷信。「伪教」：像过去白莲教之类，不是正统的宗教，假借神仙这些名义驾乩扶鸾。这都是崇尚神权，一切听命于神。受这些鬼神摆布，这是愚痴。<br/>他尚神权，佛法与这个恰恰相反，「佛尚自权」。底下是简单说明，「万法心造，自转因果，唯我独尊」。释迦牟尼佛出生时所示现的相，「天上天下，唯我独尊」。有些外教的人看到这一段经文很不舒服，他说佛教未免太自尊自大，天上天下唯我独尊，那其余的人都瞧不起了？这是莫大的误会。这个「我」不是指我这个人身，这个我是指自性，指真如本性。这个我是讲真我不是假我，是指大我不是指小我，小我有什么好尊贵的？这是一定要搞清楚。唯有真性独尊，因为真性能现万法。在唯识里面排在第一位，唯我独尊的是第八识，因为第八识以下都是第八识变的，第八识是能变，其余是所变，能变是尊；可是第八识比起真如本性，那又要差一截。真性才是真我，才是真正的独尊。</p><p class=\"text-indent\">己、忽略现实属他<br/>「忽略现实属他」：佛法是最讲现实，绝对不会忽略现实。底下有几个比喻。现实，一个是「所求」，一个是「所得」。所求的，举了个比喻，「刀头舐蜜」；蜂蜜是甜的，但是这个蜜是涂在刀刃上，你要是舌头去舐，甜味是尝到，可是舌头也去了一半。这是忽略现实。所得的，是「昧机畏果」，昧着良心得到以上所求的，可是心不安，怕果报。底下一个假设的比喻，「火烘牡丹」。牡丹花开得很美，称为富贵花，火烘牡丹，确实有这个事情。唐朝武则天时代，有一些人想讨好皇帝，把牡丹放到温室培养，牡丹开花大概是在三月间，如果正月初一就能看到牡丹花这是吉事；他们就用人工的方法培养，使它在正月开花。但是这个花只开一次，如果让它自然生长，年年都开花；人工的方法逼它提前开花，它只开一次，以后不会再开花。这是忽略现实。<br/>「始终真乐属佛」：「四正勤法」，是最讲求现实的；正是正当，勤是精进。已经有的恶，从今天起把它断掉；还没有起的恶念，决定不起；已经行的善，要让这个善增长；没有行的善，要赶快发心去修；这是四正勤。「知果畏因」：对于因缘果报的道理，认识得很清楚、很透彻，所以他造因非常谨慎。「六根清净」，一尘不染，身心充满种种功德、法喜，这是真乐，这才是现实。怎么可以说学佛的人忽略现实呢？</p><p class=\"text-indent\">庚、不合科学属他<br/>「不合科学属他」，这里提出几个问题。「人生何为」：我们到这个世间来干什么的？答不上来，这是迷惑。「宇宙何关」：宇宙、社会、一切人事，与我们有什么关系？有人说没有关系，说有关也是说得不恳切，这就是「颠倒」，不得事实。「佛学为何」：佛学是什么？他「未见」，不明了佛学是什么。每一个问题有正确的答案，这是科学。「统系属佛」：统系就是科学的精神，佛法是有系统的学术。底下也正是解答这三个问题。<br/>「人生酬业」：这个答案非常正确。你来到这个世间干什么？你过去世造业，这个时候来酬偿业报。佛经里说，子女跟父母是四种因缘—报恩、报怨、讨债、还债，没有这四种因缘不会来。人与人之间也是这四桩事情，看到那个人不顺眼，那是报怨；看到那个人很喜欢，这是报恩。这里头也有讨债、还债的，都有这些关系，比较少；父母兄弟一家人，债务就比较多一点，麻烦一点。所以，人生就是为了这事情来的。这是认识人生。<br/>「真妄觉迷」：这是讲认识宇宙。真的是本性，妄的是现象。你要是觉悟，就是真的不变随缘，这就是佛，他不变，能一切随缘，自在！这是觉悟到真的，我们讲无上正等正觉。菩萨虽然觉，妄没断；菩萨称为「觉有情」，觉悟的有情众生，他情没断。菩萨随缘不变，菩萨在随缘当中学不变，随缘当中学如如不动、不取于相。所以佛、菩萨是觉，凡夫跟罗汉是迷。阿罗汉对于妄相不迷，他真性迷，所以阿罗汉没见性；他的态度是不变不随缘，阿罗汉住在第九定中，大定当中，他不随缘、不度众生。凡夫真妄皆迷，随缘随着变。我用不变随缘这四句来解释真妄觉迷，诸位要细细体会。<br/>佛学为何？「万法归一」，这是真理所归。这个一不是数字。迷人看到这个一，还要问一下「一归何处」？觉悟的人看到这个一，什么都没有，立即销融，就会归自性；一就是自性，就是「不可思、不可议」，不可用心思惟想象。如果你还有一个「一」的概念，没有见性，因为那个一就是障碍，这个念头就是无明、就是障碍。<br/>许许多多的误会必须排除，尤其在现前这个世间，奇奇怪怪的说法太多，我们要小心要谨慎。学佛最好是亲近一个善知识，不要找太多，亲近多了增长知见、增加疑惑，不能够坚定信心。古人的好处，他只亲近一个老师，他只走动一个道场，他什么都一，一就入门。</p></div>"
    },
    {
        "title": "第四讲 人生当前之所受（观受是苦）",
        "html": "<div class=\"B1_text\"><p class=\"text-indent\">第四讲与第五讲是第一讲里的人生观，第六讲与第七讲是第一讲里的宇宙观。这一讲的题目「人生当前之所受」，这是我们应该要觉悟的。我们所受的，「观受是苦」，一观照，我们所受没有别的，苦而已。只有苦没有乐，这是真话。但是诸位要记住，这个苦受是暂时的，不是永恒的，迷了才有苦受，悟了就没有。底下举五大类—苦、乐、忧、喜、舍，迷的人才有，悟的人没有，悟的人有真乐。苦乐忧喜舍都离开才是真乐，才是真自在。<br/>甲、领受种类<br/>「领受种类」：领是领纳，受是感受；人生当前之所受，佛法里把它分类，分成身心两方面来说。身有两大类，有「苦」、有「乐」；心有「忧」、有「喜」；如果苦乐忧喜都没有，就叫做「舍」。舍受很好，但是它太短暂，不能够长久维持；如果长久维持就叫做定，短暂的叫做舍受。<br/>底下有个说明，你看线条划的。「实」：身的苦受、心的忧受，这是实在的。只是说实在的，并不是真的；这个实不当作真实讲，就是它是实有其事，它是实有的。「虚」：你感觉到这个身有乐受、心有欢喜，或者有舍受，这都不是真的，这是假的，是你的错觉。为什么是假的？下面是说明。「所苦暂停暂去」：苦暂时的离开，你就觉得很快乐。譬如，飢饿之苦是实在的，过几个钟点你吃一餐很乐，吃一餐等于吃药，这病苦要吃药，吃了很舒服；再过几个钟点又要吃一餐，一天不吃就饿得很苦，两天、三天不吃就饿得更苦。你就晓得人一身的毛病！这个虚实一定要认识清楚。我们挨打很苦，鞭子打上一鞭很痛，打上十鞭、二十鞭痛上加痛，这是苦，苦不会变成乐，这个苦就是实在的。「所乐不止仍苦」：乐会变成苦，比如说吃东西，吃得很舒服、很好吃，吃得很快乐，一餐给你吃二十碗、三十碗，你就叫苦连天。你们年轻人跳舞很快乐，连续跳七天七夜，你就叫苦连天。乐会变成苦，可见得乐是假的，不是真的；苦不会变成乐，苦是实在的。我们所受的，的的确确是苦。天冷了，你有衣服穿，觉得很自在；没有衣服穿，看你苦不苦？我们现前享受的，只有苦没有乐。我们受苦是真的，享乐是假的，这是一定要认识清楚的。<br/>下面几段都是佛在经典里所说。</p><p class=\"text-indent\">乙、苦果略举<br/>「苦果略举」，这是略说。苦果，经论里一般分为三类，称为三苦。第一种是「苦苦」，这两个字，上面是动词，下面是名词。第二种是「坏苦」，第三种是「行苦」。一切六道众生都不能避免三苦。「苦苦」又叫做八苦，在人间上自帝王下至乞丐，任何人都不能避免八苦。<br/>第一、「生苦」：出生的时候苦。这个苦，佛在经上说得很清楚，形容入胎、坐胎、出生简直跟地狱一样，胎狱之苦。我们人很健忘，早已把这个苦忘掉。可是如果细心的话，也能够体会到一些。人在欢喜快乐的时候会笑，痛苦的时候会哭，你看哪一个小孩一出生满面笑容？没有看到过；小孩子都哭，可见得痛苦。从这个地方去体会，生苦不假，是真的。第二、「老苦」：你们诸位想想能避免吗？老年人的痛苦凄惨，处处都看得到。所以年轻人要多帮助老年人，多照顾安慰老人，到你年老的时候就有年轻人来照顾你、伺候你。为什么？你过去种的因，它后面有果报。现在要是看到老年人就讨厌，你要晓得过不久你就老了，一般人也会讨厌你。因缘果报丝毫不爽。第三、「病苦」：一般人都有害病的经验，生病是很不好受的。第四、「死苦」：佛在经典里有一个形容，人死的时候好比生龟脱壳。活的乌龟把它的壳剥下来，想象而知，死苦比病苦不知道要痛苦多少倍。生老病死这四种苦，是任何一个人不能够避免。只有极少数的修行人，有相当的功夫，能避免老病死之苦；虽老，老而不衰，很自在！<br/>第五、「爱别离苦」：心爱的人、心爱的物常别离，不能够聚在一起，常常让你牵肠挂肚，很痛苦。第六、「怨憎会苦」：冤家对头希望一辈子不要见面，但是却天天碰头，天天让你生气。第七、「求不得苦」：你多愿多求不能够称心如意。这三种苦每一个人都有，不分贫富贵贱，每一个人都有他的所求，都有他的所愿，有求有愿就是苦的根源。佛法讲三解脱门，解脱就是自在，三种自在之门—空、无相、无愿，你就没有苦。万法皆空！一切相都不取不着，没有愿，什么愿望都没有，自在！有愿就有苦。佛法里教我们发四弘誓愿，这是大愿、称性之愿，心里可不能作意，可不能攀缘，攀缘就苦；佛法教我们随缘而不攀缘。<br/>第八、「五阴炽盛」：前面七种都是果报，五阴炽盛是因。为什么会有前面这七种呢？五阴炽盛，五阴是色受想行识。「色」是物质，身体是物质；我们这个身体是四大之身，有肉身所以你有苦受。「受」是感受。「想」是想象、思虑。「行」是造作、迁流、生灭；念头不住的生灭，一个念头起，一个念头灭，永远循环，不能够停止下来。「识」是指阿赖耶识，佛法称神识，世俗称灵魂。受想行识是心，因为你有心，所以你才有忧虑，你的身心才受苦。五阴像猛火一样烧得炽盛，增长烦恼，所以才有前面这七种果报。<br/>生老病死这四种苦果是「内」，内就是身内的、本身的；爱别离、怨憎会、求不得是身外的。「内之内不净」，这也是苦。观身不净，这个身不清净，并不可爱。三天不洗澡，你看毛孔里流出来的是些什么东西，就晓得里面干净不干净；身不是清净之物。「外之外」还有「天灾人祸」，可见得苦实在是太多，这世间哪有乐？死后「后之后轮回不停」，决不是死了就了断，没这回事情，死了就不得了！所以真正觉悟的人决定不死，要求解脱，这是真正聪明人、真正觉悟人。死了是迷惑颠倒，再一次来的时候比这一世更迷惑、更苦。<br/>欲界有六层天，他化自在天之下，都有这八苦。色界天没有七情五欲，所以没有八苦，但是他有色身。色界天由禅定之浅深分为四级，称为四禅天。诸位一定要明了，禅很好，你有本事断七情五欲吗？七情五欲断掉，才不过是初禅而已，禅不容易！七情五欲不断，参的禅是野狐禅、口头禅而已，你不会得禅定。色界、无色界天人没有瞋恚心，他伏住见思烦恼里的瞋恚。你是个参禅人，人家说你几句、骂你几句，你还气好几天，一点功夫都没有，这确实不容易。色界天的定功有时间性，到时候这个定就失掉，失掉之后又要堕落，所以他有「坏苦」。底下注解说「万法无常」，这个世界有成住坏空。到无色界天，没有身体，没有色相，这是六道凡夫里最高明的。中国的老子体会到这个境界，老子说：「我有大患，唯我有身。」我最大的忧患是有身体，我有身体怎么自在呢？无色界天人没有身体，只有神识，所以没有苦苦、坏苦，没有这个身受；但是他有「行苦」，行就是「剎那生灭」。</p><p class=\"text-indent\">丙、三界统苦<br/>三界统统是苦，没有不苦的。在欲界里，这三种苦：苦苦、坏苦、行苦，我们都有。我们现在活在这个世间有苦苦（八苦），死了之后身体四大分散是坏苦。我们人从生到老不是一年一年的老，不是十年十年的老，是剎那剎那老，青春不再！世间人唯一精进，一剎那都不肯停止的就是行苦，所以人生有什么意思？从出生的那天就是一条直路往坟墓上走，一天比一天接近，从来也不肯休息，这就是人生的道路。色界有两种苦：坏苦、行苦。无色界没有身体，色相他不要了，是灵界、精神的世界，没有苦苦、坏苦，但是他有行苦；他还有微细的念头剎那生灭，所以尚有寿命期限；非非想天寿命八万大劫，时间到还是要堕落。</p><p class=\"text-indent\">丁、受苦益起颠倒<br/>「解苦妄作复造苦因」：他想解决痛苦，可是他迷惑颠倒，由于不觉悟，所以想法作法都错，于是苦上加苦。解苦应当从因上解决，不要去造苦因，才真正能够离开苦果；如果不断的继续造苦因，又想不受苦报，没这个道理。「加苦续苦无有已时」：世间人所做的是增加苦、继续苦，苦受永远没断。「喻如扬汤止沸」：这是举个比喻，水很热，我们希望它温度凉一点，你把水拿来扬一扬，行吗？下面火烧得那么旺盛！聪明人应该釜底抽薪，把火熄掉，温度自然就降低。不知道熄火，扬汤止沸没用处的。<br/>这一讲概略的说明，我们当前所享受，除了苦之外没有乐。</p></div>"
    },
    {
        "title": "第五讲 人生三际之抉祕（十二因缘）",
        "html": "<div class=\"B1_text\"><p class=\"text-indent\">这一讲告诉我们生死轮回的因由。为什么会有生死轮回？轮回是不是真的？什么人主宰？这一讲是讨论这个问题。「人生」：人生就是指自己，也泛指一切众生，可是主要还是说自家。这是第一表里面「人生观」当中的「当前所造」，我们是当前造因，所以才有苦果。「三际」是三世—过去、现在、未来。「抉祕」：祕是深祕的意思，很深的道理，也是事实；佛为我们发掘出来，告诉我们这个事实的真相，这就是佛经里面所讲的「十二因缘」。<br/>甲、双重因果<br/>「双重因果」：因果是绵延不断的，有过去的因缘就有现在的苦果，有现在的因缘就有将来的苦果，所以十二因缘里面有三世，表里面列得很清楚。「过去因缘」是过去世；「现在苦果」与「现在因缘」是现在世，就是今世；「未来苦果」是未来世。过去还有过去，未来还有未来，所以佛法研修的范围是竖穷三际、横遍十方，修学内容之广泛、范围之博大，确实世间任何的学术都没有办法跟它相比。<br/>我们先讲过去因缘。第一是「无明」，第二是「行」。无明是「缘」，行是「因」。有因有缘，后面就结果，果报就是识、名色、六入、触、受。最难懂的是无明，无明有两种：一种是根本，一种是枝末。此地是讲枝末无明。<br/>无明是「无始烦恼」，就是无始劫以来，生生世世阿赖耶识里面含藏的习气种子，这个东西称为无明。《起信论》讲：「不如实知真如法一故，不觉心起，而有其念。」那个无明是根本无明，不是此地讲的枝末无明。根本无明，如同经典上讲，「无始无明」，根本就没有无明，没有开始；若有始有终，就变成事实；无明没有开始，所以它是虚妄的。《楞严经》上讲「知见立知，是无明本」，有分别执着、起心动念，那就是根本无明。因为这个地方讲：无明断了就超越三界，虽然超越三界，根本无明没断，这是断枝末无明；这个无明是指见思烦恼，所以称为无始烦恼。见思烦恼为什么称无始？生生世世累积的烦恼无量无边，就是这么回事情。<br/>烦恼如果不遇到缘，它不起作用；如果遇到缘，它就起作用，起作用就叫做「行」。行就是行动，这就是「善恶之业」。烦恼不动的时候，是迷惑，是无明；它动作的时候，就叫做造业。一动必定有三类，不一定在哪一类，有善、有恶、有无记。无记就是善恶都谈不上，譬如口渴喝一杯水，这说不上善也说不上恶，这个业是无记业，就是没有善恶的。<br/>在果报上来讲，因与果是关系最密切的，缘要差一等，比较疏远一点。譬如苦果像儿子，行就是他的父亲，无明就好像是他的祖父，比较疏远一层。所以无明缘行，行缘识，发展的关系一定是按这个顺序，一点都不错乱。这就是说明宇宙万有为什么会有这么好的秩序，它不乱，就是它发展的经过都是有秩序的、有层次的。过去世你有烦恼，所以造善恶业，当然今世就会有果报。<br/>「更从过去果来，上溯过去无始」。无始就是过去还有过去，是从时间上来说。这也说明了我们的生命是无有穷尽，我们有过去世，当然我们也有未来世，所以生命不仅仅是一世。因为生命是无有穷尽的，我们一定要断恶修善，一定要求一个究竟圆满。<br/>由于过去的因，就产生这一世的果报。果报从哪里讲起？从神识投胎说起。「识」—「本识揽渧」，这就是入胎。父母与我们的关系是增上缘，前面讲过四缘生法，亲因缘是我们自己的本识；这个「识」就是阿赖耶识，世间人讲灵魂。其实灵魂这个名词非常不恰当，因为魂他不灵，他要灵，绝对不会找一个贫穷下贱人家去投胎，一个个都会投到帝王家，一出生就大富大贵，那多自在！魂要灵，他怎么会到三恶道去投胎？他看到猪那么脏、那么讨厌，绝对不会去投胎。所以魂是迷魂！孔子在《易系辞传》里告诉我们：「游魂为变，精气为物。」这两句话说得很高明。说游魂是对的，因为神识活动的力量非常大，速度非常快。我们如果念佛求生西方极乐世界，极乐世界距离我们太远，神识一弹指间就可到达，这个速度太快了。游魂为变，这是对的。变是变什么？变六道的身，一会儿到这一道投胎，再到那一道投胎，变我们依正的相状。孔子这两句话，跟佛经里面所讲的可以说是不谋而合。<br/>父母跟我们是缘，就是增上缘，这才受生，得现在世的果报。「渧」就是父精母血，取这个为自己的身体。子女的相貌有时候很像父母，现代学术认为是遗傅，佛法不讲遗传。相貌为什么会一样？他来投胎的时候，喜欢父母那个样子，他就照那个样子塑造自己。这种相在四十岁之前不容易改变，四十岁之前的模样就是你刚刚投胎时候那一念变现出来的，我们称为先天的，就是你入胎时所取的相。自己有了知识，如果能够发心修行，那是后天的，这个相会变，相随心转。四十岁以后的相多半是后天的，你修慈悲心，相貌就很慈祥；心情很凶恶，相貌让人看到就害怕。<br/>你怎么会来投胎？有许多人结了婚之后不想要儿女，但是儿女好多，一年一个来了一大堆；有许多人想要儿女，想了几十年，一个都没有。可见得父母能不能生儿女？不能，只可以说他是个增上缘。儿女到你家里来要有缘分，没缘不来，有缘就来了。佛给我们讲，父母与子女的缘可以分为四大颊：一、报恩，孝子贤孙报恩而来的。二、报怨，败家子会把你搞得家破人亡。三、讨债，看父母欠他多少，欠得少一两岁他就走了，欠得多大概一、二十岁就走了；培养到大学毕业，花了多少钱、花了多少心血，他讨完债就走了。四、还债，看他欠父母多少，如果欠得多，在物质供养上很丰厚；欠得少，父母的生活他勉强照顾，每个月给一些零用钱，没有孝敬的心、没有恭敬心。如果没有这四种缘，不会到你家来。看穿了，人生就是这么回事情，讨债、还债、报恩、报怨。<br/>子女跟父母是这个关系，人与人之间统统是这个关系，没有其他的关系。小偷偷了你，你也是欠他的债；你不欠他，他为什么不偷别人而偷你的？强盗杀了某一个人，是欠他的命债，他要不是欠他的命债，他不杀别人单单杀这个人？「一饮一啄，莫非前定」，都有因果的关系。而且因果报应是循环的，这是因为人愚痴。譬如，别人杀我，我不甘心，我要报复，冤冤相报没完没了，这四种缘是愈结愈深，以后果报是愈来愈苦。轮回实在可怕，应当要觉悟！<br/>神识入胎之后，第一个七天称为「名色」。名色是「识煖胚团」：刚刚入胎的时候，还没有长成一个胎儿的形状，这个阶段是名色。名是他有精神、有神识；色，他是个物质，是个肉团，还没有长出人形，这时候称为名色。<br/>「六入」：相当时间之后，他在母体里面逐渐形成一个婴儿的形状，这时候称为「六入」。就是他有六根，眼耳鼻舌身都有了，都长出来。「扶尘具形」：他具足一个人的形状；这都是在坐胎的时候，还没出生，他已经长成人形，六根具足。<br/>现在苦果里面，五种就有三种是在坐胎时，坐胎时的苦处是我们没有法子想象到的。佛告诉我们，坐胎就像在地狱里受罪一样，决不是舒服的事情。母亲喝一杯凉水，胎儿感觉好像在寒冰地狱；母亲喝一杯热茶，胎儿好像在八热地狱，就像在地狱里受罪一样。佛经里形容胎儿十个月是胎狱之苦，因为这十个月的胎狱太苦，把前世的事情都忘掉了。我有一个朋友，他的小孩非常聪明，很可爱，在十一岁的时候害了一场大病，病好了以后，人就变得像白痴一样痴痴呆呆的。一场大病都能把从前的事情忘掉，何况坐胎这种大苦？所以前世的事情都忘掉，都记不起来。可是有一种人能够知道前生的事情，他跟这个父母也有缘分，他没有坐胎，他是夺胎。就是坐胎的人一出生就死了，他见到这个情形，他的神识进去，把这个身体夺过来，代替了他。换句话说，他没有经过十个月胎狱之苦，他是夺胎而来的，他对于前生的事情清清楚楚。如果真正是投胎而来的，前生的事情一定不会记得。<br/>「触」：就是出胎、出生，与外面境界接触。「根摄境界」：这是讲出生，一出生就开始接触，六根接触外面的六尘境界；从出生到老死，这一生当中都接触。<br/>「受」：触了之后，他就有感受。感受是什么？「苦乐舍感」，就是前面讲的苦乐忧喜舍这些感受。婴儿只有触没有受，他还不懂得喜怒哀乐，不晓得苦乐忧喜，天真！从前的小孩天真的时间保持得相当长，现在的小孩一两岁就懂得人情事故，天真的时间缩短，苦乐忧喜舍的受延长；一两岁就有苦乐忧喜舍，实在很可怜！菩萨行里面有修一个婴儿行，完全修天真，心里面没有人我是非、没有苦乐忧喜舍，非常自在。从前的小孩十二岁以前不懂得人情事故，心里面清净，不受境界的染污，只有触没有受。现在的小孩受的时间提前，两、三岁的时候就有受；在从前，确实十二、三岁以后才会有这个受。<br/>识、名色、六入、触、受，这是现在世苦果，这些果报是过去世的因缘造成的。可是我们在受果报的时候一定又不甘心，想种种方法要改进自己的享受，又不知道正当的方法，所以又要造作。造作是现在因缘。<br/>「现在因缘」分为三大类：第一是「爱」，第二是「取」，第三是「有」。「爱」就是七情五欲的根本，它是缘，换句话说，爱就是无明。「因受生着」：着是执着，着相了，你在感受时着相、取相。爱这个字范围也很广大，如果顺自己的意思，称心如意，你就爱贪爱取；如果不合自己意思，你就爱离，把它远离掉也是爱；爱意思很广，瞋恨也是爱。喜欢的，爱得到；不喜欢的，爱远离；用一个爱字来代表，这就是起了分别执着。<br/>这一个无明还浅、还不太严重，才有分别而已，如果这个无明继续增长，那就到第二个阶段「取」。取是「因执追求」，这就很严重必定要造业。这还算是缘，这个缘跟前面爱缘不相同。爱缘里面是动机；取这个缘里面是造作，就是第二条所讲的行，取是有行动的。行动为什么不叫做因？因为底下有结业，结业与来生神识去投胎关系更密切，所以它还是属于缘。这就是对一切法取舍得失、一切的造作，都包括在这一条里面。<br/>既有造作当然就有业，造作就是业，就是阿赖耶识里又落下业习种子。取就是造作、就是行，你造作善业，阿赖耶识里落下善的种子，这个种子叫做「有」，有了种子。你造作恶业，阿赖耶识里落下恶的种子。我们念一声佛号，阿赖耶识里有佛种子；念一声菩萨名号，阿赖耶识里有菩萨种子；经典里面看到声闻、缘觉，就落到声闻、缘觉里面；一念慈悲喜舍是诸天的种子；想到五戒十善伦常这些道理，觉得很欢喜，认为这是对的，人天种子；起了贪心，饿鬼的种子；起了瞋恚心，地狱种子；对一切事情胡里胡涂，是非利害不分，畜生种子。我们每天所造作的，十法界的种子统统都有。既然统统都有，我们来生到哪里去投胎？当然最好的是作佛、作菩萨；也有人不愿意，有人名利心很重，发心去作天王、国王。能不能我想这样，将来就能得到？不行。为什么不行？业力主宰着你。「业牵后有」：后就是来世，来世又有了身体，又要去投胎，又要去轮回，还是搞这么一套；六道之内全是业力主宰。六道以外是愿力主宰，那就不一样；真的，想用什么身分就以什么身分出现，想到哪里投胎就可以到哪里投胎，那是自在的。三界之外才行，三界之内没有办法，全是业。<br/>业力，经上给我们说「强者先牵」，哪一种业的力量强大他先投胎。十法界的业种我们统统都有，只看哪一个业力力量最大，它先起作用。正因为这个道理，所以佛教导我们念佛，使一切造作当中，我们以念佛这个业力最强最大，当然这一个业因先成熟，往生西方极乐世界；带业往生就是根据这个道理。如果你念佛念到一心不乱、心不颠倒，那就不属于三界内的业力。念佛功夫没成就，没有能够达到一心不乱、心不颠倒，带业往生还是业力（净业）去生的。八万四千法门中只有这个特别，这个业力可以到佛法界里面去，其他法门都做不到，唯独净土法门占了这个便宜。我们在三界之中是业力轮回，就凭业力也能往生，这是不可思议的事情，这是特别法门。其他法门里面没有，因为八万四千法门任何一个法门，都必须要断惑才能证真，连小乘都不例外，一定要断见思烦恼，就是此地这个无明，一定要把它断掉才能够超越三界。净土法门称为难信之法，就难信在这个地方。因为三界六道是见思烦恼变现出来的，怎么可能说是见思烦恼还在，你就能够超越三界，在理上讲实在是讲不通。可是你要是想到极乐世界有凡圣同居土，凡圣同居土的众生没有断见思烦恼，这就有点可信了。那里不断见思烦恼，这边也没有断见思烦恼，当然可以去，境界相等。什么样条件去？十法界的业力要佛法界的业力强，强者先牵，这么去往生的。何况阿弥陀佛又有愿力接引，给我们做增上缘。因为西方极乐世界在哪里我们不晓得，太虚空这么广大，究竟到哪里去？阿弥陀佛大慈大悲，他一定会来接引你、会来带路，这个法门不可思议。这是讲业力强的先得这个果报。<br/>「未来苦果」：这是来世。来世又有「生」，生是「倒识托胎」。你的神识不迷惑颠倒，它就不会来投胎；一定是迷惑颠倒，它才去投胎。「老死」是「生后苦死」。投了胎之后，又是识、名色、六入、触、受、爱、取、有，搞这么一套，而终有老死，这个事情永远就是这么样的循环，好像一个环没有一个开端，这就是轮回。「更生未来惑业，下推未来无终」：生死轮回是无穷无尽，没有止尽的。经上常讲「生死疲劳」，实在是非常痛苦的事情，我们应当要觉悟！<br/>这个十二因缘，如果我们从第一表总相、别相、事理上来观察，过去因缘是属于理，现在苦果是别相；现在因缘是事，现前的事。事跟理有密切的关系，理因事显，事依理成，相辅相成。未来苦果是总相，总别不二。从这里面，我们对于总相、别相、理事这些关系，多少能够体会到一些。</p><p class=\"text-indent\">乙、喻语<br/>「十二重城，困在长狱之意」，这是比喻。长是讲时间太长太长，无量劫。六道就好比是一个监狱，永远不能够超越，所以把它比喻作十二重城。又比喻作「十二轮」，轮是「轮回不停」的意思，永远不会休止。这是比喻我们为什么有三世？为什么有轮回？为什么有六道？这是什么道理形成的？谁在那里推动？谁在那里主宰？佛把这些真相跟我们说明了。十二因缘此地是略说，若要详细的讲相当复杂。诸位可参考《十二因缘经》或者《心经诠注》，《心经诠注》里面引用经论说得很详细。<br/>佛门里面常说：「欲知前世因，今生受者是；欲知来世果，今生作者是。」我们前生到底造一些什么业？我们现在这一生所受的果报就是，因与果一定相应。你前生做善业、修福报，这一生很自在、很幸福；前生造恶业、不善业，这一生事事都不如意，很痛苦，就是这么回事情。刚才跟诸位说过，我们在四十岁之前受前生业感力量很大，四十岁之后我们对自己这一生要负责任。因为我们自从有知识起开始造的业，对后半世就有很大的影响力，所以我们的命运可以改造。道理就在此地。袁了凡改造命运是一个例子，像他这种改造命运的人太多了！确实可以改造。<br/>来世果报如何？这一生所做的就是。我们这一生存心善良、做好事，来生的果报比这一生一定殊胜，这是一定的道理。真正要学佛，依教修行，前途一片光明，充满了信心，这一生再苦，几十年就过去了，来生得大自在、得大福报。我们要相信，人决定有来生。千万不能说，苦到感觉人生没意思，算了，我不想活，我要自杀。这就是你不修了，苦果来了受不了，「我不受，我要自杀」，那么你这苦果没受完还在，来生继续再受。你都没有善因，那只有受苦，你来生比这一生还痛苦，不能解决问题。只有断恶修善，才是真正解决问题之道；不能够逃避现实，要面对现实去改造命运，这是佛法。所以佛法决不是消极的，是积极的；佛法绝不脱离现实，他是最讲求现实的。</p></div>"
    },
    {
        "title": "第六讲 宇宙有情概况",
        "html": "<div class=\"B1_text\"><p class=\"text-indent\">这一讲，简单介绍六道。六道轮回，初学听起来有一点像神话一样，不大容易相信，但是这是事实。信，有；不信，还是有；这是宇宙之间实实在在的事。「宇宙有情概况」，这就是宇宙观里面的人事环境，人情事理。</p><p class=\"text-indent\">甲、六道状况<br/>「天」：六道第一个是天道。天的意思就是高高在上，「天者颠也」，颠峰、最高。在有情世间，天人的地位最高，福报最大，种类也很多。<br/>「类受」：类是种类，受是享受；只举这个例子来给我们说明。天的种类概略可以分二十八层天，这二十八层又可以分为三大类：就是欲界、色界、无色界。欲界里面有六层天；色界里面有四禅十八层天：初禅有三层，二禅有三层，三禅有三层，四禅有九层，一共有十八层天；无色界又称空界，他连色相都没有，也有四层；所以三界总共合起来有二十八层天。<br/>天人的享受是说不尽的，享受里面只举一种：寿命。寿命是享受，五福里面长寿是福报之一。我们从寿命看出他的福报，他寿长。「寿五百岁起」：这是讲最低的，最低的是欲界里面的四王天。四王天再上去是忉利天，我们中国人称玉皇大帝，一般宗教里面拜的上帝，都是指忉利天主。佛在经典里给我们说，要想生忉利天必须修十善业道，十善业道跟摩西十诫很类似，可见得修十诫能够生忉利天，忉利天主就是他们的天主上帝。可是我们娑婆世界（一个大千世界）多少个忉利天？一百亿个。他要找上帝，一百亿个上帝，找谁？找哪一个？这个问题很严重，一定要搞清楚。<br/>四王天的寿命五百年，他这个五百岁可不是我们人间的五百岁，我们人间五十年是四王天的一天；也照人间算法，一年三百六十天，他要活五百岁，你们计算计算，他的寿命相当之长。可见得他的福报比我们人间的福报大得太多。他也有五通，是报得，就是一生天上这五种神通都有。<br/>再往上一层是忉利天，福报就更大，寿命也更长，加一倍，他的寿命一千岁，算法也不一样，我们人间一百年是忉利天的一天。如果在忉利天上，看我们地球上众生很可怜，朝生暮死，早晨看他生，晚上就死了。水上蜉蝣是朝生暮死，忉利天人看我们世间人，就像我们看水上蜉蝣一样，还在那里争名夺利搞个不休，真可怜！愈往上去寿命是倍倍增加，非想非非想处天是最高的，寿命八万大劫。这是天界类受略举。<br/>「苦厄」：厄是灾难，他有苦。天上毕竟是乐多苦少，不是没有苦，他有苦。「欲五衰」：欲界有五衰，欲界天人平常没有苦，天天享福，可是到寿命快终了的时候，他有五种衰相出现，这个时候他感觉无比的痛苦。天人不老，天人也不生病，但是天人会死。五衰相：一、「衣垢」：天人的衣服不要裁缝，天衣无缝，不像我们的衣服要裁缝、要买料子，他不要。天人想穿什么衣服，随心所欲变化而成，而且衣服干干净净、一尘不染，不要洗。衣服不染灰尘，这是我们人间所没有的。可是他福报享尽命快终时，衣服就会染上灰尘。天人一看到衣服有染污，就晓得寿命将尽，这时候他恐怖、苦恼。二、「花萎」：天人喜欢戴花，天人戴花冠，花都非常的鲜艳。他有福报的时候花不会枯；如果花枯萎，他的福报就尽了。三、「身臭」：身上发出不好的气味，原本天人身上有香气。有时候我们读经、看经、念佛，并没有供佛像、没有烧香，可是闻到有香气。我刚刚学佛时，看经常常闻到很强烈的香气。请教老法师，告诉我说，这是我们在读经、看经的时候，有天人在旁边，他很喜欢，到这儿来看看，他身上放的香气。他的色相我们看不到，他的香气我们可以闻到。天人身上有香气，如果香气没有，臭气出来，他的寿命就快要终了。四、「腋汗」：两腋之间出汗。天人平常不出汗，身体很清净。五、「厌座」：坐立不安。天人福报快要尽的时候，这五种现象同时出现，称为五衰相。天人知道寿命快终了，愁忧恐怖。<br/>天人也有灾难，「三禅三灾—火、水、风」。欲界有五衰苦，当然三灾也是免不了的，也躲不过。色界四禅，初禅天有水灾、火灾、风灾，这三种灾难都有；二禅天没有火灾，可是有水灾、风灾；三禅天福报更大，只有风灾，没有水火灾难，可是风灾也很厉害，能够把三禅天吹坏。四禅天是福天，没有三灾，但是有死堕。<br/>「空死堕」：无色界四空天有死堕，虽然有福报，命终的时候必定堕落；因为他爬到最高层了，死的时候没有办法再停留在那一层，只有往下堕落。可见得三界统统都有苦，并不是真正究竟之乐。这是天道的简介。<br/>佛教里有两部类书，对于天道的讲解非常详细。一部是《法苑珠林》，有一百卷，讲天道部分，把经论里面佛所讲天人的事情编在一起。另外一部是《经律异相》，有五十卷。这两部都是唐朝人编的，等于百科全书一样。<br/>「人」：人道，我们现在都是属于人道。地球上有人，别的星球也可能有人，其他星球上的人跟我们人的样子是不是一样？恐怕不一定。可是他一定具备人的特色—人的智慧、人的感受。「身寿享等各地球互异」：身形、寿命、享受等等，每个星球上不尽相同。苦厄大致上差不多，有三苦、八苦，一定有这些受。为什么？造的因相同，果报必定是一样的。<br/>「阿修罗」道：阿修罗是梵语，翻成中国的意思是无端正。阿修罗的男子相貌都很丑陋、很凶恶。可是阿修罗的女子是美女，天上最美的，诸天都喜欢娶阿修罗的女子。阿修罗常常跟忉利天战争，互有胜负。《楞严经》讲阿修罗有四大类：有天上阿修罗，人间也有阿修罗，饿鬼、畜生里都有阿修罗，只有地狱里头没有；他在那一道，他的身形享受与那一道大致上相同。阿修罗福报很大，但是没有德行。六道里讲阿修罗都是指天阿修罗，所以把他算作三善道。天阿修罗有天之福报，没有天人之德。诸天性情都是柔和的，都是慈悲善良的，阿修罗不是如此。阿修罗福报跟天人一样，但是疑心重、瞋恚心重，喜欢斗争，好胜逞强，他要是不对别人发脾气，自己也会发脾气。斯大林、希特勒、毛泽东，都是人间阿修罗，福报太大、性情太残忍。他的业因是过去生中修大福报，但是他瞋恚，瞋恨心重、傲慢心重，修福不修德，才落到阿修罗道。福报享尽了，果报当然就不好，因为他很少造善因。<br/>「畜生」道：畜生道的种类、享受非常繁多。「胎卵湿化」：有胎生、卵生、湿生、化生。（一）胎生，又作腹生。从母胎而出生者，称为胎生；如象、马、牛、猪等。（二）卵生，由卵壳出生者，称为卵生；如鸡、蛇、鸟等。（三）湿生，又作因缘生、寒热和合生。即由粪聚、秽厕、腐肉、丛草等润湿地之湿气所产生者，称为湿生；如飞蛾、蚊等。（四）化生，无所托而忽有，称为化生，皆由其过去之业力而化生；如诸天、诸地狱。牠们的「形状、寿命、享受千差万别」，苦厄也是很多。「苦役」：譬如从前，牛替人耕田，马替人拉车，要为人服劳役。「充食」：家畜，猪羊鸡鸭之类，人要吃牠。这也是有业报，杀业太重会有很大的灾难；因为你吃牠，牠并不甘心，并不情愿给你吃，牠没有能力抵抗，牠怨恨的心、报复的心永远存在，将来一有机会，牠一定会来报复。古人说：「吃牠半斤，将来要还牠八两。」我们如果真正想到这个道理，不敢吃众生肉；吃众生肉，将来一定要还债，这是没有法子避免的，冤冤相报。这个世间的刀兵劫就是从杀生而来的，杀生杀得越多，战争就越残酷。我们从历史上来看，战争一次比一次范围大，一次比一次惨烈，什么原因？杀业的累积。如果我们真正能够做到不杀生，刀兵劫里就可以不受这个灾难，就可以免除，这就是共业里面有别业，我们要觉悟。我们生活必须仰赖饮食，植物里面有足够的养分维持我们的生命，何必要杀害这一些动物？实在是不应该！「人杀」：譬如有一些小朋友，抓到蝴蝶、蜻蜓，他玩，把牠玩死，他并不是吃牠，像这一类无知杀害众生的，也非常之多。「互噉」：互相残杀，弱肉强食。畜生之死，很少得好死，都是被杀的，所以三途里面畜生道称为血途，都是流血而死。<br/>「饿鬼」道：鬼道的种类也很复杂，可以分为三大类：多财鬼、少财鬼、无财鬼。「多财鬼」：有福报，像阎罗王、城隍、土地公、妈祖、王爷公之类，有很多信徒烧香祭祀，都是多财鬼。「少财鬼」：也能得到一点饮食，但是相当的苦，别人丢下，他去拾取。「无财鬼」：你供养他饮食，他也没有办法得到，所以称之为饿鬼。饿鬼指无财鬼，鬼里面大多数是无财鬼，很可怜。最苦的是焰口鬼，一得到饮食，他口里面就喷火，把饮食都烧坏，所以他得不到饮食。佛门里放焰口就是布施，以佛神力咒语来帮助他，使他能够得到一点饮食，能够救济他，所以放焰口就是施食给饿鬼，请这些饿鬼来吃饭。能够很如法的去做，这些鬼能够得到饮食。<br/>鬼的寿命很长，「寿五百岁」。计算的方法跟我们不一样，人间一个月是饿鬼的一天，我们人间初一、十五去祭祀供养，是一天早晚两餐得到饮食；如果没有人祭祀，他就挨饿。人间一个月是饿鬼的一天，也是以一个月三十天、一年三百六十天计算，鬼的寿命五百岁。鬼道不能去，时间太长，而且太苦！饿鬼的苦厄是「恐怖飢渴」：他得不到饮食，所以我们常常称鬼为饿鬼。除了飢饿之外，鬼的胆子很小，所以人怕鬼是不应该的，是错误的观念，实际上鬼怕人。常言说得好：人有三分怕鬼，鬼有七分怕人。鬼的胆子很小，所以遇到鬼不要害怕，没什么可怕。鬼常常有恐怖的感觉。经里面讲鬼道大类有三十六种。<br/>「地狱道」：狱是监牢狱。经论上讲：「地底下过五百由旬是地狱所在处」。但应知者，地狱不仅在地下，或在山间、大海边、旷野树下、空中，皆有其地狱。地狱这两个字意思是苦地，六道里面他的情况最苦，是最苦的一道。<br/>地狱的种类繁多，有「根本」地狱、「近边」地狱、「孤独」地狱。其形体寿命，受苦轻重，随各差别。根本地狱非常之苦，《地藏菩萨本愿经》里面说得很详细。根本地狱里，其中的「无间」地狱最苦，又称为阿鼻地狱。「趣果、受、时、命、形」：是说明无间地狱有这五种无间，它不间断，这是地狱里面最苦的地方，是罪业最重的地方。佛经里面讲，造五逆十恶堕五无间地狱，就是这种地狱。<br/>五逆：一、杀父，二、杀母。父母对我们有养育之恩，纵然是抱怨，也不能杀害父母，所以杀父母的罪非常重。三、杀阿罗汉。阿罗汉是圣贤，他是人间善良的榜样，他能够转移风俗、教化众生，是众生的好老师；杀害他，这个罪过很重。四、出佛身血。佛的福报太大，许许多多护法神保护他，你想杀害佛，杀不到的；但是让佛受一点伤、流一点血，这可能，这个罪很大。佛是天人导师，一切众生的福田；杀害佛，一切众生都不能种福。佛是一切众生法身慧命的寄托，杀害他，一切众生都不能够得到法身慧命，这个罪过很重。五、破和合僧：僧团是和合、是一体，你在当中分化破坏。这五种罪都是堕无间地狱。十恶：身—杀生、偷盗、淫欲，口—妄语、两舌、绮语（花言巧语）、恶口，意—贪瞋痴，这是十恶。造十恶五逆之人必堕无间地狱。<br/>无间地狱：一、「趣果无间」：果报就是地狱，这个地方人一死，神识立刻就到地狱，当中没有间隔。人死了之后，神识离开肉体，四十九天之内不会马上去投胎，在这个期间是中阴身，完全是神识状况，我们一般讲灵界，这个时间不会太长，一般不会超过四十九天，四十九天一定去投胎，又到六道去轮回。可是犯五无间罪业的人，他的神识不经过中阴，这个地方一断气，立刻就到地狱。二、「受无间」：地狱里面有无量苦，他同时都要受，不是一样一样的受。三、「时无间」：从堕地狱那一剎那开始，直到他罪受完才出地狱，没出地狱时他所受的罪，在时间上讲没有间断、没休息。四、「命无间」：一日之中真是万死万生，这个地方刀山下去，马上死了，那里风一吹又活了，活了之后再受，非常非常之苦。五、「形无间」：他觉得自己的身体很大，地狱多大他的身体就有多大，所以地狱里所有刑罚同时受。<br/>地狱的寿命很长。「寿短者一万岁」，地狱里最短命者寿命一万岁。「人间三千七百余年为一日」，在无间地狱看我们世间，中华民国五千年的历史还不到两天，怎么得了！所以地狱千万去不得，决定不能去；去了之后，出来很难，时间太长了。怎样可以不去？不造地狱的业就不去了。过去虽然造了业，但现在不让它加上缘，缘我们自己可以控制；不造恶缘，虽有地狱业因，不受地狱的果报。除地狱之外，饿鬼、畜生都不好，最好都不要造这个业因。<br/>简单跟诸位介绍一下业因。天道是修十善业道。欲界天要修十善业道；色界天要修禅定，还要修四无量心：慈无量、悲无量、喜无量、舍无量；无色界天的条件要修四空定。四禅八定、四无量心、十善业道，这是诸天条件，取得生天的资格。人道是要修五戒，中国儒家的五常—仁、义、礼、智、信，才能得人道。阿修罗也是修五戒十善，但是他贡高我慢的习气没有断除，好胜好斗的心没有去掉，所以变成阿修罗。因此我们学佛，处处要修柔和、忍辱，很重要。要能够忍让，于世无求、与人无争，才能得到真正的善果。畜生道的业因是愚痴，真妄邪正、善恶是非不能够辨别清楚，搞颠倒，搞错了。饿鬼道是贪心太重；贪爱不是好事情，饿鬼道的业因。地狱道是瞋恚心太重，瞋心堕地狱。贪瞋痴是三恶道的业因。<br/>地狱的苦厄，这里也是略举：「火坑、坚冰、刀山、剑树、碾磑、汤镬、沸屎、合山等，繁多难述。」诸位可以看《地藏菩萨本愿经》，或者看《楞严径》第八卷，讲得很详细。</p><p class=\"text-indent\">乙、互相轮回<br/>「三善道喻头出，三恶道喻头没」。这是把六道比喻作苦海，到三恶道苦海里面，头伸出来透透空气，一下就再到底下去了，总而言之，不出六道轮回。在三善道的机会比较少、时间也短，到三恶道的时间总是长、机会总是多。你要不信，看看现在我们这个世间，想想我们自己，一天到晚起心动念，三恶道的机会多，还是三善道的机会多？我们来生可能到哪一道，自己清清楚楚、明明白白，不用去问人。什么样的因，该什么样的果！<br/>三恶道又叫做三途，三途就是血途、火途、刀途。畜生称为「血途」：死必定有血，所以称为血途。地狱称为「火途」：纵然是寒冰地狱，也有一片火光。这火从哪里来的？瞋恚之火。人一生气，火都往上升，脸都红了；所以地狱是火途，是瞋恚心变的。鬼称为「刀途」：鬼常常觉得有人拿刀跟着他，要杀他，时时刻刻有恐怖、有恐惧。</p></div>"
    },
    {
        "title": "第七讲 宇宙器界概说",
        "html": "<div class=\"B1_text\"><p class=\"text-indent\">第七讲是说宇宙观里的森罗万象—物质环境，内容是介绍三千大千世界。</p><p class=\"text-indent\">甲、器界范围<br/>「直竖」：「一个世界有二十八层天，如是上下各有此等世界。」这个地方讲的一个世界是说一尊佛的教化区域，这一个世界就是一个三千大千世界。诸佛的智慧德能虽然是完全相同，可是他度众生的情形不一样。譬如两个老师同样有学问、有道德，可是他们两个所教的学生不见得一样多，不见得是一样的程度，也许有的学校很大，学生有几万人，有的学校学生只有几十个人，相差很大。这就说明诸佛教化区大小不一样。像经里面所讲，阿弥陀佛极乐世界比释迦牟尼佛娑婆世界就大得很多，水平也高，娑婆世界跟阿弥陀佛的世界没法子相比。这是佛在因地与众生结缘不相同，你自己的学问道德是一桩事情，你与众生有没有缘又是一桩事情，是两桩事情。佛常常劝我们，在初学时要广结善缘，缘结得多，将来你成佛，你的世界就很大，你度的众生就很多。这里头当然不能有贪心，如果是贪心，我将来成佛成个大佛，我的国土也很大，要度很多众生，如果有这个心，恐怕佛都成不了。一个世界有二十八层天也是很普遍的现象，可以说绝大多数的世界都是这样的。一个世界如此，世界无量无边，所以说是「如是上下各有此等世界」，像这样的大千世界在宇宙之间无量无边。这是从竖的（上下）方面说。<br/>「环周」：从横的方面看，「一个大千系为若干世界所集成，如是环周各有无量大千系世界。」这是说明在我们这个世界的四周，像这样的大千世界无量无边。而一个大千世界也叫做三千大千世界，这个三千大千世界其实是一个世界，因为一个世界的组成，它有一个小千、中千、大千，所以称为三千大千世界。有一些学者读佛经看到三千大千世界，以为佛家所讲的世界只有三千个，三千个大千世界，这是误会；三千大千世界是一个世界。佛经里面所讲世界无量无边，诸位读《华严经》就晓得了。</p><p class=\"text-indent\">乙、娑婆世界组织略说<br/>这一段是举例，举我们娑婆世界，这是我们现前居住的世界。「直竖」，从纵的方面来看，可以分为三类：「初」—欲界六天，「中」—色界十八天，「顶」—无色界四天。<br/>「欲界」有六层天。为什么称为欲界？「有饮食及男女之欲」，没有离开五欲六尘；最重要是五欲—财色名食睡，没离开，所以称之为欲界。欲界天人生活跟我们世间人差不多，他的福报大、寿命长，乐多苦少。像忉利天以上，他的苦只有五衰相，只有死堕之苦，除这个之外，确实享乐的时候多。<br/>佛对于六道众生特别赞叹人道，一切诸佛示现成佛都在人间，没有在天上成佛的，也没有在三恶道成佛的。原因在什么地方？佛在天上说法，天人固然也有去听的，不多。他们平常享乐惯了，俗话所谓「富贵学道难」，他不愿意修行，他天天享乐，纵然闻法也很难认真修行。三恶道太苦，修道也很难；「贫穷修道难」，他饭都没得吃，哪里还有时间来学佛？人间是小康之家，说富也不太富有，说穷日子还勉强可以过得去，这个环境最容易学道，苦多乐少，容易开悟。<br/>欲界六层天，最下面是「四王天」。四王天也是佛门的护法神。我们进寺庙的门，第一个接触到的是天王殿。我们一般人称四大金刚，其实那是四大天王，就是四王天。往上是「忉利天」，玉皇大帝就是忉利天的天主。忉利是梵语，翻成中文意思是三十三，所以也称为三十三天。三十三天是一层天，不是三十三层，是欲界里面第二层天。为什么称为三十三？其实那是三十三个部分合起来的，好像我们中国二十八个省，美国有五十个州，是这个意思。当中也有中央政府的组织—忉利天主，四方好比是诸侯，合起来是三十三个单位，所以称为三十三天。三十三天是平列的，是在一层，欲界的第二层。再往上去是「夜摩天」。夜摩天再上去是「兜率天」。弥勒菩萨就住在兜率天，他是在欲界第四层天。第四层天是凡圣同居土，因为有凡夫、有圣人，弥勒菩萨是等觉菩萨，他是圣人；有内院、有外院，弥勒内院是菩萨道场。可是兜率天人看不到弥勒菩萨，虽然同住在一起，彼此都不相见。好像我们这个地球上人鬼杂居，人见不到鬼，鬼也看不到人。我们这个世界也有佛菩萨住在这个地方，有缘分的人见得到，没有缘分的人见不到，所以这个世间也是凡圣同居土。欲界天第四层兜率天是凡圣同居土，色界天四禅天是凡圣同居土。兜率天再上去是「化乐天」，最上面是「他化自在天」。这些名相以及它的状况，《法苑珠林》与《楞严经》说得很详细，可以做参考。<br/>「色界」有十八层天。「无欲有禅，具身器形」，具是具足，他有身体、有居住的环境（就是器世间）、有形状；但是没有饮食男女之欲，没有名闻利养、财色名食睡这些念头。目前在国内外禅宗很盛行，我们自己要好好反省一下，心里头还有没有欲？如果欲念没有断，不够资格参禅。<br/>色界的范围包括初禅、二禅、三禅、四禅，共十八层天。愈往上面去，定的功夫愈深。初禅是「梵天」，梵是清净的意思，心已径得到清净。二禅是「光音天」。三禅是「净天」，在六道里面可以说是极乐的世界，色界里最快乐的是三禅天。四禅是「福天」，福报最大，是凡圣同居土。初禅、二禅、三禅各有三层，一共是九层天，第四禅本身就有九层天。<br/>四禅九层天，有三层是普通的四禅天。有一层是外道天，叫做「无想天」，修无想定成功，就生在无想天。修定不容易，一定要有人指导，盲修瞎练费了好大的功夫，修成个外道，还是出不了三界，到时候定功失掉，还要堕落，很冤枉！另外有五天叫做「净居天」，这是圣人所往的。小乘的三果，还没有证到阿罗汉，一些权教的菩萨，他们多半在这个地方修行。小乘三果罗汉，把见思烦恼断尽，他就超越了。超越有两种：一种是利根的阿罗汉，不必经过四空定，他就超越；还有一种是钝根的，速度没那么快，他要通过四空天，然后才能够超越。所以净居天那个区域又叫做「五不还天」，不还就是不回来了，他不会再退回到欲界；从那个地方，他有能力超越三界，超越生死轮回。<br/>最高的这一层，顶层是「无色界」，有四层天。欲界有六层天，色界有十八层天，无色界有四层天，一共是二十八层。无色界，「已无形相，只有神识」，这个世界里没有物质，完全是精神的世界。<br/>欲界、色界、无色界，合起来称为三界。「三界火宅」，这句话是佛在《法华经》上讲的。三界火宅，三界不安，三界里没有安稳的地方，三界里面都有苦；欲界有三苦、八苦，色界有坏苦、行苦，无色界有行苦。明了之后才会考虑到，我们要真正的超越三界，离开这个苦恼的处所。<br/>「一个小世界」：这就是一个单位世界，这个单位世界很像现在天文学里面所说的太阳系。「大洲四、中洲八、小洲数百，上至初禅」，这就是一个小世界，就是一个单位，一个小的组织。佛经里面讲大洲、中洲、小洲，类似我们现在所讲的星球，星球有大有小，有大星星、有小星星，这是一个日月所照，以太阳为主，是一个单位世界。佛在经典里面讲，一个单位世界有一个中心，中心称为须弥山。须弥山到底在哪里？这是我们没法子说的。如果说须弥山在我们地球上，问题很大，与佛经上讲的不相合；所以须弥山大概不在我们地球上，我们地球是一个单位世界里面一个洲而已。这是释迦牟尼佛给我们讲的宇宙观。以这个单位世界为单位，「合一千个小世界」，这就是一个星系（星团），这就是一个「小千世界」。再以小千世界为单位，集合一千个小千世界，这一个大的星系叫做「中千世界」。再以中千世界为单位，合成一千个中千世界，就是一个「大千世界」。<br/>这种说法很像我们现在所看到的银河系一样，一个银河系就很像佛所说的一个大千世界。我们晓得银河系里面有许许多多的星系星团，星系里面有许许多多的太阳系，我们晚上所看到天空当中的星星都是太阳，因为行星不放光，行星没有光。我们太阳系里面的行星，因为距离近，太阳反射的光很强，我们能看到，火星、土星、水星、木星都是相当的亮；但是其他太阳系的行星，我们肉眼没法子看到。天上的星星都是太阳，每一个太阳必定有许多的行星、卫星环绕着它，所以世界无量无边。<br/>一个小世界有一个「初禅天」；一个小千世界里面有一个「二禅天」，有一千个初禅天；中千世界有一个「三禅天」，有一千个二禅天，有一百万个初禅天；一个大千世界有一个「四禅天」，有一千个三禅天，有一百万个二禅天，有一百亿个初禅天，也就是有一百亿个小世界；这个说法是一个概略的说法，不是一个定数。为什么？世界有大有小。我们今天在太空当中发现的银河系，确实有很大的，也有很小的，所以它不是一个定数。这合起来称为「一佛土」，就是一尊佛教化的地区。可见得成了佛，的确是神通广大。<br/>我们说佛灭度了，佛不住在世间，佛没住在我们这个地球，到别的星球；其实我们自己也如此。有很多人怀疑我们地球上人口逐年增加，这些灵魂从什么地方来的？诸位要晓得，是他方世界到这儿来投胎的。我们这个地方的人，死了之后神识也会到别的星球。往生西方极乐世界，就是到阿弥陀佛的国土。凡是聚在一起都是缘分，如果没有缘分不会聚集在一起，所以一切法无非都是缘聚缘散；有缘就聚，缘尽就散，缘聚缘散没有定法。《华严经》里面讲，华藏世界比三千大千世界大得多，是集合许许多多三千大千世界所成的，华藏世界是毘卢遮那如来报身佛所居住的国土。<br/>这些说法，尤其是讲小千、中千、大千，几乎跟天文学家发现的完全一样。里面最不容易解释就是单位世界，好像经里所讲的与我们现在观察有一些出入。可是在此地我们要相信圣言量，这是事实。</p><p class=\"text-indent\">丙、万物归纳六类<br/>世间诸法无量无边，说不尽，佛非常善巧把它归成六大类。这六大类配合我们的六根，眼所见的都叫做「色」，耳能够听到的都叫做「声」，鼻可以闻到的都叫做「香」，舌能够尝的都叫做「味」，我们身体能够感触的都叫做「触」，心里面所想的就是意所知的都叫做「法」；一切万法可以用这六大类包括。<br/>这六类有好几种名称，此地略举三种。又称为「六尘」，尘是比喻，「由六根入身染污净心」：这六样东西，你要是分别执着它，能够染污你的清净心，就好比尘土。我们桌子擦得干干净净，尘土落在上面就染污。这六样东西，你要是执着它，就染污清净心，所以称为六尘。又称为「六妄」，因为这六种境界确实是虚妄而不是真实的。「为凡夫攀缘迷妄之境」：六根所接触的六种境界，凡夫迷了，以为这六种境界是真的，一意的去追求，所以称为六妄。这个名词有警觉的意思，告诉你这六样东西是虚妄的，虚妄的境界可以随缘受用，不可以攀缘追求，攀缘追求是过失。又称为「六贼」，这个名词的意思就是提醒我们要远离，要能够舍弃它。「以根为媒劫功德法财」：佛在经上告诉我们，我们每一个人的真心具足无量功德，具足无量的智慧、无量的德能、无量的才艺，真是全知全能，现在都丧失了。为什么会丧失？被这六种东西障碍。这六样东西好比是贼，六根是媒介，透过六根起作用，使我们本性本来具足的无量无边的智慧德能不能现前，被它障碍住，所以称它为六贼。如果晓得这六样东西—六贼对我们有伤害，我们当然远离，绝对不会执着。<br/>这是把宇宙里面物质环境作概略的介绍。说到这个地方，我再作一个简单的结论。前面跟诸位说过四缘生法，心法是四缘生法，色法（器世间）是两种缘生；一种是亲因缘，与有情众生的亲因缘没有两样，都是真如本性变现之物。器世间（器是器用），就是人所依靠生存的环境，也就是物质的世间，这种世间是唯心所变，经上常说「境随心转」，这是一个很重要的原则；明白这个道理，你的智慧就开，不会再迷信。<br/>我们这个身体是我们最接近的一个境界，身体也是随着心在转变，而这种转变可以明显的观察出来；心里高兴时面孔笑咪咪的，心里不高兴面孔很难看，马上就转变，时时刻刻从表情就能看到你的心。再深一层讲，身体的健康或者你的寿命，都随着你的心变化。心健康，身体一定健康；心健康，身不会有病。为什么？身是随心转的。有病，你自己有坚强的信心，病很容易治，很快就恢复。如果有点小病，自己就着急，不得了，我得大病，非死不可，什么高明的医生也治不好你。为什么？心要是死了，身也不会长久。<br/>台中李老师给我们讲一个故事：清朝时代的一个名医。曾经有一个病例。有一个病人长了一个毒瘤，长的部位没有办法用药，而且非常严重。他告诉这个病人：你这个病没关系，不会要命的，用不着吃药。他指出另外一个部位告诉他：你要小心这个地方，如果这个地方有病，就要送命。他回家去，那里不注意，现在注意这个地方，没多久，说要注意的地方问题出来，他害怕，又去找医生。医生说：好！现在有办法了，原来你害病的部位药力达不到，那是要命的，现在是你自己用精神的力量换了一个部位，这个部位好用药、好动手术；马上就给他治好。可见精神力量非常大，能够改造生理。<br/>我过去有个同参，出家的一个法师，他从小出家。大陆撤退时被抓去当兵，在金门当了几年兵，想要退役出家。退不下来，怎么办？装病。天天装心脏病，假装了三年，真的得了心脏病，到现在也没有办法治好。本来没有病，天天装，变成了真的。观想力量之大，确实能够改造自己。<br/>身可改造，环境也不例外。环境就是风水，你心清净，有智慧，风水不好的地方，你到那里去住，慢慢的风水就会变好。境随心转！所以佛教导我们修心，没教我们去算命，没教我们去找好风水；佛不许弟子看相、算命、看风水。只要身心清净，什么境界都随心转变，这多自在！所以最好的风水是在最清净善良慈悲的心地，心地才是好风水。佛法常说「诸恶莫作，众善奉行」，这就是最好的风水。<br/>前七讲，介绍一般的佛学常识，也是说明六道一切众生实际的状况。六道里面有情的众生统统有苦，不自在，所谓是不自由、不平等，所受的都是苦，好比是一种病态的状况之下。我们要是发现有病，一定很快的去找医生，诊断如何恢复健康。我们现在在六道里面生死轮回是大病，为什么不警觉？佛为我们说破，指示给我们看清楚：第一、我们要觉悟，知道三界六道轮回之可畏。第二、要发心，就是要发愿，一定要离开轮回，离苦得乐！不出轮回，就没有离苦；出了轮回，才算是离苦。特别是三恶道之苦，如果不出轮回，三恶道是任何一个人都无法避免的。第三、要明了超越的方法，才能真正离苦得乐。如果真正发心求对治的方法，帮助我们出离三界六道，唯有找佛陀才有办法。宗教不能解决，宗教只能使你生天，天还是在六道轮回之内，没有出离六道；学术也没有法子。如果学术、宗教能够解决得了，佛不会出现在世间。</p></div>"
    },
    {
        "title": "第八讲 内容设施梗概",
        "html": "<div class=\"B1_text\"><p class=\"text-indent\">后面这七讲，是佛法内容大意。第八讲「内容设施梗概」，首先把整个佛法简单扼要的给诸位做一个介绍。从讲表里面，能够看出佛法是什么。先说「佛法总纲」，后面是「佛法大意」；一个说「体」，一个说「用」，作用。</p><p class=\"text-indent\">甲、佛法总纲（体）<br/>体是教学的内容。佛法教学的内容是「戒定慧」，称之为三学，三种学问。佛的经典也是依照这个来分类，称为三藏经典。「藏」，就像仓库一样。律藏是戒学，经藏是定学，论藏是慧学；称为三藏经典，这就是佛门的教科书。修学一定要依教科书，教科书就是释迦牟尼佛对我们的教导。<br/>「戒学」：「防非止恶」，这是戒学的内容。非是错误，指邪知邪见、错误的知见；恶是指行为，种种不善的行为。佛家的戒律相当于儒家的礼，是基础的教学。孔老夫子当年教学有四科，第一科就是德行。德行用礼来教，所以小孩从小就教他学礼，学着待人接物，学着伺候长者。佛家一开端就学戒律，戒律属于生活教育。从前学佛出家人五年学戒，然后才有资格学经、学论。<br/>诸位要想在佛法里成就，不能不重视戒；因为离了戒，不会有定，戒是手段，帮助你恢复清净心。戒有两大类：一类是自律，完全是对自己、对个人私生活，这一种戒律是小乘戒；另外一类是处大众，属大乘戒。大乘戒也不是要求大家遵守，还是自律，团体当中如何自律，这叫做大乘戒。个人在自己小房间里面如何自律，叫做小乘戒。由此可知，戒律是自律的，不是戒别人的。戒律的目的是使我们得定、得清净心，我们一天到晚拿着戒律的标准去看别人，这个人犯戒，那个人也犯戒，你的心还能定得下来吗？一天到晚看到别人的过失，就是你自己的过失；你自己心清净，见不到别人的过失。古人说：「来说是非者，便是是非人。」说别人犯戒的人，他本身就是个犯戒的人，因为他的心不清净。所以戒学是学佛的基础。<br/>「（藏）属于律部」：在三藏经典里属于律藏。律部就是律藏，专门讲戒学。佛所说每一部经典的内容都有戒定慧，都有经律论的意思，这一部经典里面，那一部分说得分量重、说得多，就归到那一类去。戒律的经典也讲定、慧，但是以戒律为主，戒律讲得最多，就归到律藏。如果这一部经典讲定讲得多，讲戒讲得少；譬如《楞严经》，十卷经文讲戒律不超过一卷，讲定占得多，占十分之七，就归到经藏。<br/>佛说法四十九年，世出世间一切法无量无边，说不尽，所以学佛的人要有触类旁通、举一反三的能力。「聚」这一条就是佛没说的；佛虽然没有说，可是与佛所说的性质相同，也应当归到这一类；聚是归纳同类。「摄善法」，凡是一切讲断恶修善这一类的理论方法，虽然不是佛说的，也可以因为性质与佛所说的相同，归纳到律藏。佛教的心胸广大平等，并不是我所说的经典就是无上的依据，别人所说的不行，佛不说这个话。甚至于外道所讲，只要符合这个原则，都可以归纳。「诸恶莫作，众善奉行」，这是戒律一类，可以归纳。<br/>「定学」：定的意思是「息虑静缘」。禅定是佛法修学的总枢纽八万四千法门只是修定的手段不同，全都是修定。念阿弥陀佛修一心不乱，一心不乱就是定，他是用念佛名号这个方法来修定；参话头是一种方法，持咒也是一种方法，没有一个法门不修定。戒帮助你得定，不持戒，心是放逸的，心往境界上跑，戒帮助你把妄心收回，成就大定。孟子说：「学问之道无他，求其放心而已。」你的心一直在外头境界上攀缘，要把它收回来。戒律教你不贪、不瞋、不痴，教你不杀生、不偷盗、不邪淫，什么样都不准，心收回来，身心逐渐清净；戒帮助你修定。定的要领是息虑。虑是妄想，息虑是把所有的妄想息掉。缘是攀缘，静缘是把攀缘静下来。要止念头、不攀缘，一切妄念要止住，外缘决定不能攀。不可以讲求应酬，现在的佛法是应酬的佛法，一天到晚都攀缘，这是不能成功的。大经里面讲「庄严佛国土」，是以清净心庄严。大定才是真正的庄严，身心清净一尘不染。<br/>「（藏）属于经部」：在三藏经典里属于经藏。见到「经」这个题目，偏重在定学。「（聚）能引功德」，虽然不是佛说的，这种理论方法能够帮助我们得定，也可以看作是经典。功德就是禅定，决不是在佛教寺庙功德箱里面放一点钱，这就做了功德，那是错误的。你供养一点钱，与禅定不相干，与般若也不相干。功德是定慧，如果你修行得定，譬如说你得到一心不乱，戒律也是功德，戒定慧都是功德。如果没有得定，戒律持得再好，那是修福，不是功德，功德是一定要达到禅定。我们修学这么多年，有没有功德？福德是不少，没有功德。梁武帝是佛门的大护法，江南一带的寺庙大多数都是他建的，南朝四百八十寺都比佛光山大，度很多人。他问达摩祖师：「我的功德大不大？」达摩祖师说：「并无功德。」达摩祖师的话是老实话。梁武帝把福德当作功德，误会了。如果他问达摩祖师：「我福德大不大？」达摩祖师一定说：「甚大！甚大！」福德跟功德一定要分清楚，心不清净，没有功德。功德是讲清净心，从清净心里面生智慧。<br/>「慧学」：「去惑证理」。慧是开智慧。慧学里面，有很多一问一答互相讨论、辩论的文字。《楞严经》有不少文字是阿难尊者、富楼那尊者这些人跟释迦牟尼佛的讨论，属于慧学；但是《楞严经》是以首楞严大定为主，所以还是把它编在经藏。去惑证理：破除迷惑，证入真理，这是佛法修学最高的目标。定是慧的手段，戒是定的手段，戒学可以说是手段之手段，属于最初方便。<br/>「（藏）属于论部」：在三藏经典里属于论藏。像《大智度论》、《瑜伽师地论》、《百法明门论》、《唯识三十论》、《大乘起信论》，这一类多半是以讨论的方式来说明真理，破除我们的疑惑，以这个为宗旨，这是属于论部。「（聚）权智摄众」：权是善巧方便，以种种善巧方便，能够摄受众生、帮助教学的这些方法，都可以归纳到论藏。<br/>三藏经典，有佛所说的，有不是佛说的；不是佛说的，只要与佛讲的宗旨不相违背，都可以平等看待。</p><p class=\"text-indent\">乙、佛法大意（用）<br/>佛法大意其实有四句：「诸恶莫作，众善奉行，自净其意」，这是佛门的法印、后头一句「是诸佛教」，这是十方三世一切诸佛教化众生的宗旨。千经万论绝不离这个原则，凡是符合「诸恶莫作，众善奉行，自净其意」的宗旨，都可以看作是佛教的经典。佛门实在是广大，真正能够包容一切法。教学以自净其意为目标，自净其意属于定慧，诸恶莫作、众善奉行属于戒学，帮助你得定、开智慧。佛教教学最重要的就是开智慧；戒定慧又叫做三无漏学，三是三大类，漏是烦恼的代名词，无漏就是无烦恼；这三大类的学问，可以帮助你断烦恼、开智慧。</p><p class=\"text-indent\">丙、二门并修<br/>这一段是对于研究佛法提供一个方法，学佛从哪里下手？提供我们一点意见做参考。「二门并修」，二门是指「解门」、「行门」，二门必须并修。古大德将佛教修行订四个次第：信、解、行、证；证是证果、成就。当然你现在已经信了，信了以后要注重解行；解行要并重，不能偏一边。偏在解，没有行，无法悟入佛法的真实义；要有行，才能真正的理解。只有行，不解，这个行也不能成就；要有解帮助行，行才能成就。所以一定要两门并重，同时下功夫。解门是智慧；行门是功夫，就是禅定。解门是看破，行门是放下。<br/>「解门」：自古以来有两种方式，一个是「阅藏」，一个是「研宗」。「阅藏」：藏是《大藏经》。《大藏经》在宋朝最初编纂时有五千多卷；现在的《大藏经》增加很多，有宋以后翻译的，还有自古以来祖师大德们的注疏。现在最完整的是《中华大藏经》，这是台湾新编的，有几万卷。阅藏是好事情，可惜现代人没有这个福报。从前的出家人，事情少、时间多，每天到藏经楼阅藏；在家居士也可以到寺庙里住几年，在那里阅藏、读书，有福报。现代人不但工作忙碌，而且没有文言文的基础，经典摆在面前看不懂。我们今天最起码也要背一百篇古文才有能力读诵经典。 藏经是课程的标准，我们修学唯一的依据。佛教导我们依法不依人，法就是经典，首先我们对经典要建立信心，不能够怀疑，怀疑就变成障碍。世间人做学问，怀疑的态度非常重要，没有怀疑就不能进步；但是佛法不能怀疑。因为世间学问一直都在摸索，没有达到最高峰，没有一个定论，没有结论。佛法登峰造极，有圆圆满满的结论；怀疑这个结论，就达不到。它是一条正路，是十方诸佛菩萨所走的大道，唯有坚定的信心才能快速证得。现在全世界佛教所遗留的经典，保存最丰富、最有价值的就是中文译本，其次是西藏文译本。这两种文字都是直接从梵文翻译，而梵文的经典已遗失殆尽。 「研宗」：没有阅藏的机会，不得已而求其次—研宗，专门在一宗下手，这也是一个方法。在中国，小乘有两宗，大乘有八个宗派，每一宗派的典籍至少也有一千卷以上，包括经论以及历代祖师的著作，也是有相当分量，要想精通不容易。古人三、五年就能够透彻贯通，因为古人的福报大、环境好。古人在寺院丛林，每天在讲堂里听讲经八个小时，研究教理；还有八个钟点修行，在一块共修，参禅到禅堂，念佛到念佛堂，一天十六个小时解行并重，他有这么好的环境；剩下八个钟点，吃饭、洗澡、洗衣服，忙得不得了，连休息的时间都没有；这种教学使你没法子打妄想。一天上两个钟点课，其余时间都在胡思乱想，不能成功。古人教学方法好，因缘殊胜，我们今天找这个地方找不到，福报不如古人，就是研宗也有相当的困难。 除这个之外还有没有办法？有。不但近代有，古人也有这种情形，一生专攻一部经，这会有成就；不但是行门要一门深入，解门也要专精深入。在近代，江味农居士一生专攻《金刚经》，花了四十多年的时间锲而不舍，写出《金刚经讲义》，这个讲义就变成金刚经注解的权威。自古以来金刚经的注疏他都看过，这个讲义集古今《金刚经》注解的大成。周止菴居士也是如此，一生专攻《心经》，《心经》两百六十个字，他下了四十多年的功夫，《心经诠注》变成自古以来《心经》注解的权威。这个方法值得我们学习。每一宗的典籍几十种之多，十年研究二十种，平均半年读一部，用的功夫很有限，成绩平平；如果十年用在一部经上，这不得了，你这一部经必定出人头地。古人，纵然他是从一宗下手，几乎到他晚年成就的时候，把拉拉杂杂的都舍掉，最后只留一样，变成专攻，所以在解门也是一门深入。诸位一定要记住，解中有行，行中有解。着重学术的，像华严宗以《华严经》为主，天台宗以《法华经》为主，三论宗以《中论》、《百论》、《十二门论》、《大智度论》为主，唯识宗有六经十一论，以《解深密经》、《成唯识论》、《瑜伽师地论》为主，他们也有修行的方法，并不是只解不行。着重在行门上的，也有理解，都是解行并重。 行门里面列举四个宗派： 「律宗」：由持戒这个法门进入，着重戒律。「三业清净」：这是修行目标，所希望达到的目的；三业清净是指身、口、意能够做到清净不染。三业里面最重要的是意业，意要是不染，身口决定不染，意要是染污，身口也会连带的染污。所以律宗不但着重外表，更注重的是内在；外表能影响内在。律宗着重在形式上，一举一动都要合乎法度、合乎规矩，严持戒律。小乘戒律着重事相，小乘戒是论事不论心，外表非常庄严，一举一动都合规矩。而大乘的戒律着重在心地，对外表就不太注重。可是大乘戒比小乘戒难，因为大乘着重在心戒。譬如杀生，小乘戒是起心动念要把对方杀害，断他的命才算是犯了杀戒；可是大乘戒不如是，大乘戒起心动念就破戒，没有伤害对方，起个念头要杀他，戒就破了，所以大乘戒难持。大乘是心戒，论心不论事，杀盗淫妄，起心动念就破戒。小乘戒起心动念不破戒，没有罪，一定要做了事情才算犯罪。大乘戒在起心动念上结罪，所以大乘戒菩萨心地非常清净。 佛说律宗是「正法期成就」。佛陀在世，僧团都是清净的僧团，修行人善根深厚，社会风气非常淳朴，的确是修学戒律非常好的时代。现在的社会修戒律就相当不容易，很难。古时候有专修戒律，佛陀在世时从这个法门入门的很多。在中国，终南山道宣律师这一派专修戒律，称之为律宗。 戒律精严能感动鬼神。南山律祖就是唐朝道宣律师，感动天人供养，他是日中一食，天人每天送饭给他、侍卫保护他。窥基大师跟道宣律师同时代，窥基大师是大乘菩萨，对于戒律在外表上没有那么严格。窥基大师是贵族出身，玄奘大师看他很聪明，要他出家。传说他向玄奘大师提出三个条件：第一、我要带一车的书；第二、我要带一车的金银财宝，要享受；第三、我要带一群美女伺候我。玄奘大师说：行！都可以。于是窥基大师出家，俗称三车法师；他在戒律上就不会那么呆呆板板的。有一次他经过终南山，顺便拜访道宣律师。他名气很大，是唯识宗开山祖师、道宣律师是律宗开山祖师。道宣律师对他有一点成见：虽然是不错，很有学问，经也讲得很好，但是戒律很差，不大守戒；就有一点轻慢心，好像很遗憾，这么好的法师不能够严持戒律。他那天拜访道宣律师；天人每天供养送饭来，那天天人没送饭来，道宣律师饿了一天。第二天，天人送饭，道宣律师就问他：「昨天你为什么没有来？」天人说：「昨天有大乘菩萨在这个山上，满山的护法神都在这儿护卫，我进不来。」道宣律师听了，心里面非常惭愧，原来窥基大师是大乘菩萨，我没把他看在眼里，这么多护法神保护着；我还不如他，我才一两个护法神，他是满山遍野的护法神，害得我的护法神都不敢进来。这才晓得大乘戒跟小乘戒，在戒相上讲不能够同日而语。大乘菩萨在形式上虽然是很随便、很无所谓，心地清净。 「禅宗」：禅宗的目标是「明心见性」。心就是阿赖耶，性是真如本性。本性上起了无明，不觉，心又起了念头，这是根本无明。无明一起来，真如本性就换一个名词叫做心，所以心就是带着无明的本性。明心就是恢愎光明，把无明断除，这时候的心就又恢复它的老名字，叫做本性。明心就是见性，见性就是明心。必须要破无明才能够见性，才能够恢复明心。要想见性，先断见思，再破尘沙，然后再破一品无明，才能明心见性。试问：有没有本事把第一关见思烦恼断掉？这是要讲真正功夫。 参禅，用参话头的方式，或者是观心的方式，这都是手段；第一步的功夫要断见思烦恼，目的是明心见性。三界八十八使见惑，八十一品思惑，要断尽才能够得到解脱，但是并没有大彻大悟，还要继续努力进修，再破尘沙、无明，才能明心见性。明心见性就是三业清净，名字不一样，境界完全相同；性，本来就是清净的。念佛法门里，理一心不乱就是明心见性、就是三业清净，方法手段不相同，达到的目标完全相同。净土法门讲事一心就是禅家讲得到禅定，所以事一心叫做念佛三昧，但是还没有明心见性，要到理一心不乱才是明心见性。 「像法时期成就」：像法是相似法，佛法已经没有过去那么纯。释迦牟尼佛的法运，总共是一万二千年。正法一千年，释迦牟尼佛灭度后一千年之内，佛法还没有很大的变质，相当纯，依照佛的戒法修行，能够达到目的。像法一千年，佛灭度后一千年至二千年当中，佛法起一些变化，变质了，后来的人把他自己的知见掺杂在佛法里面，所以就不纯，这个时候单靠修戒律不容易成就，要修禅定。佛法传到中国来，刚好是佛灭度一千年，佛的法运也正好是禅定这个时代，所以中国的佛法几乎全是禅宗的势力范围。禅，的的确确在中国发扬光大。佛灭度二千年以后是末法时期，末法有一万年。我们现在这个时期是佛的末法时期，末法的初期，在这个时候禅定很难成就，在这个时代要想断见思烦恼不容易。 「净宗，带业往生，末法时期成就」：末法时期净成就。净怎么成就？「带业往生」，这个方法成就。为什么？你没有办法消业障，只有带业往生。佛在《大集经》里说：「法运一万二千年，正法戒成就，像法禅成就，末法净成就。」末法时期修学净土，就是依教奉行。 带业往生不是明心见性，不是三业清净；如果讲一心不乱，那就是明心见性、就是三业清净。在末法时期，我们的业障太重，没有能力断惑，没有能力达到一心不乱；净土的殊胜方便，就是可以带业往生，生凡圣同居土，决定能成就，正是古德所说的「万修万人去」，道理就在此地。一定要懂理论，如理如法修行，才能成功。在末法时期，如果要建立一个真正如法的道场，那就是念佛堂。念佛堂着重行门，就是长年的佛七，一年三百六十天，天天打佛七。过去印光大师在苏州灵巖山就建立这样的道场，天天打佛七，一天六支香，一支香一个半小时，每天九个钟点念佛。他的道场讲开示不讲经，是一个专门念佛的道场。但是在今天这个时代，非讲经不可；如果能够每天两个小时讲经，十个小时念佛，一天有十二个小时解行相应，这才是真正末法时期如法的道场。 「密宗」：密宗讲「三密相应」，口诵咒，手结印，意要观想，三密相应。目的也是明心见性、三业清净。密法是正法、像法、末法时候都有。如果显教不通达，没有资格学密。密是属于加行的，功夫上再加上一点，是这个意思，所以严格的来说，你要学密，先要学三藏经典，对佛法的理论方法境界都明了，才可以用密咒来加持。如果对于显教教理完全不懂，你去学密，那是盲修瞎练，不会成功。 跟真正的密宗上师学佛法，你的教理没有搞清楚，他不会教你密法。我初次见章嘉大师，他传我一个咒，跟我结缘，要我常常念。他教我六字大明咒，把这个咒的意思讲得清清楚楚。为什么呢？才能观想。「嗡」是身，「嘛呢」是莲花，「叭咪」是保持，「吽」是意，所以是身、莲花、保持、意，以中国话来说：保持身心像莲花一样。莲花出污泥而不染，你念咒时懂得这个意思，与身心相应，岂不是三业清净、一尘不染！其实「南无阿弥陀佛」也完全是梵语，意思是皈依无量觉。「南无」是皈依，「阿」翻作无，「弥陀」翻作量，「佛」翻作觉，皈依无量觉。要懂得观想，口里念佛号就跟念咒一样。 希望诸位解门着重一部经的专攻，选择一部自己喜欢的，一门深入；行门还是念佛好。</p></div>"
    },
    {
        "title": "第九讲 方便五乘解脱",
        "html": "<div class=\"B1_text\"><p class=\"text-indent\">前面是把整个佛法概略的介绍，第九讲以下讲解脱的方法，这也是普遍的介绍，介绍之后你自己去选择。先介绍通途的方法，「方便五乘解脱」。「方便」：这是从方法上说，有方正的道理、有善巧的便利，称为方便。「五乘」：适合于众生的根性，分为五种：人、天、声闻、缘觉、菩萨。众生根性不相同，佛是应机说法；你的愿望如何，佛就跟你说什么法，满你的愿望。「解脱」：解就是解开，解除你的烦恼，解除你心里面的结；脱是脱苦，结解开，苦就没有了。解是对烦恼、无明说的，脱是对轮回、生死讲的。解是因，脱是果报。</p><p class=\"text-indent\">甲、契机施度<br/>这一段是概略说出佛为什么用这些方法，他为什么不用一种方法，要用这么多的方法？五乘就是八万四千法门的归纳，归纳为五大类；因为众生根性利钝不同，钝是迟钝，利是猛利聪明。「钝根」的人，「心思昏昧，眼光浅近」，他满足现前的生活，不想将来、不想来世，这一世过得很自在就可以，来世我不知道，我不考虑；我现在在人间，人间过得很好，天上太渺茫，不想生天。像这种人，是小根器的人，志愿很小，没有远大的眼光，只希望解决眼前的痛苦，希望得到眼前的福报就可以；佛也不会舍弃他，也帮忙他。他修世间福报，行，「说世法方便」。「与上法不解」：佛不会跟他讲向上一种的；佛说法无有定法可说，佛说法满足众生的愿望，满足众生的需求，对于根性钝的是这么一个原则。<br/>「利根」的人「心思敏捷」，见闻觉知很利，一看他就明了，一听他就懂得，一闻千悟。他的「眼光远大」，不仅仅是谈眼前的事情，他晓得有将来、有来世，他要求更殊胜的果报，要求究竟圆满的果报。佛遇到这一类的人，「说出世了义」，满足他。「与下法不满」：他不求人天福报，他要求究竟圆满的解脱。</p><p class=\"text-indent\">乙、世间<br/>正因为众生根性不等，所以才有五乘的差别。五乘里面分为世间跟出世间：世间是不超越六道轮回，在六道之内；出世间是超越六道轮回。世间有两种：一种是「人乘」，一种是「天乘」。<br/>「人乘」：有人愿意在人间，人间很好，我生生世世做个人，生生世世都做个有福报的人；这个人志向不大，我们世间人所说的小儿科，胃口很小，一点点他就满足，给他一块糖就很满足，很容易打发。在佛法里面，人乘佛法就是小儿科，轻易的就可以满足他，佛就教给他保持人身、生生世世在人间享福的方法，就是小乘法。<br/>「现世福报，不失人身」：这是他希望达到的目标。我在这个世间有福报，五福临门，生生世世不失人身，这也不错。可是诸位要晓得，福底下还有一个「气」字，有福「气」，有福就要受气！福越大，气越多，不是很圆满的事情，佛法称此为红福，红尘之福。出家人也有福报，清福；他有福，他没气。什么方法能享现世福报、得人身？只要你能够「受五戒」。受五戒，不是找个法师替你受个五戒，就得人身、现世福报，这是假的，没那回事情。受是心地接受，依教奉行，一定要照做，只注重形式是没有用处的。形式上是隆重的举行一个仪式，法师给你做证明，你在佛菩萨面前宣誓，我要依照佛的戒律来遵守、来奉行。宣誓之后要能够做到，要是做不到，你是存心欺骗佛菩萨，罪上加罪。<br/>一定要知道每一条戒所含的精神，以及我们在生活当中什么状况之下应该怎么做。每一条戒都有开遮持犯，犯了戒，还认为自己戒律持得不错，那就错了。譬如不杀生，如果你们男同学去服兵役，派到前方，敌人攻来，我不能杀生，这糟糕了！亡国灭种。你持戒不杀生，你倒不错，你很好，别人遭了殃。在这个时候，戒有开缘，可以开杀戒，不是犯杀戒、不是破杀戒，要懂得这个道理。为什么开，这里面有很深的道理。由此可知，戒律条条都是活活泼泼的，不是呆板的，在某一种情形之下要活用，一定要懂得活用才能谈得上持戒。<br/>「天乘」：这个世间也有一些比较高明一点的人，他知道有天堂，晓得天人的福报比我们人间大，他不满意人间的福报，想要到天上享天福。「胜妙天福」：胜是殊胜，殊胜微妙的天上福报，他想求这个。「误为究竟」：一般宗教徒，祈求到天堂享天福，认为生到天上就永生、就是究竟，这是错误的。天有二十八层天，有三大类：欲界、色界、无色界，都不超越轮回。纵然是无色界非想非非想处天，这是最高的一层，寿命八万大劫，寿命尽了必定堕落，所以天并不是究竟。学佛的人绝不羡慕天堂，可是你想去，佛也可以教导你、帮助你。「行十善」：修十善业是生天的基本条件，可以取得生天的资格。如果要往上升，十善业还不够，色界天要加上禅定，禅定里面还要加四无量心—慈悲喜舍。<br/>人乘与天乘都不究竟，因为没有超越三界，并不是真正的离苦得乐，所以是「偷安小果」。在六道里，人天福报虽然比较大一点，但是仍然在六道里面，不能超越，所以只是小小的果报。可是要记住，三界如火宅，人天福报只能解除眼前的痛苦，得眼前的福报，决不是长远，这是我们应当要警惕的。真正得到永恒的福祉，那还是要讲求出世。</p><p class=\"text-indent\">丙、出世<br/>出世间有三种：声闻、缘觉、菩萨。根性钝劣的是声闻、缘觉，但是比人天聪明多了。他觉悟到三界不安、轮回太苦，总得超越轮回才算是一个了断；明心见性，成佛、成菩萨那太高了，不需要，只要不要轮回就好了，这就是一种钝根。<br/>「声闻乘」：要超越轮回，必须「断见思惑」。见思惑就是烦恼，心里面只要有烦恼就不能超越轮回，因为生死轮回是见思烦恼变现出来的。六道是果，见思是因，有因必有果，断了因，果就没有。<br/>什么是见思惑？讲表末后有附注。「见惑」：见是见解，惑是迷惑；错误的见解，错误的看法。「思惑」：思是思想，错误的思想、错误的想法。<br/>见惑分为五类。一、「身见」：就是执着我与我所。执着身心五蕴是「我」。「我所」是我所有的，这个房子是我所有的，这个田宅是我所有的，这个家庭是我所有的，父母是我所有的，儿女是我所有的我所是身外之物，你认为是你自己所有的，这都是属于身见，是错误的。这个身不是我的，几个人能觉悟到？无我就无烦恼了。所以见惑的根源就是我执，从我执而生的。<br/>二、「边见」：偏见，偏在一边。譬如佛法里讲空有是两边，若执着一种都是堕在一边，不是执着空就是执着有。断常也是两边；譬如有人认为人死了之后，来生还是人，这是常见；有人认为人死如灯灭，死了一切都了了，这是断见；都是错误的见解。这些错误的见解、错误的看法，会引起许许多多的罪业、许许多多的障碍。<br/>三、「戒取见」，四、「见取见」，这两种一般人称为成见，成见很深。戒取见是在修因上的成见，执着成见。见取见是果报上的成见。譬如，认为天堂就是究竟，认为信上帝将来可以升天堂，这就是见取见。要到天堂一定要修十善，不是信了就能去。<br/>五、「邪见」：除前面四种以外，凡是一切不正确的见解都叫做邪见。邪见里面最严重的是不相信因果，拨无因果；因为人不相信因果报应，他什么坏事都敢做。一饮一啄莫非前定，善有善报、恶有恶报，决定有果报的。<br/>「思惑」就是思想上的错误，分为五类：「贪」、「瞋」、「痴」、「慢」、「疑」，都是属于根本烦恼。百法里，烦恼有二十六个，六个根本烦恼，二十个随烦恼。六个根本烦恼就是此地讲的见思惑，贪、瞋、痴、慢、疑、恶见，恶见就是见惑。<br/>「贪」：贪而无厌。「瞋」：瞋恚，遇到不顺心、不满意，生瞋恚心。「痴」：愚痴，对于一切事理不能够明察，颠倒是非。譬如，我们眼前这个社会是灭法的现象，不是佛法兴的现象，每一个大街小巷都有道场，里面有正法，也有不是正法；开庙店很赚钱，于是庙店林立，打着佛教的招牌骗取信徒的财物，这怎么得了！把佛教的形象破坏，这是末法时期的怪现象，也就是佛讲「末法时期，邪师说法，如恒河沙」。「慢」：贡高我慢。「疑」：对于圣教怀疑，对于正法怀疑。现代的人都听骗，讲正法是教学，规规矩矩跟你讲，不相信，认为这个不希奇。如果那个地方开个道场，给你摸摸头就开智慧，就证果；你一定马上就去参加，认为这个快！但是聪明人要想一想，如果摸一下头就开悟证果，诸佛菩萨大慈大悲，每一个人给你摸一下，就什么都开悟了，还要修什么行？佛又何必苦口婆心说法四十九年？我们实在是迷得太深，迷惑颠倒，头脑不清醒，稍微清醒一点就能够辨别邪正，才晓得那种说法都是花言巧语、都是骗人，都不是真实的。<br/>见惑，在三界之内，欲界、色界、无色界，一共有八十八使。思惑，三界一共八十一品。见思惑断尽，就「证阿罗汉」。阿罗汉是印度话，翻作无学；无学就是毕业，所学的东西修完。小乘法里，三界六道毕业，三界六道的因缘断掉，不再受三界六道的果报，这是目标。他「修四谛」法，四谛法是小乘法的总纲领，一切小乘法都不外乎四谛—苦、集、灭、道，修这个法门可以超越三界六道轮回。<br/>「缘觉乘」：声闻是由佛的言教开悟证果的；缘觉就不一定，他比声闻聪明，观察宇宙一切的缘起而开悟。没有佛出现的时候，他自己能开悟，是世间绝顶聪明的人，功夫比声闻深。缘觉能够「断见思习」，习是习气。阿罗汉虽然断见思烦恼，习气还没断；譬如说傲慢，他养成一种习惯，时时刻刻还露出那个习气，可是心没有傲慢。辟支佛连习气都没有，都断掉。「辟支佛」是印度话，辟支翻作缘，佛是觉，辟支佛就是缘觉。「证辟支佛」也有方法，「修十二因缘」。<br/>「自了小乘」：声闻与缘觉不发心度别人，只管自己，称为小乘。如果讲三乘，声闻是小乘，缘觉是中乘，菩萨是大乘。讲二乘，声闻与缘觉归为一类称小乘，菩萨称大乘。<br/>「菩萨乘」：菩萨这两个字也是梵语，翻成中文是「觉有情」。菩萨还是有情众生，虽然有情，觉而不迷。所谓有情就是烦恼没断尽，这个烦恼是指无明烦恼，不是指见思烦恼。等觉菩萨还有一品生相无明没断尽，所以还称菩萨；一定要最后一品生相无明也断尽，这个时候才是成佛。菩萨有五十一个阶级，其实菩萨的阶级是从凡夫概念当中建立，凡夫在迷，迷得重地位就低一点，迷得轻地位就高，菩萨五十一个阶位是这么分法的。菩萨根性利，心量也大。「自行化他，证成佛果」：这是菩萨修学的目标，自己肯修，也肯帮助别人。声闻、缘觉只自修，不肯主动帮助别人，众生向他请教，他才肯教，他不会主动找你。菩萨则不然。经上常讲「菩萨作不请之友」，你不请他，他就来了，他会主动的帮助你。<br/>菩萨「修六度万行」，任何法门都修，门门都学。前面我劝诸位学一门，是不是与菩萨法牴触？不牴触。菩萨是一门成就之后，然后是门门都学，样样都学，学的进度就非常快；如果一开端是样样都学，学到最后是没有一样能学成功。所以，入门一定是从一个门入进去，入了门之后，门门都成就。《华严经》里，善财童子给我们做一个修行的榜样，他在文殊会上求得根本智，根本智一定是一门深入，然后出来五十三参，门门都通。这是很好的模范，我们应当效法善财童子。「六度」是菩萨行的总纲领，菩萨无量无边的行门归纳这六门，称为六波罗蜜，这是「普度大乘」法。在佛法里面唯有菩萨能成佛，其他的不能成佛，因为所修的不是成佛之因，只有菩萨所修的才是成佛之因，所以能证究竟圆满的大觉。</p></div>"
    },
    {
        "title": "第十讲 五戒十善",
        "html": "<div class=\"B1_text\"><p class=\"text-indent\">第十讲劝我们修学，从哪里下手？「五戒十善」。这是佛法修学的根本法，无论是三乘或者是二乘，必须以五戒十善做基础。如果五戒十善没有做好，人天资格都没有，他还能成菩萨吗？还能成声闻、缘觉吗？不可能的事情。五乘佛法好像是五层楼，菩萨是最高一层，没有下面四层怎么会有最高一层？所以我们要重视五戒十善，想学佛，想成佛、成菩萨，一定要认真修五戒十善。</p><p class=\"text-indent\">甲、五戒<br/>「五戒」：可以取得人道的资格，就是我们一般讲人格，做人的资格，在六道里取得人道的条件。<br/>戒有五条：「不杀生」是「仁」，「不偷盗」是「义」，「不邪淫」是「礼」，「不妄语」是「信」，「不饮酒」是「智」，这是配合中国固有文化而说。中国的社会是伦常的社会，这是世界上其他国家民族所看不到的。伦是五伦，五伦是讲我们社会的组织，夫妇、父子、兄弟、君臣、朋友，由一个家庭到社会国家，是五伦组织。五伦组织关系非常的亲密，所谓是四海之内皆兄弟，在社会结构上来说非常的完美，这是西方社会所没有的。维系五伦社会的道统就是五常八德，特别是五常，这是道德的基础；就是仁、义、礼、智、信，这五条是中国人基本的道德观念，人人都必须遵守。每一个人从小就要接受这个道德教育，所以一般人一生在社会上所作所为，有这个道德规范着，不至于越轨太大。我们民族在这个世界几千年来能够长治久安，一直到今天还没有被淘汰、没有灭亡，就是靠这个伦常的道统维系着。可是中国人现在是礼丢掉了，法也不遵守，天下大乱！所以我们现在比起西方人差远了，远不如西方人。我们自己应当要觉悟、要负责，把中国固有文化复兴起来。<br/>「不杀生」：跟儒家所讲的「仁」意思相同。仁是会意字，是两个人，意思就是推己及人；己所不欲，勿施于人，这是仁的意思。一切众生，尤其是指有情的众生（动物），没有不爱惜自己生命的，没有一个动物甘心情愿被人杀，被杀是没有抵抗的能力，可是这种怨恨之心不会消失。杀生的人有失仁慈，被杀的众生怀恨在心，念念要报复，这就是佛家所谓欠钱的要还债，欠命的要偿命，冤冤相报没完没了。为什么？两方面都迷。被杀的众生不会想到，过去世我曾经杀他，这是一报还一报；就这样算了，那这个事就完了，就没事；若还要杀他报复是迷，这是没有做还债想。你杀我，我将来有机会再杀你、再报复，报复一次比一次要惨烈。战争是非常残酷的事情，佛告诉我们，杀生招感世间刀兵的劫难。佛法教我们不杀生，不但是不与一切众生结冤仇，同时更是培养自己的大慈悲心。慈悲心是性德，真心里面本来就是慈悲的，养自己的慈悲心。所谓「无缘大慈，同体大悲」，是从不杀生上来培养，帮助我们明心见性，这条戒律有这么大的功德。杀生业障非常重，障碍明心见性，障碍我们得一心不乱。因为一个好杀的人，瞋恨心必定重，瞋恨心重的人，念佛怎么会得一心？修禅怎么会得禅定？所以佛法把不杀生列为一切戒条里第一条戒，是有道理的。<br/>「不偷盗」：不偷盗就是「义」，义是义务，不讲求报酬。对一切众生贡献是尽义务，不需要报酬，这是义；不偷盗接近义。「不与取」就是偷盗；不与取是别人没有同意、没有答应，你就取来，这就犯偷盗。这一条戒也是很不容易受持，我们没有得到别人同意，随便把别人东西移动，都是偷盗；不一定说据为己有才是偷盗，佛经里定义不是如此。我的书放在桌子上，你没有得到我同意，故意把我的书拿到另外一边，让我找不到，就算偷盗。而且戒律订得非常微细，就是一草一物、一针一线，再微小的东西都不可以偷盗。这一条戒是帮助我们修学清净的布施，帮助我们放下身心世界，使我们恢复自性清净心。<br/>「不邪淫」：这一条相当于儒家讲的「礼」。不邪淫是指在家人，不是指出家。人天法是讲不邪淫，出世间法是讲不淫欲，这一点有大的差别。「不妄语」：不欺骗他人，这也是根本大戒。「不饮酒」：这一条戒是属于遮戒。前面四条是性戒，不管你有没有受戒，犯了都有罪。遮戒是防止、是预防，它本身没有罪。譬如喝酒，本身不是罪，但是酒醉之后会做出杀盗淫妄；由此可知，佛制订不饮酒，是防止前面这四条戒。过分的酗酒必定误事，社会上许多犯罪与酒几乎都是关联的。<br/>「开遮持犯」，「遮」是禁止，就是这五条戒决定不能犯。「开」是有开缘，像我前面跟诸位说的杀生，是开缘。在什么情形戒可以开？利益众生的时候。特别是在救度一切众生时，众生有急难，这时候可以开戒。开戒决定不是为便利自己，而是为利益众生；如果不是为了救度众生，而救度众生又不是非不得已时，都不算开缘。要看戒本，才能真正明了每一条戒的戒体、戒相、戒行，以及开遮持犯如何修学，这才谈得上受戒。持戒守法一定要懂得戒律的意义，又要记得戒条的条文，还要理解这一条戒的精神，然后才能够如法的修学。「持」是受持，「犯」是破戒。开缘里面，开戒是持戒，并没有犯戒。佛告诉我们，五戒是「人乘之因」，一生能够依教奉行，必定能够保住人身，来生还是人身，不会堕三恶道。</p><p class=\"text-indent\">乙、十善<br/>这一段是讲「天乘之因」。生天，天人要修「十善业」。他的德行标准比我们高，我们守五条，他有十条，这十条也就是五戒的扩展。<br/>「身三」：身有三条戒。「不杀」就是不杀生，「不偷盗」、「不邪淫」，是五戒的前面三条。「约身如绳，身业清净」：约是约束，绳是绳墨，从前木匠用来打直线；约束自己身，像绳子一样拉得很直。约束自己，身业清净。<br/>「口四」：口业有四种，这是从不妄语里开出来的。第一、「不妄语」：不说假话。第二、「不恶口」：不说粗鲁的话。第三、「不两舌」不挑拨是非。第四、「不绮语」：绮语是花言巧语，话说得非常好听，可是用意不善，都是欺骗人、诱惑人、迷惑人。譬如近代有一些电影、电视、歌舞、小说，许许多多都是绮语，对世道人心有很大的影响；造作罪业，不晓得罪业深重，还认为那是高度的艺术。佛制戒律，教我们「守口如瓶，口业清净」。特别是要修出世间法的，纵然对众生没有害处，也都是些戏论，为什么不多念几声佛号？你要写一部小说，为什么不写一千万声佛号？天天一张一张写，「阿弥陀佛，阿弥陀佛」，写上几十万字，你会成佛，会往生西方极乐世界，这个功德多大！众生迷惑颠倒，没有把事实真相看清楚；真正明白，才晓得世出世间一切法没有比念佛更好的，为什么不多念佛！<br/>「意三」：意业有三种，不贪、不瞋、不痴，这个范围也非常广大。「不贪」：一切恶法不能贪，一切善法也不可以贪；因为贪恶法跟贪善法都是个贪心，只是把对象更换一下而已。在人天乘里，贪一些善法还没有关系，因为他并不想出三界，所以贪心并没有断。对一切恶法不贪，心就清净。「不瞋」：欲界天人还有瞋，贪瞋痴都有；色界跟无色界天人没有瞋，贪跟痴没断，但是瞋恚心已经伏住，种子虽然没断，它不起现行，所以色界跟无色界天人不会发脾气，没有瞋恚。如果有瞋恚心，不能得定。「不痴」：不愚痴。对于一切境界不明事理、不辨真妄，这是愚痴。「防意如城，意业清净」：从前城墙筑得很高、很厚，防守盗贼，我们防意就要像守护城池一样，要谨慎，不可以放逸，不可以大意，求得意业清净。<br/>天人的三业比我们人间清净，道德水平比我们高。这十条是生天的基本条件，不能缺少。如果是只修十善，最高只能到忉利天，忉利天以上，单有十善还不行，还要加修禅定，叫未到定。欲界上面四层天，也要修慈悲喜舍四无量心。若世间根本禅定成就，就生到色界天。</p><p class=\"text-indent\">丙、应辨<br/>第一条是讲因果。「因，有真伪纯杂大小转变」：因，有真有假、有纯有杂、有大有小，所以它会转变。这个转变，譬如真的会变成假的，假的会变成真的，因此果报千差万别。因是这么复杂，所以果—依报、正报，千差万别。为什么要辨别这个？譬如我们现在都是人，这样说起来我们过去生中一定修五戒，现在我们得人身。虽然得人身，每一个人正报不一样，面貌不一样，身体健康不一样，聪明智慧不一样，生活环境差异更大，这是什么原因？真伪纯杂大小转变，非常的复杂，这是应当要知道的。<br/>第二条讲「有漏」、「无漏」。有漏，这里面带着烦恼、习气，漏是烦恼的代名词。有漏为「世间功德」，无漏为「出世间功德」。有漏是「着相求福」，所求的是福报，在修学时着相。这个福报能不能得到？能得到。「离相去障」：高明的人离相，他不求福，他求的是去障，去障就明心见性；那是真正的功德，是真实的功德，这是觉悟的人。真正聪明人，修学跟普通人不一样，一般普通人多半是求人天福报。佛在经典里面为我们讲许多道理、许多方法，连无上正等正觉都可以获得，都能够证得，何况人天福报？这些是小事，只要肯修学，非常容易就能够获得。</p></div>"
    },
    {
        "title": "第十一讲 四谛十二因缘",
        "html": "<div class=\"B1_text\"><p class=\"text-indent\">这是讲出世间的修学要领。「四谛」、「十二因缘」，这两种都是小乘人修行的方法。</p><p class=\"text-indent\">甲、四谛<br/>「谛」：就是我们俗话讲真理，谛实之理，它是实实在在的，决不是虚妄的。有四种，说的是世间因果与出世间的因果。「四谛」是苦、集、灭、道。<br/>「苦」：「身心酬业，患累逼恼」，这八个字就把六道的众生说得清清楚楚。人生的意义、人生的价值是什么？酬业。过去造业，现在来酬偿，造善业得善报，恶业得恶报，讨债、还债、报恩、报怨。觉悟的人，在一生当中把这个东西摆脱掉，逆来顺受，要求超越，人生就有意义。如果在一生当中不能把结业解除，不能超越生死轮回，你想想看，这个人生有什么意义，有什么价值？诸位千万不要被世间名利诱惑。如果照世间人看法，人生三不朽：立功、立德、立言，青史留名；将来这个世界有成往坏空，太空中天天都有星球爆炸，试问那个历史留到什么地方？假的，不是真的。唯有明心见性才是真的，其他都是假的，不要被假的迷惑了，这比什么都重要。无始劫以来我们就迷失了自己，生生世世都搞假的，搞到现在还是目前这个状况，还要不警觉，不得了！我们现在一天到晚想的是什么？做的是什么？拿五戒十善对照一下，我们能及格吗？如果不及格就到三恶道，得不到人身，一世比一世苦。一定要警觉，要办自家的真事，要办自家的大事，什么妄想都不要打，老老实实的念佛。志同道合的同修在一起，如果有机缘，建立道场弘法利生。身心的确是酬业，而我们自己又不会转业，这就苦了。「患累逼恼」：这是说人生这一生的感受，苦；这是讲「世间果」，先说果好懂，因为是现前的感受，我们很亲切的能够体会得到。<br/>「集」：有果必有因，集就是因。果报从哪儿来的？「起惑造业，招集来苦」，这里面有三个字：「惑、业、苦」，这就是六道轮回的原因，六道轮回的道理。为什么会有六道轮回？起惑、造业、受苦，受苦又迷惑，迷惑再造业、再受苦，永远这么轮回。这是「世间的因」。<br/>佛教导我们要觉悟。「应知」：世间的苦果应该要知道。「应断」：招集苦报的业因应该要断掉。能够断，当然就不受这个苦，就超越轮回。苦集这两条是世间因果，这是真谛。<br/>下面两条是出世间的。出世间也先说果，果是什么？灭。「灭」：灭烦恼、灭生死。「结业已尽」，灭尽了。「无生死累」：涅槃、寂静、圆寂，都是灭的意思，把惑业苦灭掉，超越三界六道生死轮回。这是「出世间果」。<br/>果报当然有业因，因就是「道」。道的范围非常广大。「正助双修，能至涅槃」：涅槃就是前面讲的灭，涅槃是梵语，意思就是功德圆满、清净寂灭。如果我们用前面佛教大意三句话来说，「自净其意」是正修，就是修定、修慧，定慧是正修；戒是助修，「诸恶莫作，众善奉行」这就是助修。这完全是从纲领上来说，在实际修行当中是相当的复杂。我们看《华严经》，善财童子正修是念佛法门，念阿弥陀佛，最后的结果是普贤菩萨十大愿王导归极乐。他以念阿弥陀佛这一个法门为主修、正修，用这个法门成就念佛三昧、成就正等正觉；以无量的法门来作助修，当中五十三参，参访许多的善知识，成就自己的定慧，是助修。这一种助修，诸位一定要记住，决不是说遇到一个禅德就跟他学参禅，遇到一个密宗上师就跟他学持咒，那就糟糕，一样都不能成就。所谓参访是亲近这些善知识，听听他讲的，看看他修行的方法增长自己的智慧，绝不受他影响。如果受他影响，把自己的正修破坏，助修也没有了，正助两边都失掉。自己必须如如不动，才有资格参学。看得清清楚楚，样样都晓得，增长智慧；虽然样样都晓得，如如不动，还是一句阿弥陀佛念到底，绝不改变，这就真帮上忙。不动心就帮上定，看得清清楚楚帮上慧，定慧都修了。<br/>参学并不只限于佛门不同宗派、不同法门的这些大德，那为数不多；其实世间各行各业，从早到晚看的这些人，遇到的那些事，都是五十三参。见到这些人事，心里清清楚楚，增长智慧；虽然见到，如如不动，在什么境界都不动心，增长定功。修行，六根接触六尘境界就是道场，在这个道场才成就无上道。正修就是自己选定主修的法门，从初发心到无上道，决定不更换、不动摇。助修就是博学多闻，博学多闻里绝不受影响，要记住这一点，绝不跟人家走；博学多闻是成就自己的定慧。怎么晓得有定、不动心？样样都看、样样都听，在这里头才晓得自己不动心，没有受影响。怎么晓得自己有智慧？样样都看、样样都晓得，人家不问的时候，心干干净净什么都没有，而一问样样都晓得，这是智慧；绝不妨碍自己的清净心。也就是说，在六根接触六尘之处，训练不起心、不动念，不分别、不执着，训练离言说相、离文字相、离心缘相。历事鍊心，要在人情事故里锻鍊，才能成就。所以社会是菩萨的大道场，红尘是道场；菩萨是红尘里开的莲花，一尘不染。正助双修要认识，要真正懂得这个意思。「道」就是道理、方法，超越世间、了生死的这些理论与方法；无量法门、八万四千法门，这一个字都包括了。<br/>在此地苦集灭道是讲小乘—声闻乘；其实苦集灭道是佛法的根本教义，通大小乘。过去天台智者大师有一个小册子，讲三十七道品第一个科目—四念处。四念处是讲智慧，是我们学佛人入门修学的处所。我们一般讲观照，四念处就是基本的观照法。第一、「观受是苦」：以智慧来观察，我们现前的享受是苦不是乐。以为现前享受是乐，那是颠倒、是迷惑；不过是苦暂时离开而已。你感觉到现在还不错，因为现在苦刚刚离开。仔细想一想，我们从生下来岂不是就往坟墓里面走吗？一天一天接近，这种景象非常凄凉，非常可悲；你没有觉察到，还觉得很快乐！做生日还庆祝一番，其实庆祝什么？往坟墓里一天天接近，有什么好庆祝？实在颠倒，没有智慧。佛真是高明，把这个事实真相看得清清楚楚。一天一天接近坟墓，众生迷惑颠倒不觉悟。这个身，一身都是病，还要装扮，还觉得很可爱。最大的病是飢寒之病，天冷不多穿衣服就会冻坏，三餐没得吃就饿坏；三餐是吃药，治饿病。我们所受的，确确实实是苦。第二、「观身不净」：我们这个身体不清净，佛经上说三十六种不净之物造成这个肉身。第三、「观心无常」：这个心是妄心，一会儿想东、一会儿想西，一天到晚胡思乱想。如果心老想一样那就是得定，定在一门上那就是常；我们是一天到晚打妄想。第四、「观法无我」：我，是主宰的意思、自在的意思。一切法里面没有主宰，不自在、不自由、不平等。不自在，无我；如果真有我，自己能做得了主宰、能自在的话，诸位想想，哪一个人不喜欢长生不老？哪一个人不喜欢年年十八？做不到，自己不能主宰自己。这是智慧观察，能这样观察就觉悟了。智者大师把四念处解释得很详细，告诉我们藏通别圆四教都有四念处，四种念处境界不相同。四教也有四谛，这个地方是讲藏教四谛，就是小乘法；通教有四谛、别教有四谛、圆教有四谛，细说说不尽。<br/>「三转法轮」：这是佛的教学善巧。「示、劝、证」，这是「三转」。「示」：是指示，根性利的人一听就明了、就觉悟。譬如佛说：「此是苦，逼迫性」；「此是集，招感性」，招集感受的苦报；「此是灭，可证性」；「此是道，可修性」；都从性体上说，「上」根人一听就明了。「劝」：中等根性的人，跟他这么说，他虽然听见，好像与自己毫不相关，耳边风一样，所以必须要劝他；告诉他：我说的话不是说给别人听的，是说给你听的，你要特别注意。底下加劝勉的话，譬如，此是苦，你要知道。表解里，应知、应断、应证、应修，都是从劝修上说。这是对「中」等根性人说，意思就很亲切了。「证」：根性劣一点，「下」等根性的人，虽然劝我，我行吗？我能办得到吗？对自己没有信心，是不是我们都能做到？佛末后现身说法，给我们作见证，作证转。佛以自己为例：此是苦，我「已」经知道；此是集，我「已」经断；这意思是我知你也能知，我可以断你也可以断，我能够证得，你也能够证得，我可以修你也可以修。这么三劝，一而再，再而三，三劝如果都还不动，佛就没法子。如果三劝能够回头，佛菩萨必定来；三劝不能回头，佛菩萨不来，来了也没用处，白跑一趟，白费口舌。我们通常叫做三转四谛法轮。</p><p class=\"text-indent\">乙、十二因缘<br/>十二因缘前面介绍过，此地特别注重十二因缘的修法。十二条是连环的，里面有一个断掉，就统统断掉；所以缘觉所用的方法比声闻要巧妙。十二因缘里面有因有果，果上不能了断，一定要从因缘里面断。十二因缘讲三世因果，过去、未来的因果我们没法子断，我们不能回到过去，能断的范围只有现在的因果。现在果不能断，现在的因缘只有三条：「爱、取、有」，这三条断一条就证辟支佛，就成功了。如果是修学大乘法门，净土念佛是大乘法，能断一条，马上就证得一心不乱，成就念佛三昧。我们能不能在一切法里把爱心断掉？这个爱是贪爱，这一个字就是见思烦恼—贪、瞋、痴、慢、疑、恶见，一个爱字代表这些，把爱断掉得事一心不乱。事一心就是断见思烦恼，理一心是分破无明。<br/>十二因缘有「流转」、「还灭」二门。无明缘行，行缘识，识缘名色，互为因果；无明是因，行就是果；行是因，识是果；识是因，名色是果。到末后，老死是因，无明是果，它又转回来，永远是循环的。按照顺序去「流转」，这就是六道轮回；如果颠倒过来，称为「还灭」门。为什么有老死？因为有生；没有生，就没有老死。没有「有」，就没有生；没有取，就没有「有」，没有爱，就没有「取」。这里面断一条就全断，三界系缚就得到解脱。「流转生死门」，相当于四谛的「苦集二谛」；「还灭涅槃门」，相当于「灭道二谛」。</p><p class=\"text-indent\">丙、三界迷谛<br/>这一段是附注。「三界迷谛」：三界指欲界、色界、无色界，谛就是四谛—苦集灭道；世出世间的因果，我们统统都迷了。迷了之后才「起见惑」，有八十八使；「起思惑」，就是错误的思想，有八十一品。见思烦恼变现出六道生死轮回，因为有惑，惑是迷惑，迷惑以后就妄动，妄动就是造作，造作就结业，业力变现出六道的果报。「身心酬业」，这个话说得非常的真实。真正明了了，我们在这一生际遇当中要像大修行人，他们对人生的态度无不是逆来顺受、随遇而安，纵然受苦也甘心乐于接受，不会打妄想去换个境界，想去找一个地方摆脱掉，不做如是想。为什么？摆脱不掉。有这个业，怎么能摆脱掉？譬如欠人家钱，想躲一躲不还债，那不行；现在不还，将来还是要还，没法子！那干脆还清好了，还清就自在，所以不逃避，愿意受。受里面，改造他的业，断恶修善，在业因上下手，这样确实能够改变果报，这是有智慧的人所做的。<br/>「断尽证果」：不断尽不能证果，一定要断尽才能证果；八十八使、八十一品，一品都不能留。而断的顺序一定是先断见惑八十八使，八十八使见惑断尽，小乘就证初果。能把八十八使见惑断尽就得保障，虽然不出三界，在六道轮回里，决定不堕三恶道。所以小乘证得须陀洹之后，在六道里面只有人天两道，不会堕三恶道，而且从此以后天上人间七次往来，一定证阿罗汉果。有许多学佛同修常常来问：菩萨五十一个位次，我们现在能不能算初信？五十一个等级，我们算一年级行不行？给诸位说，不够资格。见惑八十八使断尽算一年级，标准从这边算起，这是圆教初信位的菩萨。圆教七信位的菩萨相当于阿罗汉，因为思惑也断尽。天台四教仪、贤首五教仪都说得很详细。<br/>「声闻断事，缘觉断习」：习是习气。习气很难讲，古人常常用酒瓶来作比喻。把酒瓶里的酒倒掉，倒得很干净，里面也洗得很干净、擦得很干净，确实没有酒了，闻闻还有味道，那就叫习气。阿罗汉见思烦恼确实断尽，但还有习气在。缘觉的功夫比阿罗汉高，连习气都没有，都断掉。</p></div>"
    },
    {
        "title": "第十二讲 六度万行",
        "html": "<div class=\"B1_text\"><p class=\"text-indent\">甲、六度<br/>这一讲是大乘佛法。大乘包括的范围非常广大，归纳修学的纲领就是「六度」。为什么要归纳这六条？实在说，所谓佛法是建立在相对的基础上，也就是众生有病，佛法就好比是药物一样，众生没有病，也就没有佛法，因此，「法」不可以执着。《金刚经》告诉我们：「法尚应舍，何况非法！」有病的时候，需要这个法；病好了，这个法也不能要。<br/>在这一表里面，先来看看我们有些什么病？这一定要搞清楚。第一是贪病，「贪悭」，这是病根，可以说无量无边的烦恼业障、生死轮回，都是从它而来的；包括后面的恶业、瞋恚，乃至愚痴，都离不开贪悭。因为它是一切病的根本，所以菩萨修学是从根本来拔除，得用个方法来对治它。我们晓得这个病的严重，就要认识对治的方法，而且要有效的运用方法来对治这个毛病。「贪」是贪求，凡夫欲望没有止境，不但对于世间名闻利养、五欲六尘贪而无厌，连三界之外的佛法也贪图。佛法，断掉贪心才能得到；用贪心来贪求佛法，结果是增长烦恼，不会得到的。所以学佛要去贪心，不能用贪心来学，不可以用贪心来求。悭吝与贪可以说是同类的，已经得到的不能放下，叫做「悭」；这都是我们的病根，佛法处处教我们看破、放下。什么叫做迷？什么叫做悟？所谓迷，不知道贪悭是病，认为是应该的，是一桩好事情，这就是迷惑。觉悟了，知道它是病根，它给我们带来无尽的苦难，如果真正从心地里面把悭贪拔除，就成佛。无量的烦恼可以归纳为一百零八类，百八烦恼；《百法明门论》再归纳为二十六种，二十六种再归纳就是六个根本烦恼。六个如果你还嫌多，还可以归纳为贪瞋痴三毒烦恼。因为有这三毒，心里头有毒素，果报就是生死轮回。三毒烦恼，哪一个最严重？如果再把它归纳成一个，就是悭贪。所以菩萨行法把布施列在第一条，布施是对付悭贪的。<br/>「布施」有三大类。第一、「财物」布施：财分为内财与外财。外财是身外之物，如金钱、物品等。内财是身体，譬如当义工，以劳力、智慧、技能，为社会大众服务，这是内财布施。一切所有内外之财，能施与有所需的众生，称为财物布施。自己有的，如果别人有需求，能舍，能够供养别人，能够赠与别人，心地清净无有贪念。布施就是舍、就是放下；能舍，你就得清凉、自在，就开智慧。第二、「诸法」布施：诸法包括世出世间法；世出世间法，自己知道的乐于教导别人，称为诸法布施。你所懂得的，有人来向你请教，尽心尽力把你所知道的都教给他，不吝法。你知道十分，只教他三分，他所懂得的永远不能超过你，这是吝法，悭贪心没有断。第三、「无畏布施」：众生遭遇灾难危苦，心生恐怖、畏惧，你能够帮助他，使他远离恐怖，身心得到安稳，称为无畏布施。这三种布施，如果没有把悭贪心断掉，这个布施不能称为波罗蜜，只是布施而已。修这三种布施得福报。财物布施所得的果报是财物不缺乏；以钱财布施，得大富。世间富贵之人从哪儿来的？修财布施而来的。法布施得的果报是聪明智慧；世间人有智愚不等，不平等是果报，因为过去生中修的法布施不一样。修无畏布施得健康长寿的果报。吝财得贫穷的果报；吝法得愚痴的果报；不能行无畏布施，身体多病，寿命不长。<br/>布施涵盖了一切佛法，佛陀教人不外乎财布施、法布施、无畏布施；我们日常生活中所修学的不超越这三大类，能够以清净心、真诚心，服务一切众生、服务社会、服务人民，而不求利益，这是布施。佛菩萨能施，因为知道身心世界无所有、不可得。世间人不肯布施，以为身心世界是真有，在这里面贪而无厌、患得患失；只知道为自己，不晓得为众生。<br/>修布施的功德，略举两种：第一种「除怨」；第二种「不乏」，财物、诸法、身心健康长寿，样样都具足，不会缺乏。除怨也非常重要，世间人常讲，一家饱暖千家怨！你家里发大财，为富不仁，不能够帮助别人、救济别人，你这一条街的邻里乡党对你都怨恨。你家里遭小偷，人家看到小偷去偷也不会报警察，偷得好：他家里有东西，多偷他一点。你家房子要被火烧了，人家也不会来救，烧得好。你要是有财富，常常布施别人，常常救济别人，大家对你不但不怨恨，而且尊敬你。为什么？因为你发大财，大家都有好处；你肯周济这些邻里乡党，多做这些慈善福利事业。布施所得到的功德利益还不只这些，前面两条都是讲世间的利益，不是讲佛法；佛法的目的是除障，是「去障」，不在乎除怨、不乏。如果目的是施一得万报，这是世间的果报，不能超越三界，不是得到究竟的功德利益。如果想超三界、了生死、明心见性，要除障。学佛的人修布施的目的是要断悭贪之心，财布施决不是求财富，法布施决不是求智慧？无畏布施也不求健康长寿，求去除自己的病根。如果目标在这上面，这就是布施波罗蜜，才算是六度，度越悭贪烦恼。所以我们一定要懂这个意思，决不能够停止在除怨、不乏，那是得世间果报，不能超越三界。世间果报享完还是要堕落，因为世间福报是享得尽，世间法是无常的，不是永恒的，我们一定要觉悟到。<br/>「持戒」：持戒对治「恶业」。凡夫起心动念、一切的造作，无不是恶业。前面说过，起心动念无不是业。业里面尤其可怕的是恶业，恶业的果报在三恶道。我们不想得三恶道的果报，一定要把恶业断除；不造恶业，当然就不堕恶道。除恶业用什么方法？持戒。持是保持不失，戒是戒律；戒律是善业，是恶业的反面。戒律也归纳为三大类：第一、「律仪」戒：律，有条文规定，像法律一样，譬如五戒、十戒、菩萨戒、比丘戒，都有条文；仪是讲威仪、仪态。戒律里面关于威仪的地方非常之多，威仪就是小节；连小节都不犯，这叫不犯威仪。也就是说，礼节、规律是在生活当中要遵守的。第二、「善法」戒：一切善法，对自己身心有利益的，可以增长善根的，虽然戒律里没有，我们要遵守，也算是持戒。第三、「益众」戒：对于自己身心没有好处，可是对于众生有好处，是利益众生的，菩萨也应该舍己为人；这是属于菩萨戒，菩萨能够牺牲自己、成就别人。持戒的功德是「清凉」、「解脱」。能持戒的人，心地清凉、烦恼少。解脱是自在，戒律清净，就得自在。由此可知，戒律不是约束人，而是真正教我们得到自由自在，把我们一切无明、烦恼除掉。<br/>「忍辱」：忍辱对治瞋恚。「瞋恚」：在三毒里面这是非常重的一种烦恼，果报也非常可怕，悭贪是饿鬼道的业因，瞋恚是地狱道的业因。佛法常讲「火烧功德林」，这个火就是瞋恚之火，功德指定慧；一发脾气，定没有了，慧也没有了，定慧都烧掉；福德是烧不掉的，功德烧掉了。功德能断烦恼、能破无明，如果瞋心不断，我们烦恼、无明一定会增长。为了要拔除这个病根，菩萨修忍辱波罗蜜。六度里面只讲忍，辱是翻译经典的大德加上去的。中国人很有耐心，能忍；可是有一桩事情不能忍，「辱」不能忍。「士可杀，不可辱」，杀头可以忍，没有关系，侮辱不能忍。中国人自古以来把辱看得很重，翻经的祖师大德认为辱都能忍，还有什么不能忍？忍加上辱，这是专门对中国人说；能忍辱，那就无有一法不能忍。忍要有智慧，而不是强忍。忍辱，不把需要忍受的放在心里，忍辱波罗蜜就广大而无有边际，都把它化成智慧，都把它变成禅定。<br/>忍辱，分为三大类：第一、「人害」：别人想尽方法障碍你、伤害你，你要能忍，一定要明了这里面的道理。那个人为什么障碍我、伤害我？他为什么不障碍别人、伤害别人？佛门常说：「一饮一啄，莫非前定。」他伤害你是果报，果之前一定有因；如果真正觉悟到这样，我们忍受可以做还债想，这一笔债务还了，再也没事了。菩萨在世间是个觉悟的人，菩萨会不会受到伤害？会。躲不躲避？不躲避，他知道这个债一定要还，躲不过的。安世高在中国还了两次命债，《高僧传》记载得很清楚，他有神通、有他心通，有能力躲过，不跟冤家债主见面就行，害不了他。但是，他还故意到那个地方去被他打死，还了命债。以后再投胎到人间，再去跟他见面，变成好朋友，冤债解除。这不是凡人能做得到的。凡人迷惑颠倒，于是冤冤相报没完没了；觉悟的人，样样事情都给你了断，绝对没有报复的念头。《金刚经》有一段忍辱仙人的故事，歌利王割截忍辱仙人的身体，那是一种凌迟处死，拿刀一刀一刀慢慢割，这种刑罚非常残酷，受刑的人非常痛苦；这是「人害」，这位菩萨能受得了，没有瞋恨心，所以忍辱波罗蜜圆满。你们发心修菩萨道，一定有这一天；就好像你读书，必定要经过考试，考试满分，忍辱波罗蜜圆满了。人家无缘无故的对付我们、伤害我们，都没有瞋恚的心，这是圆满的忍辱波罗蜜。别人对你一点点伤害，你都受不了，你还学什么菩萨道？<br/>第二、「世苦」：世间的苦难要能忍受。飢寒之苦，物质环境上缺乏之苦，都要能忍受。这也是属于自己的业力，譬如财物缺乏，过去生中没有修财布施，今天得的果报样样缺乏，是因果相应，我今天受这个贫穷也是应该的；看到别人富足，前生修财布施，他得财富，他今天享受是应该的。觉悟的人不怨天不尤人，晓得因果相应。如果想改善自己的环境，就修因，不必去羡慕别人。我们要想得财用，多多修财布施，财用决定不缺乏。没有修布施，这一生许许多多的欠缺一定要能够忍受。<br/>第三、「修法」：佛法的修学要能忍耐。佛法的修学要无量劫的时间才能成就，你要有耐心，没有耐心就不能成就。忍辱仙人专修忍辱波罗蜜，修五百世；以中国人算法，一世三十年，修五百世，这个时间相当长，才能把忍辱波罗蜜修圆满。所以我们修学要有耐心、要有恒心，锲而不舍才能有成就。大多数的人退堕，都是因为没有耐心。古人亲近一个老师，至少都在十年以上。《高僧传》里，亲近一个善知识二十年、三十年的很多。师友具足，同学互相切磋，老师指路，才能成就。修法要有耐心，无论行门、解门，都要有相当的耐心。像江味农居士、周止菴居士，一生在一部经上用四十年的时间，不简单，所以人家的成就不是偶然得来的。任何人有这样的毅力、耐心，都会有成就。古人说得好：天下无难事，只怕有心人。有耐心、有忍辱的心，就会成就。<br/>忍辱的功德：第一、「不失」：《金刚经》虽然讲六度，特别强调布施、忍辱，布施是能修功德，忍辱是能保持功德，不会让它失掉。第二、「成就」：保持就能成就，世出世间法都能成就。俗话说：「小不忍则乱大谋。」世出世间法的成就都要靠耐心，要能够忍耐，无论做什么事情，不要冲动，要缓慢，循序渐进，才能成就。现代人急躁，什么事都要快速，弊病很多。忍辱是除「瞋恚」障，能够做到除障，忍辱波罗蜜就成就。所以修学菩萨道的人，修忍辱度，度瞋恚这个障碍。<br/>「精进」：精是得其精华、纯而不杂；进是进步。天天求进步，儒家讲日新又新，佛法讲精进，永远进步。精进也分为三类。第一、「披甲」精进：这是比喻，古代打仗，士兵披盔甲冲锋陷阵，现代战争战车列在第一线，也是披甲精进；这是比喻勇猛的意思，没有畏惧，向前精进。如果自己肯努力，什么样的障碍都障碍不住我们。什么东西能障碍自己？懈怠懒惰障碍了自己，外面的力量是没有办法障碍的，无论顺境逆境都不能障碍，就怕自己懈怠放逸，那就没有法子。第二、「摄善」精进：这是讲精进法的内涵。我们的精进，要向一切善法去追求、去努力，千万不要向恶法精进，那就坏了。断一切恶，修一切善，这是佛教导我们的精进法。第三、「利乐」精进：于一切众生有利益，一切众生能够得到乐受，这个事情我们要努力去做。诸位要晓得，令一切众生真正得到福利安乐，就是佛法，这是真实的利益、真实的安乐。我们自己要努力修学，要把佛法发扬光大，介绍给一切众生，帮助他修学，这是精进波罗蜜。<br/>精进的功德是「增善」、「不退」。增长一切善法，使不退转，这是我们现前得到的利益。能增善、能不退转，「懈怠」的毛病自然就断掉。懈怠懒惰是一切众生无始以来的烦恼，可以说是先天的烦恼，不是后天学来的。这个烦恼非常的严重，使我们世出世间法的修学都不能成就，都不能够圆满，所以这个毛病一定要想方法来对治克服；能克服，一定能成就。但是用什么方式克服，每一个人并不一定，自己要晓得这个病，要知道选择某一种方式把这个病克服。我是用上台讲经的方法，对治懈怠。因为刚上台讲经时，讲一个小时，差不多要准备二、三十个小时，没有那么多钟点认真去准备，下不了台；一个星期讲一次、两次，一点都不敢懈怠。所以懈怠是严重的障碍，自己一定要想方法对治。<br/>「禅定」：这是大乘佛法修行的关键、枢纽。前面四种都是为修禅定做前方便。你放不下，不能得定，你有恶业、不能忍辱、懈怠懒惰，也不能得定，可见得前面所修都是为禅定做预备功夫，禅定才是真正主要的修学。首先要懂得禅与定的定义，「禅」这个字是梵文音译，「定」是中国字，定的意思与印度禅那的含义很接近，所以古人翻译就把这两个字合起来，这种翻译法称为梵华合译。禅的意思是不着相，《金刚经》所讲「不取于相」，这是禅；「如如不动」，这是定。禅定并不是天天盘腿面壁打坐，那是坐禅；禅定范围广大，这不过是修学禅定的第一种而已。这一种便利于初学，但是初学者心很散乱，叫他坐在那里身不动，心在动、打妄想，还是不行，那没有用处。禅定着重心不动，身要动；身是一部机器，机器不动就不能发挥它的功能，所以机器一定要运作，身要动；心不能动，因为心本来不是动的，心是非有非无。佛法常用圆（法轮）来表法。圆周要动，圆周不动的话，圆就不起作用，我们今天一切的文明，可以说都是圆带动的；但是圆心动不动？心不动。所以禅定着重在心不动，身要动。<br/>六祖大师在黄梅八个月，他修的禅定就是这种功夫。黄梅那时住一、两千人，他每天替常住工作，舂米劈柴，身一天到晚要动，没有休息，心不动。他在黄梅八个月是真正在那里修禅定，所以五祖把法传给他，而不传给天天在禅堂里头面壁，一坐好几天都不动的、不倒单的。《六祖坛经》实在了不起，这本书是中国人自己说的，不是从印度经典里面翻译过来的，它的内容几乎是包括全部佛教的原理原则，把一部《坛经》念通，所有大小乘法全部都通达，这是非常好的书，是我们中国的国宝。希望诸位认真去学习、体会，知道什么叫做禅；禅应用在生活上，行住坐卧、穿衣吃饭，没有一样不是禅。表现在艺术上，像中国的绘画、书法、雕刻、美术，都带有非常浓厚的禅家色彩，这就是禅的艺术化、禅的生活化，使我们整个生命都变成禅定。从禅定里透出的智慧称为般若智慧，是真正的智慧，不是从心意识里，不是从分别执着、思惟想象里产生的智慧，是从定中自然显现出来的。<br/>禅分三大类。第一、「世间禅定」：指四禅八定。这一种禅定修成之后果报在四禅天、四空天，色界、无色界，三界里面最为殊胜。第二、「出世间禅定」：佛学名词称为九次第定，就是第九定。前面八定是世间的，色界有四种禅定，无色界有四种禅定，一共是八种，禅定功夫有浅深不一样。定功更深，再往上超越，就是第九定，第九定是属于出世间的，超越三界六道。第九定指小乘的阿罗汉，阿罗汉与辟支佛所修的是出世间的禅定，乃至于诸菩萨们所修也是出世间的禅定，都超越了世间。第三、「上上禅定」：是诸佛与大菩萨们所修。如果将范围扩大来说，凡是能见性的禅定都可以称为上上禅，六祖大师所修所传的就是上上禅定。唯有上上禅才能明心见性，出世间的禅定虽然能够超越生死轮回，不能见性，所以一定要修上上禅。上上禅的原理原则都在《坛经》里面。<br/>禅定的功德是「静虑」，静虑是我们现前就能得到的好处，身心清净；虑，头脑清楚，不迷惑颠倒。心清净、头脑清楚，这是禅定的好处。它能成就一切世出世间法，对你的学业、事业，都有很大的帮助，这就是禅的生活化。更殊胜的功德是「见性」，明心见性。禅定是佛法修学的重心，八万四千法门、无量法门，都是修禅定，不修禅定不能称为解脱门，不修禅定不能见性。为什么有这么多法门？法门是方法、手段；修禅定有无量无边的方法，并不只有盘腿面壁，盘腿面壁是无量无边的方法里的一种。念佛也是禅定，一心不乱就是禅定，事一心不乱就是出世间的禅定，理一心不乱就是上上禅定；用念佛的方法来达到，所以念佛也是坐禅。坐禅，《坛经》说：心不动，名为坐；心不执着，名为禅。除障—「散乱」：散乱就是精神意志不能集中，这是障碍。精神意志不能集中，智慧不能现前，这也是大病，要用禅定的方法来断除。<br/>「般若」：这是佛法修学的目的。禅定是手段，前面四条乃是手段之手段，关键的手段是禅定，因定开慧。智慧是从清净心里面生的，智慧是从定中生的；心要是散乱，决定没有智慧。般若有三种：「实相」、「观照」、「方便」。实相是体，是般若智慧的本体。观照是自受用，是自修自证。方便是教化众生，善巧方便。<br/>般若的功德是「大觉」，大觉就是成佛，圆满彻底的觉悟。自觉之后一定要「度他」，要帮助别人觉悟。去障—「愚痴」。愚痴就是根本无明，根本无明断尽就成佛。成了佛，连等觉菩萨也能度，度生圆满；九法界有情众生，他都有能力教化，而没有障碍。<br/>六度，如果不能除障，就不叫做「度」，那是修六种福，布施、持戒、忍辱、精进、禅定、般若，统统是福报。如果能除贪悭、恶业、瞋恚、懈怠、散乱、愚痴，这才叫做六度、六波罗蜜。儒家三达德：大智、大仁、大勇，与佛法讲的六波罗蜜非常接近。布施、持戒是大仁；布施是能够推己及人，持戒能够令一切众生欢喜，对你不恐怖、不会害怕，因为持戒的人不会伤害任何人。忍辱、精进是大勇，禅定、般若是大智，岂不是智仁勇三达德具足！这是菩萨修学的纲领，可见得佛法没到中国来之前，儒家所修学的接近大乘教义。</p><p class=\"text-indent\">乙、万行<br/>六度展开就叫万行。行，是动词。万行就是无量无边的行门，修行的方法。无量无边的行门，用四弘誓愿全部把它归纳。四弘誓愿里面最重要的就是第一条，这是真正的大愿，「众生无边誓愿度」；度就是帮助、服务，服务社会、服务众生。这是大乘佛法的本愿，我们要利益一切众生；其余的三愿是为了圆满第一愿。你要度一切众生，你自己一定要成就德行，一定要断烦恼；如果你不断烦恼，你去度众生，恐怕会被众生度去。我们为什么要断烦恼？是为了要救度一切众生，才断烦恼。断烦恼是修德，是德育；学法门是智育，是求学问。断烦恼是品德的修养，学法门是智慧、学术的修养。这种努力精进为谁？不是为自己，是为了一切众生。看到一切苦难的众生，我们要去帮助他、援助他；自己没有高尚的品德、深广的学术，你拿什么去帮助人？菩萨一切的修学不为自己，而是为一切众生。你们要问生命的意义与价值，从这个地方可以看出来。唯有菩萨，生命才真正有意义，他为一切苦难的众生而为，为一切苦难的众生不休息，绝非自私自利。为一切苦难的众生，自己修布施、持戒、忍辱，断烦恼，为一切众生学无量法门。所以第二条「烦恼无尽誓愿断」，第三条「法门无量誓愿学」，都不是为自己。末后一条，那是积极到了尽头，「佛道无上誓愿成」。为什么成佛道？因为还要度等觉菩萨，还要帮他的忙，你要是不成无上佛道，等觉菩萨也是众生，他最后一品生相无明没破，这忙帮不上，你度众生的愿就不圆满。由此可知，四弘誓愿实际上是一愿，为了完成度众生的大愿，才有后面的三愿；先成就自己，再帮助别人。<br/>「此名四弘誓愿，然能行此四句，万行可谓尽包，枚举不胜其烦。」能够把这四句的意思明了，真正努力去做到，菩萨的行愿全都包括在其中。所以学佛先要发大愿，没有大愿怎么会有大行？没有大愿怎么会有真精进？所以大行、大精进，都是以大愿为基础。这是把大乘佛法—「菩萨乘」简单的介绍出来。<br/>第十、十一、十二这三讲，是佛法一般的纲领，所谓是通途法门；第十三讲表介绍特别的法门。特别法门跟普通法门究竟有哪些不一样？特别在什么地方？这是我们要留意的。通途法门，一生要成就确实不容易；但是我们在佛法上要获得真正的成就，特别法门可以帮得上忙。佛法要专攻，才能成就。</p></div>"
    },
    {
        "title": "第十三讲 行门中一特别捷径",
        "html": "<div class=\"B1_text\"><p class=\"text-indent\">捷径就是近路，成佛最近的一条道路。近路，实在讲它是大乘法，大乘比小乘要快得多。在大乘法里，禅是捷径，比禅还要近、还要稳当，那就是念佛法门这一条路。在这一条路里修成就的人非常多，我们在《净土圣贤录》、《往生传》看过很多，近代学佛人往生的例子也不少，可见得这个法门实在可靠。不但历代祖师弘扬，当年佛陀在世也特别称赞这个法门。佛的父亲净饭王，以及他的家族许许多多人，都是修西方净土，这些都给我们很大的启示。<br/>甲、学者感想<br/>「欣羡理论」：一般的学者接触到佛法之后，对于佛法的道理都生起羡慕的心。「解说周详」：佛法经典非常的丰富，博大精深，在理论上、在事相上，解说周详。「方法精细」：修证的方法非常精细，所以有八万四千法门、无量法门。「多趋佛学」：不但是在宗教界里，学术界也非常向往学习佛法。多数人把它当作一种学术来研究，这一条路在世间法里面也能有一些成就，但是对于自己生死大事疏忽了。实在讲，真正能觉悟到自己生死大事的人太少太少，这个事情是疏忽了。疏忽之后，真是苦，这种苦头没有见到、没有尝试到，无法去想象、无法去体会，可是这些苦难就在眼前，佛观察一切众生愚迷颠倒，称之为可怜悯者。要想离苦得乐，唯有自觉。佛菩萨在旁边帮助我们觉悟，如果自己不觉悟，佛菩萨也帮不上忙，也无可奈何！<br/>「畏视实行」：讲到修行，产生畏惧。「断惑难」：惑是迷惑、见思烦恼。佛曾经有个比喻，「四十截流」，流就是瀑布，譬如有四十里宽的瀑布，你能一下子把它阻挡住，使这个水不流，诸位想想这是要多大的力量？比喻断惑真难！「时间长」：断三界八十八使见惑之后，还要天上人间七次往返，才能把思惑断尽，时间实在是长。「三僧祇劫」：中国人算万万为亿，万亿为兆。以兆做为单位，上面是一千，底下有八个万，一千万万万万万万万万兆，这是一个阿僧祇。劫，是时间单位，大约是一千六百多万年。还要乘三倍，三个阿僧祇劫，这个数目字确实是天文数字。要圆满佛果，须经历三大阿僧祇劫，时间太长了。「尝疏学佛」：疏忽修行。在佛学学术上去钻研，疏忽修行，这种修学法「等于说食数宝」。肚子饿了，说这个菜不错，那个菜也不错，说了半天，肚子还是空空的，这是说食；数宝，就像银行出纳，一天到晚数钞票，都是别人的，不是自己的。我们学佛最怕走上这个道路，说食数宝，与自己生死毫不相关。学佛一定要断烦恼、要转识成智，这才是功夫，才有效果，才有成绩可言。烦恼不断就是说食数宝。<br/>每一个人都想有成就，而许多法门确实有它的困难处，不适合我们现前来修学，所以佛开的法门这么多，就是便利我们选择，选择适合自己的一种方法来修学，这种方法能够帮助自己断烦恼，帮助自己得到清净心。在一切法门里，佛指给我们大方向：正法时期戒律成就，换句话说，修戒律、禅定、净土都能成就；像法时期，戒律成就很难，禅定可以成就，净土可以成就；末法时期，只有净土才能成就。而在净土里，真正能成就的是「带业往生」，这是非常可能的事情。所以我们学佛不能好高骛远、不能好奇骛怪，一定要老老实实的修学、用功夫。特别法门就是特别介绍末法时期的净成就，这是一个特别的捷径。</p><p class=\"text-indent\">乙、门余大道净业<br/>这一段介绍念佛法门的内容。「门余大道净业」：门就是指八万四千法门，八万四千法门之外有一个特别法门；大道就是成佛之道，就是净土净业法门。这个法门又称为二力法门，有「佛力」、有「自力」。除净土法门之外，八万四千法门都要靠自己，才能成就；但是净土法门固然靠自己非常重要，佛也帮上忙。<br/>「佛力」：佛帮什么忙？「示现佛国，宏愿接引」：你的烦恼习气没断，是个凡夫，娑婆世界环境不好，你没有办法修学，不能成就；佛创造一个好环境，供给你修学。你在家里读书很难成就，佛办这个学校可以帮助你，那就是西方极乐世界。有这么好的所在，佛很慈悲，欢迎你去。可是怎么去法？这个世界不在我们地球上，距离我们娑婆世界甚远，你找也找不到，在你临命终时，佛来接引你，不需要找，佛来带你一道去；佛力帮忙就是帮这个。这种忙，八万四千法门里面没有。佛力帮忙，这对于我们来讲实在是便利太多太多，我们今天修行的目的不必用在断惑上，只用在求往生就行了。可是求往生与断惑也有分不开的关系，能够断惑当然更好，品位更高；不能断惑，能够把烦恼压住、控制住，不让它起现行，就可以往生，品位虽然低一点，佛国是到达了。一到达，所得的利益、所得的好处，实在是不可思议；《弥陀经疏钞演义》、《弥陀经要解》，都说得非常详细。<br/>「自力」：我们要具备些什么条件？这里给我们提了三条纲领，是我们自己在这一生可以办得到的。第一、「方便伏惑」：伏惑，伏住烦恼，这是必要的条件。没有这个条件，佛号念得再多也不行，古人讲「喊破喉咙也枉然」。为什么？虽然念佛号，不能伏烦恼。第二、「带业往生」：带业习种子，不带现行；你烦恼没断，能够伏住，这样可以往生。如果烦恼还在，念念当中都有烦恼，这不行，没法子往生。烦恼的根没有断，决定不起现行，这个也很难体会，譬如我们有贪心，贪有贪的种子，贪心起来的时候是现行，贪心不起来，种子在，贪心没断。带业是带种子、带习气，绝不带现行。所以我们平常在生活里就要注意，不让烦恼起现行；烦恼就是七情五欲，常常在心里起这些念头，佛号念得再多都是枉然。佛号如何变成功夫？就是能够把烦恼压下去。烦恼才起来，一句阿弥陀佛就把它换过来，换成阿弥陀佛，这一句佛号把烦恼压下去。烦恼起来只有第一念，第二念就变成佛号，第一念是烦恼，第二念佛号把烦恼压下去，这叫做念佛人。遇到顺境起了贪心，一句阿弥陀佛把它压下去，贪心不起；遇到逆境起了瞋恚心，瞋恚念头才起，第二念佛号就把它压下去，有这种本事才能带业往生。初学的时候，不太容易压得住，这个方法用久、用熟，才能控制烦恼。念头一起来，立刻就警觉，这一句佛号就是警觉。确确实实能把妄想、妄念控制住，完全控制住就是功夫成片，这就是带业往生，生凡圣同居土。如果功夫好，能够把烦恼念断，连习气种子也没有，这就是念佛三昧，就是禅定；得到定，这个定能够断烦恼，断烦恼就是事一心不乱，生方便有余土。假如功夫更高，从定中开智慧，智慧可以破无明，无明破了，这是理一心不乱，自己成为法身大士，生西方极乐世界实报庄严土；与《华严经》的境界完全相同，是圆教初住以上的菩萨，别教是地上菩萨，也就是禅家所讲见性成佛。到这样的境界，一句佛号，念佛的方法可以成就。大势至菩萨在楞严会上说：「不假方便，自得心开。」心开是理一心不乱、明心见性；只用这一句佛号，不用任何法门，就是一句佛号念到底，从伏烦恼到明心见性，就是这一个方法。所以这是在法门里面，最为殊胜、最特别的一个法门。第三、「当生成就」：这个法门是当生成就的佛法。这是讲自力，自己具备这个条件，佛力才帮得上忙，才能与阿弥陀佛感应道交。<br/>下面三句说出这个法门殊胜的功德利益。第一、「超出三界轮回」：出三界非常之难，通途法门讲，见思烦恼不断，没有办法出三界。净土法门真是特别，见思烦恼没断，能出三界。为什么？阿弥陀佛来接引，阿弥陀佛进来带你出去。第二、「了脱分段生死」：分段生死是六道里的生死轮回，从此以后永远摆脱六道生死轮回。第三、「皆不退多补处」：这是讲往生到西方极乐世界，绝不退转；生到西方之后，功夫每天进步，不会退步。而且到了西方之后，「多补处」，这是说环境好。不像我们现前这个环境，多半的人都是迷惑颠倒，我们不知不觉要受影响；还有邪知邪见，对我们多少都会有障碍，使我们犹豫不决、无所适从，这是我们眼前修学环境上所遇到的困难，不晓得学哪个法门好。西方极乐世界则不然，所见到的、所听到的，多半都是补处菩萨、等觉菩萨，程度跟佛没有两样；无量无边的佛来教化，这个福报太大了。补处佛的德行、知见，统统都圆满，跟佛没有两样，只是不在佛的地位上，除这个之外，与佛没有两样。这是福报真正大，这么好的修学环境，你要是不晓得选择，自己要去吃苦头、要去苦修，想达到这个境界太难太难了！这是给你介绍这个特别殊胜法门。</p><p class=\"text-indent\">丙、方法略举<br/>这一段依经典告诉你修学的方法，这就是《弥陀经》里面最重要的内容。《弥陀经》正宗分里分为三大段，就是「信、愿、行」。《弥陀经》经文虽然不长，义蕴非常丰富，决不是浅学人能够看得到的，一定要依靠再来人、古大德帮助我们，请他们来作导游，给我们解释说明，我们才晓得经典里面所蕴藏丰富的意思。全经的纲领，首先是教你要建立信心。蕅益大师在《弥陀经要解》里列举六条纲领：第一、「信自」，信自己、信自力；第二、「信他」，信佛力；第三、「信事」；第四、「信理」；第五、「信因」；第六「信果」。每一条都说得非常详细。<br/>信 —「如圣言量、真实不虚」：佛说的话是圣言量，不会欺骗我们。要相信西方极乐世界实实在在有，相信西方极乐世界有许多优点是我们这个地方所没有的。修学这个法门，一定要下决心把这个世间舍掉，如果还留恋这个世间，决定不能往生。这个世间什么东西都要放下，有一丝毫的留恋都不能成功，你就去不了！<br/>愿 —「专修往生、乘愿再来」：娑婆世界，我们在这里的时间久了，与这里的众生都建立许多密切的关系，生生世世互为眷属，有很深的感情，现在要把这个感情一刀两断才能往生。往生并不是不顾他们，到西方成了佛，再来才有本事度这些众生，才能帮他忙。四弘誓愿里讲断烦恼、学法门，在我们这个世间办不到，断烦恼、学法门、成佛道，都要到西方极乐世界去。再告诉诸位，学其他的法门实在是不聪明，为什么？不管你学哪个法门，到最后还是拐弯抹角，还是要转到西方极乐世界，走很多冤枉路。为什么？不到西方极乐世界不能成无上正等正觉。学其他法门，可以成正觉，可以成正等正觉，但是不能成无上正等正觉。要想成无上正等正觉，非到西方极乐世界不可。修其他的八万四千法门，到最后还是要到西方净土，岂不是绕了好多圈，走了很多冤枉路？为什么不直接去净土？这一个事实我们在《华严经》里看到，善财童子五十三参，五十三位善知识学的法门不一样，那就是说学的是无量法门、八万四千法门，到最后讲到无上正等正觉，普贤菩萨十大愿王导归极乐；说明无上正等正觉，只有在西方极乐世界完成，可见得这个法门的殊胜。所以《大方广佛华严经》是大本《弥陀经》，《弥陀经》就是《大方广佛华严经》的精华纲要；《华严》到最后导归极乐，就是归到《弥陀经》；《弥陀经》可以说是《大方广佛华严经》的总结论、最后的归宿。所以要发愿求生净土，乘愿再来，千万不要舍不得娑婆世界，那就坏了，永远不能成就。<br/>有信有愿还要有行。「行」就是修行，一定要修正自己的行为，符合西方极乐世界的标准；换句话说，取得西方极乐世界的资格，要符合它的德行标准。西方极乐世界的人没有作恶，都是善人，而且是上善之人；上善之人心里不会有恶念。心里还有杀盗淫妄，还有贪瞋痴慢，这个人是恶人，不是善人。表面上装善也不行，去不了。李老师常说，台中莲社二十多万同修，能往生也不过四、五个而已，原因是不够标准。一天到晚拿着念珠，「阿弥陀佛、阿弥陀佛」的念，心里贪瞋痴慢、杀盗淫妄没断，不是善人。极乐世界，善人才能去，所以一定要断恶修善。<br/>修行有正助双修。「正行」是「持佛名号」：二六时中这一句阿弥陀佛不能间断，用这个方法达到「一心不乱」。「助修」是「止恶修善」：要持戒，持戒的意义是断恶修善，达到「心不颠倒」的目标。<br/>功夫上的要求，每一声佛号都要具足信、愿、行；这三个条件，是修净土的三资粮，资助你往生西方极乐世界。佛号里真正具足信、愿、行，你的心一定是清净的，决定是上善之心，不会有一个恶念，自然就能与西方净土相应。至于念法，念六个字、念四个字都可以；大声念、小声念，出声念或者是默念，随自己方便，你觉得哪一种念法念得很得力、很相应，就可以用那一种方法念，没有一定的。有人佛号念得很快，有人念得很慢，能念到一心不乱就是好的念法。不管你用什么方法，能念到心地清净就好。真正念佛的人，佛像就供一尊—阿弥陀佛。为什么？求一心不乱。经本就一本《弥陀经》或《无量寿经》，专一；其他的什么都不要。古来大德，专修净土都是如此。印光大师，他的房间里面，就是一尊佛像、一个香炉、一本经书、一个蒲团。除此之外，一个「死」字挂在旁边，一天到晚看到，我快要死了，赶紧念佛，所以功夫能成就。印光大师是我们的榜样。莲池大师说：三藏十二部，让给他们去悟；八万四千法门，饶与别人行。你们去行去，我是专门念佛；搞别的法门，一定耽误自己。古德常讲：「但得见弥陀，何愁不开悟！」所以，一句佛号念到底，什么都不求，只求临命终时，阿弥陀佛来接引，就行了！甚至于品位高下，统统不要管，不要去跟阿弥陀佛谈条件，这样才能够成就，才能真正念到一心。</p><p class=\"text-indent\">丁、事有特别<br/>说明净土法门的特殊。「设喻」：先从比喻上说，然后再做个比较；这个比喻是古德所说的。「如竹中虫求出」：竹竿是一节一节的，里面有一只小虫，牠想出去。「他宗节节上穿」：八万四千法门，其他的法门采取的方法，好比小虫每一个节都咬破，一层一层往上穿，爬到顶端才能爬出去，费时间很长，要经过许许多多的难关。「净宗从旁破出」：净土法门，不是竖出，是横超。竖出难，例如天道：六欲天、四禅天、四空天，要修十善业道、四无量心、四禅八定，才能去得了。天道尚且如此不容易，何况出世间圣道。可是净土法门特别，横超的法门，从旁破出，不从竖出。从旁破出，还有个比喻，此地省略了。这个小虫在竹子里向旁边咬，竹子外面有块大石头，常常刮风，竹子在大石头上磨，已经磨损得差不多，所以小虫很容易咬破竹子，很短的时间就出去了；「风」与「石」比喻佛力加持。所以净土法门比其他的法门，实实在在要快得多。<br/>「比较」：其他法门与净土法门做个比较。「他先解而后修」：不管是哪一个法门，首先要把它的理论、方法、境界完全明了，才能够修行，所以它的顺序是：信、解、行、证；如果不明了就去修行，统统是盲修瞎练，不会成就。「净先修随分解」：净土法门是解行同时的；修就是念佛。解跟行是同时并进，一定要理解，解行相应，解行同时，这就容易了。「他如步净如车」：其他的法门好比是步行，相当艰苦；净土法门好比是坐车，舒舒服服、稳稳当当就到了。但是上车靠自力，上了车之后，那是佛力了。诸位要记住，我们现在修学，求佛接引这一段靠自力，到了西方极乐世界就靠佛力加持，那个增上缘太好太好了。下面是难易比较。「难」— 「万中难得一」：其他的法门，一万个人难得有一个人成就。「易」—「万修万人去」：净土法门容易，永明延寿大师说，万修万人去。一定要如理如法修行，才是万修万人去。确实靠得往，稳当、快速，这是净土法门殊胜之处。</p></div>"
    },
    {
        "title": "第十四讲 吾人应有之警觉",
        "html": "<div class=\"B1_text\"><p class=\"text-indent\">最后这一个讲表是总结，劝勉诸位。「吾人应有之警觉」，真的要警觉，警觉就是善根、就是福德。今天在台湾，佛教的因缘不缺乏，缺乏的是善根、福德。如果真正有善根、福德，接触这个因缘，这一生一定是圆满成就。</p><p class=\"text-indent\">甲、世法之相<br/>「世法之相」：这是第一个要觉悟的。「器世间」是宇宙，「不住成住坏空」，「不止沧海桑田」；「万法无常」。这是讲我们的环境，我们要提高警觉。世界各国武器日新月异，天天研究发展，到最后必定引发第三次世界大战。一旦战争爆发，整个世界会毁灭，地球上的生物也永远消灭，这是人类将来的结果，要警觉。学会净土法门，将来第三次大战爆发，他们毁灭，我到西方。一定要警觉，不警觉不得了。<br/>「有情世间」：「不断生住异灭」，「故有六道轮回」；「生死事大」。对于人事环境，对于自己本身，都要有大大的觉悟。觉悟了，要是没有法子解决，只得听天由命，这是痛苦、无可奈何的。在佛法里确实有办法解决，佛法的修学就是解决这个问题。而今天时间太迫切，除了念佛法门之外，用其他的方法来不及，而且不可靠，这个法门是最快速、最稳当的法门。不选择这个法门，一定误事，这是千真万确的事实。</p><p class=\"text-indent\">乙、人身难得<br/>这一段是佛在经典上劝勉我们的话。人身难得，佛法难闻。<br/>「最贵」：人身最可贵，因为容易修道。「易近道」，容易接近佛法，「容易觉悟」，「容易解脱」；所以六道里面人身最可贵。「余」：其他的五道；「本」：我们现在的人道。「天耽乐忽解脱」：天上乐多苦少，把生死大事忘掉、疏忽了，这是富贵学道难。「修罗多瞋背道」：修罗瞋恚心太重，好胜心、嫉妒心、瞋恚心特别重，这三样东西障道，所以他修道非常困难。我们自己是不是修罗？如果这三种心重，就是修罗。《楞严经》讲，阿修罗四道都有，天道、人道、畜生道、饿鬼道里有，只有地狱道没有修罗。我们如果在一切顺逆的境界里面，没有争强好胜的心、没有嫉妒的心、没有瞋恚的心，决定不是修罗。「三途昏昧多苦」：地狱、饿鬼、畜生太苦，昏昧多苦，这也是修行的障碍。昏昧，不能辨别是非；多苦，苦障碍修行。人道的好处，「多苦易启觉悟」，「小安能获修道」。人道苦多乐少，能得小安稳、小康之家，这是可贵之处。人身不容易得，得人身就有解脱的机会。我们在六道里，这一生好不容易得到人身，若不好好利用这个机会超出三界轮回，得到等于没有得，空来一场，太可惜！<br/>「难得」：人身难得。为什么难得？底下是佛在经上所说的比喻。「机缘喻」：机缘不容易。第一个比喻，「高山垂线穿针」：佛是讲须弥穿针，须弥山是最高的山，从山上垂一条线下来，山下放一个绣花针，线一掉下来刚好就穿进针孔。你们想想，这个机会有几成？这是说得人身的机会这样渺茫，我们是须弥山那条线，恰巧就穿进人道这个针孔，真不容易。第二个比喻，「盲龟浮木伸头」：瞎眼的乌龟在大海里，大海里有个木板，木板当中有个洞，木板在大海里漂，瞎眼的乌龟头一伸出来，刚好伸在木板洞里；这个机会太难得，机缘不容易。佛说的话是圣言量，我们要相信，佛不会欺骗我们的。《金刚经》说：「如来是真语者、实语者、如语者、不妄语者、不诳语者。」我们一定要相信佛所说的，人身不容易得来。在六道里，神识投到人道确实不容易。<br/>「量数喻」：从数量上比喻。「爪土及大地土」：释迦牟尼佛当年在祇树给孤独园，祇园精舍盖房子有建筑工程，佛带弟子们去看，佛在地上抓了一把土然后撒掉，指甲上还有一点。佛一个动作、一个表示，他的学生们都会问：老师您这是什么意思？因为佛没有戏论，不会开玩笑，一举一动都是给人启示的。佛反过来问学生：「我指甲上的土多，还是地上土多？」这还用得着问吗？当然是地上的土多。佛说：「我们现在世的人，死了以后来生再得人身，数量就像我指甲上的土；死了以后不能得人身，像大地之土。」人身难得，一生严持五戒十善，来生才能保住人身。我们有没有做到？五戒力量薄弱，来生得人身的机会就很渺茫，所以大多数的人，来生都到三恶道去。贪心重的到饿鬼道；瞋恚心重的到地狱道；愚痴重的，迷迷糊糊、是非黑白颠倒、邪正分不清的，到畜生道。贪瞋痴三毒烦恼是三恶道的业因，所以佛教导我们一定要断贪瞋痴。为什么？不堕三恶道。佛菩萨苦口婆心都是为我们好，我们没法子报答，他也不需要我们报答。这是数量上的比喻，也是千真万确的事实。一个明眼人，真正有智慧的人，看到现前这些大众，都看得清清楚楚；哪一个人往佛道上走，将来会成佛；哪一个人往地狱道走，将来会下地狱，现在虽然还没去，已在地狱报名注册；哪一个人走饿鬼道，哪一个人走畜生道，清清楚楚。你是什么样的心、什么样的行为，将来会到那里去。要从自己的心行去改，于一切法不贪，就不会堕饿鬼道；于一切逆境不瞋恚，就不堕地狱道；对于正法、邪法分得清清楚楚，一点不迷惑，就不堕畜生道。<br/>「时间喻」：这是时间上的比喻。「天鬼狱世寿长」：天道、鬼道、地狱道寿命都很长，人的寿命短，人身难得而易失。「七佛世仍蚁身」：这个故事也是佛说的。在祇树给孤独园，佛看到一些蚂蚁，就问弟子；弟子有许多证阿罗汉果的，都有宿命通；叫他们看蚂蚁，七佛世仍蚁身。阿罗汉的天眼、宿命通观察不到，阿罗汉只能看五百世，佛能看到五百世以前。藏教佛从修行到成佛是三个阿僧祇劫，七佛是二十一个阿僧祇劫，牠还是蚂蚁；不是说蚂蚁寿命有那么长，牠愚痴执着，认为那个身就是牠，所以死了之后还是投胎作蚂蚁，到七尊佛过后还是蚂蚁身。佛看了之后很感叹：畜生道不容易脱离！畜生愚痴、执着，所以不容易出离。<br/>「得为大幸」：人身容易接近佛法、容易觉悟、容易修行证果。人身难得，得为大幸，所以要珍惜自己的生命，把西方净土修成。真正修净土，三年的时间就足够；《净土圣贤录》、《往生传》里，三年修成的人非常多，我们三年必定也能修成。可是这里头有一个最重要的条件，就是一切万缘要放下。你之所以修不成，牵肠挂肚的事情太多，胡思乱想太多，这是大障碍，要把身心世界统统放下。像印光大师一样，把「死」字贴在床头，提醒自己：我快要死了！万念俱灰，万缘放下，一心一意念阿弥陀佛，这是正经事。不放下是累赘，不放下是大病，不放下是大苦大难，放下就自在。</p><p class=\"text-indent\">丙、佛法难闻<br/>这一段讲佛法难闻。闻到佛法是机缘，这个机缘非常难得。今天全世界四十多亿人口，有几个人在一生当中听到佛法？很难！台北市二百多万人口，几个人闻到佛法？闻佛法的机缘实在不容易。「佛法为宝」：佛法有什么好处？佛法是宝。宝的意思是有用，我们人要是得了财宝，物质生活就不缺乏，可以过很富裕舒适的生活，取这个意思。佛法能帮你「破迷启悟、离苦得乐」：离的是三界轮回之苦，得的是究竟之乐；这是我们人生所向往的，所追求而追求不到的，佛法里头有。「不遇不真」：佛法不容易遇到。我们现在遇到了吗？未必。遇到的也许是假佛法，不是真佛法。遇到不是真的佛法，跟没遇到没有两样，不能成就，你跟他学，迷上加迷，苦上加苦，不能解决问题。「不解不信」：遇到真正的佛法不解，《大藏经》看不懂，那也得不到利益。看懂了，又未必相信。有很多大学教授、天主教神父，买《大藏经》在家里看，研究参考，但他不相信；不信，也是枉然！能信，信了之后又不愿意修行，那也不行。信了之后要发愿，有愿，又不肯行；或者肯行，行了又不努力，进进退退。这样一层一层的淘汰，剩下来没几个人；台湾这么多人学佛，淘汰下来，剩一百个都不到，岂不是佛法难闻？「闻为大幸」：闻了之后，确实是真的，又能理解、又相信、又发愿、又努力的依教奉行，没几个人。这是真正要觉悟的，机缘实在不容易，开经偈说「百千万劫难遭遇」，不止百千万劫。好不容易得到人身，又遇到正法的机会，这一生不能成就的话，怎么能对得起自己？甚至对不起佛菩萨，对不起父母师长，对不起一切众生。</p><p class=\"text-indent\">丁、四马警喻<br/>这一段也是佛经里释迦牟尼佛所讲的比喻，比喻警觉心。拿五马做比喻，马有五等，警觉心不相同。「一等顾见鞭影而驰」：主人骑着马要牠走，鞭子一拿起来，牠在地上看到影子，晓得主人要牠开步走，牠就乖乖走了；这是第一等的好马。好比学佛，告诉你这个情形，你一下子就觉悟，不必要人督促，自己肯发愤努力，精进不懈，一定成就。「二等鞭着毛尾而驰」：第二等警觉心差一点，牠看到影子没有警觉心，必须主人拿鞭子在牠身上轻轻的敲几下，牠才晓得要牠走，这才开步走。这就是在生活当中遭遇到一些折磨苦难，警觉人生是真苦。前面一等人，什么样的苦难也没有受过，但是聪明，一听佛说，对！有道理，就开始学了。<br/>「三等鞭杖小侵而驰」：重重的打牠，打痛了牠才走。轻轻的打几下，不痛不痒的，牠还无所谓，还不警觉，打痛了不走不行。他受到相当的苦难，才会警觉，才会回头。「四等铁椎刺伤着路」：警觉心太差，怎么打牠都不走，用马靴后面的马刺向牠腹部刺，非常痛，忍受不了，这才走。人遭了大苦难，九死一生逃出来，他才警觉，才肯学佛。第五种这里没写。第五种马刺刺下，牠倒下去。前面四种还有救，佛还能救他；第五种，佛没有法子救。<br/>诸位一定要警觉，在现前这个时代，万事莫如念佛急！其他事情都不重要，这一桩事情太重要了。</p></div>"
    }
]