[{
    "title": "1.前五识(1)",
    "author": "净莲上师",
    "date": "2012年3月7日",
    "html": "<div class=\"B1_text\"><div id=\"fontsize\">\n<p style=\"text-align: center;\">最尊贵的净莲上师讲授</p><p style=\"text-align: center;\">讲于新加坡Orchid Country Club</p><p style=\"text-align: center;\">二○一二年三月七日</p><p>法师、各位师兄：</p><p>晚安！</p><p>我们今天介绍《八识规矩颂》。</p><p>我们知道研究唯识，第一部要看的就是《百法明门论》，那接下来就是《八识规矩颂》。《百法明门论》的内容，就是把一切法归纳为一百个法，在有为法的部分，包含了色法、心法、心所有法、二十四不相应行法——这个是有为法的部分；无为法它分成六种无为，所以加起来一共是一百个法。那借着九十四种有为法，我们希望能够当下去见到无为法，而了悟一切法无我的道理，这就是整部《百法明门论》的重点，是要悟到“一切法无我”。</p><p>可是，如果我们不了解一切法是从哪里生起的，要当下去见到无为，或者是一切法无我，它还是没有办法这么样的快速。如果我们能够进一步去了解一切法它是怎么生起的那个缘由，那我们要体证无为，或者是现证空性，或者明白无我的道理，会显得更容易。要不然我们常常说“一切有为法，如梦幻泡影”，可是境界来的时候，碰到事情来的时候，就梦幻不起来，它也不像泡、也不像影子，一切法都是真实存在的，那就是不明白一切法它是如何生起，才会有这样的迷惑。明明很执著，可是要强迫自己说不要执著、不要执著；可是你就一切法都认为是真实存在，你要不执著是很困难的，除非你知道“我”也不是真实存在，一切“法”也不是真实存在，就是除非你证到人无我、法无我，你才可能当下梦幻泡影得起来，当下知道它是虚妄不真实，自性是空的。</p><p>所以，一切法它到底是怎么生起来的呢？就是一切法都是八识所变现的，那八识从哪里来的呢？从一念无明妄动来的。所以一切众生本来是佛，我们都是清净的真心，本来是这样的。真心里面是离一切念，离一切相的，坏就坏在一念妄动，无明一起，心一动就有了第八阿赖耶识。所以第八阿赖耶识是真妄和合的，真心加上那一念的妄动，而有了第八阿赖耶识，所以它是真妄和合的。然后第八阿赖耶识再变现出能缘跟所缘——能缘的心跟所缘的境，就是所谓的见分跟相分，而有了一切法的生起：包含我们所谓的身心世界，正报还有依报，所有都是八识所变现出来的，所以是“一切唯心，万法唯识”，一切唯心造，都是从真心一念妄动而起无明，而有了第八阿赖耶识，然后才有了一切的身心世界，一切法的产生。</p><p>那我们把这个见分，把它当作是“我”，把相分当作是“法”，不知道它都是从阿赖耶识的自证分所变现出来的，因此在因缘所生的当下，就是“依他起”的当下，起了“遍计所执性”。“遍计所执”就是执见分为我、相分为法。所以我们明白一切法它是怎么生起的，就能够在面对一切境界的当下、因缘所生法的当下、就是依他起的当下不起遍计所执，就能够回归到“圆成实”。这个都听不懂没关系，我们后面会再继续讲。因为今天首先要介绍《八识规矩颂》的内容，它有很多的唯识的名相，可是都没有关系，那个不是问题。重点是我们了解一切法是八识的变现，然后八识是真妄和合的，然后我们就能够回归真心。因为我们知道第八阿赖耶识是从真心妄起无明而有的，那我们只要知道一切法不是真实存在的，不起我执跟法执，你自然就可以回归，从见分、相分，回归到自证分，然后再回归到证自证分，然后再回归到真心。这样就离开十法界了，而入一真法界，然后把一切的无明都去除，就能够究竟圆满成佛。</p><p>所以明白八识的内容非常非常的重要，因为它在这个中间就会告诉我们所有八识它所涵盖的，它每一个每一个规矩，八识规矩，就是那个“规矩”，它到底每一个识有哪一些规矩，我们等一下会介绍。我们现在首先强调，为什么念完《百法》之后，我们要进一步来研读这个《八识规矩颂》的原因，就是能够更快地了悟一切法是虚妄不真实的，而回归到我们的真心。如果我们明白理的话，功夫要提升就很快；要不然理不透，然后明明以为是实有的，还要强迫自己说这个假的、假的、假的，这样很辛苦嘛，用压抑的很辛苦。所以我们希望能从“理”下手，只要你这个理透了之后，你功夫自然就能够提升。它对我们的修证也是有很大的帮助，这就是为什么我们要继续来讲这个《八识规矩颂》的理由在这里。</p><p>这个《八识规矩颂》，我们首先就要介绍这部颂的缘起。这部颂是玄奘法师所造的。那玄奘法师为什么会造这一部论呢？是因为玄奘法师在造了《成唯识论》之后，他的弟子窥基大师，觉得这部论义理太过深广，不是一般人能够深入去探究的，于是就启请玄奘法师集合八识的要义，就是最精要的内容，另外再作成偈颂的方式。其实他是为我们启请的，为了后世的众生、末法的众生，慈悲心嘛，怕我们看《成唯识论》怎么样？又长，然后义理又深，然后又广，那个内容又非常广大，怕我们没有办法一下子就契入，所以才会启请玄奘法师，可不可以把这个八识的精要，最精华的部分、要点，去把它作成偈颂的方式，于是就有了这个《八识规矩颂》。</p><p>所以玄奘法师就把八个识把它分成四章：第一章就是说明前五识，第二章是说明第六识，第三章是说明第七识，第四章说明第八识。每一章都有三颂（三首偈颂），前两首颂是说明有漏位的八识情况，那第三颂是说它转识成智之后清净位的那个内容。所以每一章都有三颂，每一颂有四句，所以每一章就是十二句嘛，那四章就是四十八句，这就是《八识规矩颂》，非常的简单，只有四十八句，每一句是七个字，所以它一共没有多少的内容。虽然它只有短短的四十八句，可是把十卷的《成唯识论》义理，完全的包括在里面，可以说是最简洁的唯识纲要，那也是我们学习唯识最重要的指南，这个就是《八识规矩颂》的缘起。</p><p>那我们接下来要解释经题，《八识规矩颂》的经题。</p><p>“八”，就是八个识嘛。前五识（眼、耳、鼻、舌、身这五识），再加上第六识、第七识、第八识，一共是八个识。所以“八”是数目，就是指它有八个识。</p><p>第二个字“识”，是了别的意思，就是认识。我们能够了别种种的境界，这个我们称为“识”。那能够了别境界的心识有八个，所以称为“八识”。</p><p>“规矩”，就是说这八个心识各有各的规矩，绝对不能违背它们所应该遵守的规矩法则，所以它称为规矩。</p><p>那有哪些规矩呢？每一个识都有它各别的规矩：</p><p>第一个它介绍的规矩，就是“识境”。就是说八识它所缘的境，它分成性境、带质境、跟独影境。听不懂没关系，后面每个都会介绍，因为我们现在要介绍整个大纲嘛，了解这个大纲，就知道《八识规矩颂》它内容到底说了哪一些东西。所以它第一个介绍的是八识的识境，一般它有三境：就是性境、带质境、跟独影境。</p><p>第二个规矩，是“识量”。就是能缘的心，就是我们八个识它所有的量度，它分成现量、比量、还有非量。就是说我们心识去认识外境，你马上就知道外境是什么样的情况，我们刚才说“识”是了别嘛，了别外境，那你心识就有了别外境的那个作用，那你一看到，你的心就能够有一些量度。量度就是说，像一把尺，我们拿那一把尺去量布的话，就知道这个布有多长，是一尺、两尺，还是一匹，还是多少。那我们的心识在缘外在境界的时候，也是有一个量度，就是有这个量度，所以马上知道它是什么样的状况。</p><p>所谓的现量，就是你眼前当下你看到的，这个就是现量。</p><p>比量的话就是，这个境界不是现前的，是比度出来的结果。譬如说：等一下我们下课一出去，地上湿湿的，就知道刚刚下过雨了。你有没有看到雨？没有，所以它是比量，就是比度出来的一个结论，那也是我们心识的作用，去认识外境说：刚才下了一场雨。这个我们就叫识量，就是我们的心识有这个量度的作用。</p><p>所谓的非量，就是根本不存在的东西，我们叫非量。譬如说，第七识就是非量，第七识就是我执的来源，执八识的见分为我，那个是我执的来源；可是有没有这个？根本不存在“我”，所以我们知道第七识那个我执的力量，其实它是非量的。明明没有一个我，可是它把它当作是有“我”的存在，这是第七识恒审思量，执八识的见分为我——这个是非量的。所以我们念到第七识，知道第七识是非量的，我们念到第七识，明白它是非量的，那很快就破我执了，因为根本世界上没有“我”这个东西存在，所以你要证到无我就很容易了，因为它是非量的。世界上没有这个东西，叫做非量。</p><p>所以我们心识去了悟的那个境界，它不是真实存在的，我们叫做非量。比度出来的结果，叫做比量。当下现前，你可以看得到的，这个叫做现量——这个就是我们所谓的识量。我们的心识去缘外在境界，你会有一个度量的结果，就是现量、比量或非量这样一个度量的结果，我们称为识量。</p><p>所以在《八识规矩颂》当中，它首先会介绍识境：就是它属于性境、带质境、还是独影境。像性境的话，也是当下现前，等一下我们会介绍，因为前五识就是性境的，当下现前的，这个我们称为性境。</p><p>像说我昨天晚上做了一场梦，是不是当下现前可以看到这个梦？没有办法拿出来说我昨天做了这一场梦是长得这个样子，你看不到，这个我们就叫做独影境。前五识是没有作用，但是它第六意识单独起了…，造了种种的山河大地，还有梦中也有种种的人物——这个我们就称为独影境。独影，就是第六意识单独造出那个梦境的影像出来，那个不是当下现前的，我们就叫独影境，譬如说，这样就比较有概念了。</p><p>所以我们就知道《八识规矩颂》，这个规矩第一个告诉我们的是识境；第二个就是识量：现量、比量、非量。</p><p>第三个规矩是什么呢？就是识性。八识有各别它相应的那个善的、恶的、或者无记的，各别相应的那个，我们称为识性。</p><p>像前五识它就是善、恶、无记都有，它跟善心所相应的时候，就是善性；跟烦恼心所相应的时候，它就是恶性；不属于善、不属于恶的那个当下，就是随缘……像我们在走路，它没有善、还是恶，一些行为或什么，只要你当下的心没有跟善或者恶相应的，那个我们称为无记。无记性，就是无可记别，没有办法把它归在善或者是恶这样的一个内容当中，我们就称为无记性。善恶无法记别，叫做无记性。所以八个识它会分别的介绍，前五识它是跟善、恶、无记这三性哪个相应，第六识是跟哪一个，第七、第八。所以第三个规矩，就是八个识它各别跟善、恶、无记这个三性相应的状况，各有各的规矩，这个是第三个它要介绍的识性，善、恶、无记三性，我们称为识性。</p><p>第四个规矩，就是要介绍八个识它所活动的范围，就是欲界、色界、无色界——这个三界九地当中，前五识它的活动范围到哪里，第六识它三界九地活动的范围到哪里，第七识、第八识各别活动的范围到哪里，各有各的规矩，这个是它第四个要介绍的，就是八识它所活动的范围。</p><p>第五个规矩，就是介绍八识所相应的心所。你们念《百法》就知道，心所有五十一个心所，从五遍行、五别境开始嘛，善十一……这样就背完了，五十一个心所。它也各别各别，前五识、第六、第七、第八，各别相应的心所是不一样的。像前五识的话，它只有三十四个心所相应，第六识是五十一个全部相应，所以它各有各的规矩。所以我们就知道它第五个介绍的是所相应的心所。</p><p>第六个规矩，就是八识所有的依缘。就是要生起八识，所依的缘有哪些。我们已经知道“眼识九缘生”，有没有？“耳识惟从八”，“鼻舌身三七”，这个我之前有介绍过，就知道说你要生起眼识的作用，它必须要有九缘才能够生起眼识的作用，所以八个识它有各别的依缘，要生起八个识有各别所依的缘，是不同的。</p><p>第七个规矩，就是八识所起的作用，八个识它各别的作用是不同的。像前五识是用来做什么？就是观察五尘境界这个尘世间，这个红尘就是要用眼识、耳识、鼻识、舌识、身识来观察这个世间的一切境界，这个就是前五识所起的作用。所以八个识有各别生起的作用是不同的，各有各的规矩，这是第七个，八识所起的作用。</p><p>第八个，就是介绍八识什么时候能够转识成智。我们知道前五识是转成“成所作智”嘛，第六识转成“妙观察智”，第七识转成“平等性智”，第八识转成“大圆镜智”。什么时候转，这个是重点，你说我刚开始修就要全部转识成智，是不可能的，所以它有一个一个，“六七因中转，五八果上圆”，第六识跟第七识在因中能转；可是前五识跟第八识要果上圆，就是你成佛的那个时候才能转，才能转识成智。这个我们也要了解转识成智的那个内容，这所有的规矩也在这第八个内容会介绍。</p><p>转识成智之后，它能够生起什么样的作用呢？怎么来利益众生的内容呢？这个就是第九个，转识成智之后的作用，八个识各有各的规矩。</p><p>就是这九个内容，就是整个《八识规矩颂》介绍各别八个识的规矩，也就是说，八个识各有它各别所应该遵守的法则，所以就称为“规矩”，这就是“规矩”的意思。</p><p>最后一个“颂”，就是偈颂。偈颂它不是诗的形式，也不是词的形式（因为我们中国有诗词嘛），偈颂不是诗词的形式，它是一种中国再加上印度文学参合以后的一种变体，叫做韵文（音韵的韵，押韵的韵），它称为韵文。它也是经论体裁的一种，很多经论就是用偈颂的方式。印度的论师们，他们造论很喜欢先把偈颂造好，然后再用长行来慢慢地解释。长行是一种散文的形式，就是那个长篇大论，那个就是散文，再慢慢用长行这个散文的方式来解释偈颂的内容。因为偈颂很简短，所以就是太简洁，简洁到可能就是没有办法了解它这么深广的内容，因此还需要长行来解释。所以讲偈颂，就是相对这个长行来说的。</p><p>这就是《八识规矩颂》的经题，介绍完了。</p><p>那我们首先就来看前五识颂。前五识，就是指眼识、耳识、鼻识、舌识、身识，有五个识。为什么不把它分开说？眼识作三个偈颂，耳识作三个偈颂，分开来说不是更清楚吗？它为什么要把它合在一起说，前五识来作偈颂？这是有理由的，就是因为…，这个五个识为什么要合在一起说，它有七个原因：</p><p>第一个原因，就是这个前五识它同样是以净色根为所依。就是眼识依的是眼根嘛，耳识是以耳根为所依，鼻识是以鼻根为所依，舌识是以舌根为所依，身识是以身根为所依——那这五根都属于净色根，而不是浮尘根。净色根我们之前介绍过了嘛，净色根就是属于神经系统，而不是器官，不是我们看得到的这个眼睛、耳朵、鼻子，这个我们称为五官。不是指这个外在（浮尘就是外在你可以看到，它非常粗糙的，我们称为浮尘根），不是指这个五官，而是指五个胜义根，或者是现在讲的净色根，它是清净的四大所造的，我们眼睛是看不到的，譬如说视觉神经、听觉神经，这个我们眼睛看不到；因为它是微细的四大所造的，太微细，微细到我们的这个眼睛是没有办法看到的，那我们称为是净色根。所以第一个理由是：前五识都是以净色根为所依，所以我们把它合在一起说。</p><p>第二个理由，就是这个前五识同样都是以五尘境界为所缘。我们知道眼识缘的是什么？色尘为所缘，耳识是以声尘为所缘，鼻识是以香尘为所缘，舌识是以味尘为所缘，身识是以触尘为所缘。就是我们说眼耳鼻舌身相对什么？色声香味触，所以把它归在一类，这是第二个理由。</p><p>第三个理由，就是前五识都是属于性境。我们刚才说当下现前的那个就是性境。前五识都是属于性境，同样都是缘现在所有的境界，所以我们把它归在一类说。</p><p>第四个理由，就是前五识同样都是属于现量，你当下就可以缘这样的一个境界，然后当下你的心识去了知，也是当下的作用，不是刚才说的比量或非量。前五识你就是一看就知道看到什么，一听就知道听到什么，都是当下现前的，所以它是属于性境，也是属于现量。所以第四个理由是，前五识同样都属于现量所得。</p><p>第五个理由，是前五识同样是向外门转，就是说它向外攀缘。色声香味触在外面，所以我们的眼耳鼻舌身是向外去攀缘这个五尘境界，不像第七识它是内缘的。第七识跟外面都没关系，它只是执内在那个八识的见分为我，跟外在的境界没关系，那个叫内缘。那这个前五识全部都是往外在的境界，五尘境界都在外面，所以它都是向外攀缘，所以又把它归在同一类。</p><p>第六个原因，就是这前五识同样都是有间断的。我有时候看，有时候听，这中间是有间断的，不像第七识它是恒审思量，从来没有间断过，我们就知道那个俱生我执有多难断，因为它是恒审思量，执八识见分为我，没有刹那的间断。你在梦中有没有我？有啊！晚上做梦有我，白天醒过来还是有我，它是恒审思量，恒常不间断的，念念有我。所以要证到无我，除非你明白它是非量的，要不然还真的很难，知道它根本不存在，OK，比较好祛这样的执著。</p><p>所以它在有漏位的时候，我们刚才说前两颂是有漏位，第三颂是无漏位嘛，所以它在杂染有漏位的时候，有这六个相同。</p><p>那在转识成智、在无漏清净位的时候，它同样都是转成叫“成所作智”，这是第七个理由：转识成智之后，前五识都叫做成所作智。</p><p>所以基于这七个理由：六个是在杂染位，第七个是在清净位，基于这样种种的理由，我们就把这五个识，前五识把它归在一类来讲，同样作了三首偈颂。</p><p>那我们就看第一首的第一句——“性境现量通三性”。</p><p>来了，性境来了！我们大概有概念了，对不对？什么叫“性境”呢？就是当下现前的真实的境界，就叫做性境。所以这个“性”就是真实的意思，这个境界是真实的。</p><p>譬如说：我眼前看到一朵花，前五识是没有办法分辨它是什么花，这边很多花；可是我这样子眼识一看到，就是花这样而已哦，还没有分它是香水百合、还是胡姬花，还没有哦。所以当下的第一念，性境现量，当下的第一念还没有起分别；第二念，第六意识加进来（我们后面会讲眼识生起有九个因缘，里面有第六识），第六识在第二念的时候就加进来，你马上就知道什么花、什么花，还是什么颜色，黄色、红色、橘色，那是第二念，第六意识加进来之后才有种种的名言计度，就是你才会给它种种的名称跟言说，去形容它是什么花，然后它是什么形状，什么颜色，这是第六意识的分别加进来之后才有的。可是前五识它是当下，是性境、是现量，当下你看到就是花这样子，还没有分别它的内容。</p><p>所以我们就知道，譬如说：我眼前看到了这朵花；这朵花是真实的一朵花；我可以确定它是一朵花，不是别的东西，就是你的认识没有错误的；还有呢，它是真真实实地放在我的眼前，所以它不是我昨天梦里的那一朵花（我昨天做梦也梦到很漂亮的花园），不是梦里的花，也不是我虚妄假施设出来的花，这些都不是性境、现量，这样懂吗？所以它不是随我们的心妄想出来的一朵花，也不是推论出来的一朵花，也不是过去的花，也不是未来的花，也没有用种种的名称跟言说去形容出来的花，这个我们叫做“性境”。</p><p>归纳整理，所谓的性境，就是有四个重点，我们刚才都讲了，归纳一下：</p><p>第一个，这个境界一定是当下现前的。所以，当下现前的意思是什么呢？它不是过去的，也不是未来的，是当下现在你的眼前的。这是第一个重点，当下现前，叫做性境。</p><p>第二个重点，真实不虚假。就是确实有这个境界，它不是假设出来的，也不是妄想出来的，也不是推论出来的境界。就是我们刚才讲了，它不是虚幻假施设出来的，或者是你想象出来的，或者推论出来的，都不是，这个就叫做真实不虚假。</p><p>第三个，没有错误，你的认识没有错误。你不会把花看成别的，我当下看的就是花，绝对不会认错了，不会看成别的东西，这就是第三个。</p><p>第四个，可以亲自实证到的。就是我凭直觉，马上就可以亲证到这是一朵花，不是用我的第六意识去思索半天才得出来的结果，不是。是我直觉，就我一看就知道它是花嘛，所以它没有透过第六意识的想象，或者我考虑一下它到底是什么东西，我看到的是什么，不是。所以这个我们叫做“可以亲自实证到”的意思就是说，它不是透过你的意识去想一下、思索一下、考虑一下才得出来的那个结果，而是你可以凭你的直觉，马上就可以亲证到这个境界，知道它是一朵花。</p><p>那我们刚刚说了，这是第一念，是前五识的作用，那个第一念；可是第二念就加上第六意识进来了，所以你就可以开始说它是玫瑰花啦、百合花啦，还是什么颜色的花，就给它种种的名称，什么花、什么花，然后什么颜色，这是第六意识、第二念之后，第六意识加进来之后才有的结论。</p><p>所以什么叫“性境”？有四个特点：就是说我们心所缘的这个境界，它是当下现前，真实不虚假，认识没有错误，可以亲证到的，这个境界我们就叫做“性境”。所以前五识它的识境是什么呢？就是性境。</p><p>它的识量是什么呢？就是现量。所以它第二句就是“性境现量”嘛，“现量”就是我们当下能够认识这个境界的心，这个识量以前五识来说，它是属于现量。这个“现”是显现的意思，它当下就能够显现。“量”，就是我们刚才讲的量度，好像拿那个尺去量那个布它到底有多长，那我们心去量这个境界，它到底是什么样的情况，这个我们就称为识量。</p><p>前五识它是属于现量，所以你当下看到的、听到的境界，都是属于性境现量。所以境界现前，我的心就可以马上显现它的量度，我们叫做现量。知道它是一朵花，确定它是一朵花，可以亲证没有错误它是一朵花，这个我们就叫做现量的作用。所以现量它也是要当下现前，然后理解没有错误，可以亲证到。</p><p>因此，我们所缘的境界是性境，能缘的心就一定是现量。有一个能缘、所缘嘛，我的心是能缘的，境界是我的心所缘的。所以我能缘的心，以前五识来讲，就是现量；所缘的境界就是性境，这样应该很清楚了。</p><p>现在“性境”、“现量”考不倒了，对不对？很明了了。</p><p>那什么是三性呢？前五识都是通善、恶、无记三性的。我们刚才说前五识它是属于性境现量嘛，它应该没有分别的，应该是不会通善、恶、无记性的。你说现量，你还没有分别之前，应该都是跟善性相应，所以它跟善十一法相应我们还可以接受；可是它为什么会跟恶相应？无记还有一点像，因为它还没有分善恶嘛，还可以；可是为什么会跟恶性相应？为什么会跟根本烦恼、随烦恼相应呢？还是第六意识是罪魁祸首，因为第六意识加进来了，所以第六意识它当下作用是跟烦恼心所相应的时候，这个当下它就是恶性。所以前五识它是善、恶、无记这三性都有，所以我们说它通三性。</p><p>所以我们在认识外境之后，因为境有顺逆（境界有顺境、还有逆境），还有好境，就是它有好丑，有我喜欢的、我不喜欢的，因此我们的心就有了憎爱（就是讨厌的、还有贪爱的），讨厌就跟瞋相应，所以它是烦恼心所，贪爱也是烦恼心所。所以不管是顺境、逆境，都是跟烦恼相应，一个跟贪相应，一个跟瞋相应。有了好、恶，有了喜欢、不喜欢，还是跟烦恼相应。所以因为境界，我们心去缘了境界，那境界有顺逆、好坏、美丑，种种的不同，因此我们的心就起了憎爱、还有取舍，喜欢的就取，不喜欢的就舍。</p><p>所以当下的心识如果跟善心所相应的时候，就是属于善性；跟烦恼心所、不善心所相应，就是恶心所相应的时候，我们就称为恶性；那善恶不能够记别的时候，我们就称为无记性。所以我们就知道，前五识它是通三性的，最主要是第六意识加进来之后，它才有三性的差别。</p><p>我们现在就知道偈颂的第一句，它说的是前五识同属性境、现量，通善、恶、无记三性。性境是说明“识境”，就是前五识所缘的境界；现量是说明“识量”，前五识所有的量度；三性，就是说明“识性”，就是前五识所有的性别：善、恶、无记三性都有。</p><p>我们看第一首颂的第二句，就是“眼耳身三二地居”。</p><p>“眼耳身三”，就是指眼识、耳识、身识这三识。</p><p>“二地”就是指色界的初禅，就是离生喜乐地。为什么是第二地呢？就要先看那个表。三界有九地，它是第二地，所以就说二地。</p><p>那我们看三界一共有九地。欲界、色界、无色界，就是我们所谓的三界。欲界它是一地，称为“五趣杂居地”。为什么称为五趣杂居地呢？就是它是天、人、地狱、饿鬼、畜生这五趣的有情共同混杂而居的地方，所以我们叫做五趣杂居地，所以欲界只有一地。</p><p>色界有四地，就是色界我们知道有初禅、二禅、三禅、四禅嘛，就是离生喜乐地、定生喜乐地、离喜妙乐地、舍念清净地，所以色界有四地。</p><p>无色界也有四地，因为它有四空天：空无边处地、识无边处地、无所有处地、非想非非想处地。</p><p>加起来是九地，对不对？欲界一地，色界四地，无色界四地，加起来是九地。所以现在的第二地是哪里啊？第一地就是五趣杂居地，第二地就是初禅离生喜乐地。</p><p>所以我们就知道它这一句颂的意思，眼耳身三二地居，这个“居”，就是止的意思，就到这里为止了。眼耳身这三识就到色界初禅就为止了，这什么意思呢？就是这三识活动的范围，我们刚才说三界九地，八个识，三界九地它各别活动的范围是不一样的。像五趣杂居地，这整个欲界五识都有。可是到了色界初禅，两个识没有了，哪两个？鼻识跟舌识没有了，对不对？只剩下眼、耳、身三识。那为什么入初禅之后，两个识没有了呢？是因为他吃的东西跟我们不一样，我们欲界叫“段食”，就是分段，要吃早餐、中餐、晚餐嘛，喝下午茶、还有宵夜，不管几段，就是叫段食，他是分段而食的。</p><p>入了初禅以上，还要不要吃啊？禅悦为食，懂吗？打坐就吃完了，他是以禅悦，在禅定当中生起的那个喜乐为食，不用像我们还要吃，所以他鼻子还要不要闻香？舌头还要不要尝味啊？不用啊，因为他不用段食──分段饮食，不用分段饮食，他是禅悦为食，所以他都是入定。</p><p>我们讲过四禅八定嘛，初禅有五支，对不对？哪五支？寻、伺、喜、乐、一心——五支。所以他有那个喜乐，就是所谓的禅悦为食。既然不用吃东西，所以不需要鼻嗅香、舌尝味，不需要，所以他鼻识跟舌识入了初禅以上，不需要了，不需要用到。这就是眼、耳、身三识止于初禅，就到初禅为止。</p><p>那你说二禅以上呢？二禅以上五识都不起作用了，为什么不起作用？到了二禅剩下什么支啊？寻伺有没有？寻伺没有了，对不对？剩下喜、乐跟一心了，所以它也是禅悦为食，但是它没有寻伺的作用了。所以到了二禅不需要再认取外在的境界，所以它眼识不起作用；已经没有粗细分别的寻伺，所以耳识不起作用，因为寻伺是属于声；那喜支跟意识相应，所以身识也不起作用。所以到了二禅，眼不见色，耳不闻声，身不知触，没有触，只剩下意识的存在，所以它前五识都不活动了。</p><p>所以，如果有人跟你说他在定中见到光，佛菩萨跟他讲话，身体还有种种的感受，你说他有没有到二禅啊？没有嘛，对不对？那我们就知道，从二禅开始就只剩下意识的存在，三禅、四禅，还有四空定，都剩下很微细的意识存在而已，前五识都不起作用了，所以它才会说“眼耳身三二地居”，到初禅为止了，活动的范围就到初禅为止，二禅以上只剩下意识，前五识都不起作用了。</p><p>前五识不起作用，那你说二禅以上的天人，有没有这个五根啊？眼睛、鼻子、耳朵，他五识都不用作用，他有没有眼睛、耳朵、鼻子、嘴巴？有没有？五识都不用作用了，他要眼睛、耳朵、鼻子、嘴巴、舌头干什么？还有这个色身啦，色声香味触嘛，眼耳鼻舌身相对的是色声香味触。有没有见过二禅天人长什么样子的呀？没有在定中见到？还有，懂吗？他虽然五识不作用了、不起作用，但是他还有五根的存在。所以色界的有情，虽然已经离开了欲界这个粗重的体质，但是还有微细的色身存在。</p><p>我们曾经也形容色界的四大，色界还有四大，可是它是非常微细的四大，不是我们现在欲界所见到的、感受到的那个很粗糙的地水火风四大，不是；它是非常微细的存在。所以你看色界天人都是充满了光，然后感觉他是透明的，就是他不是我们欲界这个实质的肉身的存在，不是。他是微细的四大所成的，所以他依然有五根，虽然他的五识已经不起作用，但是他还有五根，他是为了庄严他的身相，使他的身相圆满无缺，所以五根还是很完整的具备。所以他不会因为没有五识的作用，然后连庄严的身相、五根都没有了，不会，还是一样有庄严的五根，一样有色身，这个身根还是有，眼耳鼻舌身这五根都还是存在的。</p><p>好，这个就是第一首颂的前面两句，我们已经知道重点了，第一个重点就是“性境现量通三性”，第二句是“眼耳身三二地居”，说明了它的识性、识量，还有就是它所活动的范围，就到色界初禅为止，二禅以上就没有前五识的活动了。</p><p>那我们时间也刚好差不多了，我们今天就讲解到这里。</p><p>最后回向：（师颂，众师兄跟颂）愿以此功德，普及于一切，我等与众生，皆共成佛道。</p> </div></div>"
},{
    "title": "2.前五识(2)",
    "author": "净莲上师",
    "date": "2012年3月8日",
    "html": "<div class=\"B1_text\"><div id=\"fontsize\">\n<p style=\"text-align:center;\">最尊贵的净莲上师讲授</p><p style=\"text-align: center;\">讲于新加坡Orchid Country Club<br/></p><p style=\"text-align:center;\">二○一二年三月八日</p><p style=\"text-align:center;\"> </p><p>喇嘛、法师、各位师兄：<br/></p><p>晚上好！</p><p>我们今天介绍第一首偈颂的后面两句，就是：“遍行别境善十一，中二大八贪瞋痴。”</p><p>那这两句就是说明前五识它所相应的心所。前五识和哪一些心所相应呢？在五十一个心所里面，前五识相应的有三十四个。</p><p>第一个相应的是“五遍行”。五遍行就是作意、触、受、想、思。</p><p>所谓的作意，就是“注意”。我们眼睛随时在看，耳朵随时在听，鼻子随时在闻，舌头随时尝味，身体有种种的感触。可是你注意到的那个，你才会看到、听到，要不然境界很多，可是为什么你会锁定一个目标去看到它呢？那个就是作意的功用，就是你注意到它了。</p><p>譬如说：你去逛街，走走走，诶！听到一首音乐，你的心就趣向那个外境，就是那个声尘，耳根趣向那个声尘，你听到那个音乐，你的心注意，这个就叫“作意”。那你耳根去跟那个声尘接触的那个当下，叫做“触”，听到的那个当下叫“触”。那你就把这个声音听进来，这个叫做“受”，所以“受”是领纳外境，就是你的心去把它接受，那个境界到你的心里面来，有进来到你的心里，那个叫做“受”。然后你就去认识，认识是“想”，想就是认识的作用，你就知道你听到的是西洋乐呢，还是国乐呢，还是交响乐，还是……就是音乐，你知道它是音乐，还是噪音呢？好听不好听呢？所以认识外境这个作用，我们称为“想”。“这个音乐还不错，我决定去买一张CD回去听”——这就是“思”的作用，所以思就是令心造作，我们的心考虑了之后，决定要怎么做，那个就是思的作用。</p><p>所以只要我们心识一活动，就有五遍行。我们每天五根面对五尘境界，一定要有五遍行，所以它是我们心识的活动，一切活动都是有五遍行，就是八个识，前五识、第六、第七、第八，都有五遍行，所以它遍一切识嘛。所以我们现在讲这个前五识，它相应的心所就一定有五遍行。那也是我们每天五根面对五尘境界，起心动念的开始，就是有作意、触、受、想、思这五个。</p><p>第二个相应的是“五别境”。五别境就是欲、胜解、念、定、慧。</p><p>想一想，我们每天忙什么？要享受嘛，对不对？忙着享受，就是眼睛要看好看的啦，耳朵要听好听的，鼻子要闻好闻的，嘴巴舌头当然要尝好吃的，那身体的感受更重要，太热了，air-con（空调）嘛，还是……我们挑衣服也是要那个最好是吸汗的啦、很柔软的啦、触感好的啦，就是身触，这是五尘境界嘛，色声香味触，这些都是属于“欲”。所以我们给“欲”一个定义就是：对于我们自己喜欢的境界一味追求，这个就叫“欲”。所以我们每天就是追求五欲之乐嘛，要享受，满足我们的五欲之乐，这个就称为“欲”。</p><p>那我们昨天讲到前五识它是性境、现量，对不对？所以你看，当下看到什么就是什么，你不会看错，你当下听到什么就是听到什么，也不会听错，这个就叫“胜解”。所以对于外境有殊胜决定性的理解，不会看错、听错、理解错误，这个我们就叫“胜解”。</p><p>然后我们对于曾经看过的、听过的、闻过的味道，或者尝过的食物、尝过的东西，身体接触过的东西，你都会有一种记忆的作用，这个就叫做“念”。不然你怎么会记得哪一部电影好看，对不对？哪一个音乐好听，哪一个香味好闻，哪个东西好吃，就是你受用的当下回熏到第八识，成为这个种子。所以这种对于曾经串习过的境界，能够明记不忘，就是这种记忆作用，我们就称为“念”。</p><p>那有时候我们看东西，看得很入神，看得很专注，好像定住了，定在那里，这个就称为“定”。所以所谓的“定”，就是对于所观察的境界非常专注、不散乱，这个我们就称为“定”。</p><p>同时我们在看的当下，或者是听的当下，能够去分辨它好不好看、好不好听，闻的当下，知道它好不好闻，吃的当下，知道它好不好吃，身体感觉好不好，这个就是“慧”的作用。所以“慧”就是对于所观察的境界，有分别简择的能力，这个叫做“慧”。</p><p>这就是所谓的五别境。我们前五识（眼耳鼻舌身这前五识），也是随时都有欲、胜解、念、定、慧这样的作用，所以前五识就一定跟这个五别境相应。也就是说，对于希望境我们会起欲，就是希望嘛，希望享受，那个希望，对那个希望的境界产生欲；对于那个决定的境界产生胜解；对于曾经串习过的境界产生念；对于所观察的境界我们有定，还有辨别——那个慧的能力，非常专注叫做定，能够辨别叫做慧，所以对于观察的境界，我们都有定跟慧的作用，这个就是所谓的五别境，就知道前五识一定有这五个。</p><p>前五识也跟十一个善法相应，这十一种善就是信、惭、愧、无贪、无瞋、无痴、精进、轻安、行舍、不放逸、不害——这十一个。</p><p>这十一个为什么称为善？它的原因就是这十一种法它的自性是善的，就是说它的自体、它的本身就是属于善性。那怎么知道它是善性呢？因为这十一个法，它远离一切的过失，而且能聚集一切的功德，那这些功德包括了世间、还有出世间的一切善法在里面。如果我们真的能够做到这十一种善法的话，我们就能够自利利他，还能够在这一世、还有将来世都能够得到利益，所以我们就称为“善”。为什么称为善的原因在这里，就是一切不论是世间法，还是出世间法，它都是能够得到利益的。</p><p>第一个善法就是“信”。信，就是我们的内心绝对的纯净，没有丝毫的主观和自己的见解。所以它的重点是：你的心非常纯净，清净到了极点，就是净化，不断地纯净、pure（纯净的），一直清净、清净、清净，清净到了极点，会发生什么事呢？就跟我们的自性很接近了，对不对？因为我们的自性本来清净嘛。那你现在因为信心，让我们的心越来越清净、越来越清净，是不是就跟你自性本来清净那个相合了？所以我们一切的修行，其实就是在修一个“信心”而已，你的信心圆满，你就成佛了，为什么？因为“信心清净则生实相”，就是你能够见到那个诸法的实相，也就是说你能够明心见性，你可以见到自己的菩提自性，因为你清净的那个自性心现前了，你就能够开悟，你能够证果。</p><p>所以这个“信”非常非常的重要，不管你是对世间的善法相信，还是佛所说的一切法相信，还是对三宝的功德相信，世间圣贤的道德相信，或者你相信业力它所展现的那个能力。业力它是一股很强的力量，你造善造恶一定会有那个果报出来，这是一种业的力量，你相信那个业力的存在。</p><p>因为相信，你才会精进嘛。你对那个不信的，你当然就不会很勇猛精进去把它完成，或者去把它做到。就是一定是相信，你才会做。所以它是精进的一股动力，就是靠信心来的。不信的话一定懈怠。我们相信有好处，我们才会去做嘛。所以信心它是精进的推动力，它也是我们成就最重要的根本，就是信心。所以我们一面修，就一面让自己的心清净、清净、清净，净到了极处，自性自然就现前。</p><p>我们有这个体悟，常常一怀疑，心就被染污了，对不对？就开始不信这个、不信那个，怀疑东、怀疑西，那个就是开始你的心被染污了，所有的烦恼就生起了。所以不信、怀疑会让我们心受到染污，然后一切的染法，一切的烦恼就这样生起了。除非你有信心，你的心才能够保持那个清净心，所以它很重要。</p><p>第二善法就是“惭”。惭，简单说就是反省自己的一种自觉的能力。譬如说我们做了坏事，我们内心会感到羞耻，老是耿耿于怀，或者觉得对不起自己良心的那种感觉，那个就叫做惭。</p><p>那个“愧”呢，愧是尊重世间公共的那个舆论，叫做愧。譬如说我们做了坏事，我们很害怕舆论的批评，害怕别人的指责，觉得没有脸见人，这个就是一种愧的心理。所以惭跟愧是有一点差别：惭比较偏重在你觉得自形羞惭；那愧呢，就是恐怕愧对他人，怕一些批评啊，或者责备啊。所以一个是对自己负责，一个是对他人负责的一种情怀。这个是惭、还有愧。</p><p>第四个是“无贪”。无贪就是不染著。对于已经得到的，我们不会耽著在里面；对没有得到的，你也不会拼命去追求，你就是很安于现状，这个就是无贪的特性。</p><p>我们修行人，就是不但不要贪，还要对它们产生深深的厌恶，因为我们要知道贪是轮回的根本，为什么会来轮回？就是一念“贪”来的，所以阿罗汉证到无贪、无瞋、无痴，他就不会再来了嘛，不会来六道了。所以我们对贪要生起非常强烈的厌恶，一种出离心。</p><p>那你说“我为了证明无贪，所以我每天也就不要去特别讲究说，什么眼睛要看好的，还是耳朵要听好的，我就随便吃啦，还是随便糟蹋自己的身体”，这样也不对。所谓“无贪”的意思，不是说我就把这五尘境界丢掉，然后我也不睬它，然后我逃避它，为了怕引发我的贪，所以我就很害怕它，然后远远地避开它，不是这样子。你可以很自在地受用五尘境界，但是你的心不染著。受用，就是你还是要看，还是要听，但是你的心没有怎么样？没有受到它的诱惑，还是安住得很好；可是你可以很自在地受用五尘境界，但是心不染著，那个叫无贪。不是说我就都不要受用了，不要受用你没有办法活啊，不吃饭就饿死了。所以不是说你不要受用，而是你可以很自在地受用，但是你一定要很小心地观察自己的起心动念，有没有跟贪相应，这个就是功夫嘛。有修止观都OK啦，没问题啦。面对五尘境界心不动，就是止嘛；清清楚楚、明明白白，知道它是生灭无常、无我的，就是观嘛。然后受用，你可以吃多多都OK，所以它是功夫的问题。</p><p>所以我们修行人不但对世间的名闻、利养，或者是…，就是我们说名关、利关、恭敬关嘛，关关要过关，对不对？就是不但不贪著世间的这些名闻、利养等等的。那对出世间的涅槃、菩提也不贪求哦！不要说我世间的这些我都可以放下了，可是我一心一意就是要追求菩提跟涅槃果，这个有没有贪？我们叫“善法欲”啦，可是这个还是跟贪相应，为什么？因为你是为了自己的成就而追求菩提涅槃果，这个就有贪，因为还有“我”，懂吗？重点是没有“我”就对了！我今天想要开悟、想明心见性、想要证果，不是为了我自己，我是希望赶快有能力去利益众生，这个就对了。</p><p>所以我不但对世间的名闻利养，我不会去贪求，我做一切的善法功德，我也不会为了贪求世间的善业果报（有的人是为了功德才去做的嘛，为了善报，为了福报，然后才去修善法还有功德的，这个还是贪啊！你在修贪啊！因为你希望获得一些好的果报，这是世间的贪。可是一旦学佛修行，又会贪，要赶快开悟、赶快证果、赶快解脱，这也是贪；然后修禅定，就耽著在禅悦当中，舒服得都不想下座，什么事都不管了，什么责任也不想扛，就想躲起来，那个也是贪啊！）所以也不要贪著那个禅定之乐，更不要贪求想要证果。所以，学佛修行都是为了利益众生，不是为了自己解脱证果，这样就是做到“无贪”。</p><p>“无瞋”，就是不恚怒，充满了慈愍心。像我们为什么功德不能够累积呢？为什么功德不能累积？就是我们好不容易累积了一点功德，可是火烧功德林，“一念瞋心起，百万障门开”，全部烧光光了。好不容易银行存一点钱，一次就领空了，这个就是瞋恚。因为我们还有瞋恚，所以只要瞋恚心一起来，我们所有的功德全部烧光光，所以说火烧功德林嘛。</p><p>那为什么我们的慈心生不起来呢？我们那个同情心、那个慈愍心生不起来呢？也是因为瞋恚，还有瞋恚，所以瞋恚它会障碍我们慈心的生起。因为你一发脾气怎么样？自己都不快乐，你怎么可能给众生快乐？对不对？慈心就是要给众生快乐，可是你发脾气的时候你不快乐，所以你不可能给众生快乐，所以当我们还有瞋恚心的时候，我们是不可能有慈心的。这也是我们为什么那个慈愍心生不起来的原因，就是还有瞋心。</p><p>所以如果我们想说快速地累积功德，就是发菩提心嘛，我们前面一直强调的。然后想要有慈心，也是要先做到无瞋，所以这个无瞋也是很重要的。</p><p>那什么是“无痴”呢？就是对一切事、理明白了解，叫无痴。所以它等于是有正知正见，也等于是有清净的智慧，是同样的意思。你只要能够明白一切的事理，你就自然没有愚痴，境界来的时候不会迷惑颠倒，然后也能够有智慧来抉择什么是正行，什么不是正行，这样子你才可能很正确地来修习一切的善法。</p><p>所以我们常常说行善也要有智慧，这个智慧就是从无痴来的，你不但具有正知正见，而且对一切的事理明白，就是说一切的现象界是“事”，一切的现象界你都知道它是生灭无常的，所以你不会著在任何的境界上面，所以你不会迷惑颠倒，任何境界现前你都不会迷惑颠倒，因为你对“事”已经做到无痴了。那对于一切理，这个“理”，就是指空性的智慧。刚才是讲事相上的差别，事相上有千差万别，但是你不会迷惑，当下可以观空——这个空性的智慧就是属于理体的部分，就从现象界可以直接就回归到那个本体界。所以，你是在事相的当下去明白那个空性的道理，而入那个理的法界。所以有事法界，有理法界。事，是指现象界；理法界，是指透过现象界，你去明白它空性的道理，那个就是进入了理法界，能够做到，就是现在所谓的无痴了。</p><p>这个无贪、无瞋、无痴，在小乘来说，它称为“三善根”。所谓的善根，就是一切善法的根本，因为它能生起一切的善法，所以叫善根。所以证到小乘的阿罗汉或辟支佛，他一定有无贪、无瞋、无痴这三个善根，因此他也能够圆满一切的功德。就是从这个无贪、无瞋、无痴的三善根来的，善法的根本，所以一切善都是从这个根本生出来的。所以只要你有无贪、无瞋、无痴，你去圆满一切的功德就很容易了，因为它是一切善法的根本。所以这三个善根它是趋向解脱，阿罗汉就是解脱嘛，小乘就是讲自己的解脱，所以它是可以趋向解脱的，所以它称为三善根。</p><p>那以大乘来说，做到无贪就可以成就布施、持戒的功德；你做到无瞋，就能够成就忍辱的功德；你如果做到无痴，就能够成就般若智慧的功德。所以不论小乘还是大乘，这无贪、无瞋、无痴都非常非常的重要，因为它是一切善法的根本，依于这种根本，你才可以圆满一切的功德善法。</p><p>善法的第七个是“精进”。精进，就是努力向上的一种进取心，叫做精进。在佛法它本来的意思，就是专门对那个止恶行善来说的，所以我们常常说四正勤嘛，三十七菩提道品有所谓的四正勤，就是讲精进。就是对还没有生起的恶法，我们不要让它生起；已经生起的恶法，要赶快让它断除；还没有生起的善，我们要赶快生起；已经生起的善，要让它增长广大——这个就是止恶行善来说的四正勤，就是精进的范围。这个比较偏在自己的、自我利益的上面，自己修行的内容。不管小乘、大乘都有三十七菩提道品，所以这个四正勤都是小乘、大乘必须要修的，你自我完成修行的内容，就是四正勤非常重要，这样你才可以断恶修善，很快速地达到这样的一个效果。所以有了精进，才能对所修的一切善法不减不退。</p><p>所以什么叫做“精”？就是说这中间没有恶法的杂染了，叫做精。就是很精纯，没有恶法夹杂在里面，才叫精进的“精”。所以你今天还会行恶，虽然你今天做了很多的善，可是你中间有夹杂恶在里面，你今天不能说精进的那个“精”，没有！因为不纯嘛，你有夹杂恶在里面。那“进”的话，就是说恶法会让我们的善法退失，就没有办法进。所以我们就是要很精勤地做到刚才讲的那个四正勤，努力精进地成就一切的善，但是这中间没有丝毫的恶夹杂在里面，这个才叫做精进，这是你自己的修行来讲。</p><p>可是大乘的菩萨来讲，这样还是不够的。因为大乘有发菩提心嘛，他不但自利，刚才是自我修行，是自利方面，他还要再利他。所以他在行善的、他在广修一切功德善事的时候，他不会为了自己，就是说他没有一念的贪心夹杂在里面，贪心也是杂染嘛，也算是恶法，算是烦恼。而且，他在利益众生这个过程，所有在行菩萨道的这个过程，他不会有那个疲厌的心，不耐烦：“哎呀！众生好难度，算了吧！我还是自了比较快！”不会生起那个疲累的心，永远在弘扬如来的正法，利益无量的众生，不达目的，绝不终止，就是这样一个勇猛精进的心。所以能够做到这样自利利他，才叫做真精进（真正的精进），这是菩萨的精进。</p><p>所以菩萨有所谓的“披甲精进”，披着铠甲就不怕，好像那个战士上战场，就往前冲啊冲啊，他为什么不害怕？因为他披甲，披着战甲、盔甲，所以他可以冲冲冲冲冲，杀什么？杀烦恼贼啊，这是第一个披甲精进。第二个精进，叫做“摄善精进”，就是我们刚才讲的，广修一切的功德善事，但没有为自己一念的贪心夹杂在里面，这个是叫摄善，收摄的摄，摄善的精进。第三个，就是“利乐精进”，就是利益众生，宣扬如来的正法，不达目的，绝对不停止，这个叫做利乐精进。这个是大乘的真精进。</p><p>第八个“轻安”。轻安，就是指我们身心非常的调和安适、轻松畅快的那个感觉，叫做轻安。</p><p>那你说平常有没有轻安？没有！轻安是你修定才会有的轻安。所以世间的那种身心刹那的畅快，那个不叫轻安，差太多了。这个轻安是指修定来的轻安，你有修禅定才会生起这个轻安的感觉。有了这个轻安，你才可以远离身心的粗重；远离身心的粗重之后，你才不会有昏沉的现象。不然现在我们一般白天是什么？是小昏沉，晚上睡着是大昏沉，都在昏沉当中，就是因为没有轻安。身体也非常的粗重，老是四大不调啦，五脏六腑生病啦，就身不调嘛，就是身粗重；心也很粗重，一下生烦恼，一下又闹情绪，然后又什么感受，心也不轻安。</p><p>所以除非你得定，身心才能够在这种调和安适、轻松畅快这样的一个状态当中，你才可以永远远离昏沉。我们也说，你可以到达色界初禅就没有睡眠了，晚上你就是躺在那里，你的意识也是非常非常清明，就是睡着了，你也知道你每一个（动作）：你翻身，你也知道你翻身，你踢被子，你也知道你踢被子，都很清楚，所以它是修定来的。</p><p>第九个，“不放逸”。就是说我们时时刻刻都防护自己的这一念心，不让它放逸、懒惰地向不正当的方面去发展，这个就是不放逸；也就是很勤勉地在修一切的善法。所以很精进地在无贪、无瞋、无痴这三善根上面，很精进地在这个三善根上面，心不丝毫的放逸，这个我们叫做不放逸。所以佛果它其实就是不放逸来的，所以佛随时都在定中嘛，祂心不会放逸的，永远在这个三善根里面，永远没有贪瞋痴。</p><p>第十个，“行舍”。行舍也是精进三善根来的，精进无贪、无瞋、无痴，久了呢，我们的心自然就能够非常寂静地安住在什么状态呢？平等、正直的这个境界当中。平等、正直是重点。</p><p>像我们一般心都不平等嘛，我们的心有高下，所以不平等。为什么不平等？亲人就产生贪爱嘛，怨敌就产生瞋恚，所以心不平等；所以，除非我们已经做到了行舍。这个行舍是定力的成就，就是说你已经心能够安住在这个定当中了，那在这个定当中，当然就不会有怨亲、中庸的差别，所以你的心才能安住在平等上面。</p><p>那所谓的正直，就是不邪曲，叫做正直。也不会散乱，也不会昏沉，然后也不会有一些那种恶的寻思，我们所谓的恶觉，就是不好的念头，不会有。这个我们叫做正直，就是没有邪曲的意思。</p><p>所以它也是定力来的，就是说你的心在定当中，所以它可以一直安住在这样的一个状态，平等正直这样的一个状态，我们就称为行舍。所以它可以对治掉举，你定修得好，就不会有那个粗的散乱，也不会有细的掉举。</p><p>好，善法最后一个，“不害”。就是不损恼、不伤害众生，就是说我们随时随地都不会让众生感到痛苦，所以它是一种悲心，悲心就是拔苦嘛，帮众生去除痛苦，拔除众生的苦，这个是不害来的。你要有这个不害的心，随时不想伤害众生，不想让众生痛苦，还希望帮他除苦，这个就是不害。任何情况之下都不可能生起伤害众生的念头，更何况是语言暴力、行为暴力，都不可能，所以它是一种悲心的展现。</p><p>我们昨天介绍前五识它是性境、现量嘛，所以它一定就是跟这个纯善、至善的十一种善法相应，是理所当然的。我们比较不能够理解的是说，它为什么还会跟后面等一下要讲到的那个烦恼相应呢？就是第六意识是罪魁祸首嘛，我们昨天讲过，只要第二念第六意识加进来，第六意识生烦恼，跟烦恼心所相应，前五识也跟着跟烦恼心所相应。可是前五识它本身是性境现量的，所以它是无分别的嘛，无分别跟这个善法相应就比较能够理解。</p><p>那我们再来分析一下，这十一个善行对我们修行的重要性。因为我们修行无非就是要从断恶修善开始下手嘛，然后再修习止观，成就戒定慧三学，最后发菩提心、行菩萨道。那你想要完成这个自利利他的这样一个修行呢，你就一定要有十一个善行，所以什么时候圆满这个自利利他的修行，就是什么时候做到了这十一种善法，你就圆满了。就是这么重要，这十一种善法非常非常重要，所以我们还要特别来把它归纳整理一下：</p><p> <img src=\"/ueditor/php/upload/600012/image/20201224/1608818345582663.png\" _src=\"/ueditor/php/upload/600012/image/20201224/1608818345582663.png\"/></p><p>第一个信心，我们刚才讲了，信心非常非常重要，所以它是一个根本，一切成就的根本就是信心。有了信，你才会好乐（yào）行善，所以信心的作用就是好乐行善，就是那个“乐善”，就是好乐行善。</p><p>无贪、无瞋、无痴，我们刚才讲了，它是三善根，一切善法的根本，它能够生起一切的善法，所以它叫“作善”。你要行一切的善，就是以无贪、无瞋、无痴为根本。</p><p>精进，是菩萨唯一的善根嘛；不放逸，就是时时刻刻防护我们自己的这一念心。有了精进跟不放逸，我们一切的善法功德，自然就能够圆满成就，所以叫做“满善”，就是圆满成就一切的善。从哪里来的？从精进跟不放逸来的。什么是不放逸？刚才讲过，就是精进在无贪、无瞋、无痴三善根上面，叫做不放逸。</p><p>这个是你要修一切的善必须具备：信、无贪、无瞋、无痴、精进、不放逸这些善根，你才能够修习一切的善法，圆满成就一切的善法，（这是）基本条件。</p><p>那你想要止息一切的恶，就要靠惭跟愧心，所以惭、愧它的功能就是止息一切恶，这就做到了我们修行第一步的什么？断恶修善嘛。</p><p>轻安→对治昏沉（障观）</p><p>行舍→对治掉举（障止）</p><p>然后就要修习止观了，对不对？修习止观才能够得轻安，我们刚才说轻安是由定来的。初禅开始就有轻安了，初禅以前的欲界定、未到地定都没有轻安，初禅开始有轻安，所以标准没有很高嘛。那轻安它主要是能够对治昏沉，昏沉一旦对治了，我们就能够很快的生起慧观而成就慧力，所以得轻安能够成就慧力。那行舍呢，它可以对治掉举，掉举对治了之后，我们就能够很快的成就定力。</p><p>所以轻安跟行舍，就是不管各宗各派，你修习止观，就是想要成就定慧的话，它的下手功夫从哪里下手？就是修止观，然后成就轻安跟行舍，从这边下手。</p><p>不害——拔苦——悲</p><p>无瞋——与乐——慈</p><p>那不害呢，就是你自己成就之后就要行菩萨道嘛，那你那个慈心的来源从哪里来？就从不害来，我们刚才说了。所以不害是修戒定慧，还有行菩萨道的根本。</p><p><img src=\"/ueditor/php/upload/600012/image/20201224/1608818346548064.png\" _src=\"/ueditor/php/upload/600012/image/20201224/1608818346548064.png\"/></p><p>那我们看那个四无量心，就是说我们能够悲愍众生、怜愍众生，然后希望去利益他们，就是因为我们有慈悲喜舍这四无量心，可是它们的特性有一些不一样，就是说它的体性是不同的：<br/></p><p>慈心比较偏在给众生快乐，这个要做到无瞋才能够给众生快乐，就是我们刚才讲的，你自己都不快乐，不可能让众生快乐嘛，所以你自己要先去除这个瞋恚心，你的那个慈心才可能生起。那个悲心，就是希望为一切众生除苦，所以它是不害这个善根为它的体性。慈心是以无瞋善根为体性；悲是以不害善根为体性；喜是以不嫉妒这个善根为体性，不嫉妒才会随喜嘛，所以这个喜，也是希望让一切众生感到欢喜，所以你不但不会嫉妒他，而且还能够随喜，随喜他一切的功德等等；那个舍，就是以无贪、无瞋善根为体性，这个就是我们刚才讲的行舍那个“舍”，心平等正直。我们对亲人会贪爱，对怨敌会瞋恨，就是有贪、有瞋，所以我们的心不平等、不正直。所以这个舍无量心，就是心能够做到平等正直，自然它就是以无贪、无瞋善根为它的体性。</p><p>那这四个都是很重要，我们想利益众生，想行菩萨道，就是要有具备这样悲愍众生的心，就是慈悲喜舍这四无量心，是非常重要的行菩萨道的基本功夫，基本条件。</p><p>前五识不但跟十一个善法相应，就是前面的五遍行、五别境、善十一都相应；它也跟烦恼心所相应，是因为第六识加进来的关系，所以它也和两个中随烦恼，八个大随烦恼，还有三个根本烦恼相应。所以就是下面一句：“中二大八贪瞋痴”。</p><p>“中二”，就是无惭、无愧。现在讲的都是跟我们刚才讲的相反的，所以我们很快把它带过就好了。无惭、无愧就是刚才讲的惭愧的反面嘛。刚才是说要有惭愧心，我们才可能止息一切的恶行，那你无惭、无愧的话，当然就是没有办法，你就是会生长一切的恶，都是从无惭、无愧来的。所以，无惭就是做了坏事，自己不觉得羞耻，就没有惭心；没有愧心，就是做了坏事也不怕别人的批评，简单说就是这样。</p><p>八个大随烦恼，就是指不信、懈怠、放逸、昏沉、掉举、失念、散乱、不正知。</p><p>“不信”，就是相对刚才那个信来说的。所以你不信的话，就会懈怠，因为你不相信行善会有好报，你就不会去行善：不相信世间的善法，你就不会行世间的善；不相信出世间的善法，你就不会行出世间的善。那他为什么会不信呢？它的根本是愚痴来的。现在所谓的随烦恼，就是随根本烦恼来的，我们称为随烦恼，所以它一定是从根本烦恼那边来的。所以现在讲的不信，它是从根本烦恼那个贪瞋痴的“痴”来的，因为愚痴，愚痴才会不明白事理，所以你才会不相信嘛，因为它就是宇宙的真理，可是你居然不相信，就是愚痴嘛，所以它是愚痴来的。</p><p>第二个大随烦恼就是“懈怠”。懈怠就是懒惰啦、不精进啊，不努力地断恶，然后不精进的为善，所以它很难圆满一切善法的原因在这里，就是它会懈怠、会懒惰。它也是愚痴来的，因为不信就会懈怠，所以不信是愚痴，懈怠也是愚痴相应的，所以它属于痴的一分。</p><p>那“放逸”呢，就是我们的心每天任意放纵在五欲的享受上面，不知道有所节制，我们就叫做放逸。一放逸，我们的心就忘失正念，一忘失正念就会造作一切罪恶的行为。所以应该要断的恶，你不会很有效地去预防；应该要修的善，你也不会很精勤地去修。所以所谓的放逸，就是懈怠还有贪瞋痴，所以放逸跟贪瞋痴相应，还有懈怠的一分。</p><p>“昏沉”，就是昏昧沉重，就是属于痴，它是和愚痴相应的。昏沉是修观最大的障碍，所以我们为什么常常修观的时候，我们对所观的境界总是观不起来啊，观不清楚啊，然后不能保持啊，就是因为昏沉，所以它是障碍我们修观最主要的原因，就是因为我们还会昏沉。所以想要修一切的观行都不能够成就，就是整天身体重重的啦，头脑昏昏的啦，心也是暗昧不明啊，昏昧的状态，这个我们就称为昏沉。</p><p>那什么是“掉举”呢？掉举就是我们的心在一种轻浮躁动的状态，我们叫做掉举。像有些人总是喜欢闲逛啊，到处逛啊，东逛逛、西逛逛，到处游荡，这个叫做身的掉举；讲话喜欢东拉西扯啦，谈笑风生，这个是口的掉举；每天放纵自己的心怎么样？任意地遨游奔驰，天马行空，不断地攀缘外境，就是在打坐修定的时候也是胡思乱想，妄念纷飞，或者是见到种种的恶境界，这个都是意的掉举。所以，掉举能够障碍我们得定，所以它是修定最大的障碍。那为什么会掉举呢？它是跟贪相应的，因为贪欲，所以不断不断地妄念纷飞，都是从贪欲来的。</p><p>下面一个“失念”。失念，就是忘失正念，不能够忆念保持正念。不能够忆念保持正念，就会让我们的邪念增长，心就散乱。所以一失念，心就散乱。</p><p>那什么是“散乱”呢？散，是分散；乱，是扰乱。就是让我们的身心驰散流荡，不能够收摄，不能够专注在一个境界上面，因此不能够得定的原因，就是因为散乱。不能够得正定，发的都是恶慧。所以心一散乱，就一切的烦恼都来了，所以它是贪瞋痴的一分，贪瞋痴它都有，所以散乱的原因是贪瞋痴都有。</p><p>那最后一个，“不正知”。就是指没有正知见，有的都是邪知邪见。这个“知”就是指知见，知见只要不正的话，那个邪见就会增长，所以它是属于邪慧，还有愚痴的一分，这个是不正知。</p><p>前五识跟这两个中随烦恼、八个大随烦恼相应之外，还跟三个根本烦恼相应，就是贪瞋痴。贪瞋痴，我们刚才讲无贪、无瞋、无痴，反过来就是贪、瞋、痴。</p><p>所以贪，就是贪欲。不管你是贪财、贪色、贪名、贪利，贪种种的欲乐，心中永远不会感到满足，这个就是贪爱的一种心理状态。</p><p>那瞋呢，瞋就是心怀恚怒，瞋恚那个恚怒，这个我们叫做瞋。我们一般都说瞋恚，就是心怀恚怒，叫做瞋，没有慈愍心。所以说“瞋心障慈，害障悲”。</p><p>痴呢，痴就是愚痴无明，对事理不明白叫痴。所以因为无明愚痴，才会不信。我们刚才说不信是什么？愚痴的一分嘛，所以愚痴就无明，不明白事理，然后就开始不信，然后就邪见，然后懈怠、放逸、昏沉、散乱都跟痴有关。所以愚痴一上来，就统统都有了，这些烦恼都有了。所以在一切的烦恼当中，愚痴是最严重的一种烦恼。</p><p>我们讲它相应的一些心所，一共有五十一个心所，贪瞋痴有了嘛，根本烦恼有六个，贪瞋痴有了。为什么没有慢、疑、恶见（恶见就是五不正见）？为什么没有这三个根本烦恼？是因为我们要生起慢、疑，还有五不正见，必须要有我执跟法执，可是前五识没有我执、也没有法执，因此没有这三个根本烦恼。</p><p>第二个，它为什么没有小随烦恼？十个小随烦恼，为什么不相应？就是因为小随烦恼是随着我们第六意识分别，个别现行的，前五识它是现量任运分别，所以它没有小随烦恼。</p><p>最后一个，它为什么没有四不定？因为这四个不定法都是跟第六意识相应的，所以它没有这个四不定。寻、伺是第六意识的粗细分别，叫寻伺嘛；那个悔，前五识不会后悔，因为它现量性境，不会后悔；那睡眠，前五识也不会睡着，所以睡眠是第六意识的昏昧状态，我们叫睡眠，所以前五识没有睡眠，因此说它没有四不定。</p><p>我们今天就介绍前五识它所相应的心所内容，一共三十四个心所相应，其他十七个不相应。</p><p>我们就介绍到这里。回向：</p><p>（师颂，众师兄跟颂）愿以此功德，普及于一切，我等与众生，皆共成佛道。</p> </div></div>"
},{
    "title": "3.前五识(3)",
    "author": "净莲上师",
    "date": "2012年3月9日",
    "html": "<div class=\"B1_text\"><div id=\"fontsize\">\n<p style=\"text-align: center;\">最尊贵的净莲上师讲授<br/></p><p style=\"text-align: center;\">讲于新加坡Orchid Country Club</p><p style=\"text-align: center;\">二○一二年三月九日</p><p>喇嘛、法师、各位师兄：</p><p>晚上好！</p><p>我们继续看：“五识同依净色根，九缘七八好相邻。”</p><p>这个是第二首颂的前两句，是说明前五识所依的根，还有所依的缘。前五识所依的根，是净色根。我们第一晚有讲过什么是净色根，所以说“五识同依净色根”，什么是净色根呢？净色根就是清净色法所成的根，叫做净色根。我们讲过，它是清净的四大所成的根，所以叫做净色根。</p><p>那什么是清净的色法呢？清净的色法，指的就是清净的四大所造的色法，叫清净的色法。它非常微细，不是我们肉眼可以看得见的，因为它的自体非常清净，所以我们就称它为清净的色法。那我们前五识所依的根，就是由这种清净色法所成的根，叫做净色根。那简单地讲，就是我们现在所说的神经系统：我们眼识所依的眼根，就叫做视觉神经；耳识所依的耳根，就叫做听觉神经；鼻识所依的鼻根，叫做嗅觉神经；舌识所依的舌根，就叫做味觉神经；身识所依的身根，就叫做触觉神经。这样我们就能够比较明白，它净色根指的是什么。</p><p>那五识就是要依这个净色根才能够摄取外境，就是眼、耳、鼻、舌、身，它摄取的是色、声、香、味、触五尘境界嘛。那一旦根跟境互相接触，就能够生起五识的作用。但是在摄取外境的同时，还必须要有种种的助缘，才能够发挥五识的功能。譬如说眼根和外境相接触的时候，生起眼识就必须具备九种助缘，所以说“眼识九缘生”，所以我们现在就要了解生起眼识的作用，它必须要有九个助缘：</p><p>第一个是“所依根”，就是这个根缘。一定要有这个净色根的眼根。如果眼根坏了，我们就看不见，所以它第一个是所依根。</p><p>第二个是“所缘境”，就是我们眼根所面对的是色尘，这个就是境缘。如果这个色境不现前，我们也看不到。</p><p>第三个是“亲因缘”，就是所谓的种子缘。如果没有眼识的种子，我们也看不见。所以这个眼识的种子，是由自己亲因所生的，所以叫做亲因缘。那这个眼识的种子在哪里呢？就含藏在第八阿赖耶识里面。每一个识都有它的识种子，因为有这个种子，你有外境现前的时候，你才能够生起现行，你才能够看见，所以这个亲因缘就是指这个识的种子。</p><p>第四个是“分别依缘”，这个就指的是第六识。我们要看东西的话，也是要有第六意识的分别，我们才能够看得见。所以如果没有第六意识的分别，虽然有外境现前，我们也不能了别说你看到了什么，所以这个分别依缘也是很重要，指的是第六识。</p><p>第五个、“染净依缘”，指的是第七识。要生起眼识还要有第七识的帮忙，就是第六识在分别外境之后，我们眼识是染的、还是净的，还要依这个第七识。如果第七识是染的，眼识就是染的；如果第七识是净的，眼识就是净的。所以在第七识没有转成平等性智之前，第六意识是念念成染，因此前五识也是念念成染。所以眼识是清净的还是染污的，就要看第七识转了没有。所以它是…，染净依缘，就是说成染还是成净，完全要看第七识它转了没有，没有转之前，第六识是染的，所以前五识也是染的。第七识转了之后，第六识是清净的，也转成妙观察智，那前五识才能够跟着转，转成清净的成所作智。第六识先转，第七识再转、跟着转，第六跟第七先转，“五八果上圆”嘛：“六七因中转，五八果上圆”，所以第六跟第七识先转，然后八识转，五识再转。</p><p>第六个是“根本依缘”，指的是第八识。第八识是诸识的根本，所以称为根本依。任何一识的生起，都是以第八识作为它生起的根本，因此没有根本识作为依止的话，眼识不生。所以眼识要发挥它的功能，也必须要有第八识，因为它是一切识的根本。</p><p>第七个助缘就是“作意”。我们昨天介绍五遍行，有第一个作意，就是我们的心趣向外境，注意到那个外境，那个叫做作意。所以让我们的心去趣向外境，这个就是作意。所以如果没有作意的话，我们没有要注意任何一个地方，我们就视而不见嘛，因为我们没有注意某个焦点，所以如果没有作意的话，就等于视而不见。所以作意是令我们的心趣向外境，如果没有这个警动性的话，种子是不能生起现行的。所以作意它最主要的功能，就是我们的种子能够起现行，就是靠作意。没有作意的话，我们含藏在八识有无量的种子，它不会生起现行，一定是作意之后它才会生起现行。所以一切心识的活动一定有作意，前五识、第六识、第七识、第八识一定有作意，要不然没有办法起心动念。</p><p>第八个是“空缘”，就是空间。如果没有适当的空间距离，我们眼睛也看不见，所以我们眼睛要看到种种的境界，必须要有空间距离，这个就是空缘。太近了，看不到，碰到我的眼睛，我什么也看不到；太远，我也看不清楚，所以它要有适当的距离才能够看到。</p><p>第九个是“明缘”，就是光明。如果没有光明的照射，我们也是没有办法分辨这个色境它的情况，它是什么颜色啦，什么形状啦，没有办法分辨，所以也是要有光线。在黑暗当中，什么都看不见，所以它必须要有明缘。</p><p>这个就是“眼识九缘生”。要生起眼识的作用，必须要这个九缘，少一个都看不见。</p><p>如果是耳识的话，就必须具备八个因缘。因为耳识不需要光明，你在黑暗里面还是可以听到音声，所以刚才九个缘就少了一个明缘，不需要光线。那根缘就是耳根，境缘就是声境，种子缘就改成耳识的种子，一共这八个因缘，其他作意一样，第六识、第七识、第八识，这个都一定要具备的。所以说“耳识唯从八”，偈颂当中所说的那个“八”，就是指耳识它需要八个缘，才能够生起作用。</p><p>偈颂中的“七”，就是指鼻、舌、身这三个识，所具备的缘是七种，就是前面的八个缘当中再少一个空缘，就是空间距离它不需要。像你鼻子闻香的话，你这个味道一定要碰到鼻根，你才能够闻出它的香臭。那舌根也是一样的，你的东西，你说放在外面，什么味道我不知道，我一定要舌头碰到，对不对？所以它是没有空间距离的，它一定要碰到我的舌根，我才知道。那身体也是同样，你一定要接触到，我才有种种的…，我才感觉冷啦，或者是暖啦，才有这种种的感觉生起。所以鼻识、舌识、身识三识，不需要空间距离就能够生起，所以说“鼻舌身三七”，这三识只需要七缘就可以了。</p><p>所以鼻识的七缘，就是鼻根相对的那个境，就是香境；然后要有鼻识的种子；还要有作意；分别依，就是第六识；染净依，就是第七识；还要有根本依第八识，就能够生起鼻识的作用。</p><p>那舌识的七缘就是：舌根，味境，舌识的种子，作意，分别依，染净依，根本依。</p><p>身识的七缘就是：身根，触境，身识种子，作意，分别依，染净依，根本依。</p><p>所以颂中的第二句说“九缘七八好相邻”，我们就知道这个“九缘七八”是什么意思了。“九缘”就是指眼识需要九缘；“七”就是鼻、舌、身三识需要七缘；这个“八”就是耳识需要八缘。</p><p>那什么是“好相邻”呢？就好像好邻居一样，现在有什么事情，我们大家一起合作，把这个事情办好，合作无间、互相帮助，这个就是“好相邻”的意思。</p><p>那我们现在不管是眼识、耳识、鼻识、舌识、身识——这五识它要生起作用的时候，不管它是九缘、八缘，还是七缘，每一个缘不是单独去帮助五识的生起，不是；而是大家一同的互相支助、互相帮助，好像好邻居一样互相的帮忙，让这个五识能够生起作用，所以我们叫做“好相邻”。也就是好相邻助的意思，互相依存，不相乖违，不会互相找茬，互相违背。就好像好邻居一样，总是互相帮忙，合作无间，把事情做好。所以五识生起所需要的助缘也是一样，它们总是相互一致，好相邻助，让识能够无碍的生起；而不是每一个缘个别单独让识生起，不会互相帮助，不是这样。所以我们说它是“好相邻”。</p><p>“合三离二观尘世，愚者难分识与根。”这是第二首颂的后面两句。</p><p>第一句是说明前五识在观察五尘世间的时候，根与境是相合呢，还是根与境是相离的情况。那我们刚才讲了就明白了，鼻、舌、身三识怎么样？必须它没有空间距离嘛，所以它一定是相合才能生起作用。所以“合三”，我们就知道它的意思是指，鼻、舌、身三识在观察香、味、触尘的时候，根和境是相合的状态，因为不需要空间距离，根跟境是相合的，所以说“合三”，就这三识是相合的，这三识要生起作用的时候，根跟境是相合的状态。</p><p>那“离二”，就是指眼识跟耳识，这两个在观察色境跟声境的时候，根跟境是相离的状态。我们刚才讲了嘛，眼识、耳识的生起需要空间距离，所以说“离二”。</p><p>“观尘世”，就是观察这个尘世间。五识的作用就是用来观察这个五尘世间。所以前五识是做什么？就是观察这个红尘所有的事情，五尘境界，观察这个五尘境界、这个世间，就是前五识的功能。</p><p>那为什么叫“尘”呢？这个“尘”就是指五尘境界。因为它会染污我们的心识，所以我们叫它“尘”。除非你有止观在里面；不然一看，五识面对色、声、香、味、触的时候，马上第六意识起分别，“我”再加进去，就我喜欢不喜欢，那个烦恼就生起了。所以它其实是你五根面对五尘境界的时候，它是染污我们的心的，让我生起贪、瞋、痴种种的烦恼，所以它是尘，就是染污的意思。除非你当下有定，然后有智慧的观察，才不会被它染污。</p><p>这个“世”是迁流的意思。所以就是说这个迁流变化的世间，所有的尘境都是染污我们心识的，所以叫“尘世”。那五识的作用，就是来观察这个尘世间的。</p><p>我们看第二句：“愚者难分识与根。”</p><p>这个就是说到，我们五根面对五尘境界的时候，所生起的种种认识，到底是这个根的作用？还是识的作用？也就是说，譬如说我们能看见东西，你认为是眼根看见？还是眼识看见？我们一般都会以为说我的眼睛看见嘛，就是我的眼睛能够看得见，而不是说我的眼识能够看得见。我看见东西，是因为我有眼睛，所以我看得见。</p><p>实际上不是嘛，我们刚才就已经讲过，刚才“眼识九缘生”的时候就讲过，眼根只是生起眼识的增上缘而已，眼根是属于净色根嘛，因为它是清净色法所成的根，它是最微细、最清净的色法所成的，那什么意思？它是属于色法（眼根是属于色法）。既然是色法，它就没有知觉的作用，所以它不能够了别外境，所以我们眼根只是照见外境，但是它不能了别外境，它没有这个知觉的作用，因为眼根是属于色法，懂吗？所以能看见的不是眼根的作用，眼根只是有照境的功能。所以，真正能够看见的是眼识，眼识就是属于心法了。我们说心法有八个嘛，就是讲眼识它属于心法。所以心法它就有知觉的功能，而且它也能够了别外境。所以我们能见的是眼识，而不是眼根。</p><p>所以世间人都会以为我们能够看得见是眼根的作用；不但世间人是这样认为，外道也是这样认为，还包含了愚法的声闻人也难分识与根的差别。所以这边才会说“愚者难分识与根”，这个“愚者”，就是指愚法的声闻人。因为声闻人他只断烦恼障，还有所知障没有断，所以他对法的见解还是愚痴的，所以我们称为“愚者”。</p><p>声闻人认为根和识是可以互生的（可以互相生起，它是互相帮忙、互相生起的），所以就错认第六识为根，不知道有第八识的存在。声闻小乘他们只讲到第六识，没有第七识、第八识。有第七识、第八识是大乘唯识谈到有七、八两识；可是小乘声闻人他们只谈到第六识，所以他们就以为这个识就是跟根互相作用而能够看得见。</p><p>那我们刚刚说，生起眼识需要九缘，对不对？其中有一个亲因缘，就是眼识的种子，生起眼识…，就是这个眼识种子是生起眼识的亲因缘嘛，刚才讲了有这个缘，那眼识它就是由眼识的种子所生的，才能够生起眼识的现行，加上作意，这个眼识的种子才能生起眼识的现行。可是这个种子含藏在哪里？含藏在第八识，所以这个第八识才会成为生起眼识的根本依嘛，刚才说根本依缘就是第八识。可是小乘因为他不知道有第八识，所以他以为根、识是可以互生的，这个根就是识，所以我们才会说他“愚者难分识与根”。</p><p>所以这边的“愚者”，不是指世间的愚痴的人，不是；是特别指声闻小乘人，他们都搞不清楚根跟识的差别在哪里，它非常的难分。那为什么那么难分呢？它容易被混淆的原因，是因为根跟识它们缘的都是色尘（如果以眼识来说的话，它缘的都是色尘），就是说根跟识生必同境：就是你眼根缘的是色尘，眼识缘的也是色尘，所以这个时候根跟识就会弄不清楚，因为它们缘的是同一个境界，懂吗？那你的耳根也是听声尘，你的耳识也是缘声尘，所以根跟识就会很容易混淆的原因在哪里？原因就在这里，就是根跟识它生必同境：它们一生起作用是同一个境界，缘的是同一个境界，所以根跟识就弄不清楚。</p><p>那另外弄不清楚的原因是，这个五根跟五识对于境界都是任运现缘，我们第一个晚上讲了嘛，性境、现量嘛，它就是当下现前的，所以它是任运的就缘当下那个境界，然后不起分别，所以很难分根跟识的差别，因为它都是当下任运现缘，就是任运地缘当下现前的那个境界，所以根跟识很难分。</p><p>勉强要比喻的话就是：五根缘境，就好像镜子相对那个要照摄的对象，因为我们说眼根对色尘，就好像镜子前面有一个对象对着这个镜子，对不对？我们眼根对着色尘，就好像镜子对着这个对象一样。可是五识对于境界来讲，它是如镜现像，它是镜子里面反射那个影像，跟刚才说对着一个像是不一样的。镜子，这边有一个像，对着镜子，这个是五根，对于境界来讲，是好比镜子对着像；可是五识缘境界，它是镜中现像，这个镜子里面现出这个像，所以有这么微细的差别。所以一般弄不清楚的原因，就是因为它们都是任运现缘，不起分别，所以它很难分。</p><p>可是“识”呢，我们刚才说它是属于心法嘛，“根”是属于色法，色法跟心法是不同的：根能够照境，识能够缘境，所以根、识也是不一样的。根能够照境，我们刚才说好像镜子对像，它是能够照境，所以它不能够了别外境；可是识它能够缘境，所以它能够了别外境，所以根跟识其实是不同的。一个不能够了别，它只是对境而已，不能够了别；那识它能够缘境，所以它能够了别外境。一个是照境，一个是缘境，所以根、识是不同的。那声闻人没有八识的说法，所以他很难弄清楚两者的差别，因此说“愚者难分识与根”。</p><p>前面两首偈颂说的是：五识在有漏位上的种种相。那至于五识在无漏位上转识成智的情形，我们就要看第三首偈颂：</p><p>“变相观空唯后得，果中犹自不诠真。圆明初发成无漏，三类分身息苦轮。”</p><p>这个前五识到了无漏位上就能够转成“成所作智”，那么这个成所作智是属于什么样的智慧呢？一般我们把智慧分成加行智、根本智，还有后得智。</p><p>那什么是加行智？就是在加行位上所产生的智慧，我们称为“加行智”。譬如说听闻来的智慧，我们叫闻所成智，因为听闻而成就的智慧，它属于加行智。那你听闻之后，思惟产生的智慧，我们叫做思所成智，就是经由思惟观察而成就的智慧，我们叫做思所成智。所以这个闻所成智、思所成智，都是属于加行智，在加行位上所成就的智慧。可是有没有开悟？有没有见道？还没有。譬如说我们听闻诸法空性的道理，然后借着不断不断地思惟观察，在一切有为法上，观它的生灭无常，希望能够体悟到一切法自性是空的，希望能够见到诸法的空相，这一切的努力都是属于加行智，因为还是没有见到空性。</p><p>那什么时候见道？就是你这样慢慢地，不断不断地思惟、观察、修习，有一天就真正的见空性了，这个时候的智慧我们称为“根本智”。就是真实的见到诸法空相，或者真如本性现前了，我们这个时候心就是这个真如本性，因为你要见的是什么？真如本性，你当下现的是什么？你的心现出的是真如本性，所以这个时候你的心跟境是合一了，这个我们称为根本智。所以它是可以亲缘真如的，你的心当下可以亲自缘到这个真如，因为你当下的心就是真如的本身了。前面加行智是我们不断不断地思惟观察，希望能够见空性，真如本性能够现前，可是还没有现前。哪一天真正现前的时候，真如现前了，那你真如本性现前了，是不是同一个东西？你要见的是真如，你的真如本性现前了，真如对真如，所以它合一了，这个我们称为根本智，就是诸法空相现前。</p><p>那我们要依于这个智慧，再生起种种的作用，那个我们称为“后得智”。所以刚才说你亲见真如的那个根本智，为什么称为“根本”呢？因为它是一切智慧的根本，所以称为根本智。所以之后一切的智慧，需要这个根本智慧作为基础，然后再活用，你可以无量地起妙用，来做利益众生的事情，所以在无量的善巧方便、利益众生这个运用的智慧，我们都叫做后得智。就是依于“根本”之后才得到的，叫做“后得”，得到根本智之后才得到的，所以叫后得智。依于根本智之上，再起广大的运用。</p><p>所以我们就知道，你见了空性之后，得了根本智之后，你对一切法就不再会执著了，因为当下你就见到它的真如，当下你就见到一切法的空相。虽然现象界有无量的千差万别，但是你都不会执著，是因为在千差万别的宇宙万有当下，你可以见到真如，对不对？所以菩萨在利益众生的时候，他是不会起任何的执著，就是因为他得了根本智，然后又有无量的善巧方便，从根本智生起它的作用、后得智的作用。因为有根本智，所以在一切因缘法上面，他可以见到它的空相，所以他不会执著；可是又不会著在这个空里面什么事都不做，所以空中能够生出妙有，然后做广大利益众生的事业，都是后得智才能够圆满的。</p><p>那后得智能不能亲缘真如？就不可以了。只有根本智当下，你的心境是合一的。可是后得智是从这边“变相观空”才生起的作用。所以我们看偈颂，叫做“变相观空唯后得”，这个“后得”就是后得智的意思。可是后得智就不能够亲缘真如了，所以它是要变带起空相，才能够生起它智慧的作用，所以这里的“后得”就是指后得智。</p><p>那前五识转成的“成所作智”，它就是属于后得智。那后得智在观察空理的时候，必须先变起真如的相貌，所以叫做“变相观空”。它不是亲缘真如，它必须要先变起真如的相貌。譬如说我们在观察一切现象界的当下，见到诸法的空相，那这个空相和根本智所见的那个空相不一样，对不对？这时候的空相不是真如的本身，而是借着一切有为法去观出来的，所以它不是真如的本身。这时候见到的空相，不是空相的本身，而是变带真如而起的空相，这就是“变相观空”的意思。因为有根本智，已经见到诸法空相，所以我们在观一切法的时候，能够见到空相，这个空相不是真如的本身，而是变带真如而起的空相，所以后得智是不能够亲缘真如的，所以是“变相观空唯后得”。</p><p>那这个后得智虽然能够变相观空，但是不能够直接诠证真如，所以说“果中犹自不诠真”（下面一句）。</p><p>这个“果中”，就是指到了佛的果位当中；“犹自不诠真”，就是还是不能够亲自直接证到真如。所以这边的“诠”是证得的意思；“真”就是指真如。即使到了果位，佛的果位上，还是不能够亲缘真如。</p><p>那为什么到了佛的果位上，还是不能够证得这个真如呢？因为五识只缘现量的境界，所以只能观察诸法的事相，不能够体悟诸法的真理。因为它只缘现量境，所以它只能观察一切法的事相，而不能够直接去缘到它的理体部分，不能体悟诸法的真理，就是那个空相。所以不但在因位是这样，到了果位上也是同样。所以转成成所作智之后，虽然可以变相观空，但是所观的是相似的空性，并不是直接证得真如，所以说“果中犹自不诠真”。</p><p>那前五识要到什么时候才能转成成所作智呢？就是要到成佛的时候，才能够生起成所作智。那为什么要到成佛的时候才能生起成所作智？前面难道就不能转五识成成所作智吗？不可以，因为五识要依五根才能够生起。五根是八识所变现的相分，所以在第八识没有转成大圆镜智之前，它是有漏的，这个时候的五根是有漏的，所以依于五根所起的五识也是有漏的。那到了佛果，八识转成无漏，那由八识所变现的相分——这个五根也能转成无漏，依于五根而生起的五识，这个时候才能够转成无漏。所以说：要到成佛的时候，这个前五识才能够转成成所作智。</p><p>懂吗？有点难懂？再讲一遍：</p><p>我们刚才说五识生起要什么九缘、八缘、七缘的，不管要有几缘，五识都要依五根才能作用，对不对？五根是生起眼识的什么缘？刚才说了，所以生起五识一定要依五根。那五根是怎么来的呢？五根是第八阿赖耶识所变现的相分，所以能变现的是第八阿赖耶识，所变现的相分是五根。所以在能变现的第八识没有转识成智之前、没有转成大圆镜智之前，它所变现的五根相分是不是也是有漏的？能变的是第八阿赖耶识它是有漏的时候，它所变现的五根是不是也是有漏的？五根是有漏的，那能依于五根而生起的五识，是不是也是有漏的？</p><p>所以，什么时候这个五识才会变成无漏？除非五根无漏嘛！五根什么时候无漏？能变的阿赖耶识转成无漏，它所变现的相分才是无漏的，对不对？所以依于这个五根而生起的五识才是无漏的。这样很容易，对不对？所以它为什么一定要等到八识转成大圆镜智之后，这个五识才能同时转成成所作智的原因在这边。因为五识要依五根才能作用，五根又是第八识的相分，所以第八识没转，五根就没转；五根没转，五识就没转。所以第八识一转，五根转，五识就转了。就是这么简单，懂了！</p><p>所以在第八识转成大圆镜智的第一个刹那，前五识也同时就转成无漏的成所作智，所以颂中说“圆明初发成无漏”。</p><p>这个“圆明”就是指大圆镜智；“初发”就是最初发起的时候；“成无漏”就是前五识马上就可以转成无漏的成所作智。所以前五识什么时候转识成智？成佛的时候才转：第八阿赖耶识一转成大圆镜智，前五识马上就转成成所作智了，所以它是“五八果上圆”，我们就懂了。前五识跟八识怎么样？在果上才能够圆满转识成智。“六七因中转”，就是第六跟第七识，我们之后会讲第六识，下一次就是介绍第六识，然后第七识，最后第八识，就会讲：六七是因中就能转了，第六识先转，马上第七识跟着转，之后再详细介绍。</p><p>那么转成成所作智之后，有什么用处呢？那佛为了度化众生，在证得成所作智之后，随时随地都能够变起三类不同的身形，去为不同根性的众生说法，使他们能够息灭两种生死的苦轮。所以我们偈颂中说“三类分身息苦轮”，这个“三类分身”就是：</p><p>第一个是“胜应身”，就是最殊胜的应身。就是祂能化现大身。这是为谁化现呢？就是为了地上菩萨所化现的，初地一直到十地菩萨，是适应十地菩萨的机宜，祂示现的是丈六的卢舍那身，千丈，不是丈六，丈六是下面一个要讲的小化身才是丈六。千丈的卢舍那身（因为佛的报身非常的广大，祂在我们这个凡夫的面前不能够现这么大身，我们会吓到，然后认为祂是异类，所以祂一定要化现跟我们同等的身量。可是又要比我们怎么样？要比我们高一倍，我们是八尺嘛，祂是再一倍：丈六）。那祂宣说什么呢？为十地菩萨宣说十波罗蜜，然后令他们能依这个大法修行，息灭什么？变易生死的苦轮。我们知道有分段生死，还有变易生死，六道当中是分段生死，四圣法界以上都是属于变易生死，所以这个时候息的是变易生死的苦轮。</p><p>第二种是“劣应身”，就比较低劣的了，它是小化身。是为谁现的呢？是为适应二乘还有凡夫的机宜，示现丈六的小化身，为我们说什么？苦集灭道四圣谛……种种的法门，让我们能够依法修行而息灭分段生死的苦轮。我们刚才说祂为什么要比我们高一倍呢？我们人道身是高八尺，可是祂现在来一个一丈六，这样才能显出祂的尊贵，让我们人可以生起敬畏仰慕的心，所以祂要现得比我们还要高大。</p><p>第三类是“随类应身”，也称为随类不定化身。祂是为了适应各类不同的机宜，示现随类的化身，为说各个所能接受的教法。那只要依祂所说的如法修行的话，就能够离苦得乐。所以这一类的化身祂是大小不定，可以遍十方刹，就是“应以何身得度，即现何身而为说法”，随不同的因缘、不同的种类，化现不同的身，说不同的法。</p><p>那你说成佛转识成智之后，祂就能够现这三类的分身，祂是自己的意思呢？还是众生的意思？祂为什么是成佛的时候，祂很自然的就能够现三身？这个很重要哦，这个就说明在因地的时候因为有发愿，所以你在成佛的时候，它自然就能够现这三类的分身来息众生的两种苦轮。</p><p>所以菩萨都是在因地发了菩提心，发了誓度一切众生的菩萨誓愿，所以祂在果位上成就成所作智的时候，很自然就能够现起这三身来利益一切众生。而且祂现身的时候，不是说“我要现什么身”，不是自己的意思，祂不是随自己的心意，要怎样现就怎么变，不是。祂一定是要适应众生的根性，适应众生机宜的需要，适应接受的程度，在不同的国土作这三类的分身，祂是应众生机而现的，不是自己的意思。</p><p>好，那我们最后再谈一谈，为什么称为“成所作智”，这到底是什么意思呢？这要以自利和利他两方面来说：</p><p>自利方面就是，诸佛如来一切所应做的自利事业都已经成办，就是说祂自己方面，不论是所应断的、所应修的皆已成办。这是以自利来说。</p><p>那利他方面来说的话就是，在成办自己所应该成办的一切之后，还要成办利益一切众生的事业，那这个利他的无量事业要由化身来成办。所以祂要有三类分身的原因就是，你要成办一切利益众生的事业，必须要有种种的化身。我们说千百亿化身，各种大身、小身、不定身。那化身成办又要依智慧才能够生起，所以我们就称这个智慧叫做成所作智。也就是说，这个智慧能够成就佛所应做的事业，所以叫做成所作智，这个就是它名称的来源。</p><p>我们这三个晚上介绍前五识的内容，相信大家都听得很明白。</p><p>那我们下一次就是介绍第六识，五月份吧。我们课程就到这里结束。回向：</p><p>（师颂，众师兄跟颂）愿以此功德，普及于一切，我等与众生，皆共成佛道。</p> </div></div>"
},{
    "title": "4.第六识(1)",
    "author": "净莲上师",
    "date": "2012年5月16日",
    "html": "<div class=\"B1_text\"><div id=\"fontsize\">\n<p style=\"text-align: center;\">最尊贵的净莲上师讲授<br/></p><p style=\"text-align: center;\">讲于新加坡Orchid Country Club</p><p style=\"text-align: center;\">二○一二年五月十六日</p><p>各位喇嘛、各位居士大德：</p><p>晚上好！</p><p>我们今天开始介绍第六识。也同样，前面两首偈颂它是属于有漏杂染识，那第三首偈颂是无漏清净识。</p><p>那我们首先介绍第六意识它的依缘，就是要生起第六意识，必须要具备五个缘：</p><p>第一个缘是所依根，第六意识所依的根是第七末那意。我们知道第七识它是属于恒审思量，执八识见分为我，恒常与四惑相应，所以它是染污的，恒常跟我见、我爱、我痴、我慢相应，所以它是属于染污，所以第七识又叫做“染污意”。这个“染污”的意思就是恒常跟这个四根本烦恼相应；这个“意”的意思就是恒审思量，执八识见分为我。所以我们那个“我执”的来源是从哪里来？就是从第七识来。</p><p>那第六识跟第七识的关系又非常紧密，除非第七识转成平等性智，念念无我了，这个时候第六识才是念念都是清净的。可是我们第七识如果还没有转成平等性智之前，就是恒常跟这个四惑相应，就是念念都有我爱、我见、我贪、我慢、我痴，这个时候意识也是念念都有“我”在这边：我在想、我的看法、我认为……，那谁在听呢？谁在看呢？就是我在看、我在听、我在感觉，念念都有“我”，就是因为第七识没有转成平等性智之前，第六意识念念都是有“我”的染污在里面，为什么呢？因为第六意识它的所依根就是第七末那意。这个也是“意识”它名称的由来，就是“意所生识”名为意识，就是第六意识它是依第七识的意根而生起心识的活动，因此我们称第六识就称为“意识”，这个“意”就是依于意根、依于第七末那识的意思，这个就是所依根。</p><p>那它所缘境呢，就是法尘。那什么是法尘呢？就是五尘落谢的影子。我们五根在接触五尘之后，一定有那个影像留在我们的心田当中，第六意识的见分再把它变成相分境，成为自己的所缘。这个意思就是说，譬如：大家都照过相嘛，你们要照相之前，先看那个里面的影像，那个镜子里面的影像，就是你要照之前，你还没有按下快门，你先要取景，对不对？取景，那你还没有按下快门，就是说这个底片还没有感光，就还没有把这个影像印在这个底片上，你只是在寻找你要摄取的那个目标，这个寻找就是“作意”。当你设定了目标，这中间就已经有作意在里面了，你决定这个角度好，因此你按下快门，“咔嚓！”这时候你所取的影像就印在那个底片上。这个底片就好比我们的心田，所以这个时候我们的第六意识再取这个影像作为自己的所缘，这个就是所谓的法尘。所以五尘落谢的影子，就是所有的影子都印在我们的心田，就是你取境的意思，取各种的境，把它印在我们的心田，然后我们的第六意识再把它当作我们自己的所缘，所以它的所缘境就是法尘。</p><p>法尘就是五尘落谢的影子，五尘就是色、声、香、味、触，我们五根面对五尘之后，会有影像留在我们的心田当中，那第六意识再去分别它，去分别它之前，要先把它转为自己的相分，作为自己的所缘。所以这个相分是怎么来的？是第六意识的见分所变现出来的，所以我们第六意识它缘的其实不是外面的境界了，我们以为是我真的看到这个境界，然后我分别的是这个东西好不好看啦，这个好不好吃啦，我以为是外面的这个来引发我第六意识的分别，其实不是；我们第六意识缘的只是影像而已，五尘落谢的影子，没有办法真正的缘到外境（色、声、香、味、触这个五尘境界，没有办法亲自缘到），它缘的只是影像。所以它要先把它变成相分之后，才能够成为自己的所缘境。这个应该明白了，这就是法尘。</p><p>那就一定要有“作意”嘛，要不然我们眼睛看这么多的境界，可是你怎么去认识这个境界的内容是什么，就是说你看到了什么，然后你听到了什么，这个就要有作意在里面；要不然像我现在眼睛睁开，我看得很广啊，可是我要试图说明我看到的是什么境界的话，我必须先要有作意，这个作意就是我们刚才比喻的：你要先取景，照相之前你要先取景，你取好之后，你把它按下快门，这个就是作意。作意就是令心趣向外境嘛，你那个心趣向外境，取各种境界的时候，这个就是作意的作用。所以每个心识活动，它一定要有作意这个缘。</p><p>另外，就一定要有一个种子缘，所以还有一个种子依，作为它自己的亲因缘。每个心识生起一定要有它的种子，不然你生起的那个心识活动它是从哪里来？它不可能凭空来嘛，它不可能从虚空来，也不可能从你那边来，然后引发我的心识，我一定有一个种子让它生起现行。所以每个心识的活动它一定有种子缘，或者是一切法的生起，它一定要有种子生现行，所以一切法的种子含藏在第八意识，第八识就是含藏无量劫以来我们所熏习的种子，都含藏在我们的第八识。那现在面对境界的时候，是哪一个种子生起现行呢？就要看当时的因缘，所以要内因，然后加上外缘，外缘的牵动，牵动你内在那些无量的种子是哪一个种子先生起现行，所以我们心识的活动，它一定要有一个种子依，就是作为它自己的亲因缘。</p><p>那这些种子含藏在第八识，所以还要有一个根本依，就是第八阿赖耶识，是一切心识生起的根本依。</p><p>我们前面曾经介绍过九个缘，“眼识九缘生”嘛，那我们现在介绍了五个，还剩下四个，是第六意识不需要具备的。因为第六意识它内缘什么？刚才我们讲的那个法尘境界，它是内缘影像嘛，五尘落谢的影子，然后它内缘这个五尘落谢的影子，所以它不需要光线，也不需要空间，所以它没有明缘，也没有空缘。</p><p>然后第六意识本身就是分别了知，所以它不需要再另外立一个分别依。然后第六意识的，我们刚才说所依根是第七末那意，所以也不需要再另外立一个染净依，所以第六识没有，第七识没有。剩下的就是这五缘：一共九个缘嘛，剩下的空缘、明缘、分别依、染净依——这四个都没有，所以就只有五缘，就能够生起第六意识的活动。</p><p>所以，这个第六意识活动它容不容易？就是只要这五个因缘，我们第六意识就开始分别了。第六意识简单说就是我们的分别心，所有的分别都是从第六意识来的。那这五个缘容不容易具备呢？</p><p>非常非常容易：我们说你就一定会有作意嘛，因为你念念都在作意。而且一定有种子含藏在第八识，一有外缘的牵动，种子就生起现行了，所以一定有种子依，一定有根本依，也一定有作意。那这个所依根呢，所依根是第七识──恒审思量，第七识的作用是恒常不间断的，所以随时你第六意识要用，随时都有，所以它不会缺这个所依根的，因为第七识它就是恒常相续，一直在作用，恒常就是执有一个“我”的存在，这是第七识染污意的作用。那所缘境，这个法尘也是都有的，它也是一直都在。</p><p>所以我们就知道，为什么第六意识它非常容易生起，它活动的范围非常广，就是因为它所具备的缘少，而且又很容易获得这五个缘，很容易就能够获得，所以它能够恒常都生起这个第六意识分别的作用，我们几乎念念都在分别，念念第六意识都在作用。</p><p>除了五个情况之外，第六意识是不作用的，哪五个情况第六意识停止活动呢？</p><p>第一个，就是你入了无想定了。无“想”，那个想心所就是第六意识，你修禅定修到：我把第六意识的想心所灭了，我在这个无想定当中，这个第六意识是暂时被伏住，不生起作用。</p><p>那我死后就生在无想天，所以无想天也没有第六意识的活动，所以叫做无想天，他一直在无想这个定境当中。生前你入了这个无想定，死后就能够生在这个无想天当中（编按：这是第二个）。</p><p>第三个，就是灭受想定。这个是阿罗汉证的，是灭受想定，就可以入小乘的涅槃。所以他在这个定境当中，不但把想心所灭了，受心所也灭了，所以叫做灭受想定：这个定境当中没有想心所，也没有受心所，所以这时候的第六意识是不活动的。</p><p>还有，就是闷绝。闷绝就是昏过去了，暂时失去了意识。有人昏倒，当下第六意识是没有知觉的，暂时停止活动。所以在昏倒（我们称为闷绝）这个时候第六意识也不生起活动。</p><p>还有一个，就是睡眠，没有梦的时候、没有做梦的时候，也没有第六意识的生起活动。有梦的时候就有，做梦就是第六意识的作用嘛，才会有种种的梦境，那个时候第六意识是在活动的。可是无梦的时候就没有，第六意识没有活动。</p><p>所以除了这个五种无心位之外，第六意识是从来没有停止过活动，所以它的力量、活动力最强最广，几乎念念都有它。我们白天念念都在分别嘛，也是很忙的。</p><p>我们前面曾经介绍前五识，前五识的生起，第一刹那是性境、现量嘛，这时候有第六识加进来，这个叫做“明了意识”。当下的第一念，是还没有给它种种的名称跟言说，还没有详细地描绘说你看到了什么内容，听到了什么音声，还没有用种种的语言去描述它之前，你只是看只是看，听只是听，当下是现量的、无分别的，这个时候也有第六意识，这个时候的第六意识我们称为“明了意识”。“明了”的意思就是说，第六意识这个时候它的作用是帮助前五识去认识外境；前五识它只是管照境嘛，我们说好像镜子反映物体，它只是照境而已，但是里面到底是什么内容？那个分别要靠第六意识来分别。那有了第六意识的分别之后，你的前五识的活动才知道你看到了什么，听到了什么。所以“明了”的意思就是说，第六意识在帮助前五识的活动的时候，它是帮助前五识去了别外境，所以它称为“明了”，你就很明白地了别种种的外境，色、声、香、味、触，知道这个外境的内容。所以这个时候的第一念——第六意识加进来，它是明了意识，它是现量。</p><p>所以我们如果现在，譬如说去逛街，我就是看，我都没有特别起什么…，特别去取境，我就是看啦，然后这样逛啊逛啊，这个还没有锁定目标嘛，你那个“快门”还没有按下去。等到你锁定一个目标，就是你作意已经加进去了，然后你锁定一个聚焦，把你的焦点聚在一个东西上面，那就是有“作意”在这上面了，然后你就说：“诶，这个东西很漂亮！”很漂亮就有分别，不然你怎么知道它漂不漂亮？所以第二念就开始分别，这个时候就是比量了。第一念是现量，第二念就是比量。所以我们每天是不是都在做这个事情？没有分别的时候是现量嘛，可是大部分都是比量，大部分都是在分别，不断不断不断地在分别。</p><p>那晚上睡着呢，有没有分别？还是有啊！第六意识还在分别，就是你的梦境。就是白天五尘落谢的影子印在你的、留在你的心田，然后第六意识的见分，再把它变为相分境，作为自己的所缘，然后晚上的梦中，我们说的下意识、潜意识，白天所有留在心中的影像，到晚上就全部出来了，“日有所思、夜有所梦”嘛，所以白天第六意识在活动，晚上只要有做梦，第六意识也仍然在活动。</p><p>那你说我入定了，第六意识有没有？除非刚才讲的入了无想定、灭受想定，其他的定有没有第六意识？有！你说我坐在这边好安静，我什么都没有想，好像也没有念头，然后我就在这边非常的清净……，第六意识有没有作用？空空洞洞的、清清明明的，不管你用什么形容，当下好像就是圆明清净，还是一片光明，还是什么，就是你内心好像没有什么起心动念了，好像已经没有妄念了，当下的那个什么空空的、还是什么明明历历的，不管你去怎么形容，“那个”它还是法尘境界，懂吗？所以有些人坐到这个时候，他就以为说“我是不是见性了？”有啦！见到法尘啦！可是没有见性啦！</p><p>所以《楞严经》才会说：“内守幽闲，犹是法尘分别影事”，有没有？内守幽闲，你在打坐的定中，守一个那个“幽闲”，就是空空洞洞，好像什么都没有，好像一个非常宁静安详的，那样的一个状态，没有明心见性；“犹是”，仍然是什么？“法尘分别影事”，就是我们现在讲的：五尘落谢的影子，印在心田的法尘境界这样而已，第六意识去缘这个非常幽闲空灵的这样一个境界，把它当作自己的相分，所以它还是法尘分别影事。</p><p>所以你在定中，第六意识还是在起作用，只是它这个时候是现量，定中是现量，可是第六意识还在活动，它当下的那个法尘境界就是空空洞洞、宁静安详这样的一个状态，可是它还是法尘。白天它也是活动的很厉害，晚上睡觉做梦还是在活动，入定了还是在活动，所以我们才会说它活动的范围非常广，因为它具的缘很少，很容易就能够具足（得到这五个缘），所以它很容易就生起活动，几乎是没有停过，白天、晚上都没有停过。</p><p>好，那我们就明白这个第六意识它所具备的缘，还有它在“五无心位”是没有生起活动的，其他活动都是非常炽烈的。</p><p>那我们就来看第一首偈颂的第一句：就是“三性三量通三境。”</p><p>这个“通”的意思，就是全部都通，第六意识通三性，也通三量，也通三境；三性、三量、三境都通的意思。</p><p>那为什么它通三性呢？就是因为第六意识它跟五十一个心所全部相应。那五十一个心所里面有善心所，有烦恼的心所，还有无记的心所。所以当我们的意识生起活动，当下所相应的心所是十一个善心所的时候，这个时候的第六意识它就属于善性的；如果当下是跟根本烦恼、大随、中随、小随烦恼，任何一个烦恼心所相应的时候，我们就称为是恶性的，这个时候第六意识就是恶性的，就是你生起烦恼了，我们平常就说“我现在很烦恼”，这个时候是恶性的；当第六意识跟譬如说五遍行啊、五别境啊，还有不定四啊，因为这些都是通三性的，跟它们的无记性相应的时候，这个时候我们就说它是无记性的。</p><p>那至于这个善、恶、无记，是怎么去界定它呢？它就有一个定义。什么叫做善性？就是顺于正理，益于自他，叫做善性。所谓的善，就是顺于正理，就是合乎真理，或者是佛法的道理、佛法的义理，而且它一定是不但利于自己，也利于别人的，这个我们就称为善性。能利于自己，也可以利益他人，而且它绝对是合乎正理的。那什么是不善性，或者叫恶性呢？就是它违背正理的，不合乎佛法的义理，或者是跟真理相违背的；不但损害自己，又损害他人的，我们就把它归在恶性这个范围里面。至于那个没有办法把它归在善性，也没有办法把它归在恶性，这个我们就称为无记性，就是于善恶无所记别，没有办法把它归类，这个我们就称为无记。</p><p>我们第六意识是通三性，就是善、恶、无记都有。譬如说：我现在起一个念头，想要发菩提心，想要利益众生，我好好地精进在佛法上，成就以后希望能够利益一切的众生，这当下是善性；或者是，我对三宝、对佛法非常有信心，人家怎么样跟我挑拨离间，我的信心都不会动摇，我这个当下的信心就是善心嘛，所以我当下的意识是跟善性相应的一个状态。可是当我生烦恼了，那个不好的念头生起来的时候，这个时候我的意识就是跟恶性相应的。那譬如说我走在路上，我就是也没有什么特别寻求任何的一个目标，我只是这样很悠哉、很悠闲地这样走，我当下也没有什么好的念头，也没有生起不好的念头，当下这个就是无记，跟无记性相应的。所以我们第六意识生起的每一念当下，我们都可以把它归在善性、恶性，或者是无记性——就没有离开这三性的范围。所以我们说第六意识它是通三性的。</p><p>它第二个是通三量。所谓的三量就是现量、比量、跟非量。现量，我们现在已经比较熟悉了，就是第一念，当下第一念现前，还没有起分别之前，我们称为现量。第二念开始分别，这个就落入比量了，所以比量的意思就是开始比度，去度量你所缘的境界。</p><p>这个“三量”的意思，就是能缘的心我们称为见分，所缘的境我们称为相分。那我们每天面对很多的境界，这个境界是我们的心的所缘境，这个我们称为相分；那我们这个能缘境界的心称为见分，就是我们现在讲的见分有三量，就是我的心去度量我所缘的这个境界，要去认识这个境界它是什么样的境界，所以我的心必须要有度量这样的一个过程，我才知道我看到了什么、我听到了什么，然后我了知了什么，我明白了什么。所以一个是心，一个是境，我们的心面对境，这个能缘境界的心我们叫做见分，就是现在讲的三量，就叫识量嘛，我们心识去度量我们所缘的境界，所以叫做识量，就是它有现量、比量、跟非量的差别。</p><p>那我们心去认识这个外境，这个我们心的所缘境它叫做相分，它叫做“识境”，就是我们心识去量度的那个境界，它也是有三境（三种境界）：就是性境、带质境、跟独影境。</p><p>那我们现在先介绍的是三量。就是当下现前的，我们第六意识，就是我们刚才说的明了意识，当下现前的，第一念还没有生分别之前，我们就叫做“现量”。第二念开始分别，我们称为“随念分别”，接下来就是“计度分别”，计算的计，度量的度。随念分别，随着我的念，第二念就开始分别了，我们叫做随念分别。接下来就开始计度了，计算的计，然后去度量这个境界到底是什么样的一个内容，因为我要去认识外境嘛，我的心去缘外境，然后我要认识这些外境，所以我的心识做一种度量的作用。当下现前的，我们叫做现量。开始给它种种的名称言说，开始分别了，随念分别或者计度分别，这个我们就称为“比量”。</p><p>譬如说：我远远看到烟，我就知道它那边着火了，这个是比量。境界没有现前，我是用推测比度，知道那边有火，那边开始着火了。我怎么会知道？因为我看到烟了，所以我看到烟之后，我的心识活动去度量推测，那边一定是着火了，要不然怎么会有烟呢？又好比你煮饭，煮了一锅饭，到底有没有熟呢？你就拿一粒起来吃吃看，哎呀！熟了！就可以比度推测整锅饭都熟了，你不用每一粒每一粒去尝，每一粒吃完才说全部熟了，不必这样嘛！所以就是比度推测所得到的结果，我们叫做比量，因为它是比度出来的结果。</p><p>接下来要介绍非量，非量它其实就是相似的现量，或者是相似的比量。这个“相似”的意思，就是说跟原来的境界是错误的认知，颠倒的、错误的。像我们说现量，就是当下现前的，我们去认知它，它是现量的。那我们上次也讲过：现量它的定义就是说，你的认识没有错误的，我们上次是说你看到一朵花，它确定是一朵花，不是别的东西，那它真实也是一朵花，我没有认识错误，这个是真的现量。可是现在相似的现量，就是譬如说：你远远看到绳子，你以为是蛇，然后你走近才说“啊，它不是蛇，它是绳子”。当下现前，但是什么？跟你当初认识的是什么？刚好颠倒或者是错误的。所以说：“境界现前，量则全非”，所以叫做非量。它只是绳子，不是蛇；但是境界是现前的，你可以看得见的，可是跟事实是违背的，是错误的认识，这个我们称为相似的现量。</p><p>那如果说你推测比量的结果是正确的，没有错，那个就是真正的比量、真比量。那什么是相似的比量？就是你推测比度之后的结果是错误的，这个就是相似的比量，叫做非量。譬如说：我们每天都以为有一个“我”在作主，对不对？你每天早餐要吃什么，你是不是“我决定的啊？有一个我啊，我自己决定我今天要吃什么，我今天出门要穿什么衣服呀，都是我自己在决定的呀！所以我是自在的，我可以自在地作主”，所以认为有一个可以主宰的，然后可以自在的，然后全世界只有“我”最了不起嘛，那个是唯一的，我是唯一的、最了不起，那个慢——我慢，念念都有我慢在里面。</p><p>可是，事实上有没有这一个可以主宰、又可以自在，又唯一的“我”？是不是真实存在的呢？有没有这个东西？你真的可以自在吗？你真的可以作主吗？你说我不要老可以吗？我不要病可以吗？不可以呀！你作不了主的！是谁在作主？业力在作主啊！我们每天当下身心的状况，不是一个我在作主哦，我的身体现在好不好，健不健康，有没有生病，没有一个“我”在作主，业力使然，因缘所生。你过去造了什么业，你这一世就是展现什么样业报身，业力的展现，业力没有一个“我”在作主。如是因，如是果，因缘成熟，它就作这样的一个展现，这中间没有一个“我”可以自在作主的。你是不是一个唯一的？也不是唯一的。没有“我”，哪来的唯一嘛！唯一的“我”，大前提要有一个“我”啊！可是这个“我”不是真实存在的，所以也没有所谓的唯一。所以就没有办法合乎那个“我”的定义，你要有一个真实的“我”存在，它必须能够主宰，能够自在，而且是唯一的，这三个条件具足，才有一个“我”的真实存在。可是我们去了解一下，我是没有办法自在作主，我没有办法主宰，然后我也没有办法自在，我也不是唯一的。</p><p>所以这个“我”，比度推测的结果，以为有一个活泼泼的生命，它可以自在作主、唯一的——这个推测比量的结果，跟事实真相相反、错误的！一种错误的推测，比度的结果是错误的，所以它叫非量。所以有一个“我”的真实存在，这个是相似的比量，推测错误，所以它是非量的。</p><p>所以我们现在知道三量了：现量、比量、非量。非量就是相似的现量、相似的比量，叫做非量。反正跟事实错误的、颠倒的认知，都叫做非量。只是看境界现不现前，当下现前的叫做现量，经过比度推测的结果叫做比量，差别在这里。对的，是真现量、真比量；错的，是相似的现量，相似的比量——叫做非量，这个是错误的结果，跟事实互相违背，或者错误的认知，这样应该了解了。</p><p>好！现在考各位。我现在入定，第六意识保持无分别，是哪一量？现量、比量、非量，哪一量？我当下无分别，在定当中没有起分别，现量嘛，对不对？我坐在这里打妄想、幻想，我如果哪一天发财，中了乐透，我一定要环游世界——这是哪一量？非量嘛。晚上做梦，哪一量？梦境，晚上做梦的梦境，什么量？非量！晚上走路，远远看到枯的树枝，以为是鬼，以为撞见鬼，这是什么量？非量！好啦，大概没有问题了。</p><p>反正我们五根面对五尘境界的第二念就是比量，所以我们每一天不断不断地，第六意识不断不断地分别，都是在比量当中；那跟事实互相违背，就是全部都是非量，这样很简单就认识了。当下现前的第一念，没有分别的时候是现量；第二念开始分别，就是比量了。所以我们每一天面对这么多的境界，你是不是都在比量比较多？你无分别、现量，保持无分别、现量，可不可以去参加party？还是什么……shopping（购物）的时候，可不可以保持现量、无分别？很难嘛，不然就不会带一堆东西，什么打折、打折、打折，然后带一大堆东西回家，那个就是比量的结果。</p><p>所以我们为什么说要修定？修定就是说你练习保持第六意识的无分别，一直保持这个现量境，把这个时间一直拉长。保持无分别有什么好处？你第六意识没有分别，刚才讲说第六识跟第七识是兄弟嘛，它们有紧密的关系。你第六识无分别，第七识那个“我”有没有机会加进来？我现量无分别，第七识那个“我”可不可以硬放进来？我现量、无分别，放不进来，对不对？所以第七识它变成没有串习那个我执的力量，会越来越弱。</p><p>所以你常常保持第六意识现量无分别，第七识没有办法加进来说有一个“我”怎么样、怎么样……我在想、我在听，然后我的感受、我的见解、我的什么……那个我我我，那个“我”放不进来，第七识没有办法放进来。</p><p>然后时间长了会怎样？发生什么结果？那个般若无分别智就会现前，因为你是现量无分别，你要见的那个般若无分别智，它也是无分别，这两个是不是有可能会撞在一起啊？不是撞在一起，就现前了。你只要第六意识一直保持现量无分别，你那个无分别的智慧就会现前，因为它们都是无分别，不会打架，懂吗？可以很愉快地融合在一起，就有机会明心见性、开悟。所以我们当下开悟的那个…，现前的那个真如是什么？就是般若无分别智，它一定是在无分别的当下，它才可以出来。</p><p>你说我现在比量、非量，那个无分别会不会进来？因为不相应。所以我们第六意识如果每天都忙着在那边比度、比度。比量就是分别心嘛！不然你怎么有好坏啊、喜不喜欢，那个全部都是分别心的结果。然后念念有我，那个都是非量、非量、非量，每一念都非量，因为念念有我，也是错的。这样般若无分别智没有机会现前，因为不相应，因为你是在比量跟非量这个境界当中，所以那个般若无分别智是没有机会现前的。</p><p>所以为什么我们要修习止观？希望能够把我们的心安住在现量无分别的这样一个境界当中，久了以后，我们的自性就现前了、就开悟了、就明心见性了，所以这个现量无分别非常非常的重要。然后我们可以在这个定中一直保持，然后下座以后也一直保持，我们可以少生很多烦恼，少造很多业；因为所有的烦恼都是你比量以后才开始的嘛，然后“我”再加进来，烦恼就现前，贪瞋痴慢就统统出来了。有烦恼就造业，身口意就造业，造业就受苦嘛，所以都是自作自受啊，怨不了别人，都是自己造的，然后报在自己身上。</p><p>所以我们明白第六意识它保持现量的重要性，我们就知道怎么样用功了，为什么我们要修定那么重要？就是希望能够保持第六意识的现量无分别，时间越长越好，不但有机会开悟，而且它还可以帮助我们减少生烦恼、造业的机会。</p><p>好，这个三量应该没问题了，很清楚了。</p><p>所以我们第六意识，就是一定是通三量的。</p><p>它也是通三境，我们刚才说这个三境就是我们的所缘境，我们第六意识的心是能缘的心，它所缘的境界是什么呢？就是所谓的相分境，它分成性境、带质境、跟独影境。</p><p>性境，就是当下现前的，刚才讲的现量所缘的都是性境。你只要第六意识保持现量无分别，你当下所缘的境界都是性境。像前面前五识生起的时候，第六意识加进去，这个明了意识，当下是现量的，所以这个时候所缘境是性境（所缘的相分境是性境），所以现量的所缘一定是性境，这个没问题了。</p><p>我们刚才说比量的所缘一定是带质境，那为什么称为带质境呢？这个“质”，就是你要依托这个本质，而变带起相分境，成为自己的所缘。就譬如说：我们刚才说五尘落谢的影子，有没有？五尘落谢的影子，你第六意识的见分去把它变成什么？相分境，成为第六意识的所缘，那它这个本质是什么？它要依托五尘落谢的影子为本质，把它变现成自己所缘的相分境。</p><p>所以这个“带质”的意思，这个“质”，就是它一定要有一个依托的本质，譬如说五尘落谢的影子是它依托的本质。这个“带”就是变带，你依托这个本质之后，你把它变带成相分境，成为自己见分的所缘。所以我们刚才说第六意识它缘的是法尘境界，这个法尘怎么来的呢？五尘落谢的影子——以这个为本质，然后变起相分（变带起相分），就是现在讲的“带质境”的这个“带”，就是变带，你依托这个本质，变带起相分，成为自己的所缘，这样就懂了。所以比量它所缘的一定是带质境。</p><p>可是带质境它又分成真带质，还有似带质。真带质是“以心缘心真带质”，先把它当咒语来念：“以心缘心真带质，以心缘色似带质”。你能缘的心是见分，我们刚才讲了嘛，我如果所缘的境也是见分的话，就是以心缘心了。譬如说：我们刚才说，第七识的见分，缘第八识的见分为我，是不是两个见分？见分都是心嘛，能缘的心叫见分，对不对？再讲一遍。那个“我”的观念怎么来的？是第七识的见分──能缘的心，它缘什么呢？缘第八识的见分，把它变成相分境，以为是有一个“我”，那个“我”怎么变来的？两个见分变出来的结果，两个见分变出来的相分境，那个“我”就是以心缘心真带质。“中间相分两头生”，这个“两头”就是两个见分，一个是能缘的第七识的见分，一个是所缘第八识的见分，有没有？两头生起这个相分，这个时候的相分我们就称为真带质境。“以心缘心真带质，中间相分两头生”，两个见分所生的相分。</p><p>那什么是似带质呢？就是我们刚才说五尘落谢的影子，是以心缘色嘛。五尘落谢的影子，我们第六识的见分把五尘落谢的影子变成相分成为自己的所缘。所以这个时候的相分是怎么来的？一个见分所生的，对不对？第六意识的见分所生的，所以是“以心缘色似带质，中间相分一头生”，就是一个见分生的，所以也不是很难。</p><p>什么叫带质境，我们已经明白了，它一定要夹带本质，然后变带起它所缘的相分进来。那这个相分境的生起，是两个见分所生起的相分？还是一个见分生起的相分？两个见分生起的相分，我们叫做以心缘心，叫做真带质；一个见分所生起的，叫“以心缘色似带质”，就是五尘落谢的影子，就是法尘境界就是似带质，这样懂吗？</p><p>七识那个我执是怎么生起的？那个就是真带质，那个“我”的相分，我们称为第七识的作用，它所缘的那个境界（那个相分境），我们称为真带质；现在第六意识所缘的法尘境界，叫做似带质，都是比量所缘。我刚才讲比度的结果是错误的，叫做相似的比量，对不对？是非量！对！那五尘落谢的影子，我们第六意识去缘它这个法尘境界，然后把它…，就是去分别说这个外尘是怎么样，五尘落谢的影子是什么样的……你到底看到了什么、听到了什么，去分别这个境界，这个是比度推测的结果，叫做比量嘛。所以一个是真的比量，一个是相似的比量——叫做非量。所以它都是叫做比量所缘，叫做带质境，是比量所缘。</p><p>现量所缘的，叫做性境；比量所缘的，叫做带质境。这个中间再分：是真带质、还是似带质。真带质，如果是以第七识来讲，两个见分所生的相分境的话，它是属于非量的，这个它是叫做真带质。可是五尘落谢的影子，这个法尘境界我们称为似带质，以心缘色似带质，它是真正的比量。</p><p>OK？没有问题，对不对？继续：</p><p>还有一个叫独影境的。独影境很简单，独影境就是前五识不活动了，像我们睡着了，前五识、五根都睡着了，眼睛、鼻子、嘴巴都睡着了，对不对？五识都不活动了。只有第六意识单独活动，在梦境里面做得很热闹，有没有？每天晚上的梦境都非常精彩，这是第六意识单独生起活动，这个我们叫做独影境。就单独生起的影像，没有前五识的配合，第六意识不用前五识加进来，前五识停止活动了，第六意识单独在那边很热闹地活动，这个我们都叫做独影境。</p><p>所以第六意识单独生起的活动很多嘛，譬如说：你想想过去的事情，然后计划一下未来的事情，或者晚上做做梦啊，做一做白日梦，就是幻想啊，幻想一些什么……未来不管会不会发生的，可是我想起来就很欢喜的一些幻境啊，这些都是属于独影境。</p><p>可是它分成“无质独影”跟“有质独影”，这个“质”我们已经知道，它一定是夹带本质，像刚才讲的那个似带质，它就是有质的独影，对不对？因为它是五尘落谢的影子，它要依托五尘落谢的影子为本质，这个时候第六意识单独所生起的活动，我们就称为有质独影境，它是有依托本质的，然后才生起了第六意识单独生起了这个活动的，就是有质独影。</p><p>那个无质呢，就是根本没有本质的，譬如我们刚才说梦境，梦境你没有依托什么本质嘛，幻境，没有依托什么本质，这个我们称为无质独影境。就是什么龟毛兔角啊，你就想说：乌龟会长毛？乌龟不会长毛，所以根本就没有这个，它是非量的，兔也不会长角，所以龟毛兔角，它都是属于无质独影，它没有依托本质，因为根本没有这个东西，你没有办法依托嘛。像幻境，根本没有这个本质可以依托，你是在那边凭空去想象出来的境界嘛，所以它都是属于无质独影境，这样就很容易分别了。所谓的独影境，又分无质独影，有质独影，这个有质独影，也是我们刚才说的似带质。 <img src=\"https://oss.lianshi99.com/d/oss/uploads/tubiao/bs414.png\"/></p><p>所以我们最后看这个表，我们就很清楚了。这个相分三境这个表：有性境、有带质境；现量所缘就是性境，它是真的相分；带质境它是比量所缘，属于假的相分。那带质境又有真带质境、有似带质境，以心缘心真带质境，以心缘色是似带质境。似带质境，又分有质独影境，就等于似带质境，它都是比量的；无质独影境都是非量的。所以性境是现量，带质境是比量。第七识的真带质境是非量，就是相似的比量，是非量的；然后有质独影境是比量的，因为是五尘落谢的影子；无质独影境都属于非量的，就是空花兔角啊，兔子不会长角，还有梦境啊、幻境啊，这个都是属于无质独影境。</p><p>这样我们就把第一句的偈颂介绍完毕。</p><p>“三性三量通三境”，就是第六意识它不但通三性，也通三量，也通三境，所以它活动的力量最强，造业的力量也最强。</p><p>好，那我们刚好就是介绍到一个段落，我们今天就讲到这里。</p><p>（师颂，众师兄跟颂）愿以此功德，普及于一切，我等与众生，皆共成佛道。</p> </div></div>"
},{
    "title": "5.第六识(2)",
    "author": "净莲上师",
    "date": "2012年5月17日",
    "html": "<div class=\"B1_text\"><div id=\"fontsize\">\n<p style=\"text-align: center;\">最尊贵的净莲上师讲授<br/></p><p style=\"text-align: center;\">讲于新加坡Orchid Country Club</p><p style=\"text-align: center;\">二○一二年五月十七日</p><p>各位喇嘛、各位居士大德：</p><p>晚上好！</p><p>我们今天继续介绍第六识。</p><p>第一首偈颂的第二句是“三界轮时易可知”。</p><p>这句颂是说明：第六意识在三界九地当中活动的范围是很容易就可以了知的。</p><p>三界的轮回，三界的轮回是怎么造成的？是业力造成的嘛，对不对？如果是十恶业的话就堕三恶趣，如果是善业的话就生三善趣、三善道。所以整个三界六道的轮回是善恶业力所造成的。</p><p>那这个业力是怎么来的呢？就自己造的嘛，不是别人给你的，也不是阎罗王决定的，是自己造的。那八个识，哪一识的造业力量最强呢？我们昨天也稍微提到过，是第六意识的造业力量最强，因为它活动的范围最广，整个三界九地它全部都可以到达，都可以生起意识的活动，遍三界九地，造业的力量又最强，那它的行相又是最粗显，所以我们才说它是很容易可以了知的。整个三界轮转的时候，第六意识是很容易可以了知的，就是这一句偈颂的意思：就是“三界轮时易可知”。</p><p>那前五识、第七识、第八识，难道就没有那么容易了知吗？确实，相对第六意识来讲，它是没有那么容易可以了知的。我们前五识前面已经介绍过，它是没有遍三界九地的，还记不记得？前五识只能够到达初禅嘛，“眼耳身三二地居”，这三个识只能够到达初禅。只有欲界五个识都能够生起活动；但是到了色界初禅只剩下三个，二禅以上就都没有五识活动的迹象，所以它只能够活动到初禅。那第七识跟第八识，因为它是一种内缘、内执的力量，我们昨天也一再强调说那个“中间相分两头生”，有没有？就是第七识的见分执八识的见分为我，所以它是内执，第七识是执第八识的见分，把它当作是“我”。那第八识呢，它又是含藏无量的种子这样而已，跟外面都没有关系，有没有？第七识、第八识跟外面的六尘境界都没有关系：一个是执八识的见分，然后八识又含藏无量的种子，跟外境都没有关系，对不对？所以它的行相是非常微细，很难去了知的。</p><p>所以我们一般人是没有办法察觉第七识跟第八识的作用，一般人是没有办法察觉的；除非你定力很高，在定中可以看见，或者你证到至少八地以上，你才可以对第七识跟第八识有比较进一步的认知。那凡夫是完全没有办法察觉第七识跟第八识的作用，因为它跟外境没有关系。</p><p>那我们每天接触的，就是六根面对六尘境界嘛，这个是我们比较能了解的，第六意识分别了知我们也可以了解；但是第七识、第八识我们是很难了解。所以这句才会说“三界轮时易可知”，这是指第六意识，三界九地当中它活动是最广的，完全可以到达。而且它的行相非常粗猛：你第六意识一分别，跟哪一个善心所、恶心所，还是无记心所相应，马上当下你就知道你这一念是好的念头还是不好的念头，还是什么样内容的心所相应，你马上就可以察觉，所以它是很容易了知的，这个应该没问题了。</p><p>“相应心所五十一，善恶临时别配之。”</p><p>这个就是说，这句颂就是说明第六意识它所相应的心所有五十一个，然后这个意识是善是恶呢，要看它临时随缘分别配合的心所来决定。</p><p>那五十一个心所，我们前面已经讲了三十四个。还有十七个，就是根本烦恼的慢、疑、不正见，我们还没有介绍；随烦恼的十个小随烦恼，还没有介绍到；还有最后的四个不定心所，也还没有介绍。所以我们今天就打算把这个上一堂还没有介绍的心所把它补齐，这样我们就知道五十一个心所所有的内容，到底说了哪一些。</p><p>那现在我们要先知道，第六意识它五十一个心所全部相应。那这五十一个心所，有属于善心所，也有属于恶心所，也有属于无记心所，善、恶、无记都有。那你这一念当下是跟哪一个心所相应，来决定你是造善、还是造恶、还是无记业。</p><p>我们第六意识除了根本烦恼的贪瞋痴相应以外，它还有慢、疑、不正见相应。</p><p>这个“慢”，就是我们昨天也介绍过了，每个人都有，只是有没有现行这样而已，因为恒常与四惑相应嘛，第七识恒审思量，恒常与四惑相应，这四惑里面就有“我慢”。所以它是与生俱来的，天生就有，它不是那么容易断的，你再怎么隐藏，再怎么伪装，就是慢在骨子里，表面看不出来，骨子里面还是很慢的。那个没有办法，因为是天生与生俱来的，它是属于根本烦恼，天生就有的，它不是那么容易就说断就断，只是有没有现行的差别。</p><p>那这个“慢”来讲，它也有很多不同的上下的差别。所谓的“慢”就是心有高下，心有高下，所以它对应外在的整个大环境来讲，就是感得什么的共业呢？就是地震嘛。地震就是这个地区慢心的共业成熟了，就发生地震了。所以地震一发生，有的塌陷了，有的隆起来，有没有？所以“慢”的意思就是我们的心有高下，就会感得这个地区经常有地震的发生。就是没有地震的时候，它也是…，你看它的整个地形，这个地区的地形是平坦的大道，一片平原、草原；还是有高山、有丘陵，有那个低下去的河——也可以看出这个地区的共业，他们慢心的差别程度。因为外境是随着我们心意识来转的，所以这个地区大部分的人，每天想的是什么样的念头，它就会感得外在的环境是什么样的一个环境，依报随着正报转嘛，这个大家都知道。所以我们现在谈到慢呢，它就是心有高下。</p><p>那这个高下怎么来的呢？跟别人比较来的：我跟别人比的时候，是怎么样的情况。我如果比别人强，确实也是比别人强的话，那我一定是贡高我慢，理所当然嘛，因为你不如我嘛，这个时候我们就叫做…，第一个叫什么？叫做“慢”：就是自己确实胜过别人，或者自己跟别人差不多相等，这个时候我们也觉得自己很了不起，因为我比你好嘛，大不了我们相等嘛，我还是觉得我比较优秀啦，这就是第一种慢。</p><p>那第二种慢是我跟别人相比的时候，程度差不多，可是我要认为我比他厉害，我胜过他，明明是差不多；可是因为我的慢心，我觉得我胜过他。还有一种情况就是，比我自己强的时候，我觉得他不过跟我差不多，这个慢心就有一点超过了，对不对？所以叫做“过慢”，这个慢心是有点超过了。明明是相等，可是我们觉得我自己胜过他；明明他比我强，我还是觉得跟我差不多，这是有一点小小的超过。</p><p>可是还没有后面这个更超过，叫做“慢过慢”的，更超过。就是对那个胜过自己很多的，可是我还是认为我胜过他，那这种贡高我慢、这种自负就是更超过了，所以我们就说这种慢叫做“慢过慢”。</p><p>第四种慢，就是把五蕴当作是我，这就是一般我们说的“我慢”。贡高我慢那个我慢，其实就是说，色、受、想、行、识这个五蕴，其实它是生灭无常的，它是空无自性的，可是我们居然把它当作是真实的我：我的色身嘛、色蕴，这个身体是我的啊！要不然我为什么那么保护它？我的感受对我来说很重要啊！我的感受好不好，对我来说很重要啊！为什么很重要？因为我觉得这个感受是“我”的感受，这个属于受蕴。色、受、想，想蕴的话那更是了：我的想法、我的看法、我的见解，这些看法见解哪里来的？我的主意呀！从“我”来的，我的思想来的，所以我也把这些当作是“我”的思想、见解、看法——这就是想蕴。</p><p>行蕴就比较难了，行蕴就是说我们生命的流动，这一期的生命，从出生开始就已经步向死亡；可是我们居然没有察觉。它是没有一刹那停留的，每一秒、每一刹那都是快速的走向死亡，这是行蕴的作用。“行”就是迁流不息嘛，就是不断不断地在变迁、在流动，好像流水一样，它是不能够去把它切断的，这就是行蕴的作用。不管你要不要老，它就是会老，不管你要不要死，它一定会死——这就是行蕴的作用。它不停地往前，时间不断不断地往前流逝。那我们也会觉得有一个“我”怎样？从出生到五岁、十岁、二十岁、三十岁、四五十岁，从青少年到壮年，到中年、老年，有一个“我”嘛，跟着行蕴的流转，年纪慢慢地大了。</p><p>那这个识蕴也是，识蕴就是…，小乘是说第六识啦，可是大乘就是说有八个识嘛。这个识蕴也是不断不断地生灭。如果以第八识来讲，含藏无量劫的种子，那这个种子不断不断地起现行，不同的外缘，牵动不同的种子让它生起现行。每天就是种子生现行，现行再熏回去成为未来的种子，这就是识蕴的作用。它也是生灭生灭的：种子生现行，现行熏成种子，种子生现行，现行熏成种子……。整个生命的流转，或者讲整个三界的轮回，就是种子生现行，就是行蕴的作用，然后就是种子生现行生灭相续的一个现象这样而已，可是这中间并没有一个“我”的真实存在。</p><p>我们昨天曾经谈到说，以为有一个“我”可以作主嘛。那我们说了，其实没有一个“我”可以作主，是业力在作主，对不对？那各位有没有想到？有没有更深一层的体会？什么叫做业力在作主？就是现在讲到的这个识蕴，种子不断地生起现行，又熏回去成为未来的种子，这个就变成我们所谓的习气。像我们每个人都有自己的习气，就是所谓的个性啊、嗜好啊，这个就是你慢慢熏出来的嘛。</p><p>你说我今天早上我可以作主，我今天要吃西式的早餐，不是我自己决定的吗？诶？要问啊，你为什么喜欢吃西式的早餐呢？那就是过去你曾经吃过西式的早餐，那个种子怎么样？熏回去说西式的早餐好吃，熏回去成为未来的种子，所以下一次你要选择早餐的时候就西式的早餐，是谁在决定？是我在决定吗？业力的种子在决定，对不对？因为每个种子都是你自己熏回去的，每一个现行，身口意的现行结束了之后，全部熏回去了，成为你未来的种子。所以，我们第八阿赖耶识含藏无量的种子，全部都是你熏回去的，看你轮回多久，生生世世。所以我们也有带过去世的习气呀，过去无量劫以来，看你轮回多久，全部熏到第八识，现在有一个什么境界，你那个种子就现行了。所以是谁在决定呢？种子生现行，谁在决定呢？没有一个“我”在决定嘛，对不对？是你所熏的习气的种子在决定，也是你的业力在决定的，我们说的就是这个。</p><p>你所有的业报身也是业力的展现嘛，你过去世怎么熏，你这一世就是长得这个样子，从里到外，每个细胞都是业力使然，都是业力的展现。所以有的人为什么长得好，有的长得不好？就是你过去看怎么熏，它就是怎么展现啦。所以有没有一个“我”的真实存在？没有的，全部都是业力的展现、习气的展现，每一个都是你自己造的，每个业力自己造的，每个习气自己熏的，没有一个“我”在作主。就是不断不断地把种子生现行，然后再熏回去成为种子，就这样一个生灭相续的过程这样而已。</p><p>那我们觉得从生到死，有一个“我”出生了，有一个“我”死掉了，没有！就是这样一个生灭相续的过程而已，还会轮回到下一世，对不对？所以中阴身的时候还是一样，你临终的那一念，决定你的中阴身所现起的，你当下的那个状况，第八识的业力现前，就是你中阴身的景象，它也是生灭相续的过程，也没有一个“我”死掉然后进入中阴身，没有。然后再入胎，也是生灭相续的过程，都是种子生现行，都是行蕴、识蕴的作用，没有一个“我”又投胎了，从头到尾都没有“我”——这个才是诸法的实相。</p><p>所以，我们修行就是一定要明白这个无我的道理，要不然你怎么修，都是“我”在修，越修“我”越执著。我们现在讲的贡高我慢，修行越久，那个贡高我慢越强，因为我懂得很多嘛，你要讲什么，我马上就可以跟你回应啊，你讲什么法门，我也通通有沾过啦。</p><p>所以那个我执跟法执就是这样子出来的嘛，不明白这个道理。所以我们讲说这个五蕴都是生灭无常的现象，它没有一个“我”，所以色蕴不是我，受蕴不是我，想蕴不是我，行蕴不是我，识蕴不是我，都是生灭相续而已。我们把五蕴当作是我，所以叫“我慢”。本来没有我，居然把它当作是“我”，而且也还自以为了不起，这个叫我慢。</p><p>还有，就是“增上慢”。增上慢一般人还没有的，就是修行的人最会，修行人的专利，就是增上慢。什么叫增上慢呢？就是未得言得，未证言证。未得言得，没有得到菩提果啊、涅槃果啊，就说自己已经得到了，为什么你要这样说呢？为了名闻利养，为了要显示我的修行很高，所以我就说我已经得了；未证言证，没有证到说自己证到了：没有证到初果、二果、三果、四果，说自己证到初果、二果、三果、四果，说自己已经登初地了，说自己已经证到四禅八定了。未得言得，未证言证，就是说你本来没有的，你自己去加上去，所以叫做增上慢。这个慢心是你自己加上去的，叫做“增上”，本来没有到这个程度的。没有得，也没有证，但是你自己把它加上去，所以我们就叫做增上慢。在妄语里面叫“大妄语”，它是比较严重的妄语。</p><p>好，还有一种就是“卑慢”。就是我们不如人家的时候，我们不但不生惭愧心，还生起高慢的心，我们就叫做卑慢。就是自卑感所造的自大狂。明明是比不过别人，但是我还觉得“那个也没什么啊！”一种那种轻慢的心理，其实是他非常的自卑，然后表现出好像我不甩你啊，然后我也不觉得你有什么了不起呀！就是那副样子，那个德性、那个样子。那就是因为自卑感的作祟，所引发的一种慢心，我们叫做卑慢，是自卑感在作祟。</p><p>那最后一个是“邪慢”。这就是为了虚名假利，到处宣扬自己的德行，明明没有那个修行，没有那个品德，还到处宣扬，为了什么？为了虚名假利。还洋洋得意，自以为了不起，这个我们叫做邪慢。</p><p>这是属于根本烦恼。</p><p>还有根本烦恼──疑，也是跟第六意识相应的。</p><p>疑，就是怀疑，一种怀疑不信的态度。虽然来学佛修行，但是对佛法僧三宝也不是很相信；然后对佛法所说的道理，有的可以相信，有些还是存疑的，尤其是对自己还没有办法证到的部分，像佛菩萨的神通境界，“哎呀！那个根本就是说故事嘛！天方夜谭嘛！”讲到什么因果，讲一些因果故事，“就是要吓人家的，对不对？就是要吓到他不敢做坏事，所以就编了很多的因果故事，然后来吓唬人的。”他不相信有轮回，三世因果、六道轮回，不是很相信，就说那个他是编故事拿来教育人的。</p><p>所以，只要有怀疑不信的话，就是有这个疑。可是这个疑根如果不断的话，就是没有办法。如果说要学佛修行的话，这个疑根——带着疑根来学佛修行是不可能入门喏，不是说证果修行哦，是没有办法入门。所以说，佛法的大海“信为能入”，只要你还有一丝的怀疑，你都没有入门喏，不管你修了多久，学了多久，跑了多少道场，跟了多少师父，你就是还没有入门，懂吗？所以怀疑很严重，一定要把它断除！你带着怀疑来修，你就是不可能成就，因为怀疑不信会染污我们所有的心所，心只要你一念不信，全部都染污了。你好不容易修到一个还不错的境界，可是你这一念的怀疑，全部都完蛋、全部泡汤，因为你的心染污了。</p><p>譬如说：你跟一个上师学得好好的，修得也蛮好的，也觉得很相应；可是就有人跟你挑拨离间，说“那个上师有问题呀，传承有问题，他个人的私生活有问题，这个有问题，他的法门有问题。”听了心都凉了，“那我跟他这么久，然后他的法我修那么久，难道有问题吗？”那听完这个，一怀疑之后，你明天开始观想上师，就观想不起来了；明天修这个法，就乱不相应的。平常修完还有轻安喜乐，现在开始全部都完了，为什么？因为你的心完全受到污染了，所以这个时候你想成就一切的善法不可能，想成就一切的禅定功夫不可能，想要开悟不可能，开智慧不可能，证果不可能！因为你的心已经被染污了，你修什么就是不可能相应！因为我不可能说我一面怀疑，然后我就成就了，可能吗？不可能嘛！除非我有百分之百的信心，我才有可能成就嘛，我才可能开悟嘛。</p><p>我们上次也讲了，信心会让我们的心清净，清净到极点，你的自性就现前，你就开悟了嘛。所以你现在有一点点的小怀疑，小不信，你的心受到染污，你的心不清净，你可不可能开悟？不可能开悟啊！所以开悟是在——昨天讲的般若无分别智，完全的清净心的那个当下，你才可能自性现前，才可能明心见性。可是你有一点点的小怀疑、小不信，你的心清净不起来，所以你也别想开悟，自性也别想现前，修任何法门也别想成就，这样懂吗？</p><p>所以这个疑根就一定要断，才开始入门喏，然后你才带着你的信心，跟你相信的师父、相应的法门，怎么样？带着信心，才慢慢、慢慢地修你的信心。你的信心圆满，就是成就圆满的时候，懂吗？所以从头到尾其实我们都在修一个信心而已，信心没有那么容易的，懂吗？每个人天生带来的，这个也是天生带来的，就会怀疑哦！所以它也是很难断，有没有现行的差别而已，小怀疑、大怀疑的差别而已。</p><p>看你会不会怀疑，就看你平常的小动作就看得出来了嘛：你去买东西，会不会担心人家骗你买贵了，会的话就是哦！他给你出个价钱，杀杀杀！你交一个朋友，他对你有所求的时候，你是不是开始怀疑他了？他是不是打我的主意？他是不是想跟我借钱？他为什么突然会对我这么好？吓死了！所以这个怀疑，一般人就有的，只是严不严重的差别。</p><p>学佛修行以后，还是一样带着怀疑，因为这个是天生的。所以我们一定要靠我们后天的学佛修行，理要透、教理通透之后，你这个怀疑就会越来越少，为什么？你慢慢明白了道理，然后再把它修证、实证到，会不会怀疑？不会，因为你做到啦，证明它是没有错的。所以先听闻，然后思惟，相信了以后，你就改变了，然后你就做到了，这个你就不会怀疑了。</p><p>所以这个“信”也是靠修行来的，你的修行到什么程度，你的信心就到什么程度，它是跟着你的修行增长的。断疑生信嘛，所以你的教理越通达，实证的功夫越高，信心就越强，一定是这样，越修越有信心，为什么？因为你一步一步的都实证到了，然后教理越来越能够融会贯通，怀疑自然就会减少，一直到完全地断除为止。</p><p>还有，就是不正见、五种不正见。不正见也叫做“恶见”，就是一切不正当的见解，颠倒错误的见解，有五种：</p><p>第一个就是“萨迦耶见”，我们称为身见（或者是我见）。就是我们刚才讲的，把五取蕴当作是“我”，还非常坚固地执著这个五蕴是我，就叫做萨迦耶见、身见或者是我见。</p><p>有了“我”以后，我就要讨论“我”死了以后，就如灯灭就没有了呢？还是说有一个恒常的我不断不断不断地去轮回？我们现在都有答案了，对不对？如果你相信有三世因果、六道轮回，你就不会有断灭见，就不会说我死了就断灭了。那会不会落在常见呢？不明白五蕴不是我之前，我们都是有常见：就是我死了以后再去轮回，三界六道不断不断地轮回，谁在轮回？“我”在轮回呀！有一个恒常的“我”一直在轮回呀！这就是常见。他不会消失的，他就是不断不断地流转，一下三善道，一下三恶道，永远有一个“我”——这个是常见。我们现在就知道：这两个都不是正确的，所以它叫做不正见，错误颠倒的见解。</p><p>明明没有我，你还去讨论这个我是永恒存在的，还是死后就断灭了：一个是断见，一个是常见，都落在两边，所以我们称为“边见”。“边”就是两边，断常两边。所以这个是错误的，不管你讨论这个“我”是断灭的，还是永恒存在的，通通错！都是落在边见当中。</p><p>第三个是“邪见”。就是一切的颠倒见，我们都称为邪见；或者不属于萨迦耶见、边见、见取见、戒禁取见的范围，另外的不能够归在这四类的，其他的全部都称为邪见，所以邪见的范围比较广，但是它最严重的就是“拨无因果”，不相信有因果。因为不相信有因果，他就不相信善有善报，恶有恶报，他就不会去想要断恶修善，或者积极地去行善，因为他不相信善恶是公平的，因为他看了太多的好人怎么样？没有什么好下场，“所以哪里有什么善有善报呢？一个大好人，结果穷困潦倒，然后全世界的人都在欺负他，弄得一身的病，非常非常可怜，这怎么是大善人、大好人的果报下场呢？那一定不是有这个因果论的嘛！一定是不准的嘛！”所以还是很多人有这样的见解。</p><p>可是我们相信的人就知道，因果不是看眼前嘛，因果通三世嘛，对不对？这一世他是好人的展现，但是运非常的不好，是他过去所造的恶业先成熟，这样懂吗？那他这一世造了很多的善，但是这一世还没有成熟，可能下一世才成熟，或者是没有遇到成熟的因缘，也许会到下下世再成熟，还可能超过三世。就是它都含藏在你的第八识，你善恶业的种子都含藏在第八识，但是它什么时候感果？不一定的，因为一定要有外缘才能够感果，你那个外缘一直不成熟，它一直没有办法感果。所以不是看眼前说他做了这么多的好事，可是为什么所有的坏事都降临在他的身上。所以这个邪见也是，没有正知见之前，都是邪见，很多的。等我们听闻正法，如理思惟，然后依教修行，才慢慢地有正知见，然后才慢慢地邪知邪见越来越少；要不然大部分都是邪知邪见比较多。也要在学习佛法之后，慢慢才知道什么是正知正见。</p><p>第四个是“见取见”。所谓的见取见就是──坚持地、抓得牢牢的自己主观的见解，主观的见解，自己坚持是正确的。主观的见解是怎么来的？就是“我”来的，我的思想、我的见解、我的看法嘛。一开始就错，因为没有“我”啊，居然有“我的”见解，“我的”主观的见解，然后还坚持我的主观见解是正确的！别人跟我反驳的时候，我就说：“我很客观啦！我非常的客观啦！”那就是他绝对的主观的时候，懂吗？“我非常的客观”，你说他主观还客观？“我很客观地说我的见解这样而已呀！我认为这个才是正确的。”你说他主观还是客观？所以只要是你主观的见解，认为它是正确的，然后坚执地强调，然后对别人跟你唱反调的时候，完全不能接受，甚至生气了，有没有？</p><p>你们在选举的时候，两党就开始吵了嘛，一面看电视一面吵嘛：我支持这个党，他支持那个党，然后就开始……光是政见不同就已经很多那个主观的成见在里面了。然后每天也很多生活琐事，不断不断地发生，每个人都有自己的看法。那当彼此的看法不同的时候，就彼此强调他才是对的！全部都在五不正见里面，懂吗？我们现在看得就很清楚：他就有萨迦耶见嘛，他堕在边见里面，对不对？对错就是两边啦，一个一定要说你对，一个说你错，边见啦！然后现在就是什么？就一定有邪见嘛，一定有见取见，因为他现在坚持“我”的看法是对的，根本没有我，他还要坚持“我”的看法，那也是五不正见嘛。</p><p>然后，“戒禁取见”也是常常有的，就是你对一些戒律或者是那个禁戒，就是说很多禁止的一些约定俗成的那种规矩，一种约束的教条之类的，那你把它当作是正确的，然后你很严格地执守，以为这样子是造下正确的因，其实它不是正确的因；可是你把它当作是正确的，然后遵守一辈子都不敢违犯，以为这个是正确的因，结果它不是正确的因。那刚才我们讲那个见取见是“非果计果”，就是说它没有办法得到那个果报，可是你以为你坚持的这个见解是正确的，然后你这样奉行终身，以为会得到那个果报，其实是不对的，是错误的，因为它是错误的见解所引发的，当然就不是正确的结果，它就是错误的结果。所以一个是非果计果，一个是非因计因。</p><p>这个佛法最主要是对那个外道来说的；可是我们现在把范围扩大，就是把它用在我们日常生活当中，都是可以用得上的。反正你对一些禁戒啦，或者戒律，就“死”守在它的教条上面啦，然后非常坚固执持它；但是又不能够得到应该有的那个善果。那很多内容我们就不讲了，因为一讲的话就是要……很多又开始了，又开始要那个了，譬如说要不要吃素的问题嘛，对不对？大家心里就明白了，这个就吵了很久了，对不对？我们还是不要讨论比较好。反正个人自己选择，我们就是要很清楚地知道自己有没有落在那个五不正见当中，因为它确实是很重要的。</p><p>有了正知正见之后，你才可能破除这个见惑。破除这个五不正见，我们也讲过，它只证到小乘的初果而已，所以它的程度，就是说它要求的并不是很高。五不正见就是属于见惑，见解上的错误，见解上的迷惑，见解上不明白的地方，见解上所犯的错误，那要证到小乘的初果才能够暂时的不再现行，因为小乘已经证到什么？无我了嘛，小乘初果，所以它可以破除萨迦耶见、边见这些。小乘的初果就不会有五不正见。</p><p>所以我们在证得初果之前，每一个人都有五不正见，只是你有没有发现而已。所以下次跟人家争执的时候，说“我对”的时候，就好好想：我正在讲五不正见这样而已，就可以减少很多的争执，好好地在法上用功，那个是比较实在的，这样可以避免很多的争论。</p><p>第六意识还跟十个小随烦恼相应。它为什么叫小随烦恼？就是它可以个别现起，个别现起，它不是普遍会染污我们的心，所以我们就叫它小随烦恼，因为它比较单纯，然后它也比较容易断。</p><p>第一个是“忿”。忿每个人也有，保证每个人每天都有。惨了！只要你对眼前当下的情况有一点点看不顺眼，心里面有意见，那个就是忿、忿忿不平。像你去搭地铁，那个上下班的时候人很多嘛，会这样撞来撞去，有人撞到你，你是不是就狠狠地瞪他？那个叫忿，很容易的，每天都会发生的。心里面有一点小小的不爽，那个就是忿啦，只要你心里面没有充满了喜乐，那个就是忿，闷闷的，这样懂吗？所以看这个不顺眼，看那个不顺心，看这个有意见，然后看那个怎么样，小小的complain（抱怨）一下，那个都是忿，有意见就是忿，懂吗？它很容易犯的。所以这个时候还不严重，你就是complain完就没有啦，这件事情就过去啦，那个眼睛这样瞪完就过去了，你就还是走你的路嘛，这样就OK了，就是你很快就把它化解了，不顺眼，不顺眼转头就忘记了，就OK了。</p><p>可是，如果你还继续生气的话，那就会进到下面那个“恨”了。所以你这个忿怒的情绪如果没有排解掉的话，你继续把它放在心上，它就会变成一种怨结，就结在你的心上，我们说心有千千结，有没有？那个就是一个一个这样结起来的，你忿怒之后，没有把它化掉，在里面打一个结了，懂吗？那个叫做恨，就开始怀恨在心了。像你刚才跟某人吵一架，吵完就吵完了嘛，吵架是一种沟通，也蛮好的嘛。可是吵回来还没完啊，心里面又打结了，“他就是这样子、他就是那样子！”就开始怀恨在心了，那个叫做恨。就是前面的忿怒没有化解掉，变成一种怨恨，怨恨把它埋在心里面。</p><p>可是，如果说你去做个SPA啦，去跑个步啊，去游个泳回来没有了，也OK啊。可是每次想到还要再恨一次，那个进入下面那个“恼”了，这样懂吗？所以它是有层次的：先小小的忿怒，过来就有一点恨，有一点恨意在里面；每次想到他就开始咬牙切齿，那个就叫做热恼，身心整个热恼起来。尤其是当你不顺心的时候，已经很不顺了嘛，然后它就很容易爆。</p><p>所以常常会觉得很奇怪，你的亲朋好友，或者你的枕边人觉得很奇怪：“今天这么小的事情，也值得你跟我这样大吵一番吗？”他是忿跟恨已经很久了，你不知道，在里面已经打了很多结，很多的complain在里面，他就一直累积、一直累积、一直累积，一直压压，压抑、压抑、压抑，有一天就爆发了嘛！很小的事情爆发，你以为是“这么小的事情？有那么严重吗？”其实他不是今天……它只是导火线而已，不是今天这么小的事情他就爆发了，是因为他已经累积了太多的忿跟恨在心里面，今天怎么样？全身身心热恼起来，所以要跟你吵一架。</p><p>所以我们一回想起跟我们有怨结的那个人或者事情的话，啊！我们就开始身心热恼，然后就要开始想怎么样去报复了嘛，那个是从恼以后，你就会开始采取行动：就会想到怎样去恼乱他啦，让他没有好日子过啦，从此不得安宁啊，什么之类的——会有这些念头起来，都是已经进入了恼，所以你才会采取行动。</p><p>好，忿、恨、恼就是这样，那个瞋的程度而已。忿、恨、恼都是跟瞋的一分相应的。</p><p>所谓的随烦恼，就是根本烦恼分出来的，随着根本烦恼所延伸出来的一些大随烦恼、中随烦恼、小随烦恼。我们现在讲的是小随烦恼，它都是从根本烦恼延伸出来的，我们称为随烦恼，跟随这个根本烦恼来的，所以它一定是和根本烦恼的内容相应的。像我们刚才讲的忿、恨、恼就是瞋的一分，这都是瞋心来的，只是再细分来讲，它有忿、恨、恼的差别。</p><p>还有，我们现在讲“嫉妒”也是瞋的一分，嫉妒就是…，大家也很熟悉嘛，妒忌嘛，尤其是看到别人比我好的时候，比我顺的时候，又赚钱，然后又买好的房子，在很贵的地段买房子，然后吃好的、穿好的，开的什么名车，心里面怪怪的，那个一丝一丝嫉妒的心理就起来，那个就是嫉。它是一种见不得别人比我好的一种心理状态，所以它也是属于瞋恚的一分。</p><p>第五个是“悭”。悭，就是吝啬。舍不得嘛，所以它一定是跟贪相应的，所以它是属于贪的一分。有什么好的东西自己藏起来，不愿意跟别人分享，也不肯布施给别人，这个就是吝啬小气，我们说他“铁公鸡”这样子。那今天来学佛修行，有什么密法偷偷地藏起来，绝对不告诉别人的，无上密。所以这也是很多密法为什么会失传（的原因）。世间是很多秘方会失传，就是吝啬啊，不愿意告诉别人，好的都没有了，都不见了，一个一个消失了，就是因为吝啬的结果，这个就是“悭”的一种心理。</p><p>所以贫穷的果报怎么来的？就是吝啬来的，不肯布施、不肯财布施。不肯法布施的果报是什么？就愚痴嘛，怎么学、怎么修，就是不开悟啊、不证果啊。就是你曾经学法修行，秘密地藏了很多的法，不告诉别人，自己会的也不告诉你，为什么？“我怕你胜过我啊！你比我早开悟，比我早成就怎么办？别人都去恭敬你了，你名利双收，然后我就被你比下去了嘛，很逊嘛！”</p><p>所以佛法才会告诉我们一定要财布施、要法布施、要舍放下，没有一个“我”嘛，所以都很好解决，只要证到“无我”都没问题，因为这个都是“我”来的，没有一个我要贪嘛，所以通通都舍放下了。你喜欢，好啦，给你啦，反正死的时候也带不走。</p><p>“谄”。谄就是心邪曲、不正直，我们叫做谄，它是属于贪、痴的一分。就是我们研究他为什么要谄曲呢？为了自己的利益嘛，所以他才要去做一些巧言令色啊、卑躬屈膝啊，要取悦他人的这种手段啊，所以它是跟贪相应的，为了自己的利益。那这样做，他以为怎样？可以贪到便宜，或者是“我用这样来对我的长官，也许我可以升官啦、我可以发财啦，我可以从此一帆风顺啦”，这就是愚痴嘛！以为用谄曲的方式，可以达到我想要达到的那个目标，用尽了各种的手段，不断地用谄曲的方法去达到我的目的，这个是愚痴。因为这整个过程，从你谋划，到得逞、得手，这个过程你不晓得要造了多少业，懂吗？因为这个全部都是不好的心理，全部都是烦恼心所，每个烦恼，然后你又去把它讲出来，又去把它做出来，身口意全部造（业），还以为怎么样？可以得到你所想要得到的——不管是你想要得到的地位，还是名、还是利，不知道这个过程其实是造业的过程，不是成功的过程。所以我们说他是愚痴的。</p><p>“诳”，就是一种欺骗的心理。就是做了坏事，还把它隐藏起来，装着一副很有修行、很有品德、很有道德的样子。为了得到自己的名闻利养，花尽了心思，用欺骗的手段，然后迷惑别人，所以它也是属于贪、痴的一分，都是为了自己的利益，所以它一定是跟贪（相应）的。你为什么要欺骗？就是要贪一些什么利益嘛，所以你才要用欺骗的手段。那为什么愚痴？同理可证，以为这样子可以达到目的，其实它是造业的，造了很多的恶业，实际上非常非常不值得，可是自己不知道，所以说是愚痴。</p><p>这个“害”，就是损害。对一切众生没有怜愍的心，而且还进一步地加以迫害，它是属于瞋恚的一分，所以它也是瞋心来的。你为什么会想要伤害众生呢？就是瞋心嘛。只有瞋心的时候，才会想到要去伤害别人，所以它是属于瞋的一分。</p><p>那“憍”呢，就是一种自高自大的心理。我们常常说憍慢，就是自己觉得值得引以为傲，值得骄傲的那个部分，不管你是哪一个部分，你先生起对自己引以为傲的部分，先生起这个染著的心，就是自己先迷醉在这个里面，然后再心以为傲。不管你是觉得说你的相貌，你长得比别人相貌好啊，还是学问比人家高啦，还是身体一向以来都很健康，所以你会嘲笑那个病恹恹的人，或者你是有名啊利啊，还是比人家富有啊，不管是什么，只要你觉得值得骄傲的那个——全部都是憍。</p><p>那我们一般说憍慢、憍慢，憍跟慢有什么差别？我们刚才讲完慢嘛。现在这个憍，就是你自己没有跟别人比，你就自己觉得自己很了不起，值得骄傲的什么什么部分，也许是你成功的部分，也许是你天生的部分，也许是你后天努力的部分，不管什么部分，只要你觉得骄傲的那种心理，我们叫做憍。那个慢，就是跟别人比较之后，所引发的一种“永远是自己最了不起”的那种心理，是慢。所以一个是有比较，一个是没有比较，就是自己醉心在自己的成功里面。</p><p>第十个就是“覆”。覆，就是隐藏。隐藏自己的过错，不愿意坦白，我们就说他是有盖覆的。那他为什么要隐藏呢？就是又是害怕自己失去什么名闻利养啊，害怕有坏的名声啦，害怕被别人瞧不起啦，所以把自己所有犯的错全部都隐藏得好好的，不让人家发现，所以它也是贪、痴的一分。为了要自我保护嘛，为了要获得好的名声，或者是名闻利养，或者是什么，还是为自己的利益，所以它一定是跟贪相应的。然后一定跟痴相应的，因为他以为这样隐藏，一手遮天，人家都不会发现，完全不怕果报现前，所以我们说它是痴的一分。</p><p>今天时间已经到了，我们就介绍到这里，明天再继续。</p><p>（师颂，众师兄跟颂）愿以此功德，普及于一切，我等与众生，皆共成佛道。</p> </div></div>"
},{
    "title": "6.第六识(3)",
    "author": "净莲上师",
    "date": "2012年5月18日",
    "html": "<div class=\"B1_text\"><div id=\"fontsize\">\n<p style=\"text-align: center;\">最尊贵的净莲上师讲授<br/></p><p style=\"text-align: center;\">讲于新加坡Orchid Country Club</p><p style=\"text-align: center;\">二○一二年五月十八日</p><p>各位喇嘛、各位居士大德：</p><p>晚上好！</p><p>“善恶临时别配之”。</p><p>我们把五十一个心所介绍完了，那第六意识跟这个五十一个心所全部都相应，这里面有善、恶，还有属于无记——三性在里面。</p><p>第六意识虽然跟五十一个心所全部相应，但是它不可能同时生起，那到底是哪一个生起呢？就是现在讲的这一句：“善恶临时别配之”。就是意识是善是恶呢，就要看它“临时”——随当时的因缘，来分别配合的心所，来决定是跟善相应，还是恶相应，还是无记相应。因为你不可能五十一个同时生起，是不可能的，而且善跟恶是互相冲突的，所以善心所生起的时候，恶心所是不可能跟意识再相应的。所以它是要看临时、当下是跟哪一个心所来相应，才知道这个时候的意识是属于善、恶，还是无记性。</p><p>所以我们说，第六意识虽然它造业的力量最强；可是第六意识它自己单独是没有办法造业，一定要配合心所，它才能够完成造业这件事情。</p><p>所以如果意识它接触的是善境界的时候，这时候的善心所就从八识田里面的那个种子——善心所的种子生起现行，然后跟意识互相配合，就完成了善业。</p><p>那如果我们遇到的是逆境、恶境界的话，我们这个时候，像无惭、无愧这是两个中随烦恼嘛，还有忿、恨、恼、嫉、悭、害、覆，这七个小随烦恼，再加上根本烦恼中的瞋，一共是十个烦恼，就会从我们第八识的种子生起现行，跟意识相应，然后就完成了造恶业这件事情。我们就知道逆境界现前的时候，有这十个烦恼心所会从八识田生起，跟第六意识相应，然后完成了造恶业的这件事情。</p><p>那如果意识它接触的是不善，或者是有覆无记境界的时候，贪、痴、慢、疑、不正见，这五个根本烦恼，还有八个大随烦恼，还有谄、诳、憍这三个小随烦恼，加起来一共是十六个心所，就会从八识田的种子生起，跟第六意识相应，而完成了造作恶业，或者是有覆无记业。</p><p>这边有讲到一个有覆无记，还有一个无覆无记，这个后面会讲到，因为第七识属于有覆无记性的。我们现在讲第六意识它是通三性，对不对？那前面前五识也是通三性。那我们会讲到，下一次就讲第七识，再详细讲。那我们先要了解的是，第七识它是属于有覆无记。“有覆”的意思，就是有盖覆、有烦恼的盖覆，我们之前也讲过它恒常与四惑相应嘛，有没有？什么我贪啦、我慢啦、我痴啊、我见啊——这四个根本烦恼恒常跟第七识相应，只要你有第七识，没有转成平等性智之前，第七识只要一作用，就有这四个根本烦恼现起，所以我们称它是有覆无记性。这个“无记”的意思是：第七识它没有办法造业，它只是执八识的见分为我嘛，只要它现起，就有这四个根本烦恼，但是它没有造业的能力，懂吗？造业能力最强就是第六意识而已。第七识它的作用只是执八识见分为我这样而已，然后恒常有四惑相应，所以我们称它是三性里面，属于有覆无记性。</p><p>第八识我们也了解了，它是含藏无量劫以来的种子，所有我们曾经熏习的种子，全部含藏在第八识，所以它只是有持种的功能，持这些种子含藏在第八识这样的功能，所以它是能藏、执藏、所藏的功能，跟外境也没有关系。七识、八识跟外境都没有关系，都是内执的一种作用。那第八识它只是执持无量劫以来的种子，只是含藏这样而已，所以第八识也没有能力造业。所以第八识有没有四惑相应？又没有，所以它是属于无覆无记，它是没有烦恼盖覆的。所以我们现在要记的就是：第七识属于有覆无记，第八识属于无覆无记——这两个无记都没有办法造业。</p><p>所以现在谈到说第六意识跟有覆无记相应的时候，它就是这个有覆无记这样的一个状态，有覆无记业。然后如果是善恶心所完全不跟意识发生关系的时候，你这时候起心动念，只有五遍行、五别境，或者刚才讲的四不定这些的话，意识跟这些相应，就没有跟前面讲的善十一这些心所相应，也没有跟所有二十六个烦恼心所相应，都没有。只有五遍行、五别境、四不定相应的话，这个时候意识所完成的就是无覆无记性。</p><p>所以现在就了解了：就是善性、还是恶性，还是有覆无记性、还是无覆无记性，就看第六意识跟五十一个心所，哪一个心所相应，是跟善心所相应，还是烦恼心所相应，还是跟有覆无记相应，还是无覆无记相应来决定——这个就是“善恶临时别配之”的意思，应该了解了。</p><p>因为我们讲五遍行、五别境，跟四不定，才刚讲完，它们虽然都通三性（三性就是有善、恶、无记嘛），所以它们也可以是跟无记性相应的。所以第六意识跟这些五遍行、五别境，或者是四不定——无记性相应的时候，它就是属于无记性，这样很容易了解了。所以这个意识是善是恶呢，要看它和哪一个心所相应，因此我们才会说它是由临时分别配合的心所来决定，这个意识是善、还是恶。</p><p>好，下面一句：“性界受三恒转易。”</p><p>刚才讲到意识跟五十一个心所全部相应，所以它的活动是非常广的。那它这个活动是相应之后就一直持续呢？还是说它是有转变的？譬如说我跟善性相应，是不是就一直善呢？还是跟恶性相应，就一直恶呢？不是嘛！是一下善、一下恶，所以它是什么？“恒转易”，它是恒常转变改易的。所以在这一句颂里面我们就能够明白，第六意识它是恒常转变改易生起的。那又要分三性、三界、三受来说，就是说第六意识它在三性、三界、三受当中，是恒常转变改易的。</p><p>这个“性”，就是指善、恶、无记三性，在意识中是恒常转变改易而起的。这个很容易了解，因为我们是善变的心，对不对？一下善念生起说“我应该利益众生，发个菩提心吧”，等一下，下一念又“唉呀！众生很难度，人心是险恶的啦”，马上恶心又生起了。所以一下善、一下恶，然后也没有善恶的时候，就是无记的状态，所以它是变来变去的嘛。这就是第一个——三性来说，第六意识是变来变去的。</p><p>三界来说也是啊，三界就是欲界、色界、无色界三界，它也是。第六意识在这个三界当中也是恒常转变改易而起的。像我们修定就知道，我们是不是都一直都在欲界，就看你定力的功夫嘛，我们没有入定之前都是在欲界，对不对？可是如果你一旦入了色界初禅，你就不在欲界，你就入了色界，对不对？你入了初禅、二禅、三禅、四禅，你这个时候的心是色界心。如果你又再继续入无色界四空定，你当下的心是无色界心。可是你一退失禅定就又回到欲界心。所以欲界心、色界心、无色界心，是不是也可以转变改易？它也是变来变去的。所以我们也可能在现在的现实生活当中，在修定当中，这个三界是怎么样？转变改易的。</p><p>受，受就更容易了解了，一下苦受一下乐受嘛，没有苦乐受，就叫做舍，所以受就是指苦、乐、舍这三受，意识在这个三受当中也是恒常转变改易生起的。这个每天也在发生嘛：现在坐在这边很凉快，就是乐受啰；等一下出去，好热哦！那是苦受；温度刚好的时候，就是舍受，没有特别的苦乐受的时候，就是舍受。</p><p>这就是“性界受三恒转易”。</p><p>下面一句：“根随信等总相连。”</p><p>这句颂就是说：第六意识相应的心所法，也总是互相牵连而起的。这个“根”就是指六个根本烦恼，前面都介绍过了；“随”，就是指大随、中随、小随烦恼，一共有二十个随烦恼；“信”，就是指“信”啊这些十一个善法，十一个善心所；这个“等”就是剩下的五遍行、五别境，还有四不定，就是等，就包括了五遍行、五别境、四不定在里面。这就是所有五十一个心所，都是随从识性的转易而起的。</p><p>如果这个识性是善的时候，我们信等等这十一个善心所就同时跟它相应，就同时随它生起，随这个善性生起。假定这个识性是不善的，根本烦恼、随烦恼就会跟它同时生起。如果这个识性是无记的，遍行、别境、四不定，就会跟这个无记心所，跟它同时生起。</p><p>那它这个中间，五十一个心所之间，它总是互相牵连，它是怎么个牵连法呢？我们有一个表，大家看这个表就会很清楚。还是分成善类、根本烦恼类、还有随烦恼这三类。这五十一个心所之间它是互相牵连而起的，怎么个牵连法？</p><p>一、善类</p><p>1.信、惭、愧、无贪、无瞋、无痴、精进、不放逸、行舍、不害——若有一法现起，其余九法种子必同时活动。</p><p>2.轻安——一法若现起，前十法种子必同时活动。</p><p>就像信、惭、愧、无贪、无瞋、无痴、精进、不放逸、行舍、不害——十个善法嘛，对不对？这其中的任何一个法生起的时候，其他的九个种子都可以从第八识生起，同时跟它活动。这个意思就是说，譬如说当你有信心的时候，你就可以同时有惭愧心，又无贪、无瞋、无痴，然后又精进、又不放逸、又心平等住，就行舍嘛，然后又可以不害，只要这十个善法其中你有一个，其他都能够从八识田里面生起那个善法的种子。所以我们就知道这个善法很重要，因为你有一个，其他都有。当你有信心，全部的善都可以生起；一个怀疑不信，通通都没了。</p><p>那少了一个什么？少了一个轻安，对不对？因为轻安要修定才有，至少要入初禅，才有所谓的轻安。我们平常的那种乐受啦，或者那种快乐喜悦，都不能够叫轻安，那个是证初禅之后才有，所以轻安就没有放在这个里面。你有信心的时候也没有轻安，其他九个都有。轻安一定要修禅定才有，而且是要证初禅才有。可是，重点是你有轻安了之后，前面十个善法都有。</p><p>所以我们在介绍色界初禅、二禅、三禅、四禅的时候，我们才会说：你证到初禅有十种善法功德生起，有没有？其中里面有一个叫做“善心生”，就是在指这个——现在讲的十一种善法。你只要证初禅，有轻安之后，善心不断不断地生起，现在我们就知道它为什么，因为它是互相牵连生起的。你只要有轻安，这十个善法就能够不断不断地从你心里面生起。所以没有得禅定之前，你说“我为什么一下会怀疑，然后有时候做坏事，也没有什么惭愧心，脸不红气不喘”，那是因为你没有得轻安。你得了轻安、初禅之后，你心中都是恒常跟喜乐相应，身心又在轻安的状态，你那个瞋恚心很难生起，这样懂吗？根本烦恼那个瞋心不会生起，那跟瞋相应的忿恨恼嫉害也不会生起。所以你那个念头生起来都是善的念头，都是跟现在讲的十种善法相应的，那个念头都是好的念头，而且随着你的定力增加，二禅、三禅、四禅，你那个善心又不断不断地开发，它有层次的，会越来越深厚，善根会越来越深厚，随着你定的功夫增加，你那个善心会开发得越来越多、越来越多，所以你的信心变成越来越足，越来越增加、越来越增加，一直到圆满。</p><p>所以修禅定很重要，就是止观一定要修的原因就在这里：一旦你得定了之后，你不用勉强自己，或要求自己说“我不可以动恶念，我不可以动恶念”，这个时候就没有恶念，因为所有烦恼种子都被你的定力暂时伏住，起不来了。所以色界开始都没有瞋，色界天人四禅，无色界四空定的天人是没有瞋恚的，瞋恚是欲界才有；所以只要你入了色界初禅开始，你不会发脾气的，没有什么闹情绪的，没有那种心情很郁闷，没有，全部都是喜乐。喜乐状态就看你是证几禅嘛，初禅有喜乐，二禅有喜乐，那个不同的层次，三禅没有喜只有乐，四禅就舍念清净，就没有喜乐了，就跟舍受相应。我们刚才讲三受嘛：苦受、乐受、舍受。四禅开始以上、四空定，全部都是舍受相应，不再有喜乐了。</p><p>所以现在讲到这个善法跟定的关系，我们就知道它非常非常重要，修定是非常重要，只有定力可以把我们的烦恼心所暂时伏住，生起的都是善的心所，那我们造作的都是善业嘛，身语意开始都是善业。然后我们再透过忏悔啦、行善啦，再把我们含藏在第八识的那些烦恼、恶业的种子，慢慢、慢慢地清净。慢慢清净之后，那个一定要报的，可以重报轻受，那个不一定要报的就清净，你就不用受报了，你看多好！多便宜！所以忏悔很重要，就是一定要把它赶快忏除干净，能够忏干净就不用报，那个一定要受的，也可以打折扣嘛。</p><p>所以，佛法绝对不是说宿命论，善有善报，恶有恶报，好像都没有起死回生的功能，不是的。业力是由我们自己主宰的，每个业都自己造的，对不对？那已经造的来不及，只有忏悔，那将来可以不要造啊，你可以作主啊，你可以不要再造啊，至少造善的嘛，要造的话也要造善的，然后造清净的业。</p><p>好，这个就是善类，是这样互相牵连的情况。</p><p>二、根本烦恼类</p><p>1.无明（即痴）——一法若起，八大随烦恼种子必同时活动。</p><p>2.贪、慢、疑、见四法中——若有一法现起，无明及八大种子必同时活动。</p><p>3.瞋——一法若现起，无明、八大、二中种子必同时活动。</p><p>第二个根本烦恼类的话，我们就知道很麻烦了，你只要无明一起，那些通通都有了。</p><p>所以我们看第一个，无明就是痴，贪瞋痴的痴，根本烦恼有贪瞋痴的痴嘛。痴，我们这边就说无明：不明白无我的道理，以为有一个我的真实存在，那个就是痴、就是无明。只要这个痴一起，八大随烦恼，我只要当下是愚痴、无明一片，我就同时昏沉、掉举、不信、懈怠、放逸、失念、散乱、不正知，就从我们的八识田种子就生起现行，它可以同时生起这么多八个大随烦恼，只要你一起无明，同时都来。</p><p>第二种情况，是你如果起贪，或者生起慢心，或者怀疑不信的时候，或者是我们昨天介绍那个五不正见：萨迦耶见、边见……那些五不正见，任何一个生起的话，无明也来了，八大随烦恼也来了，它可以同时生起。我现在一起贪心，无明也来了，然后什么？昏沉、掉举、不信、懈怠、放逸、失念、散乱、不正知——可以一起来；同样的，我现在起了一个慢心，无明起，八大随烦恼一起来，可以同时生起；我现在一怀疑不信，八大随烦恼、无明同时生起；我有五个不正见生起的时候，也是无明生起，因为有五不正见就是无明来的嘛，因为无明以为有一个我，所以才有萨迦耶见，然后才有边见，才有邪见、见取见、戒禁取见，全部都是跟无明有密切的关系，然后八大随烦恼也可以从八识田里面生起它的种子，一起同时现行。</p><p>第三种情况，就是你一发脾气，瞋心起的话，无明也来了，八大随烦恼也可以一起生起，然后还有无惭、无愧。发脾气当下一定是没有惭愧心的，要不然你不会吵架嘛。你如果有惭愧心的话，你现在瞋心一起来就看到，就赶快惭愧了嘛，为什么？要惭愧什么？但是一般都来不及啦，要不然不会发脾气，有惭愧心的人应该是不会发脾气。万一发脾气，如果你来得及惭愧的话，那个吵架也吵不起来，为什么？你要惭愧什么？因为我瞋心的种子还在嘛，你要先惭愧这个啊！我的定力还没有入初禅，要不然也不会起瞋心，对不对？我们刚才说的，你只要有初禅的定力，不会发脾气，不会闹情绪。所以我要忏什么？忏我没有禅定的功夫，我要忏什么？八识田瞋心的种子习气还这么重，我要忏这个。我如果已经没有瞋心习气的种子，今天会不会发脾气？会不会起瞋心？不会啊！因为我种子清净啦！我如果禅定功夫够，你种子没有清净，至少也伏得住啊，它不会现行啊。</p><p>所以要先有这个惭愧心，先忏悔自己还有瞋心的种子跟习气、烦恼，这个业力还没有清净，禅定功夫也还没有成就，后面就通通没有了，因为你这一忏悔就怎样？就不会造恶业，然后又熏回第八识成为未来恶业的种子，它随时又会报，全部又报在自己身上嘛。所以了解这个道理的，他会很小心的，过去造的已经来不及，就赶快把它忏干净，那很小心地不要再造新的。</p><p>我们现在明白根本烦恼它是这样互相牵连生起的话，我们就知道为什么烦恼这么难断，为什么一起贪心、一起瞋心、一起无明就这么严重？原来它是互相牵连很多的，都可以同时生起，所以它不是单纯的一个烦恼而已，它是互相牵连，所以它会……那个烦恼的习气跟业力为什么那么重的原因，为什么那么难断的原因，就是因为它会互相牵连。这样会小心一点噢！</p><p>三、随烦恼类</p><p>1.大随八法中——若有一法现起，无明及余七法种子必同时活动。</p><p>2.中随二法中——若有一法现起，余一法及无明、八大种子亦同时活动。</p><p>3.小随诳、谄、害三法中——若有一法现起，无明、八大种子必同时活动。</p><p>4.小随忿、恨、恼、嫉、覆、悭、憍七法中——若有一法现起，无明、八大、二中种子必同时活动。</p><p>然后第三个就是随烦恼，它之间也会互相牵连。像大随烦恼，八个大随烦恼当中，只要有任何一个生起的话，无明也起了，还有其他七个也会同时从这第八识种子生起现行。所以你只要一落入昏沉，其他七个都有，所以昏沉里面有掉举、有不信、有懈怠、有放逸、失念、散乱、不正知，再加上无明。</p><p>第二种情况是中随烦恼：就是无惭、无愧。如果你没有惭愧心，做错了事情都不知道要忏悔，没有惭愧心的话，只要有其中一个，因为惭愧心一般都是一起生起的，它不会说我有惭心，然后没有愧心，不会，有惭愧心就是有惭愧心，没有惭愧心就是无惭、无愧。那这无惭无愧，只要任何一个生起的话，怎样呢？另外一个就一定生起，所以它一般是同时生起的，无明也起了，还有八大随烦恼也起了，都能够从八识田当中生起这些无明的种子，还有八大随烦恼的种子都能够生起现行，跟它一起相应。</p><p>所以我们知道，佛法上面也说，只要还有惭愧心都有救；对一个没有惭愧心的人来讲，他等于是没救了，很难救，我们现在也知道为什么很难救了。</p><p>第三种是小随烦恼：诳、谄、害这三法中有任何一法生起的时候，也同时有无明，还有八大随烦恼的种子同时活动。</p><p>第四种情况，就是小随烦恼的另外七个──忿、恨、恼、嫉、覆、悭、憍，这七法中有任何一法生起的时候，无明、八大随烦恼，还有无惭、无愧这两个中随烦恼的种子也会同时生起活动。</p><p>这就是互相牵连的情况。“根随信等总相连”，六根本烦恼、二十个随烦恼、十一个善心所，再加上五遍行、五别境、四不定心所，它总是互相牵连而起的，现在我们明白了。</p><p>下面一句：“动身发语独为最。”</p><p>这句颂是说明第六意识的作用，第六意识的作用是什么？就是造业力量最强，就是它的作用。那么，以动身发语来说呢，第六意识的力量是最强最大的，所以用“独为最”，单独它是最强最大的，以动身发语来说。动身、发语，就是我们要发动我们这个身业、还有语业的话，从意业开始，所以意业就是第六意识先有三种思，然后才会完成语业跟身业。所以，我们为什么说动身发语，第六意识独为最呢？它的力量最强最大呢？那我们就要知道，我们要发动这个身业跟语业的话，一定要有三个过程，我们要造口业、造身业的话，先要有意业，这个意业就是由第六意识来完成的。</p><p>像第一种叫做“审虑思”。思，就是令心造作嘛，令心造作就是造业的意思。我们心，第六意识这个意识心先造作，造作什么呢？当境界现前的时候，我们第六意识会先对它做一番筹度思量，来审查说应该要怎么样来应付这个境界。所以当有境界现前的时候，我们的意识就会先做一番筹度思量，这个就是称为“审虑思”。就是我先考虑考虑啦，考虑之后就决定了嘛，很简单说就是这样。决定了，就是下面那个“决定思”。所以我们在筹度思量之后，就会有所决定，这个时候我们就称为决定思。那一旦决定，我就要说出来、做出来了嘛，所以就有第三个“发动思”。发动什么？发动身、语，造作身业跟口业。</p><p>所以，前面的审虑思跟决定思，它是属于意业，我们要先考虑，然后做决定，这个还没有动作嘛，还没有说出来、做出来，所以这两个是属于身口意的意业，要先完成；一旦决定了之后，我就决定怎么说，就是造作语业，决定怎么做，就是造作身业。所以为什么说第六意识它造业的力量最强，尤其是动身发语独为最呢？就是因为它要经过审虑思、决定思、发动思，才能够动身发语。所以从意业的造作，到身业的造作，到语业的造作，全部都要靠第六意识来完成，所以我们才会说第六意识造业的力量最强。</p><p>那前五识可不可以造业？前五识要造业也是有第六意识加进去之后，它才有分别嘛，我们第一堂课讲的，就是去了别外境这样的一个功能，就是明了意识。所以前五识它造业的力量非常薄弱，也是靠第六意识的分别加进去之后，因为前五识它只是什么？照境而已嘛，就是看、听……这样而已；但是要第六意识加进去之后，你才可以了别外境，然后再进入第二念──随念分别，然后再计度分别，就是现在讲的审虑思、决定思，然后才有发动思。</p><p>那第七识、第八识能不能造业？我们刚才说它是有覆无记性、无覆无记性，可不可以造业？没有办法造业，它只是一种内执的力量，第七识执八识见分为我嘛；那第八识我们刚才讲，它只是持种的功能。所以第七识、第八识没有能力造业，只有第六意识在造业。</p><p>讲到这边，我们要不要恨第六意识啊？都是它惹的祸！可是，反过来说，如果没有第六意识，我们能够修行吗？前五识可以修吗？第七识、第八识可以修行吗？不可以嘛！所以修行还要靠第六意识，所以第六意识还是蛮可爱的。所以你是要造善业、造恶业，就第六意识来决定嘛，你要修定，还是第六意识来下手嘛。“六七因中转，五八果上圆”嘛，还是从第六意识下手开始修嘛！所以没有第六意识，还是没有办法修行，所以第六意识还是非常重要。我们下手修，也是从第六意识修，我们修定，也是保持第六意识的现量无分别嘛，还是从第六意识下手修，所以第六意识非常非常的重要。所以我们尽量不要造作恶业，然后靠第六意识来好好修行就对了。</p><p>下面一句：“引满能招业力牵。”</p><p>这句颂就是说明引业跟满业的性质差别。就是因为第六意识它动身发语独为最的缘故，所以总、别二报都是第六意识引业跟满业这两种业力所招感的，就是“引满能招业力牵”的意思就是这个意思。</p><p>那我们要解释什么是引业，什么是满业。</p><p>引业，就是引生我们去六道投胎那个总报体的业力。譬如说我们这一期的生命结束之后，引生你去投生的那个业力，我们称为引业。引，就是牵引嘛、引导。引导你去六道任何一道去投胎的那个总果报体，我们称为引业。</p><p>那满业呢？满业就是这个总报体上面获得圆满决定的业。就是说，譬如说你还是投胎做人好了，可是每个人他圆满的业不一样，对不对？有的人他六根很具足，有的人会缺嘛：天生眼盲的，天生耳聋的，六根不具的，有残缺的；那有的人是寿命长，有的人是寿命短，有的人是大富贵，有的是贫穷，有的是眷属美满，有的是每天吵吵闹闹、眷属不圆满嘛，有的是长得相好庄严，有的是长得面貌丑陋嘛，这个就是满业的差别，就是同一道以后（刚才引业就是引生哪一道），那同样生在那一道，每个人的别业又不同。</p><p>所以，引业也可以说是总报，然后满业是别报，就是个别个别的业力所展现的，在同一道里面，每个人圆满的程度不一样，那个是满业。</p><p>可是，引业跟满业都是第六意识造作的，然后含藏在第八识，成为这个生命的总报体。那你这一口气断之后，这个总报体就带着业力引生到下一道的轮回去。所以你的引业会引到哪一道去投生，就看你第六意识在生前造作了哪一些业。譬如说：杀业多的，就会引生地狱的总报；偷盗业比较重的，就会引生到饿鬼道，就会有饿鬼道的总报；那个邪淫多的话，就会引生畜生道的总报；修习十善业的，十善业多的，就能够感得天或者人的总报；十善业再加上禅定，有禅定功夫的，死后就会生在色界天或者无色界天的总报，看你的禅定是证到哪一禅，四禅八定的哪一定，死后就到那一天去，这个除了十善业之外，还要再加上定力的功夫。这就是引业跟满业的差别。</p><p>所以这个“能招”的意思就是说，引业跟满业这两种业能招感什么？总报跟别报这两种报。</p><p>所以这个“业力牵”的意思就是，我们在这个六道轮回当中，感受这个总报跟别报这两种不同的果报，完全都是由第六意识动身发语所造成的，引业跟满业所牵引的，所以业力是如影随形，所以叫做“牵”。所以这个“牵”的意思就是说，业力是如影随形，你不管投（生）到哪里，业力都是跟着你的。</p><p>所以我们对身外之物说不要贪著，生前就要舍放下，因为一个都带不走。稳稳当当带着走的是什么？就是现在你第六意识曾经所造的业，是一定跟着你一起投（生）到下一世的轮回当中。所以能够带得走的是业力，其他都带不走。所以带不走的我们就赶快舍放下；那个带得走的，就要好好地去斟酌这个业力的内容，是什么样的业力，因为它可以牵引你投生到不同的六道轮回里面去。都是第六意识造作的这些善恶业力，所造成的这两种总报跟别报的差别，就是引业跟满业的差别，都是第六意识所造作的。</p><p>这样我们就把这个有漏杂染识介绍完了。</p><p>接下来就是无漏清净识。第六意识要到什么时候才能够转成无漏清净呢？那在转成无漏清净之后，它又能够成就什么样的智慧呢？这个智慧又能够发挥什么样的作用？那我们看下面一首偈颂，最后一首偈颂就能够明白了。</p><p>“发起初心欢喜地，俱生犹自现缠眠。远行地后纯无漏，观察圆明照大千。”</p><p>这个有漏的杂染状态，要到初地的时候就可以开始转了，所以最初发起转识成智，是在欢喜地的初心，这个时候只能够转成下品的妙观察智，因为俱生的我执跟法执还是不时地现前。那一直要到远行地（就是七地之后），到八地才能转成中品的妙观察智；经过九地、十地，到等觉的后心，才能够转成上品的妙观察智，这个时候就是纯粹的无漏，第六意识才真正的转成妙观察智。这个妙观察智的作用，就是能够圆满、光明、清净地遍照整个大千世界。</p><p>刚才把这四句很简单地把它说明了，那我们再详细一点说明。</p><p>“发起初心欢喜地”，这个“发起”就是最初发起智慧是在什么时候呢？就在欢喜地的初心。</p><p>这个“初心”，就是初入欢喜地的一念心。因为每一地都有入、住、出，我要入初地（这个欢喜地就是初地的意思），登初地，初地有先入初地、住在初地、然后岀初地，然后入二地、住二地、岀二地，所以每一地都有入、住、出。这个最初发起妙观察智就是在你入初地的初心，就是入的时候，这个初心就是入初地的这一念心，我们称为初心，就是入、住、出嘛——入心的时候，就能够开始转识成智了。</p><p>欢喜地就是初地嘛，所以入初地之后，我们根本智生起，后得智也现前，所以就能够开始发起妙观察智的原因在这里，因为根本智发起，后得智也发起，所以它就能够断除由分别而起的我执跟法执。因为根本智就是你的真如现前嘛，般若无分别智现前，就明白那个无我空性的道理，所以由分别而起的我执跟法执，这个时候就能够断除。</p><p>可是，这个时候的智慧的力量还很薄弱，没有办法一直保持那个无漏的状态，所以这个时候是有漏、无漏互相间杂生起，所以我们才会说俱生的我执跟法执的现行还会现起，俱生我执跟法执的种子也还是眠伏不动，就是下面的一句：“俱生犹自现缠眠”。</p><p>这个“俱生”，就是指俱生的我执跟法执；“缠”就是以现行来说，我们说种子生现行嘛，这个缠是指现行来说；这个“眠”是指种子来说，种子好像还没有睡醒，还眠伏在八识田里面，就是说它种子跟现行都还在的意思。所以俱生我法二执的现行，仍然缠缚着有情，所以我们用“缠”来代替。这个“眠”，就是说俱生我执跟法执的种子，仍旧眠伏在阿赖耶识当中没有伏断，就是随时随地都会发生现行活动。就是由分别而起的我执跟法执可以断除，但是俱生的我执跟法执，不论是现行还是种子都还在，它会不断不断地现行的意思。</p><p>那我们当然不知道什么叫“俱生”、“分别”，所以我们现在要稍微解释一下，很简单地解释，因为在后面第七识的时候还会详细说。</p><p>“我执”有俱生我执跟分别我执的差别，什么叫做“俱生我执”呢？就是指我们无始以来，第六识跟第七识就是不断不断地熏习，我们还没有转识成智之前，第六识跟第七识都还在，它就不断不断地虚妄熏习。这个内在的这种力量，恒常跟我们这个身体一起来。“俱生”的意思就是你天生就带来，“俱生”就是与生俱来的意思，你只要出生就有俱生我执。</p><p>那俱生我执怎么来的？第七识跟第六识都有，为什么会有？因为我们第六识、第七识还没有转识成智之前，你只要生出来就有，所以它是与生俱来的。那它是怎么来的？我们刚才讲的，虚妄熏习来的，一直以为有“我”，生生世世你还没有转识成智之前，生生世世轮转都有俱生的我执，跟着你生命一起来。所以除非靠修行断，不然你是没有办法坐在那里它就自己断了，因为天生下来就有的。</p><p>那因为第六识跟第七识它们的差别就是：第七识我们一直讲，它是恒常的嘛，恒审思量，就是说它没有一刹那间断的。那第六识我们第一堂课已经讲过，第六识“五无心位”，它会有间断的时候，五种无心位是没有第六识的活动的，所以它是有间断的。所以我们在俱生我执，介绍这个俱生我执的时候，才会把它分成是常相续的、还是有间断的。那我们就知道，“常相续”指的是第七识，它恒常缘第八识的见分，妄执以为有一个真实的我，这个就是俱生我执的来源，它是恒常相续，它是第七识的作用，没有刹那的间断，睡着了还是有我啊，梦里面有我，对不对？不然谁在做梦？所以没有一刹那间断的噢！那“有间断”就是第六识，它是有间断的，第六识就是我们前面讲，就是它先变现出五蕴，然后我们再执五蕴为我，因为第六意识有间断，所以它这个俱生我执就是有间断的。也是……就是认为有一个真实的我，可是跟刚才那个我不一样，刚才那个是执八识的见分为我，现在第六识是执什么？五蕴为我，所以它们执的内容不一样；可是都是属于俱生我执，一个是恒常的常相续，一个是有间断，这样明白了？初步明白就好。</p><p>那这两种执著它是任运而起，就是随时它都会起来的，所以它是很微细，很不容易察觉，也很不容易断除。所以你开悟可不可以断？还没有办法断。刚才讲，开悟就是登初地嘛，初地只能断分别的我执跟法执；但是这个俱生的，是动都不能动，还没有办法断。所以它要到修道位之后，才能够慢慢慢慢地断除，它是比较难断的。</p><p>那另外一种分别我执就比较容易断了，因为它是由第六意识来的，第六意识分别来的，那我只要有正知见就断了。所以他一登初地的初心，它就断了。所以它不是与生俱来的，它是后天的熏习。</p><p>后天怎么熏习呢？就是看你是佛弟子、还是外道。因为外道有所谓的“神我”，有没有？梵我，无上的至上意识就是我，我就要把这个我消融，然后跟至上无上意识相结合，由这个小我跟那个大我相合，那从头到尾都有一个“我”，那是外道的“我”。那你怎么会有那些知见呢？就是第六意识，你亲近他们的老师，然后听闻他们的教理，然后依照他们的方法来修，因此你的第六意识就有一个他们所说那个“我”的影像存在，观念里面就有一个神我，或者梵我，或者至上意识、还是什么……不管用什么名称，就是有一个“我”，那它是后天的熏习，你去亲近他们的教派，然后听闻他们的教理，还有依他们的方法来修习。一旦见空性之后，你就知道是无我的。所以由第六意识分别而起的，不管是佛弟子执五蕴为我，或者那个邪教所说的分别我，你在登初地的时候都能够断，所以这个分别我执它是比较容易断的，在登初地的时候就能断。</p><p>那法执也是有两种，有俱生法执跟分别法执。也是相同的道理，只要是俱生，都是与生俱来。“无始时来”，就是第六识、第七识，“虚妄熏习”，熏习到内在有一股很强大执著的那个力量。所以我们天生与生俱来，一生下来就会……就是跟我们这个身一起来的，不用后天的熏习、分别，都不用，你天生就已经有俱生法执，也是分常相续跟有间断。</p><p>由第七识缘第八识的见分，对这个我相……就是更微细的执著，就是第七识缘第八识的见分以为有我，然后由它所产生种种的法。譬如说：五蕴的话，五蕴是法，我们执五蕴为“我”，那同时也会执五蕴这个法是真实存在的，所以由这个我而生起的种种那个法的执著，我们就称为“俱生法执”，由第七识缘第八识的见分来的，这个是常相续的。所以把这一切的法当作是真实存在的，不知道它是因缘所生，是如幻假有的这个法的执著，天生来的，这个我们都称为是俱生法执，跟第七识相应的，就是常相续的这个部分。</p><p>那“有间断”，就是由第六意识，它缘我们心识所变现的，不管是五蕴、还是十二入、还是十八界，这些种种的法相，我们天生都执著以为它是真实存在的；可是它是第六意识变现之后所执著的那个部分，就是有间断的。像我们都有嘛，像我们看一切的山河大地、宇宙万有，是不是都是真实存在的？这个就是属于第六意识的分别，第六意识有间断的俱生法执。那这个也是很难断，也是任运就能够现起，它也是非常微细，也是要在修道位上才能够慢慢地断除。</p><p>另外一种就是“分别法执”，分别法执就是后天的熏习，执著一切法是真实存在的，然后熏到八识田成为未来的种子。那有的是听了他们外道的说法，有关于一切法的不同教理，然后熏熏熏，熏到八识田里面，然后由第六意识而起的，我们都称为分别法执。</p><p>像刚才讲缘外道所说的神我等等的，它也是有一些影像，就是法，随着那个神我而延伸出来所说那个一切法的内容，它也是由第六意识分别熏习而起的，这些都是在见道位就能够断除。一旦证得无我空性的智慧现前，你就知道这个“我”不是真实存在，由分别而起的我或者法，都能够断除。</p><p>登初地的时候，由分别的我执跟法执可以断除。</p><p>那俱生我执跟法执的种子和现行，仍不断地现起。那要到什么时候才能够慢慢地断呢？就是后面这一句：“远行地后纯无漏”。要到远行地，也就是七地之后，就是第七地的后心，俱生我执才能够逐渐地摧毁，这个时候由下品的妙观察智，转成中品的妙观察智。然后再从远行地，进入第八地，经过第九地、第十地，一直等到等觉的后心，这个时候俱生的法执才能够断除，由中品的妙观察智转成上品的妙观察智。</p><p>讲到这边，我们就有一个概念，什么概念呢？第六意识要转识成智，分成三个阶段，对不对？初地的时候，初地的初心下品转，就是有下品的妙观察智；到八地的时候中品转，就是转成中品的妙观察智；到等觉的后心上品转，就能够转成上品的妙观察智——到这个时候第六意识才得到纯净的无漏，转成真正圆满的妙观察智，而能够圆明普照大千，所以说“观察圆明照大千”。那俱生的我执八地断嘛；俱生的法执，等觉后心断，所以它是最难断的，就是俱生的法执，要到最后才能够断除。</p><p>好，“观察圆明照大千”，这个“观察”就是指妙观察智，这个智慧善能观察万有诸法的差别。所谓的“妙观察”，它能够很微妙地观察一切法的差别，这个智慧首先它能够观察到的是千差万别的万法诸有。那成就的法门也是什么？千差万别的无量法门都能够成就，因为已经妙观察。像我们修两个法门就开始打架了，对不对？“我可不可以一面念阿弥陀佛，一面修天台止观？”打架了！也常常有师兄来问说“我早课念这个念这个，这中间会不会互相冲突？我晚课念这个这个，修这些法门、做这些功课，会不会互相冲突？”就是第六意识的分别、执著还是很重，所以没有办法圆融一切的次第也好，或者圆融一切的法在心中也好。</p><p>所以一直要等到第六意识转成妙观察智之后，你才能够善观一切的法，一切的法都能圆融入到你的自性，任何的千差万别你都可以善观察。善观察很重要，因为每个众生的根性不一样，他所好乐的法门也不一样。那佛菩萨要利益众生的话，一定需要妙观察智，先圆融一切的法门之后再善说，他善分别之后再善说。</p><p>所以这个妙观察智，就是第六意识是分别，可是转成妙观察智，叫做“善分别”，加了一个“善”，就是表示说他善于观察，叫做妙观察。所以一切法对他来讲，都没有任何障碍的，他全部可以圆融，世间法一样，出世间法、一切的法门也都是一样可以圆融。所以他可以说任何的一个法，也没有任何一个法会怎么样？互相冲突的，或者是有所障碍，不会。</p><p>如果我们了知一切法，要教导众生，要说给众生听，可是又没有那个口才可不可以？也不可以，所以还要有无碍的辩才；无碍辩才怎么来？也是妙观察智来的，所以他也善能够运用无碍的辩才。</p><p>所以他不但是要善分别，还要善观察，还要善说，要有无碍的辩才，让众生能够听得懂，能够一听就懂，一听就悟，所以他能够觉悟一切的有情，才能够真实地利乐一切的众生——这个都是妙观察智的作用。所以佛菩萨祂为什么能够化导一切众生，也完全是运用这个妙观察智。如果没有这个智慧，我们想要化导众生是非常困难的，因为又不善圆融一切法，然后又不善观察，然后又没有无碍的辩才，想要利益众生就比较困难，所以才称它为妙观察智。</p><p>这个妙观察智它有三大作用：</p><p>第一个是圆满。“圆”就是圆满，指妙观察智它的本体具足一切的功德，所以说它是最圆满的。妙观察智它的本体是最圆满的，因为它具足一切的功德在里面，我们说本自具足嘛。所以不用担心说我到时候是不是…，不晓得要怎样来说，或者不知道…，我不善观察那个根性，不善观机还是什么，都不用担心，只要你能够转识成智，你自然就有这个智慧，它自然就能够圆满光明清净，因为它是智慧的作用，它是妙观察智的作用，自然有这个作用。</p><p>“明”，就是光明。这个就是指妙观察智它的本体能够明照一切，所以说它是最光明的。</p><p>“净”，就是清净的意思。指妙观察智它的本体纯粹无漏，任何一个染法跟它都不相应，它是纯粹无漏的，所以我们说它是最清净的。</p><p>所以这个本体这么圆满、光明、清净的妙观察智，它就能够普遍地照耀整个大千世界，不但明显的地方可以照到，就是幽暗的地方也同样的可以照到，所以就是所谓的“无有一处不照瞩”，所以我们就称为“照大千”、普照整个大千世界。</p><p>这个就是用妙观察智的作用，来形容如来的果德，成就如来之后，它就有这样的功德：善能观察诸法，圆融无碍，次第分明，又能够了知一切众生的根性，还有他们所好乐的乐欲，也能够以无碍的辩才来说一切的妙法，令众生开悟，来获得最后涅槃的大安乐。</p><p>这一次我们第六意识三个晚上就把它介绍清楚了。那个分别我执、分别法执，刚才很简单的介绍，相信大家都听不太清楚。我们在第七识的时候还会介绍，因为就是要明白它是修什么观，譬如说它是修生空观、还是法空观、还是真如观，这个要详细说。因为今天时间已经超过，所以就把它草草结束。那我们后面再把什么阶段应该要修什么样的观，把它好好地介绍，然后再把什么时候配合什么样的修行，然后才能够断除俱生的我执跟法执，或者分别的我执跟法执，它也要修不同的我空观、还有法空观。所以那个部分还不清楚的话就不用担心，我们后面会再详细的介绍。</p><p>好，我们这一次的法会就到这里圆满。</p><p>（师颂，众师兄跟颂）愿以此功德，普及于一切，我等与众生，皆共成佛道。</p> </div></div>"
},{
    "title": "7.第七识(1)",
    "author": "净莲上师",
    "date": "2012年8月27日",
    "html": "<div class=\"B1_text\"><div id=\"fontsize\">\n<p style=\"text-align: center;\">最尊贵的净莲上师讲授<br/></p><p style=\"text-align: center;\">讲于新加坡Orchid Country Club</p><p style=\"text-align: center;\">二○一二年八月二十七日</p><p>法师、各位师兄、各位居士大德：</p><p>晚上好！</p><p>我们今天介绍第七末那识。</p><p>那为什么称为“末那”呢？“末那”是印度话，那翻成中文就是“意”的意思。“意”，是思量的意思，也就是思虑、量度。第七末那识思虑量度有一个“我”，那这个“我”是怎么产生的呢？就是缘第八阿赖耶识的见分的时候产生的，所以第七识在缘第八识见分的时候，把它思虑量度为“我”，这就是我们我执的来源。我们会以为有一个“我”，其实是非量的，并没有一个真实的“我”存在，那这个“我”是怎么产生的？其实是第七识的见分，它在缘第八识的见分的时候，把它当作是“我”。</p><p>所以现在讲这个“末那”，它是思量的意思，就是思虑量度有一个“我”，那这个“我”是怎么产生的？就是它在缘第八识见分的时候，把第八识的见分执为“我”，这就是“我”的来源。所以我们知道第七识它称为“末那”，“末那”就是“意”的意思，也是“思量”的意思。</p><p>另外，它也称为意根，因为它是第六识所依之根。我们前面介绍过第六识跟第七识它们的关系非常密切，因为第七识称为染净依嘛，所以第六识是清净的还是染污的，完全看第七识。第七识它还没有转识成智之前，第六识念念是染污的；那第七识转成清净以后，那第六识才可能念念是清净的。就是当第七识念念是无我的时候（我们说恒审思量嘛，在没有转识成智之前，我们是恒审思量有一个“我”），那证到无我之后，是恒审思量“无我”，所以这时候的第七识是念念无我的，因此第六识也是念念清净的。</p><p>所以我们知道，在第七识没有转之前，我们不管如何的努力，那个“我”都是非常的难断，那“我”没有断之前，我们所有的什么善法、功德全部都是染污的，就是它一定只有人天果报，不能够出三界。所有的善法功德只感得人天果报，除非你念念无我，行所有的善法功德，你才可能出三界，那个功德才是清净的；要不然都有一个“我”嘛！“我”在行善、“我”在累积功德，所以这时候第七识念念是染污的。</p><p>所以第六识它依什么呢？依第七识，所以第七识是第六识意识所依，所以它称为“意根”。第六意识所依之根，所以第七识叫做“意根”。第六识叫做“意识”，第七识叫做“意根”。“意识”跟“意根”很容易混淆，所以常常就不翻“意根”，而称为“末那”，它的原因在这里。所以我们就说第七末那识，而不说意根，意根常常会跟意识混淆，所以我们就保留它原来的音，不去翻译。</p><p>所以我们现在就得到一个结论，第七识称为“末那”，也叫做“意根”，也叫做“思量”，所以以后看到末那、意根、思量，我们都知道它指的是第七识，这样就可以了。</p><p>那第七识它要生起，需要哪些因缘呢？因为一切法因缘所生嘛，第七识要生起作用，也必须要有它的因缘。那在八个识当中，第七识所需要的缘最少，它只需要三个缘，就是根本依、作意，还有它自己的种子。“根本依”我们前面也介绍过，所谓的根本依就是指第八阿赖耶识，它是诸识的根本，八个识一切识要生起，就一定要有第八阿赖耶识，所以第八阿赖耶识是诸识生起的根本依。所以现在第七识要生起作用，当然也是要有这个根本依，指的是第八阿赖耶识。那“作意”我们也讲过，一切心识的活动，一定要有作意。第三个，是自己的种子，这个也是一定要有的，一切心识的活动也一定要有自己的种子生起，所以各识都自有它的种子，称为种子依，那也就是生起诸识的“亲因缘”。那它所缘的，我们称为“所缘缘”。那还有一个“增上缘”，像作意，其他的，除了亲因缘跟所缘缘之外的，我们都称为增上缘，就是之前提到的空间啦、光明啊、分别依啊——就是第六意识分别依啊等等的，除了亲因缘跟所缘缘之外的，都是属于增上缘的部分。</p><p>所以在唯识里面就讲到了有四缘：一定有“亲因缘”，就是它自识的种子；然后还要有它的所缘的对境，有能缘的心，还要有它的所缘的对境，有能缘的心，还有所缘的境嘛。能缘的心叫做见分，所缘的境叫相分，这个之前我们都介绍过了。所以它的所缘境就是它的“所缘缘”；还有，其他的就是“增上缘”；另外一个“等无间缘”，就是说它前念灭、后念生，这个中间是相续不间断的，叫做“等无间缘”，就是平等没有间断，叫做“等无间”。“无间”就是没有间断，平等没有间断的相续的活动。所以，它一定是具有四缘。</p><p>所以我们现在也要知道的是，第七识它所需要的缘，就是有根本依、作意、还有自种子，这三缘就可以生起它的活动了。</p><p>好，我们看第七识颂，也是分为两个部分：第一个部分是有关于有漏杂染识的部分。</p><p>首先看第一个偈颂：</p><p>“带质有覆通情本，随缘执我量为非。”</p><p>这个我们现在看到就比较熟悉了，对不对？“带质”，就是前面我们说的真带质嘛，这是说明它的识境。所以这两句颂是说明第七识的识境、识性、还有识量。识境，就是带质境；识性，是有覆无记性；识量，属于非量。那我们一个一个解释。</p><p>第一个“带质”，就是说第七识在三境当中，它属于真带质境的，我们前面也介绍过“以心缘心真带质”，有没有？还记得吗？“中间相分两头生”。以心缘心，就是两个都是见分，我们说能缘的心叫见分嘛，所以我们看“以心缘心”，就这个“心”就属于见分，哪两个见分呢？就是第七识的见分，缘第八识的见分，执为“我”，对不对？所以是两个见分，就是“以心缘心”。</p><p>“中间相分”，以心缘心之后，它产生这个我执，就是“我”的这个相分是两头生的，就是两个见分所生的。“两头”，就是一头是能缘的心（就是第七识的见分）；另外一头就是所缘境，就是第七识所缘的第八识的见分，是第七识的所缘境。所以能缘的心是第七识的见分，所缘的境是第八识的见分。所以第七识的见分在缘第八识的见分的时候，就是第七识的见分依托第八识的见分为本质，因为这个带质这个“质”就是带有本质，这个本质是什么？就是第八识的见分为本质。第七识的见分依托第八识的见分为本质，然后变起自心中的相分，就是这个“我”，作为自己的所缘，这个所缘的境就是第八识的见分，所以是真带质境。</p><p>以心缘心真带质，带有什么本质呢？第八识的见分为本质，然后变现起相分，成为自己的所缘。所以这个所缘境是第八识的见分来的，它依托第八识的见分为本质，然后变现成自己所缘的那个相分境。所以，第一个“带质”我们就明白，第七识它是属于真带质境。</p><p>第二个“有覆”，是说明第七识在三性当中，它属于有覆无记性的，所以这个“有覆”就是有所盖覆的意思。</p><p>第七识恒常与四惑相应，就是第七识在没有转识成智之前，念念都是有什么？我贪、我痴、我见、我慢这四个根本烦恼，我们叫做四惑。恒常与四惑相应，就是说从来没有间断过。“恒常”就没有间断过，念念都有我贪、我痴、我见、我慢。这个很恐怖对不对？我们每个念头都有这四个，从来没有间断过，睡着了在梦里也有，这样懂吗？</p><p>前面我们说第六识还有五无心位嘛，五种有间断的；可是第七识是恒常没有间断的，念念都有我贪、我痴（我痴就是无明嘛，不明白无我的道理）、然后我见、我慢。那这个为什么很严重呢？因为这四个根本烦恼会盖覆我们的真如本性，没有办法现前。我们不是说要让我们的真如自性现前吗？希望能开悟吗？希望能明心见性，见到我们的真如本性，可是为什么见不到？问题就出在第七识，懂吗？念念都有这个四惑相应，因此我们虽然本自具足、菩提自性本自具足，但是它就是不现前，为什么？因为第七识是有覆无记性，“有覆”就是有盖覆，被什么盖覆？就是被这四个根本烦恼所盖覆。</p><p>所以在没有转识成智之前，没有转成无我之前，它其实是很难开悟的。所以开悟是悟什么？也是悟到这个无我空性的道理呀，也是我们说的般若无分别智现前，就是开悟的当下，它当下没有我的，就是明白了这个无我的道理，叫做开悟。开悟之后，你第七识才可能转成清净的，就是所谓的转识成智，也是开悟之后的事情。所以无我的事情也是开悟之后的事情，见到这个无我的真理之后，你才可能念念无我；在这个之前都是念念有我的，而且非常的执著，恒常没有间断的作用。</p><p>所以，这个第七识它是恒常与四惑相应，盖覆我们的真如本性不能现前，而幻起——虚幻地妄起以为有“我”的错觉，而且牢牢地在这个上面有所执著，所以我们称为“有覆”，就是有盖覆，盖覆我们的真如自性没有办法现前。这个是第七识，它在三性当中是属于有覆的。</p><p>而且，它是无记性。我们也介绍过什么叫“无记”，就是善恶无所记别，或者善恶无所记取的意思。第七识虽然它有盖覆，被这个四惑盖覆；但是它自己却不会造作善业或恶业，它没有办法造作善恶业，所以我们说它是无记性的，对于善恶无所记取。</p><p>我们已经知道第六意识造业的力量最强，前五识要造业也要靠第六识，因为前五识的生起有分别依嘛，有第六识加进去，它才可能有造很微细的、很轻微的善恶业，或者无记业。第七识不会造业，因为它是无记性的；之后我们要介绍第八识，它也没有造业的功能，因为第八识属于无覆无记性的，无记性的都没有办法造业。所以只有第六识造业的力量最强。所以我们说第七识它是属于有覆无记性的，这个无记性就是指它没有造善恶业的作用。</p><p>下面就是第三个说“通情本”。这个“通”是通下面两个：“情”、还有“本”字，就是通情又通本，情本兼通，所以叫做“通情本”。</p><p>那什么是“情”呢？情就是情执，指的是第七识的见分，它是情执的来源。因为第七识的见分恒常坚固执著第八识的见分为“我”，而且对它爱恋不舍，所以叫做情执。所以我们现在就知道了，我们常说这个人情执很重，指的是什么？就是第七识的见分。那为什么称众生为“有情”众生？这个“有情众生”，就是有情执的众生，叫做有情众生，指的也是第七识的见分。第七识的见分永远执八识的见分为“我”，这就是情执的来源。所以我们就知道，情执指的是第七识的见分——这个能缘的心。</p><p>那这个能缘的心缘什么呢？就是缘第八识的见分。所以，第七识的见分依托第八识的见分为本质，变起自心中的相分，作为自己的所缘，所以叫做“本”。这个“本”就是指本质的意思，指的是第八识见分这个所缘的境，称为“本”，因为第七识的见分就是缘第八识的见分为本质嘛。</p><p>所以，我们现在知道“情”跟“本”指的是什么了，对不对？</p><p>所以第七识它所执这个我相是怎么来的呢？它一方面通情，也就是第七识的见分——这个能缘的心；又一方面通本，也就是第八识的见分——这个所缘的境，所以叫做通情本：情执、本质兼通，叫做通情本。</p><p>“随缘执我量为非。”</p><p>这是说第七识在三量当中是属于非量的。非量我们前面也介绍过了，根本不存在的，把它当作是实有的，就是属于非量。所以这一句的意思是：“随”第七识见分“缘”第八识见分时就执为“我”，本来没有我，妄计为“我”，属非量，所以说“量为非”。</p><p>所以这个“我”，根本就是世界上没有存在这个东西的，根本不存在“我”这个东西。所以我们念念有我，其实就是第七识的见分，它在执第八识见分的时候，把它当作是我。</p><p>所以我们就要进一步地去讨论，为什么第七识的见分在缘第八识的见分的时候，会误以为有“我”呢？为什么会把第八识的见分当作就是“我”呢？那要首先知道“我”的定义是什么。</p><p>“我”的第一个定义就是“常”，相续、不间断的；因为“我”不可能一下子出现、一下又消失，对不对？所以所谓的“我”，给它一个定义，一定是恒常、不间断的，所以它一定要符合“常”这个特性。而且它还要“唯一”，对不对？我们每一个都认为我是世界上独一、最厉害的那一个嘛！全世界只有“我”最厉害！“我”是唯一的嘛！“我”的定义也一定要是唯一的，而且它是能够主宰的，能够自由作主的，这样就符合了“我”的定义。</p><p>所以我们现在看第八识的见分，它是不是符合这个定义呢？第八识的性质它是恒常相续、始终不变的，所以这个“恒时相续”就是符合“常”了嘛，第八识的作用也从来没有间断过，所以它就是“常”啰？而且始终不变，这个就符合“一”嘛，那个会变来变去的，那个就不符合“一”嘛，那第八识的见分也是始终不变的，而且是能够自在作主的。</p><p>所以第七识的见分，它在缘第八识的见分的时候，看到它是常，又一，又主宰，又能够自在作主，就以为是真正的有一个“我”，它是恒常、唯一，是能够主宰，不知道它是相似的，并不是真的。因为我们知道第八阿赖耶识它也是生灭法，也是生灭、生灭……，我们八个识都是生灭的嘛，所以第八阿赖耶识它也是生灭的作用。可是它生灭相续没有间断，看起来它好像永远是恒常的，所以就误以为它是真实有一个恒常不变的“我”，不知道它是生灭相续的，它也是无常的。所以第七识的见分误解了，误解这个相似、看起来好像是常、是一的，不知道它只是相似的，不是真正的，所以就以为有一个真正的、常一的“我”，所以很自然就把它执取为“我”——这个就是俱生我执的来源。俱生我执怎么来的？就是这么来的！一场误会！就是看第八识的见分好像合乎那个“我”的定义，所以就把它当作是真实的“我”。</p><p>那我们再进一步看第七识的见分，诶，它也合乎这个定义。如果第八识的见分看起来好像是合乎“我”的定义，可是第七识如果有间断也不行嘛，一下有我，一下没有我也不行。所以我们看第七识的见分，它也同样的，在时间上也是恒时生起，任运相续不断，所以看它也是恒常的，似乎也能自在地内执第八识的见分为自内我，看起来是可以自在作主的；而且始终如一地，永远只执第八识的见分为所缘境，从来没有改变过。是唯一的嘛，对不对？唯一只执第八识的见分为所缘境。唯一，它不缘别的，它跟外境也没关系，它永远内执第八识的见分，不外缘，它只内缘，缘什么呢？只缘第八识的见分，不缘其他的，所以是不是唯一的？对呀！</p><p>第七识的见分、第八识的见分都合乎看起来是“我”的定义，我执就这么生起了，所以我们所谓的“我”，而且是俱生的我执（我们之前介绍“我”，有分别的我执跟俱生的我执，分别的我执是第六意识分别来的），那现在第七识的见分执八识见分为“我”，是俱生的，它比较难断，就是因为它念念恒常没有间断，这就是俱生我执的来源。</p><p>这个很重要哦！我们说要断我执、断我执，怎么断？你念念有我怎么断？然后又不知道那个我执是怎么造成的，你怎么断？所以我们现在明白这个道理，念了第七识，俱生我执就能够断，为什么？是第七识的作用嘛！就是第七识缘第八识的见分嘛，以为有一个常一、能够主宰的“我”嘛！那为什么叫非量？就是认知有错误叫非量嘛，对于所缘境的认知是错误的叫非量嘛，跟现实不符合的叫非量嘛，我们前面介绍三量的时候说过。</p><p>所以这个“我”根本就不存在，没有这个东西的，“龟毛兔角”，没有这个东西。所以明白这个道理，对我们的修行应该有很大帮助，直接就断俱生我执了，而不是分别我执。分别我执比较容易：你第六意识保持现量无分别就没有了，分别我执就没有了，很容易呀！可是第七识很难，因为它恒常相续，就难了。明白道理可以对我们有很大的帮助，知道它根本不存在，这个就好办了，对不对？</p><p>我们看下面：</p><p>“八大遍行别境慧，贪痴我见慢相随。”</p><p>这两句颂是说明第七识所相应的心所只有十八个，其他三十三个心所都不相应，所以它相应的心所也很少，把“我”断了，这个都没有问题了。</p><p>那我们先看它不相应的心所。</p><p>第一个，第七识它不和别境中的欲、胜解、念、定心所相应，五别境我们之前就念过，《百法》的时候就念过。</p><p>那什么叫“欲”呢？就是希望为性，叫做欲嘛。你有所希望，那个就是欲心所。那第七识有没有希望呢？它不用希望，对不对？它就内执八识见分为我，没有其他的希望，所以它一定没有欲心所。所以第七识它念念只缘现在，就是缘八识的见分为我，更没有其他的希望，所以我们说它没有欲心所。</p><p>那第七识也没有胜解心所，什么是“胜解”？胜解就是印持为性，它的体性是什么？就是要有所印证持守或者是决断，需要有所决定，这个是胜解心所。那第七识它既然只是一味地执持、坚执八识的见分为我，当然就没有需要等着去印持决定的，所以没有胜解心所。没有什么好去印证的，也没有什么好决定的，它就已经牢牢地抓住八识见分了，把它当作是“我”，所以需不需要再怎么决断？不用决断，有没有什么好印持的？没有什么好印持的（印证持守的），没有，不用，它就已经这么样的坚固把它抓得牢牢的，所以不需要胜解。</p><p>那什么是“念”心所呢？念，就是明记不忘为性嘛，对什么明记不忘？对曾习境，过去曾经串习的境界明记不忘，在心中忆念保持，明记不忘，这个是念的特性。那第七识它只缘现在，当然就不会忆念曾经所串习的境界，跟过去都没有关系，它念念都是缘现在，所以它没有念心所。</p><p>那什么是“定”心所呢？就是专注不散乱，叫做定心所嘛。那第七识它的心识是散乱的，不能安定在一个处所，所以没有定心所。</p><p>第二个，第七识不与善十一个心所相应。我们刚才说第七识它是有覆，有覆就是有盖覆的嘛，所以它的心是染污的，恒常与四惑相应嘛，所以和善心所的性质刚好相反。它是染污性的，那善心所是善性的，所以它一定不和十一个善心所相应，因为性质刚好相反，一个是染污，一个是善的，不相应。</p><p>第三个，第七识不和两个中随烦恼相应。我们刚才说第七识它是属于无记性的，它不是不善性的，所以自然就不和不善的两个中随烦恼相应。</p><p>第四个，第七识不和十个小随烦恼相应。小随烦恼我们知道它是比较粗的、比较粗糙，然后比较妄动的，所以它是属于粗动的。可是第七识它的行相非常的微细，因为它是一种内执的，跟外境没有关系，它是内执的，所以它的行相是很微细的，跟小随烦恼的粗动是不相应的，所以它不和十个小随烦恼相应。</p><p>第五个，第七识不和四个不定心所相应。</p><p>不定心所第一个就是“悔”嘛，就是一种追悔的心，那追悔什么呢？就追悔过去所造的业。那第七识它是任运缘现在境，就是它恒缘第八识见分，不能够造业，那要不要后悔？不需要追悔，所以它没有追悔的“恶作”心所（悔也叫“恶作”）。</p><p>不定心所第二个是“睡眠”。为什么需要睡眠呢？就是我们每天攀缘外境，把自己的身心弄得很疲累，所以晚上需要睡眠。那第七识它不缘外境，就是第七识永远内执第八（识）为我，不假外缘，而且身心也不会感到疲累，就是没有那个粗重昏昧的现象，所以不需要睡眠。睡眠就是身心粗重的昏昧状况，我们叫做睡眠，就是第六意识那种昏昧的状况。那第七识它是不会昏昧的，所以它不需要睡眠。</p><p>不定心所，第三个是“寻”。寻就是寻求，对外境的粗分别，我们称为寻求。那细分别呢我们就称为伺察，不定心所第四个是“伺”，伺就是伺察，对于外境的细分别。那第七识只缘内境，它也没有粗细的分别，所以它不需要有寻伺这两个心所，所以和寻、伺两个心所不相应。</p><p>那除了这三十三个不相应的心所之外，另外跟十八个心所相应。</p><p>这十八个心所，第一个是八大，就是八个大随烦恼，第七识是和八个大随烦恼相应的。这个很重要哦！前面我们介绍过八大随烦恼，一个有，就其他全部都有了嘛，对不对？一个“不信”有，其他都有，所以它经常都是怎么样？都是同时生起的，所以很严重。而且它是天生就有的，俱生的。所以我们天生就是有昏沉、有掉举、有散乱、有不信、懈怠、放逸、失念、不正知。所以就知道修行为什么需要不断不断地精进，就是因为我们天生带来的这个太多了，这种违反我们修行的…，像我们要修定嘛，可是我们天生散乱、掉举，你说怎么修定，对不对？我们要修观嘛，可是昏沉一来，什么也观不起来啊，所以修止修观最大的障碍就是昏沉、掉举、散乱嘛。那我们要念个佛啦、还持个咒啦，可是它就放逸啊、失念啦、不正知啊，你也没有办法好好念佛，也没有办法好好地持咒，也没有办法好好地观想。所以这个八大随烦恼其实就是我们修行最大的障碍就在这里，因为它天生就有。</p><p>我们天生就很懒，所以一定是懈怠的嘛！要精进都很难，那偏偏它又没有间断地跟第七识相应，第七识没有间断，所以八大随烦恼没有间断，第七识是俱生的，俱生的我执嘛，八大随烦恼也是天生就有的劣根性啦，我们说劣根性，所以它比较难一点，不像那个十个小随烦恼它比较容易断。所以第七识它是染污意，所以它和遍一切染心的八大随烦恼是相应的。</p><p>所以第七识它是昏昧、没有堪任性的，所以它和昏沉相应，昏沉就没有堪任性，就是一种昏昧的状态，然后身心完全没有堪任性，没有堪能性（或者没有堪任性），什么意思呢？就是说你想要修，没办法，你想要观，观不起来，你想要念（佛），也没办法专注，身心不堪任。堪任的意思就是说：你要叫它做什么，它就做什么，那个叫身心有堪任性，可以为你所用，你可以很自在地想观什么就观得起来，想持什么咒啦，还是什么，都可以做得到，就是你可以有这个自在作主性，叫做有堪任性。可是昏沉一来，就完全没有堪任性，所以变成说你不管修什么法门，昏沉一来，就统统没有办法。那第七识它就是一种昏昧、没有堪任性的，所以它一定是跟昏沉相应。</p><p>而且第七识它是具有喧嚣性的，所以一定跟掉举相应。</p><p>那第七识它是属于流动而不安定的，所以一定和散乱相应。</p><p>而且第七识它是什么？刚才说它是染污意嘛，所以它一定是杂秽染污的，一定跟“不信”相应。我们“不信”也说过，所谓的“信”是心净为信，它的体性就是你的心是完全清净的状态，你才有纯粹清净的信心。所以只要有“信”，你的心就是清净的，一不信，心就被染污了，而且它把其他的所有心所都染污，所以“不信”它最严重，只要一不信，其他的心所都被染污。那第七识它既然是属于染污的，当然它就跟“不信”相应。</p><p>而且我们刚才说，第七识它不能够自己修行，它没有办法造业，也没有办法修行，所以它一定跟懈怠相应。精进就是可以好好地用功，那第七识是没有办法修行的，因此它跟懈怠相应。</p><p>而且，第七识任运妄缘第八识见分为我，所以它一定是跟放逸相应的。</p><p>而且，第七识经常和四惑相应，与正念相违，所以它一定是跟失念相应。失念就是忘失正念，没有办法心住在正念当中，所以第七识跟正念相违，它就跟失念相应。</p><p>第七识它是对于所观境是谬解错误的，就是说它对所观境是…，我们说它是非量的，所以它对于它的所观境是认知错谬、是误解的，所以它一定是跟不正知相应。</p><p>第二个，它是跟五遍行相应。遍行，就是指五遍行心所：作意、触、受、想、思。那五遍行我们之前也介绍过，它是遍一切心识的，所以第七识就一定有这个遍行心所，因为五遍行是遍一切识而活动的，八个心识都有它，所以当然第七识也有。</p><p>第三个，别境慧，是指五别境里面的“慧”心所，就是那个我见的来源，就是从这边“慧”来的。那什么叫慧呢？就是于境简择，我们叫做慧。就是对于我们的所缘境，有那个简择的作用、选择的作用，这个是慧心所。你怎么知道是善啊是恶啊？是是啊还是非啊？对还是错啊？就是说你对那个所缘的境界，有那个抉择的作用，它就称为慧心所。那现在我们说第七识它是简择第八识的见分，连续地假想为“我”，所以它有慧心所。就是第七识它有简择的作用，它简择什么呢？就简择第八识的见分，把它当作是“我”，这就是慧心所的作用。</p><p>只是这个时候的慧，它是属于染污慧。我们说慧心所的时候，有说它是善、恶、无记性的，它是通三性的。那这边的慧，它只是染污，只是跟不善性相应，其他的善是不相应的，所以这边的慧心所是属于染污的慧。它也是我见的来源，我见怎么生起的？就是第七识简择第八识的见分为“我”来的——我见的来源。因为四个根本烦恼就有我见嘛，对不对？那我见怎么来的？就是慧心所的作用，我们现在知道了。</p><p>所以下面一句：“贪痴我见慢相随”，就是说明第七识和四个根本烦恼相应，就是我贪、我痴、我见、我慢。</p><p>这个“我贪”也叫做我爱，就是深深地爱著于我，没有一时一刻的舍离，不只是对已经得到的自身生起贪爱，就是对还没有得到的自身也会生起贪爱。这就是每天我们很忙碌的，就是从这边来的嘛，因为有我爱，爱我爱自己，所以看怎么样让自己生活过得比较好一点啦、舒适一点啦、还是什么，就是念念都在我爱上面打转，于是生活很忙碌，就是忙碌这个我爱、这个我贪。所以只要有“我”，就贪著不舍，对于“我”有所染著，所以有我贪。</p><p>那什么是我痴呢？痴，就是无明，这个无明是因为迷于无我的真理。一切法本来无我，这个就是《百法》只讲这一句话，整个百法要介绍的就是“一切法本来无我”，就是要介绍这句话。那为什么我们还会有“我”呢？有我执跟法执？就是痴、无明，因为无明、愚痴，不明白无我的道理，才妄起以为有“我”的执著。所以我痴就是说明那个无明，不明白无我的道理，才会起无明，才会有我痴，不明白无我就以为有我嘛。那对于这个“我”，有这个无明愚痴的误解，所以叫做我痴。所以这个无明就是迷于无我的道理，而妄生“我”的执著，所以叫做我痴。也就是因为无明不觉，才有我痴，就是从那个“一念不觉生三细”那边来的。</p><p>第三个是我见，也叫做身见。这个“见”，就是推度的意思。就是刚才我们说五别境当中的慧心所，以这个慧心所为体。第七识缘第八识见分时，推度有一个实在的自我可以自在作主，这样推求以为有一个可以主宰的“我”的见解，就叫做我见。就执八识的见分为我，所以有我见。</p><p>那我慢呢？慢，就是自高自大的一种心理。就是依仗着所执的“我”，令心高举起来，总以为自己是最了不起的，从来不把任何人放在眼里，好像整个宇宙天地之间只有自己最伟大，这种自我贡高的心理，我们就称为我慢。现在知道我没有什么了不起了，对不对？因为根本没有我嘛！所以没有什么了不起。</p><p>好，那在根本烦恼里面，还有瞋、疑、不正见，四个不正见嘛，对不对？我们介绍根本烦恼的时候，除了刚刚说的以外，还有什么？还有瞋，还有疑，还有四个不正见。那为什么第七识没有这些内容呢？所以我们要稍微解释一下。</p><p>因为我爱，而且深深耽著爱恋自我，你说这个时候有没有瞋？我爱恋自我，爱自己爱得不得了，有没有瞋？我爱生起的时候，那个瞋有没有可能生起？没有，对不对？所以第七识是没有瞋心所的，因为爱自己都来不及，怎么会有瞋呢？</p><p>也是由于我见的缘故，坚执有一个“我”，从来没有丝毫的怀疑过，所以“疑”也没有生起的机会。你们有没有怀疑过“我”？没有啊！从来没有怀疑过！天生就有的俱生我执。所以没有怀疑过，是因为有我见的缘故。既然见解当中以为有一个“我”，我们刚才说推度嘛，那个慧心所推度以为有一个“我”，你就不会怀疑，从来没有怀疑过，所以它没有这个根本烦恼“疑”。</p><p>既然坚执我见，以为有一个我，而且耽著难舍，那要不要再讨论说这个“我”是有边？还是无边呢？没有什么好讨论的，就是从头到尾就有一个“我”，没有什么好讨论的，所以它没有边见。边见，就是有或者是无嘛，那有没有什么好讨论？没有，就是从头到尾都是有一个“我”，而且非常坚固地执著有一个“我”，没有什么好讨论的，所以它一定没有边见。</p><p>那另外还有邪见、见取见、戒禁取见，那这些都是由分别而起的，所以跟我们现在说的俱生的第七识它是不相应的，因为邪见、见取见、戒禁取见都是分别才有的，那第七识既然它是属于俱生的，它就不跟分别而起的邪见、见取见、戒禁取见相应的理由就在这里。</p><p>好，讲到这里刚好一个段落，今天就介绍到这里好了。下面要讲的话，可能会来不及，我们今天介绍到这里。</p><p>（师颂，众师兄跟颂）愿以此功德，普及于一切，我等与众生，皆共成佛道。</p> </div></div>"
},{
    "title": "8.第七识(2)",
    "author": "净莲上师",
    "date": "2012年8月28日",
    "html": "<div class=\"B1_text\"><div id=\"fontsize\">\n<p style=\"text-align: center;\">最尊贵的净莲上师讲授<br/></p><p style=\"text-align: center;\">讲于新加坡Orchid Country Club</p><p style=\"text-align: center;\">二○一二年八月二十八日</p><p>喇嘛、各位居士大德：</p><p>大家晚上好！</p><p>我们继续看。</p><p>“恒审思量我相随，有情日夜镇昏迷。”</p><p>这两句颂是说明第七识的性相和作用。</p><p>第七识是以思量为性相。思量，就是思虑量度的意思，也可以说是缘虑的作用。什么叫做“缘虑”呢？就是心对于所缘境，有一种计度而深明的审察推度。八个识是能缘的心，它各自都有所缘境。那心对于它的所缘境会有一种推度，或者是一种思虑、一种量度，就是说去认识你的所缘境是什么样的状况——这样的一个作用，我们叫做缘虑的作用，或者是思量的作用，就是能缘的心，对它所缘的境界做一种思虑量度，或者是审察推度这样的一个作用，去认识它的所缘境，它到底是什么样的情况。对所缘境有所认识、有所观察、有所了解，这个我们就叫做思量。</p><p>每一识都有这个思量、缘虑的作用；但是只有第七识它是恒常，然后又有这个审察的作用。所以以时间来讲，八个识它有的是有间断：我们知道前五识有间断，第六识有间断，第七识、第八识没有间断，都是恒常相续没有间断的。那前五识的作用它是有间断的，我们前面都念过，第六识它也是有间断的，就是在五种无心位的时候它是有间断的。</p><p>那至于这个思量的作用，对所缘境缘虑的这个作用，不是每个识都有的。像前五识它就没有这个“审”的作用，第六识有，第七识有，第八识又没有。就是因为八个识它的状况都不一样，所以我们把它归纳整理成四种状况，就是有关于这个“恒审”的作用。</p><p>这个“恒”是显示不断，而且是常相续的，就是恒常没有间断，这个是以时间来说。就是能缘的心对于它的所缘境，它是有间断、还是恒常没有间断，讨论这个问题。那第二个问题，就是它有没有这个审察的作用？有没有这个思量的作用？所以这个“审”，又是显示计度而深明的这个审察推度的作用。计度，就是计算度量，你心对于所缘的境界，你能不能去计算，或者度量它的情况，有这样的一个作用，我们称为“审”，就是审察推度的意思。那个“深明”，就是很深刻的、又很明显的做一种审察推度的作用，我们叫做“审”。</p><p>所以，八个识分成四个状况来讨论：</p><p>第一个是“恒而非审”。恒，就是指它时间是没有间断的，恒常相续没有间断的时候。那像第八识，它从无始以来，一直恒常相续没有间断，所以它具有“恒”的这个意。为什么第八识它不能够有间断呢？因为我们知道身心器世界都是八识所变现的，一切法都是八识所变现的，八识如果有间断，那它变现的这个身心世界不是一下有？一下没有吗？所以不可能有这种情况，所以它一定是恒常相续的。</p><p>也是因为它恒常相续，所以我们就忽略了，以为有一个什么？恒常的我或者法的存在。它虽然是恒常相续，但是因为它是生灭无常的，只要是生灭无常，它就是无我的。可是我们因为无明愚痴的关系，所以我们就会把它非常快速生灭相续的这个现象，把它当作是真实存在的。这个就是我执跟法执最主要的来源——就是无明，不明白一切法无我的道理，才会起颠倒想，把这个恒常相续的身心世界当作是真实存在的。</p><p>那为什么会这样呢？就是因为它生灭相续的速度太快，就是说它生灭的速度太快，快到我们没有办法去观察，因为它中间快到没有那个空隙说“哦，它是有间断的！”没有办法，所以我们就误以为说它是实有的。所以，在经论上说它到底有多快呢？就是一弹指有三十二亿百千念，我们的心念生灭、生灭、生灭，一弹指有多少呢？三十二亿百千念，够不够快？非常快！快到我们没有办法捕捉。就是因为它这么快，生灭、生灭、生灭、生灭……然后相续没有间断，我们看起来就是真的嘛！你看这个桌子、椅子、讲堂是不是真的？真的呀！可是它是以这么快的速度在生灭。然后把这个生灭相续、没有间断，我们就认为这个是真实存在。你家里的屋子是不是真实的？真实存在的！对不对？我是不是真实存在？真实存在的！为什么会有这样的误解？就是因为不明白它是生灭相续的相续相，然后把这个生灭的相续相，把它执为是实有的。</p><p>所以我们修行其实最主要的目的，就是要破这样的一个迷思，要破除这个无明，明白一切法本来无我的道理，就能够破除这个我执跟法执。我们知道它的来源是怎么来的，它都是八识所变现的，第八阿赖耶识所变现的身心世界，那在下一次我们介绍第八识就会更清楚。</p><p>而且，这个第八识它是什么？同体的，你的第八识跟我的第八识一不一样？同一个第八识，这样懂吗？所以法界本来同体，一切众生本来同体，都是同一个、共一个阿赖耶识，然后变现出十法界的依正庄严，就是十法界的正报还有依报，或者我们所谓的身心世界，全部都是共同一个阿赖耶识所变现出来的。</p><p>那你说，为什么同一个阿赖耶识会有这么多不同的情况？那就是有共业跟别业的差别嘛，我们前面也介绍过有总报还有别报。所以我们现在虽然都生在人道，我们见的这个世界，大家看的都一样，就是因为我们的业力相同，所以那个叫做“同业妄见”，我们的共业是相同的，所以妄见这个山河大地，我们看的都一样：你看是山，我也是山，你看是水，我也是水啊！那是因为我们的共业，同一个阿赖耶识的共业所变现出来的。</p><p>那你说这中间一个人死亡，譬如说我“过去”了，那这个世界还在不在？在呀！只是我这个果报体又继续再去轮回，但是没有一个“我”，这整个现象、整个过程也都是生灭相续的，进入中阴身，然后投入下一生，也都是生灭生灭相续的，从头到尾都没有一个“我”的存在，都是业力的显现，懂吗？哪一个业力先成熟，你就先变现那一道，饿鬼道的业力先变现，在你临终的时候就会……你自己的第八阿赖耶识的业识变现出饿鬼道的景象，那个景象不在外面，所以我们整个的法界它其实……我们看到的身心世界它都不是在外面，都是我们第八阿赖耶识所变现出来的。</p><p>所以现在讲到第八阿赖耶识，它必须是恒常、没有间断的原因，就是所有的身心世界都是它变现出来的，所以它不能够有间断，这样懂吗？不可能这样我一觉醒来，然后世界不见了，然后明天再出现，不可能有这样的事情，所以第八阿赖耶识它一定要恒常没有间断。</p><p>可是它有没有审察的作用呢？没有，它没有思量的作用。那我们念过第八识就知道，第八识是叫做“藏识”嘛，那为什么叫藏识？是因为它能藏、所藏，还有执藏。它的功能就是能藏，就是以它持种来说，我们无量劫以来的种子在哪里？都含藏在第八识，所以它持无量劫以来的种子，以这个持种来说，它是能藏的这个作用。因为每一法的生起必须要有种子，没有种子不可能说凭空就现出什么法来，不可能。色法有色法的种子，心法有心法的种子，任何一法生起都必须要有种子——这所有的种子，包含我们刚才说变现出身心世界的这个种子，全部含藏在第八阿赖耶识当中。所以我们才说这个种子遇到外缘，它就能够现行。</p><p>那现行之后，它又回熏到我们的第八阿赖耶识，所以以这个受熏来讲，就是“所藏”。第二个所藏，就是以受熏来说，它不是种子生现行，然后就完毕，就结束了，没有！最重要是它又熏回来。所以我们才会说对于佛法修行，我们要常常熏习，就是把它熏到第八阿赖耶识成为我们善法的种子、善根的种子、将来成就的种子，一切成就必须要具备的这个，尤其是善根非常非常重要。那也是我们历劫以来一直熏熏熏，熏了很多善法善根的种子在我们第八阿赖耶识。那同样的，烦恼的种子也是一样，业力的种子也是一样，我们希望它不要再熏回来。我现在发一顿脾气，我希望当下就把它怎么样？它自己就解脱掉了，我情绪一起来，希望当下就把它解脱掉，不用再熏回去，成为我烦恼、业力的种子。</p><p>所以这个也是修行的重点，你在每个当下，你都要这样来做。那个不好的种子，恶法的种子，它一生起，当下就把它什么？让它自己解脱掉，你只要不继续在上面分别、执著、串习，它就怎么样？它就消融掉，它就不会再熏回去第八阿赖耶识。所以我们希望熏回去，受熏的是什么？善法的，将来成就的种子，善根的种子。恶法的种子就怎么样？里面就让它慢慢、慢慢地让它清净，所有恶法业力的种子、烦恼的种子都慢慢把它清净。那发出来，种子生现行的时候，当下把它消融掉，不要再熏回去，所以你那个恶法的内容会越来越少、越来越少，你的习气、不好的习气也会越来越淡薄，所以它是一个用功的要诀——就在这里，就知道每天要怎么用功。</p><p>你说我没有时间修行，没有关系，你在每一念的当下，每一个当下照顾好你的念头，这样子来熏。所以我们就知道，第八识它第二个所藏的功能，就是指受熏，它能够受熏习回这个第八阿赖耶识，所以它这个种子有新熏的种子，也有旧的种子，都有。过去的种子已经熏习的，还有每天新熏习的，都有。</p><p>那另外一个就是“执藏”，就是我们昨天讲的，第七识的见分执第八识的见分为我，这个就是我爱执藏，它执第八识的见分嘛，所以第八识的见分是第七识的所缘境。</p><p>那我们知道整个八识就是能藏、所藏、执藏这样的功能，那它有没有审察的作用？有没有思量的作用？完全没有，所以我们才会说“恒而非审”，这个是指第八识。它时间上来说，它是恒常、没有间断；但是它又没有思量的作用，因为它只有管持种、受熏，还有什么？第七识见分执八识的见分为我的那个我爱执藏，所以它完全没有去度量那个所缘境这样的一个作用，是没有的，所以我们说它是恒而非审。</p><p>第二个是讲“审而非恒”，就是指第六识。第六识它有思量的作用，所以第六识在所缘境上，它具有深明计度的作用，尤其是对于分别所起的我执跟法执，它更是牢牢地执为实有，所以具有这个“审”义，具有审察的作用。</p><p>我们知道我执跟法执有分别的，分别的我执跟法执都是第六识的作用，就是因为第六识有这个思量的作用、有这个审察推度的作用，它才会生起分别的我执跟法执，所以我们说第六识它是有“审”的这个义含藏在里面。</p><p>但是在五种无心位的时候，它的作用又暂时间断，所以缺乏“恒”义，就没有“恒”的这个义理在里面。</p><p>前面我们都介绍过，第六识什么时候没有？你入无想定的时候，想心所灭了，第六意识没有；生无想天，不管你在无想天的时间有多长，第六意识都没有生起作用，暂时的伏住，没有生起作用；另外，就是入灭尽定的时候，入灭尽定，就是说不但第六意识的想心所灭，第七识也暂时不起活动，所以灭尽定的定慧力又更高了，就是因为它不但想心所第六意识可以灭，第七识也暂时不起活动，所入的那个境界我们叫做灭尽定（那个定境的名词）；另外就是睡眠，没有做梦的时候，第六意识没有作用的，不活动的；还有，就是闷绝，就是晕过去的时候，暂时没有意识嘛，也是第六意识暂时间断——这个我们称为五个无心位，“无心”就是没有第六意识的活动。所以它是有间断的，所以是“非恒”。</p><p>第三种情况是“非恒非审”，这个是指前五识。它的作用常常有间断，所以它不具“恒”义。前五识有间断，对不对？我一下用看的，然后等一下用听的，我听的时候，我就没有办法很专心的看；就算是你一心可以多用，可是它都是有间断的，它不可能看就一直看嘛，对不对？总是有看完的时候，然后听有听完的时候，等一下又闻到什么味道啦，等一下吃饭，舌头又尝什么味道，晚上吃了什么东西这样子，所以它是有间断的，前五识的作用是有间断的。</p><p>那它是“非审”，我们前面介绍过前五识嘛，它只缘现在，有没有？前五识它是性境、现量，所以它只有自性分别，没有随念分别，没有计度分别，所以它不能够深明地计度，因此没有“审”意，没有这个思量缘虑的作用。</p><p>所谓的自性分别，就是第一念还在现量境，这个我们称为自性分别，第六意识加进来了，但是这个时候还没有随念分别。第二念就开始随念分别，就进入比量，所以现量我们叫自性分别。所以前五识它只有自性分别，就是第一念的现量、性境；等到第二念的时候就是随念分别了，这个就进入比量，然后就是计度分别，就是对你的所缘境越来越怎么样？深明地去计算、去度量，对于这个所缘境认识得越来越明晰清楚。所以它有第一念、第二念，念念一直一直延续，所以我们说我思考一件事情，它就是越来越深、越来越深刻、越来越深刻。</p><p>所以前五识它面对这个色声香味触的时候，第一念性境现量的时候，都是自性分别，因为这个时候还没有说这个是什么花，然后漂不漂亮，是什么颜色，都还没有；只是就这样看到，桌面上这样子，就这样子，这是自性分别。可是第二念开始，我就会说“这个是香水百合、这是玫瑰”，就开始了：“这是胡姬花……”，这是比量以后才有种种的名称跟言说，这是第二念随念分别，然后计度分别。慢慢地，所有的形容，形容这个桌上的情况越来越清楚，那个都是比量以后才有的，这样应该明白了。所以前五识因为它是性境、现量，所以它没有这个“审”的作用。</p><p>第四种，“亦恒亦审”，只有第七识是亦恒亦审。因为第七识从无始以来，相续不间断地活动，而且深明计度第八识的见分为我，所以它是亦恒亦审。</p><p>我们昨天介绍过嘛，第七识它是没有间断的，恒常相续的。而且它是这么样的清楚，这样的丝毫没有怀疑，就执八识的见分为我，这个就是“审”的作用，审察推度的作用，把第八识的见分审察推度为“我”，我们说是那个“慧”的作用嘛，慧心所的作用，就是它是思虑推度出来一个结果说：那个就是“我”！就把它当作是我，八识的见分把它当作是我。所以它是恒常没有间断，然后又深明地计度第八识的见分为我，所以我们说它是亦恒亦审。</p><p>那正因为第七识是亦恒亦审，思量的意义特别的超胜，所以我们才说第七识是以“思量”为性相。我们昨天也说，看到“思量”，就知道它指的是第七识，因为第七识是以思量为它的性相，体性跟行相全部都是思量，然后用这个来彰显“恒审思量”的功用，单独只有在第七识。所以我们说“恒审思量”，就知道它指的是第七识，又恒又审就对了。</p><p>那下面一句“我相随”，是说在第七识没有转识成智之前，永远恒审思量，执八识的见分为我，所以说“我相随”。</p><p>那这个“我”，有“人我”和“法我”的差别：</p><p>什么叫“人我”呢？就是以为有一个实有的生命体。就是在我们有情的心识当中，总觉得有一个独立、自主，而且永恒存在的自体。这个自体会数数不断地往返六道，感受不同的果报。这就是我们每一个心念里面都是这样嘛，有一个“我”在轮回，有没有？所以我很怕造业，我很怕堕三恶道，为什么？因为“我”会去受苦呀！可是没有“我”，是谁在轮回呢？所以轮回本来空，本来也没有“我”，那是谁去？就是我们刚才说的：生灭相续的那个业力，所显现的六道轮回的景象。有一个五蕴的假合，生灭相续五蕴的假合，然后怎么样？业力变现出那个景象，然后变现出那个身心世界，都是第八阿赖耶识业识所变现的景象，从头到尾也没有轮回真实的存在，也没有一个“我”在轮回，这个才是宇宙的实相，叫做诸法实相，这个才是真正一切法的真实面貌。可是因为无明的关系，所以我们就会以为有一个“我”，有一个“我”不断不断地在六道当中轮回，有时候上升三善道，有时候堕三恶道。</p><p>所以像这样妄执有一个常、一、主宰的自我，我们就称为“人我执”，就简称为“我执”。所以我执就是妄执有一个“常”，就是永恒不变的嘛，“我虽然不断不断去轮回，可是这个我一直存在呀”——这个就是“常”的观念，永恒不变的一个我。而且它是“一”——独立不二的存在，叫做“一”。这个我是独立不二的存在，这个叫做“一”。</p><p>那个主宰的“主”，就是代表自己可以做得了主。我们之前也举例过，每天我们都以为自己可以作主嘛，其实都是业力在作主，对不对？都是种子生现行，又熏回去成为我的嗜好、我的习气、我个性的种子嘛。每天只是这个你熏回去的种子又起现行，然后你就说我喜欢吃这个、我喜欢穿那个，我喜欢什么什么、我不喜欢什么什么，有没有“我”在决定？没有啊！根本就没有我，都是你这种子生现行而已呀！所有的种子都是你熏回去的，然后每天不同的外缘，它种子随着外缘不断不断地现起这样而已，所以都是业力、习气、烦恼在作主，没有一个“我”在作主。可是我们就是妄认有一个“我”可以作主。</p><p>然后这个主宰的“宰”，它是支配统治的意思。“我可以支配统治啊！我不但可以支配我自己，我还可以支配别人，对不对？你去做什么、你去做什么，不是在支配吗？”所以这个都是妄执，自性妄执，以为有一个“我”，然后它是恒常的，它是独立不二的，然后它是可以自在作主的，它是可以支配统治的，还要统治全世界，不是吗？打仗、打仗，然后统治全世界，这个都是从妄执有一个“我”生起来的一个谬解，叫做非量。所以我们就知道那个“我执”是怎么来的？就是这么来的，这个叫“人我”，执著有一个“我”，就叫做我执。</p><p>那这个“我”，还有所谓的“法我”，法我就是以为一切法是实有的。我们刚刚说一切法都是阿赖耶识所变现的；可是我们因为无明，不明白这个宇宙实相的道理，我们会把一切因缘所生法，把它当作是真实存在的。所以妄执一切法是真实存在的，我们就称为“法我执”，也简称为“法执”。我执跟法执，法执就是对法执著，为什么会执著？因为以为它是真实存在的，对一切法执为真实存在的，这个执著我们就称为法执。</p><p>那一切众生所以会起这样的妄执，就是因为第七识在缘第八识见分的时候，不了解它是相续法，是因缘所起的生灭法，是幻化不真实的法，才会妄起实法的执著，以为一切法是实有的。所以问题都是出在第七识的见分执第八识见分的时候，所起的一个结果，把它当作是真实存在的。我们也一直说，虽然它是恒常，但是它是生灭相续，生灭相续没有间断，看起来好像是恒常，其实它是生灭法，它只是生灭生灭的相续而已，并不是真实有一个“我”或者是“法”的存在。</p><p>那这个我执跟法执它是一起生起的呢？还是分别生起的？是有我执，同时有法执？还是说有法执，没有我执？它们之间到底是什么样的一个关系呢？这两种执著的生起，它是有连带的关系，它不是各自独立的。</p><p>一般来说，我执一定是依于法执而起的，就是我要生起我执，一定要依于那个法执，才能够生起我执。因为“我”是法的一部分，我们念过《百法》就知道嘛，《百法》就是把一切法归纳为一百种，有没有？里面有色法、心法、心所有法、有心不相应行法，还有无为法，有没有？然后我们所谓的“我执”是指什么呢？我们是五蕴的假合嘛：色、受、想、行、识——我把这个色受想行识五蕴的假合，把它当作是“我”的色、“我”的受嘛，把色蕴当作是我，这个色蕴，我的身体，这个是色蕴。色蕴是属于色法，受想行识属于心法。那一切法有百法，我们刚才讲过了，有色法、心法、心所有法、心不相应行法，还有无为法嘛，所以谁比较大？谁比较小？“我”比较小，对不对？我的五蕴，色受想行识只是一切法里面的一小部分，色蕴的部分，还有受蕴、想蕴、行蕴、识蕴，它是属于心法的部分。可是一切法有一百种，那“我”只是一小种，所以我要生起我执的话，是不是一定要有法执，我才能生起我执，对不对？那我今天如果要生起法执，需不需要一定有我执？不需要，对不对？因为“法”的范围比较宽，“我”的范围比较小，只是法的一部分，所以“我”是法的一部分，所以我要生起我执，一定有法执；我要生起法执，不需要我执，这样懂吗？所以我们就知道我执跟法执它们之间的关系了。</p><p>所以我执是一定要依于法执才能够生起，有了这个实法的观念，才有我执的这个假想。所以可以说我执跟法执它是同时具有的，并没有前后的次第——就是生起我执，法执同时生起，它是同时具有，没有前后的次第。有我执就一定有法执，而且它是同时生起，同时具有的。但是法执的生起，并不需要依于我执，所以说法执的范围比我执宽。总而言之，也就是说，有我执的时候，就一定有法执；有法执的时候，不一定有我执，这个就是我执跟法执它们两者的差别，这样应该有概念了。</p><p>那我们看下一句：“有情日夜镇昏迷。”</p><p>这个是解释第七识所发生的作用，第七识它所发挥的作用是什么呢？就是让一切的众生经常处在迷惑不醒的生死当中。第七识它的作用就是让我们轮回，不断不断地轮回，所以“有情”就是指一切众生；“日夜”在这边就是代表生死；这个“镇”，就是经常的意思，或者是永远的意思；“昏迷”是迷惑不醒的意思。所以，这句话就是“让一切众生，经常处在迷惑不醒的生死当中”，这个就是第七识它的作用。</p><p>所以加上前面那一句“恒审思量我相随，有情日夜镇昏迷”，连起来就是说：一切的众生之所以迷惑不醒，长期处在生死当中，它的根本就在于恒审思量，有个实有的我执，常时相随而已。</p><p>第七句：“四惑八大相应起。”</p><p>这句颂是说明“有情日夜镇昏迷”进一步的原因。</p><p>一切众生之所以会日夜镇昏迷，最主要的原因我们刚才说过了，是因为“恒审思量我相随”。有了“我”之后，那随之而来的就是四惑八大相应起：只要第七识一发生活动，就是只要那个我执一起，我贪、我痴、我见、我慢，这四个根本烦恼，还有不信、懈怠、放逸、昏沉、掉举、失念、散乱、不正知这八个大随烦恼就立刻和它相应生起，这个叫做“四惑八大相应起”。</p><p>所以我们就知道，烦恼的根本是什么？只要“我”一起，四惑八大就来嘛！所以烦恼的根本是什么？是我执嘛！对不对？有我才有我贪啦，不然谁在贪，对不对？有我才会慢啦，不然你是在慢什么？所以一定是以为有我，那个我执一起来，我贪、我痴、我见、我慢才来的嘛，才相随、然后八大烦恼才相随。所以一切烦恼：根本烦恼、随烦恼怎么来的？就是“我”来的、我执来的，所以烦恼的根本是我执。所以我们说我要断烦恼，除非你断“我”嘛，你明白无我的道理，不然你怎么断烦恼？我好烦恼哦！我好想断烦恼！</p><p>有人问说：你为什么要修定？“我想断烦恼嘛！”那个“我”还在，你怎么断？你怎么盘腿，那个烦恼还是在呀！因为“我”还在，烦恼就在，所以我们知道烦恼的根本是我执。那我执怎么来的？现在大家都很会背了，第七识的见分来的嘛，执八识的见分为我嘛。那为什么会这样认为呢？因为无明嘛，不明白无我的道理，才会在第七识执八识见分的时候，把它当作是“我”。</p><p>所以一切轮回的根本是什么？为什么会轮回？刚才讲了半天，我们来一个总结，为什么会轮回？因为无明嘛，再倒退回来。为什么会轮回？因为无明，所以以为有一个“我”，对不对？有我就生烦恼，有烦恼就造业，造业就轮回嘛，所以轮回的根本原因就是无明。这样推回去，找到那个主要的主犯，最主要的那个根本原因，就是因为无明。所以，除非我们破无明，知道无我的道理，要不然你想要什么解决烦恼的问题，想要跳脱轮回，什么出三界，都是不可能的，因为这一切都是无明所造成的。</p><p>不明白那个无我的道理，所以你才会以为有一个“我”，只要有我，烦恼就来了嘛，有烦恼就造业，不同的业力，在不同的三界六道轮回。所以轮回的根本追到最后，追追追，就是无明。烦恼的根本是我执，轮回的根本是无明，我执跟无明的关系，又是因为无明才有我执，这样子全部就连起来了。</p><p>所以现在这个“四惑八大相应起”，我们最主要要知道：“有情日夜镇昏迷”它最主要的原因就是在有“我”，那有了我之后，四惑八大就会相应而生起。</p><p>那下面一句：“六转呼为染净依。”</p><p>这句颂是说，前六转识特别称呼第七识为染净依。六转，就是指前面的六转识。前五识、第六识，叫做“前六转识”。呼，是称呼；染净依，就是指第七识。我们前面也讲过嘛，都有染净依，对不对？第七识是染净依。那这边就是指第七识为前六转识成染或者成净的所依，叫做染净依。</p><p>那什么是“转识”呢？我们先要弄清楚，它是有“本识”还有“转识”的差别。本识就是根本，我们说根本依，那个就是本识，就是指第八识。剩下的前五识、第六识、第七识，我们都称为转识。所以我们看唯识就会看到前六转识、前七转识。前五识、六识、七识——这前七转识都是从根本识转变而生起的，所以称为七转识。再讲一遍，因为前七识都是从根本识（就是第八阿赖耶识）转变而生起的，所以称为七转识。只有第八阿赖耶识称为本识，其他七个都称为转识，就是因为它都要从根本识转变才能够生起，所以称为七转识。</p><p>现在讲的前六转识，是依于染净转易而说的。就是说前六识的染净转易，就是说它转染、还是转净，我们昨天也讲过，我们之前也讲过，就是第六识跟第七识密切相关，关系非常密切，就是在讲这个。因为前六识染净的转易，是受到第七识的影响。也就是说第七识如果是杂染的，前六转识就会转成杂染的；第七识如果是清净的，前六转识就转成清净——所以转染污或者转清净，是随着第七识来转染还是转净，所以称前六识是称为“转识”，它的原因是在这里；然后第七识是前六转识的染净依，就是前六识要转染、还是转净，要依于第七识是染的还是净的，这应该没问题啦。</p><p>所以，我们第七识在没有转识成智之前，前六转识所造的业都是杂染的，就是因为有我执、法执的关系。我们昨天也讲嘛，就算你是行善累积功德，因为有一个“我”在行善，没有三轮体空，我布施，有一个布施的我，还有我布施的对象，还有布施什么东西，牢牢地记住，有我执还有法执，所以它能够感得的就是三界的什么？人天果报这样而已，就是福报好这样而已，但是不可能解脱轮回的。解脱轮回一定是三轮体空之后的事情，无我之后，就是你第七识转识成智，转成念念无我的话，你这个时候的布施是三轮体空，没有一个我在布施，也没有一个布施的对象，也没有布施的东西，因为都不是真实存在的，本来也没有我、也没有法嘛，无我也无法，对不对？没有我执跟法执之后，无我也无法。所以做就做了，做完就忘记了，不会把这件事情牢牢地记住，也不会说“我今天又累积了什么功德，然后我今天要去放生，为了求我的长寿，我今天布施医药，希望我能够健康。”这个都是感得人天果报，因为有我执的关系，还有法执的关系，也是执那个善法功德为真实存在的嘛，不然你干嘛行善、累积功德呢？所以这个有法执。还有一个“我”在行善累积功德，这个是我执。</p><p>所以只要有我执、法执来行善、累积功德，就是我们现在讲的，第七识没有转识成智之前，念念有我，所以前面的六转识全部都是染污的，你所有的善行功德全部都是染污的，只能感得人天果报，没有办法出轮回，也不可能开悟证果，所以修了半天也别想开悟，也别想证果，也不可能证初地。</p><p>因此，第七识没有转成无我之前，前六转识念念成染，念念有我；在第七识转成无我之后，前六转识念念成净，念念无我。所以说，前六转识特别称呼第七识为“染净依”，这句话就是这个意思。</p><p>那我们这个杂染的部分讲完了。</p><p>第二个部分就是无漏的清净识：“极喜初心平等性，无功用行我恒摧。”</p><p>这两句颂是说明第七识什么时候能够转识成智。</p><p>第七识要转识成智，就是跟第六识一样，同样有三个阶段。还记得吗？第六识的时候，我们讲第六识什么时候转成下品的妙观察智啊？初地的时候嘛，第六识转成下品的妙观察智，那现在讲第七识也是同样的。第六识转了，第七识才能转，第七识没有办法自己转，那就是第六识跟第七识关系密切的原因。第六识转下品妙观察智，同时，可以说是同时，同时、马上第七识就转成下品的平等性智。</p><p>那第二个阶段怎么转？八地的时候转，对不对？证八地的时候，第六意识转成中品的妙观察智，同时第七识也转成中品的平等性智。</p><p>成佛的前一刹那，第六意识转成上品的妙观察智，第七识也同时转成上品的平等性智。</p><p>所以第六识转，第七识就跟着转；第六识没有转，第七识没有办法自己转识成智，为什么呢？原因就是我们说过，第七识它属于有覆无记性，有没有？昨天讲的，所以它对境没有分别。我们昨天也说第七识没有办法修行嘛，你说第七识可不可以说“我来听闻，闻思修啊？我来听闻、思惟，好好地修？”有没有办法？第七识有没有办法听闻、思惟、修习？有没有办法？它就念念执八识的见分为我，它没有办法听闻，也没有办法思惟，也没有办法修习，所以它自己可不可以转识成智？没有办法。所以除非第六识转，第七识才能跟着转，最主要的原因在这里。所以第七识的转识成智就跟着第六识一起，同样的分成三个阶段。</p><p>极喜，就是指“极喜地”，也就是初地，或者称为“欢喜地”。因为到了初地，破一品无明，超越了十法界，是踏上圣者菩萨的第一个阶位，内心的欢喜是从来没有过的，所以我们称为欢喜地。就是非常欢喜，这种欢喜是之前没有的，因为什么？因为出了十法界。</p><p>十法界是哪十法界，知道吗？我们常常说三界六道，六道轮回就是六个法界，再过来就是四圣法界──声闻、缘觉、菩萨，还有佛（这个是十法界的佛），这个都还没有破无明。像阿罗汉我们知道，他破见思惑，可是见思惑的习气没有破，要等到缘觉才能破见思惑的习气。那过来是什么？尘沙惑，然后还有尘沙惑的习气。这是四圣法界它要破的：从见思惑，破见思惑，然后见思惑的习气，然后尘沙惑，尘沙惑的习气。就是四圣法界──声闻、缘觉、菩萨、佛，这是四圣法界，加上六道，就是十法界。无明都没有破哦！所以我们才会说阿罗汉没有明心见性，因为他无明还在，他连尘沙惑都没有破，还在十法界的四圣法界当中。</p><p>所以，现在初地为什么那么欢喜呢？超越了十法界，不会再到六道、还有四圣法界当中，因为他不但破了见思惑，还破了见思的习气，破了尘沙，还破了尘沙的习气。破一品无明，我们叫做登初地，是不是要很欢喜？对！要很欢喜！终于入了一真法界了。所以这个时候是实报庄严土嘛，四圣法界是方便有余土，六道是凡圣同居土，有没有？</p><p>所以我们就要知道祂为什么那么欢喜，叫做欢喜地的原因就在这里，因为终于破了一品无明，这个时候才叫做开悟，才叫明心见性。你那个见思、尘沙没有破，不能说你开悟，也不能说你明心见性。所以明心见性，明什么心？见什么性？就是见你的本性，你的本性是什么？就是破一品无明，你的真心现前，菩提自性现前，真心本性这个时候才能现前，就是一定要破一品无明，这个时候就是入了圣者的阶位了。前面是三贤嘛，有三贤十圣嘛。</p><p>这种欢喜是最殊胜的欢喜，可以说已经到达了极点的欢喜，就是欢喜到了极点，所以叫做“极喜地”。初心，就是入心的意思。我们上一堂有介绍：有入、住、出嘛，每一地都有入、住、出。所以极喜地的初心就是入心，就是入这个初地，叫做极喜地初心。</p><p>“平等性”，就是指平等性智。第七识到了初地的初心，就可以转成平等性智，所以偈颂说：“极喜初心平等性”。但是这个时候转的是下品的平等性智，因为入了初地的初心只能够断分别的我执，那俱生的我执仍然不时的现行。</p><p>那这个俱生的我执要到什么时候才能断除呢？就是要到八地，一直要到八地才能够真正的断除，所以偈颂说：“无功用行我恒摧”。这个“无功用”指的就是八地。到了八地才能够做到任运无功用行，所以称八地为无功用行。那到了这个时候，俱生我执永伏不起，就是“我相”永远不会再现起了。“我相”恒被摧碎无余，所以说“我恒摧”。这个时候第七识就转成中品的平等性智。</p><p>那至于上品的平等性智，就要到成佛的前一刹那才能够转，所以它跟第六识一样，分为下品、中品，还有上品，这三个阶段来转识成智。</p><p>好，我们今天时间到了，讲到这里。</p><p>（师颂，众师兄跟颂）愿以此功德，普及于一切，我等与众生，皆共成佛道。</p> </div></div>"
},{
    "title": "9.第七识(3)",
    "author": "净莲上师",
    "date": "2012年8月29日",
    "html": "<div class=\"B1_text\"><div id=\"fontsize\">\n<p style=\"text-align: center;\">最尊贵的净莲上师讲授<br/></p><p style=\"text-align: center;\">讲于新加坡Orchid Country Club</p><p style=\"text-align: center;\">二○一二年八月二十九日</p><p>各位喇嘛、各位居士大德：</p><p>晚上好！</p><p>我们继续看第七识颂。</p><p>我们昨天讲到第七识转识成智，就称为平等性智。那为什么称为平等性智呢？是因为有了这个智慧之后，就能够观一切有情众生平等、观一切法平等，所以称为平等性智。意思就是说，有了这个智慧之后，我们才可能平等。</p><p>那没有转识成智之前，为什么不平等呢？我们应该知道答案了，因为有“我”嘛！因为第七识它的作用，就是把第八阿赖耶识的见分当作是“我”，第八阿赖耶识的相分当作是“法”，而且是真实存在的。那只要有“我”，就跟其他的众生对立了，所以没办法平等。有我就有他，有自他的差别。那一切众生对我们来讲，我们也是有冤、亲、中庸的差别，就是有对象的差别。我最亲爱的人，不等于我最仇恨的人嘛，可以相等吗？没办法相等，对不对？一个是最爱的，一个是最恨的，所以心没有办法平等，就是因为“我”来的。只要有“我”，一切有情众生就别想平等。</p><p>那心不平等，我们可能生起大慈大悲心吗？可不可能？我们可能对我最恨的那个人生起大慈大悲心吗？对最亲爱的人有可能，也不是百分之百啦。我们所谓的大慈大悲是说“无缘大慈，同体大悲”，他必须要证到这个平等性智之后他才有的。只要有“我”在，你就算是对亲爱的人有一些慈悲心，但是它也不是大慈大悲，因为还有“我”的缘故。一定要证到一切众生平等了，我们才可能有无缘大慈，同体大悲，也就是已经证到这个法界是同体了。</p><p>我们昨天稍微介绍了一下，其实阿赖耶识是一个，为什么？是因为我们的真心是一个嘛，对不对？我们修行就是希望我们的真心能够现前。那你的真心跟我的真心有关系吗？我们说菩提自性现前，你的菩提自性跟我的菩提自性相同吗？所谓的真心就是没有生灭的，菩提自性也是本不生灭，本不动摇，本自清净，能生万法——这个是相同的，是本体，也就是所谓的法身，法身是本体，这个本体就是我们的真心，也就是我们的真如本性，它本来是同体的，它只有一个，没有分你的真心、我的真心，你的自性、我的自性，没有，自性只有一个！所以整个法界它的本体是一，也就是所谓的法身。所以我们说修行证到法身的意思，就是我们的自性现前了，我们的真心现前了，所以就证到整个法界是同体的。</p><p>那阿赖耶识是怎么产生的呢？一念无明就有了。你本来是真心的，一切众生本来是佛，因为真心本来就有嘛，菩提自性也是人人具足嘛，本自具足不是吗？但是为什么现在不是佛呢？就是因为起了无明，只要你在不生不灭的、本来清净的这个真心，随时一念妄动，阿赖耶识就产生了。所以真心是能现，阿赖耶识是所现，它是一念无明的产物，只要你起了一念无明，一念的妄动，阿赖耶识就形成了。</p><p>那我们昨天也说，所有的身心世界都是阿赖耶识变现出来的，所有都是第八阿赖耶识的变现。所以你只要一起无明，阿赖耶就诞生了，然后就有所谓的见分跟相分。阿赖耶识的本体我们叫做自证分，八个识，每个识都有四分：就是证自证分、自证分，还有相分跟见分。自证分是每个识的本体。那你说见分跟相分是怎么来的？就是本体一起了二元对立，就有了见分跟相分的产生，所以见分跟相分是自证分来的，每个识的本体，所以阿赖耶识的本体是自证分。那我们一起了二元对立的观念，有能所：有能缘的心，有所缘的境，一起了这个能所，就有了见分跟相分，这是阿赖耶识所变现的见分跟相分。</p><p>那第七识它做什么事呢？就是把第八阿赖耶识的见分，把它当作是“我”，第八阿赖耶识所变现的相分，把它当作是一切法，这样明白吗？我执跟法执的来源就是这样来的。</p><p>那至于那个证自证分，那是我们本体，那个般若智慧的部分，它简择你的自证分，证得是对还是错。譬如说我今天开悟了，我除了找我的上师跟我印证说我到底是悟了，还是耽误了，还是哪一个悟，是开悟？还是耽误的误？如果找不到上师的话，我们的自性里面就有一种智慧的作用，它能够简择你这个自证分，你证到的是不是自证分，你是不是真的明心见性，这个检查自证分证得对不对，我们叫做证自证分，就是来证明自证分是对、还是错，是不是真的已经真心现前了，还是只是误解而已。以为开悟了，结果没有悟，结果就被耽误了这样子。</p><p>所以我们就知道，都是一念无明来的，一念无明而有阿赖耶识，阿赖耶识的自证分，只要二元对立一起，就有见分跟相分，有能所，那这个所缘的境界叫做相分——第七识执为法；那阿赖耶识的见分——第七识执为我。我执跟法执的来源，我们现在就很清楚了。</p><p>所以除非你证到无我，要不然别想一切众生平等。可是，如果我们明白刚才说的这个道理，知道本来是共同的一个阿赖耶，本来也是共同一个真心，本来是无我的；只是第七识的作用，以为有我有法；本来是没有的，一切法无我的。它可以帮助我们，我们再加上修我空观（或者人空观），或者是法空观，加强这个熏习，慢慢地就可以证到人无我、法无我。</p><p>加强熏习的意思，就是一切的种子都含藏在第八识嘛，对不对？所以我们如果现在还是念念有我的话，熏回去怎么样？还是有我啊！这样明白吗？所以那个我执是越来越坚固，如果你没有透过修行，不明白这个道理、无我的道理，没有这样一个空性智慧的见地，然后也没有下功夫去修空观的话，我们继续熏，我执跟法执的习气还是越来越坚固。不断地熏习，也是同样的熏习习气的种子、烦恼的种子、业力的种子，不断不断地被熏习，所以我们是不可能有什么离苦得乐，还是解脱、证果、开悟的一天，是不可能的。</p><p>所以我们首先要把这个道理弄明白，然后再加上修空观（我空观、人空观、法空观），然后才能够慢慢地第六意识保持现量无分别，第七识那个“我”就没有机会加进来。</p><p>所以我们昨天才会说，为什么一定要第六识转了，第七识才能转，而且为什么我们要修定，就是要修到保持那个现量无分别，第六意识保持现量，现量的状况之下，第七识的那个“我”没有办法、没有机会生起。所以第六识转了之后，第七识才能够跟着转，它的原因在这里。因为第七识它没有办法修行，它没有办法闻思修嘛，没有说“我要转，由我转成无我”，第七识没有这样的能力，所以一定要靠第六识的下手来修，所以一切的修行都是从第六意识修。</p><p>所以说第六意识虽然造业的力量最强，可是我们还是要靠它来修行。前五识没办法修，第七、第八识没办法修，只有靠第六意识来修。所以第六意识的现量也好，或者比量也好，都是要从第六意识下手来修，才能够影响到第七识能够转识成智。只要平等性智一现前，自他自然就平等，一切有情众生才能够真正的做到平等，而且这个时候才有真正的大慈大悲。所谓的“无缘大慈，同体大悲”，这个一定要证到平等性智之后，从这个智慧来观察，一切众生才是平等的。</p><p>所以没有证到无我之前，你说我要慈悲，那个都假的，有“我”的话，没有真正的平等，不是真正的慈悲。可是我们也可以熏修啦，培养我们的慈悲心。但是真正做到大慈大悲，一定要第七识转成无我，它才可能，有这个平等性智之后，它才可能做到真正的平等。</p><p>然后以法来说，就是一定要断我执，然后才能够做到真正的一切众生平等；一定要断法执呢，才能够做到真正的一切法平等。就是不再执第八阿赖耶识所变现的相分为法，知道它也是生灭无常的，一切法都是因缘所生的嘛，所以它是空无自性的，一切法并不是真实存在的，就是修法空观，不断不断这样的熏习，一直到真正的证到这个法无我为止，你才可能真正的做到一切法是平等的。</p><p>要不然我们一面修，也是一面分别嘛，一面执著说“你修什么法门，我修什么法门”，然后再来比较谁的比较殊胜，修天台止观的就没有办法念佛，那大手印、大圆满也是要争个高下，谁比较殊胜嘛，对不对？一切法门也是，一面修一面分别执著，都是因为有法执的关系。那证到法无我的话，这个都不是问题了。因为佛说法是应机嘛，不同众生，不同的根机、不同的因缘之下，祂说出不同的法，其实法没有高下的差别，只是因为我们对法有所执著，我们才会去分这个法门、那个法门，这个宗、那个宗，然后把自己搞得很混乱，其实都是从佛清净的自性里面，祂所证悟了我们的自性以后，从自性里面很自然流露出来的法。不同的众生，小乘根性就说小乘法，大乘根性就说大乘法。也不是小乘比较低劣，然后大乘比较高，然后密乘更高——没有这样的说法。这个就是我们对法有执著，才会有这样的分别心。</p><p>所以我们修行的目的是什么？要解脱对不对？跳出三界外，为什么要跳出三界外？为什么要从六道当中解脱？是因为我们觉得六道轮回是苦的嘛，所以要从轮回当中解脱。可是，整个轮回的现象是真实存在的吗？不是真实存在的嘛，对不对？它也是因缘所生法，你不同的业力，阿赖耶识不同的业识所变现不同的景象，都是你第八阿赖耶识自己的业识所变现的景象，它并不是真实存在的，所以一切法也不是真实存在的，轮回也不是真实存在的，所以整个轮回的现象也是如幻如化的。</p><p>你明白一切法不是真实存在，那你对这个轮回、要急于解脱这个轮回，你也会知道它是如梦如幻的，它也不是那么……像三恶道，我们说千万不要去，因为它是很恐怖的，我们就要生起这个怖畏的心，怕造恶业，然后堕到恶道。可是你明白法无我的道理，你就不会……因为地狱也空嘛，对不对？地狱也是我们业识所变现的，它并不是真实的有。所以我们证到法无我，我们就会把这整个轮回的现象，知道它是幻化的，它没有那么厌恶，然后它也没有这么怖畏，那么急着……像小乘人那么急着想要从轮回当中解脱，那就是对这个轮回的现象，把它当作是真实有的。</p><p>那我们说，我要赶快从轮回当中解脱之后，要去哪里呀？要入个涅槃嘛，要从轮回出，入什么？涅槃，为什么要入涅槃呢？因为涅槃才是真正的安乐嘛，常乐我净，对不对？所以它有出入的差别，要从三界六道当中解脱出来，然后入一个寂静的涅槃，它才是真正的常乐我净，才是真正的安乐。</p><p>可是我们再看，涅槃法它也是真实存在的吗？它也是因缘所生嘛，你修了半天，证到一个涅槃，它也是生灭法。涅槃的本身是不生不灭，我的意思是说你从修行一直到证得涅槃，这个涅槃是怎么证得的？也是你生灭生灭的修行法门，经过这样的一个过程，然后才证到所谓的涅槃。可是涅槃它也不是真实的，它也是如幻如化的。这样我们就不会觉得说“涅槃才是最殊胜的，然后它是我们最好乐的”，才不会对那个涅槃境界有所贪爱或者是执著。</p><p>我们说这个是什么意思呢？就是说只要我们对法还有执著的话，就有彼此的差别，那就有轮回跟涅槃的差别。可是轮回的自性是空的，涅槃的自性也是空的，那怎么轮回跟涅槃是平等的，就是轮涅不二，轮回跟涅槃是不二的，什么时候才能证到？也就是除非你证到法无我，不再执第八阿赖耶识所变现的相分为法，就是修法空观，不断不断深化，然后这个智慧（平等性智）产生了之后，你才能够视一切法平等。</p><p>那明白轮回跟涅槃，它是平等不二的，这个是非常重要的，因为它就是为什么佛菩萨愿意不断不断地来生死，再入轮回当中来生死，然后来利益众生，就是因为祂知道轮回不是真实存在的。所谓的轮回的苦，那个苦的本质也不是真实存在的，所以祂愿意发大菩提心，然后不断不断地入轮回当中来利益众生，但是祂虽然入轮回当中，祂又不会被轮回所染污，懂吗？所以我们说祂不住生死。那祂也不会因为涅槃是真正的清净，真正的安乐，然后去入一个所谓的涅槃，然后安住在涅槃境界当中，佛菩萨也不会这么做。因为你就入涅槃，什么事都不做嘛，像小乘入灭尽定，就没有办法再利益众生了。</p><p>所以，佛菩萨也是因为大悲心的关系，祂不住生死，也不住涅槃，所以祂虽然能够证到涅槃的境界，但是不会被涅槃所限、所限制。但是祂可以现证涅槃，但是祂又不会住在涅槃当中，不做利益众生的事。又从涅槃当中怎么样？从那个不生不灭的涅槃境界当中，再生起如幻的大悲心来利益如幻的众生，就是因为佛菩萨祂已经证到法平等，就是平等性智已经现前，因此祂能观一切法平等，轮回跟涅槃平等无二——都好像是昨夜的一场梦而已，不是真实存在的，所以他可以不住生死，不住涅槃，叫做“无住涅槃”。</p><p>这个就是我们看那个讲义上的：“观诸自他有情平等，大慈悲等恒共相应”，这就是讲你证到平等性智之后，你才能够观一切有情是平等的，没有自他的隔碍；要不然有自有他，一切众生不平等。所以一定要这个平等性智现前，断了我执之后，你才能够做到一切自他有情是平等的，这个时候才有大慈大悲心。所以我们说“大慈悲等恒共相应”，这时候你来度众生的那个过程，整个过程一定是跟大慈大悲相应的，它是任运自然就现起大悲心，不用我们在那边发菩提心，发了半天也发不出来，为什么？因为有“我”嘛！有我执，你怎么发也发不起来。所以到这个时候，平等性智现前之后，你的大慈大悲心是任运自然就生起了，所以你看到一切的有情都是平等的，没有冤、亲、中庸对象的差别；而且都是任运，就是希望他们快乐，希望他们能够除苦，这是很自然就做到的。所以，这个慈悲心是证到平等性智之后，才能够任运自然地生起，所以它是断我执之后才能够做到的境界。</p><p>第二句说：“观达一切诸法平等，无住涅槃之所建立”。我们就知道，就一定是要断法执之后，一切法才能够平等，所以这个时候我们来观一切诸法才能够完全的平等。轮回、涅槃都是如幻如化的，平等不二的，都是昨夜的一场梦而已，不是真实存在的。这个时候才能够不住生死、不住涅槃，我们称为无住涅槃，这个时候才能够建立所谓的无住涅槃。所以无住涅槃，不住生死、不住涅槃，这个是怎么来的呢？就是观诸法平等来的，断法执以后，平等性智现前之后，才能够建立的无住涅槃。</p><p>所以我们就知道，这些佛菩萨的境界，到底是怎么来的呢？原来是转识成智来的，你只要转七识成平等性智，自然观一切有情平等、观一切法平等。在这个之前，只要有我执、法执，不管是有情、还是法，一定是不平等的，一定有分别执著，这个是很自然的事情。</p><p>所以我们修行要先明理，先把正确的见地、知见先建立好，我们才不会妄功用，盲修瞎练：就是以为说自己可以发菩提心，发得很好啦，或者是“我这个人最公平了，我对谁都一样”，不可能的啦！你有“我”，怎么可能对谁都一样？是对谁都不一样！是不可能公平！就是因为有自他差别的缘故。那我们也不可能说什么禅宗、净土宗、什么天台宗、华严宗都一律平等，还有律宗，也是不平等嘛！你有法执，怎么可能平等嘛？所以新学一个法门，就跟原来旧的法门就打架了嘛，就问说：“我可以不可以同时念佛？然后又修天台止观？然后可不可以再修个不净观？还是再念个佛怎么样？”就是很混乱就对了。所以我们现在就知道问题出在哪里，原来我们对法有执著的缘故。只要打破这个执著，才可能一切平等。</p><p>那我们看下面一个偈颂：</p><p>“如来现起他受用，十地菩萨所被机。”</p><p>这两句颂是说明平等性智的妙用。</p><p>你证得了平等性智，除了我们刚才说观一切有情、一切法平等之外，它到底还能够做什么呢？就是只有成佛的时候，才真正地圆满了上品的平等性智，那上品的平等性智圆满了之后，它到底能够起什么妙用呢？就是有所谓法、报、化三身嘛。</p><p>法身我们刚才介绍过了，就是每个人的自性，我们本自具足的菩提自性，它就是法身，就是我们的本体。所以说什么都是共同一法身嘛，一切佛是共同一个法身，现在我们也能够理解这句话，因为本来真心就是同一个嘛，本体也是同一个，所以法身也是同一个。那法身是本体，你只要证得你的清净心，就是你的菩提自性，或者是你的真心能够现前，这个就是所谓的法身。可是法身是没有形相的，没有生灭的嘛，所以什么“不垢不净，不增不减”，这个都是在形容那个本体，它是没有形相的。</p><p>那没有形相，我证得这个法身，我怎么利益众生呢？所以我是不是还要再现一个什么身？所以我可以从我法身这个本体现出那个报身，为初地以上的菩萨来宣说十波罗蜜法。</p><p>那我们凡夫怎么办？二乘人怎么办？还没有登地的菩萨怎么办？那佛祂就要现化身。之前我们介绍过化身，有没有？有各种化身，那个就是为我们凡夫、还有二乘人，还有还没有登地（就是地前的菩萨）所现的身，就是化身。</p><p>那我们现在讲的这个，为十地菩萨宣说的，所以祂现的一定是报身。那报身它又分成两种报身：一种就是自受用，譬如说我证到境界，我所证的境界你们大家都没有办法受用，我的境界我自己受用，这个叫做“自受用身”。那我自己在那边受用身，可不可以利益初地到十地的菩萨？也没有办法利益嘛，所以我还要再现一个“他受用身”。所以，报身有自受用身，有他受用身。自受用，就是自己享受清净的法乐，自己证的那个境界，佛所证的境界，自己受用，这个叫自受用身，其他人没有办法受用。可是为了要利益地上的菩萨，祂必须再现一个他受用身，为初地以上的菩萨宣说十波罗蜜。所以我们知道报身有自受用、还有他受用的差别。这就是现在要讲的这个，我们来看：</p><p>所以到了如来究竟位中，平等性智才能够圆满转成上品的。这个时候就现起他受用身，为初地到十地的菩萨宣说大法。这就是这两句颂的意思，平等性智的妙用就在这里。</p><p>那什么叫“如来”呢？是指正觉的佛陀，已经自觉觉他、觉行圆满的这个佛陀，我们称为“如来”。可是佛有很多名号嘛，对不对？称为佛，佛是化身来说，如来是指什么？法身来说。所以我们一看到如来，指的就是佛的法身。我们刚才说的有法报化三身嘛，本体来说，那本体有没有来去？本体没有来去，不来不去。所以无所从来，也无所去，叫做“如来”。好像来，又好像没有来，无所从来，无所从去，所以叫做如来，为什么？因为法身没有来去，所以叫做如来——这个名称是这么来的。我们就知道它是站在法身的立场来说的，因为法身没有来去，所以称为如来，就是“无所从来，亦无所去”的意思。</p><p>那什么叫他受用呢？我们刚才解释了，它就是指他受用身，就是法身如来所现的报身相，专为十地菩萨所受用的，所以称为他受用。那佛祂在亲证如来自性清净的本体的时候，只要证得本体，法身就现前，就是我们自性现前，真心现前的意思，这个时候我们称为法身。</p><p>那为什么称为法身呢？因为它是一切法所依之身。那依于这个本体才能够现起一切的法，才能够为十地菩萨现起他受用的报身，所以才称为法身，就是一切法所依之身。我们刚才说它是本体嘛，然后从体起用，从这个本体再现起报身或者是化身这样子。</p><p>所以现在所现起这个他受用的报身，就是为十地菩萨现起他受用的报身；那地前的菩萨、还有二乘凡夫，就现起化身。所以这个报身跟化身，都是要依于法身才能够现起。所以法身是本体，报身跟化身是应机所现的，不同的对象现不同的身。</p><p>因为法身它是没有形相的，那我们众生看不见；所以为了利益不同的众生，如来祂就必须要现起报身和化身，来为众生说法。那如来法身所现的报身有两种：就是我们刚才说的，一种是自受用身，这个是佛独自所受用的清净法乐，所以佛这个自受用身，它到底是什么样的一个境界呢？就是说祂自受用这个法乐、清净的法乐，这个是只有祂自己能受用的，受用的是什么内容呢？就是清净的法乐，这是证得法身之后所生起的一种清净的法乐。那这种清净的法乐不但天魔外道所不能知（天魔外道都没有办法知道佛自受用身的那个境界，祂到底在受用什么样的境界，天魔外道没有办法了知），就算我们佛弟子的声闻、缘觉、还有菩萨，也是不能够领受得到，所以称为自受用身，只有祂自己，佛自己能够享受的清净法乐。</p><p>那就是因为连地上的菩萨都不能受到这种清净的法乐，所以如来才会从自己平等性智当中，示现微妙清净的功德身，在清净的佛土中弘扬大法，令十地菩萨也能受用大乘法乐，这个时候所现的身，就称为他受用身。这个专为地上菩萨所示现的他受用身，也会因为阶位的不同，有着胜劣的差别，所现的清净佛土也有广狭多少的不同。所以每一地菩萨所见的佛身是不一样的。</p><p>譬如说：初地菩萨，祂所现的是百丈身，就是说如来为初地菩萨所现的他受用身是百丈身，然后坐在百叶的莲花上，宣说的是布施波罗蜜。十地菩萨刚好相对十波罗蜜，那现的身是越来越殊胜。所以为二地菩萨所现的就是千丈身，越来越高大，然后坐在千叶的莲花上，宣说的是持戒波罗蜜；那三地菩萨所现的就是万丈身，坐在万叶的莲花上，宣说忍辱波罗蜜。先是六度嘛：布施、持戒、忍辱、精进、禅定、智慧，然后呢？方便波罗蜜、愿波罗蜜、力波罗蜜。然后为十地菩萨所现的就是百万亿丈身，坐在百万亿叶的莲花上，宣说最后一个：智波罗蜜。</p><p>所以你证到不同的，初地、二地，还是不同的哪一地，不同的阶位，所见的如来他受用身是不同的、所见都是不同的。所以这个如来所现起的他受用身，是专为教导十地菩萨所现起的，所以说“十地菩萨所被机”，它的对机是什么？就是初地到十地的菩萨，才能够见到如来的他受用身。</p><p>好，那讲到这里，我们就把第七识颂介绍完了。</p><p>那接下来，我们就稍微再介绍分别我执、俱生我执，还有分别法执跟俱生法执，稍微再介绍。因为要完全明白，要等八个识都听完会比较清楚。现在有关于阿赖耶识、第八阿赖耶识的内容，因为我们还没有讲，下一次才要讲，我们才知道第八阿赖耶识它是怎么变现出我们身心世界的，我们比较能够体会。虽然我们已经稍微、很简单地介绍过了，就是我执跟法执是怎么来的，都是阿赖耶识的见分跟相分，第七识去执著见分，就是我执，执著第八识所变现的相分，就是法执，所以我们现在也只能很初步地有这样的一个了解，那我们对这个我执跟法执，也可以有初步的了解，所以我们稍微再介绍一次。</p><p>那我执，它有分别我执跟俱生我执。分别我执，它就是后天所熏习来的，所以它不是与生俱来的。那是怎么后天熏习呢？就是你亲近可能外道的一些邪师，然后听了一些邪说，外道邪说，然后在我们心中就产生邪分别，这一类的我执，都是由第六意识所分别来的，我们就称为分别我执。</p><p>有关于“外道”这个名词，当初只是为了要区别佛法以外的，称为外道，它绝对不是骂人的话，也没有轻视、诋毁的意思，都没有，因为我们发觉在佛教徒里面也有很多外道，所以我们实在没有资格批评人家是外道。因为外道它真正的意思是心外求法，你只要心外求法，就是外道，因为你不往内心去求嘛。因为我们的真心，菩提自性都在我们自己这里面，都在我们自家里面，你偏偏要到外面去找，到外面怎么去找你的菩提自性？所以它不在外面，在你自己家里面，所以你是要往内寻求，才能够让你的真心现前。所以修行是往里面找，而不是往外面找。所以你到外面去找，不管你什么法，只要是心外求法，离开你的真心到外面去寻那个，永远没有办法见到你真心的那个，只能够越来越遥远，变成说开悟的障碍，让你的菩提道越来越遥远的那个叫做心外求法，我们就说他是外道。所以我们虽然说自己是佛弟子，可是我们做的事情如果都是向心外去求，那个我们自己也是大外道，所以我们没有资格批评人家是外道。</p><p>可是当时在印度佛陀的时代，就是其他在印度当时有很多所谓的外道，像“六师外道”是最有名的，还有很多很多不同的修行，还有不同的理论。因为他们都没有办法开悟，没有办法明心见性，没有办法见到自己的真心，所以我们说他是外道。那外道的“我执”就非常多的理论，因为他们不管怎么讨论，从头到尾，他都是先成立“我”是存在的，然后我再讨论这个“我”的量是大还是小，还是不一定大小，可是它的大前提是“我体”是常住不灭的，所以我们才会说他外道。因为本来无我的，你居然要讨论“我”存在的状况，那个“我”的量是大还是小，那真的是心外求法，因为这样永远没有办法证到无我，永远没有办法见到自己的真心，因为真心是无我的，是没有生灭的。</p><p>所以一般外道，当时的一般外道所执的“我”，还有关于我体的讨论，它是有三种，那都是我体是常住不灭的，那另外再讨论说“我”的量是要大，还是小，还是不一定，所以它有三种情况：</p><p>第一种就是说，他是执著“我”这个体是常住不灭的，而且是周遍各道，量如虚空。所以这个“我”的量它是周遍的，它一定要像虚空一样周遍在各地，你才可以随处造业随处受报嘛，所以它的理论就是说：那“我”的这个量一定像虚空一样周遍，没有一个地方没有到达的，所以我才可能在什么地方造业，什么地方都可以受报嘛；而不是说一定要把它规范说你在这边造业，然后在这边受报。你都是整个虚空都能够遍满的话，你就是随处造业随处受报。这是第一个理论：因为我量像虚空这么广大周遍，所以它可以随处造不同的业，随处感受不同的苦乐，就是果报。那这一类是指胜论派、还有数论派所妄执的我，所以外道都是首先建立“我”的存在，然后再来讨论。</p><p>第二种情况，是执著“我”这个体虽然常住不灭，但是“我”的量却没有一定的大小，它可以随着我身体的转变而舒展开来，或者把它缩小。譬如说大象，我体就大，小蚂蚁，我体就小，它可以舒展，而且也可以缩小。那这一类外道他的说法，就是属于裸形外道，或者无惭外道他们所妄执的我。</p><p>第三类的讨论，就是执著我体虽然是不灭的，但是我量却非常细小，为什么要这么样细小呢？这么小它才能够方便潜藏在我们的身中，那随时运转我的身体来造作种种的业，那这一类就是指兽主、还有遍出外道他们所妄执的我。</p><p>当然这都是错误的，我们举这个例子只是要说明它是这样的一个说法，就是我们第六意识就开始比量了，有没有？是用比量嘛，不是现量。比量，第六意识就开始分别了，比量、分别，有一个我，它是常住不灭的，然后它是像虚空这么大，这就是分别我执的来源，懂吗？它是分别来的，第六意识分别来的、比量来的，所以它很容易断。你只要知道什么？听了第七识颂，听完就知道它是错的，是不是就可以破分别的我执？它是比较容易破的，因为它是第六意识的比量来的，就是我们刚才说，他听了邪师、邪论、邪的说法，然后产生了邪分别，以为有一个“我”，比量出来的，然后它是非量的，“我”是非量的，就是这样子。</p><p>另外还有三种，就是讨论五蕴是不是“我”的问题。有一种是执著五蕴就是我，称为“即蕴我”，色受想行识这五蕴就是我；另外一派就是说那个“我”是离开了五蕴，另外有一个我，叫做“离蕴我”；第三派就说：你即蕴我、离蕴我都有过失，我就来一个“非即蕴非离蕴”，五蕴既不是我，离开五蕴也没有我，那根本就不知道他的“我”在哪里，他是为了要避免前面两派说法的过失，所以他就说：五蕴也不是我，离了五蕴之外也没有我，就是这样子。所以它都是第六意识的分别比量来的结果，其实都是非量的，因为“我”是非量，根本没有存在这样一个“我”的真实，所以我们才会说他是错误的。</p><p>以上这些外道的理论，都是执著有一个“我”，而这个“我”不是俱生的，而是听了外道的理论，在第六意识上生起一个我相。听了这个理论，然后我在意识当中就生起一个我相，它是常住不灭的，它是大的、小的怎样，第六意识就生起这样的一个我相而已。那既然是后天熏习来的，所以它是比较容易断的，我们只要修生空观，像刚才讲说那个五蕴是我，我们只要观色受想行识都是生灭、无常、无我的，五蕴就不是我了嘛，就可以破除这样的一个执著。所以对于分别我执，我们就是修生空观就可以破除了。所以它是在初地菩萨就可以破分别的我执，为什么？因为初地菩萨见到空性了，无我空性的智慧现前，当然就能够破除分别我执。</p><p>第二种我执就是俱生我执，这个就是比较难断了，因为它是俱生的。所谓的俱生，就是与生俱来的，一出生就有。那它是怎么来的？我们现在知道，它是无明来的：众生由于无明，不明白无我的道理，所以从无始以来，就一直妄执有一个“我”真实的存在，这个称为俱生我执。</p><p>这个俱生我执有两种，一种是恒常相续的俱生我执——指的就是第七识的作用，就是第七识的见分缘第八识的见分的时候，不知道它是自心的变现，就把它执为是恒常、唯一、真实的自我，而形成了这个恒常相续的俱生我执。其实这个俱生我执是由第七识和第八识两个见分嘛（这个我们都已经知道了），所变起自心的一个相分，由第七识还有第八识两个见分所变起自心的一个相分，就是“我”，“我”这个相分怎么来？第七识跟第八识两个见分来的，“中间相分两头生”，有没有？“以心缘心真带质，中间相分两头生”，就是在讲这个，并不是真实有一个实在的自我。由于第七识是恒常相续的，所以它所生起的俱生我执也是恒常相续的。</p><p>那另外一种有间断的俱生我执，指的就是第六识的作用。第六识的见分在缘第八识所变现的五取蕴相分的时候，就是那个五蕴是怎么生起的？五取蕴就是第八阿赖耶识所变现的相分嘛，那第六识的见分就缘这个第八识所变现的五取蕴的相分，不知道五取蕴（就是五蕴身心、色受想行识这个五蕴身心）这个相分是八识的变现，因为不知道它是八识的变现（我们现在都知道它是八识的变现了），于是就执著这个五蕴相为恒常、唯一、真实的自我，而形成了有间断的俱生我执。</p><p>所以我们就知道，有间断的俱生我执就是第六识的作用，是第六识的见分在缘第八识的相分的时候（就是所变现那个五蕴的相分的时候），把它当作是我，就是把五蕴当作是我。我们现在也是啊！我们没有证到无我之前，五蕴都是我嘛，我的身嘛、我的感受啊、我的想法啊，对不对？那这个就是第六识俱生我执的作用。</p><p>其实这个俱生我执，是由第六识的见分，缘第八识所变现的五取蕴相分时，所变现自心的一个相分，并不是真有一个“我”的存在。由于第六意识是有间断的，所以它所生起的俱生我执也是有间断的。</p><p>那这两种我执，俱生我执是比较微细难观察的，所以一定要到修道位的时候。我们说见道位就是登初地的时候，我们称为见道位，就是开悟的时候，破一品无明的时候，我们称为见道了，就是见到你的真心本性了，这个时候就能够初步地转成下品的平等性智、下品的妙观察智。这时候才能够破分别的我执跟法执，可是俱生的我执还没有办法，要到修道位，就是二地、三地……每一地慢慢、慢慢地熏什么？来不断地修习殊胜的生空观，才能够彻底地灭除俱生的我执。</p><p>那什么叫殊胜的生空观呢？因为在没有见道之前，修的是有漏的生空观，有没有？因为那时候还有“我”嘛，对不对？还没有证初地，还没有见道，还没有明心见性，还没有开悟，所以你这个时候还是有一个“我”来修，所以这个是比较低劣的、比较下劣的一种生空观。那你见道之后，初步证到无我了嘛，这个时候是无漏的生空观，所以我们就称为殊胜的生空观，因为这个时候已经明白了无我的道理，所以这个殊胜是相对低劣的有漏观来说的。在没有断分别我执之前，所修的生空观是有漏的，因为还有“我”，还没有真正的证到空性。</p><p>但在证得因缘所生、空无自性的道理之后，也就是在见道位之后，这个时候所生起的观慧就属于无漏了，因此在修道位中所修的都是这种无漏观，就是所谓的殊胜的生空观。那也只有这种无漏的观慧，才能够真正的断除俱生我执，所以要到第八地无功用行之后，就能够彻底地除灭了。</p><p>什么叫无功用？为什么要到第八地这个俱生我执才能断？为什么在初地只断这个分别的我执，俱生的我们没有办法断？因为已经证到无漏了嘛，对不对？因为要继续地修这个殊胜的生空观，譬如说他在入定之后，入这个生空观的这个定境之后，这个慧观现前，这个无漏的智慧现前，这个当下是无我的；可是他出定之后，因为他的慧观没有办法连续，慧观会因为出定然后间断，这时候“我”又现前，这样明白吗？俱生的我又现前，分别的我已经没有了，但是俱生的我会再出观，这个观慧没有办法持续的，有间断的情况之下，这个俱生的我执又会现前。</p><p>所以必须要不断不断地有功用、有功用，一直到七地有功用。第八地无功用了，就是说你不用再……可以任运自然地现起那个无漏的观慧，不用再加功了。所以我们说第八地，一定要到第八地无功用行，之前都是有功用的，因为观慧会间断，无功用之后观慧不会间断，才能够彻底地断除所谓俱生的我执，它的原因在这里。</p><p>那法执也是有分别法执跟俱生的法执。</p><p>分别法执也是后天熏习来的，也是属于第六识虚妄的分别，也许是听了小乘的教法所说的五蕴、十二处、十八界等诸相，那第六意识就随着这个听闻的内容，变现起自心的相分，因此对它分别计度，妄执有实在的法，这个就是分别法执的一种情况，这个是佛教来说。</p><p>那另外，外道就是听了外道所说的理论，譬如说数论派它有所谓的二十五谛，胜论派有所谓的六句，还有顺世外道的唯物论等等，便在第六意识上生起自心的相分，然后对这些相分分别计度，妄执有实在的法——这都是分别法执的来源。</p><p>那这两种法执非常的粗显，比较容易断，比较容易分辨。所以只要修法空，一旦入初地，观一切法空观，观一切法本来空，就能够断除这个分别法执。</p><p>那俱生法执它也是比较难断，因为它是俱生的，也是因为从无始以来，我们第六识还有第七识不断地虚妄地熏习我们内在的种子所产生的。就是我们刚才说的，你现在还是念念有这个法，以为一切法真实存在的，你念念还是熏回去，所以第六识、第七识都是这样熏，从无始以来都认为一切法是真实存在的，现在还继续熏，一直要到证到法无我，才能够真正地断除。所以这种俱生法执是比较难的。就是它不断地虚妄熏习我们内在种子所产生的，恒常和我们的生命同来，不需要等待外在邪教的影响，或者是内在错误的邪分别，就能够任运自然地转变生起，所以称为俱生的。</p><p>俱生法执也有两种，一种是恒常相续的俱生法执，这个是指第七识的作用。第七识的见分在缘第八识的相分时，不知道这个所缘境是自心的变现，于是就把它执为实有，而形成了这个恒常相续的俱生法执。</p><p>那另外一种，是有间断的俱生法执。指的就是第六识的作用，第六识的见分在缘第八识所变现的五蕴、十二处、十八界等等相分的时候，不知道这些相分是八识的变现，于是就在五蕴、十二处、十八界等等的相上面执有实在的法，而形成了这个有间断的俱生法执。</p><p>这两种法执它非常微细，难以观察，而且是任运现起的，因此它很难断除，要到见道位之后，初地、二地菩萨，一直到十地的修道位，整个修道的过程怎么样？每一地数数地修习殊胜的法空观，这也是殊胜的法空观，一地一地的，逐渐地才能够断除这个俱生的法执，所以它是比较难断除的。</p><p>好，刚好时间到了，念得很快，就是因为时间到了。</p><p>我们今天就到这里圆满。</p><p>（师颂，众师兄跟颂）愿以此功德，普及于一切，我等与众生，皆共成佛道。</p> </div></div>"
},{
    "title": "10.第八识(1)",
    "author": "净莲上师",
    "date": "2012年11月21日",
    "html": "<div class=\"B1_text\"><div id=\"fontsize\">\n<p style=\"text-align: center;\">最尊贵的净莲上师讲授<br/></p><p style=\"text-align: center;\">讲于新加坡Orchid Country Club</p><p style=\"text-align: center;\">二○一二年十一月二十一日</p><p>各位喇嘛、法师、各位居士大德：</p><p>晚上好！</p><p>我们今天开始介绍第八识。</p><p>第八识，要生起第八识，必须要有哪些因缘呢？它需要有四个缘，就可以生起第八识的作用。</p><p>第一个是“种子缘”。每一个心识要生起，一定要有自己的种子作为亲因缘，这是每一识都有的，一定有这个种子；不然你说你的心识是从哪里蹦出来的？它一定要有种子才能够生现行，才能够生起这个心识的活动，所以它一定要有种子这个缘。</p><p>第二个就是“境缘”，就是它的所缘境。我们前面讲第七识的时候，一直重复一句话，就是“第七识的见分执八识的见分为我”，那就有很多师兄问说：“那八识的相分是什么？”现在讲的就是八识的相分，就是境缘。</p><p>能缘的心，我们知道叫做见分；所缘的境，叫做相分。所以第八识它的所缘相分境，它就是有种子、根身、器界为它的“所缘缘”。我们说过因缘有四种嘛：有亲因缘、所缘缘、还有增上缘、还有一个等无间缘，所以一定要具足这四个缘，一切法才能够生起，它必须要有这四个缘。</p><p>那至于所缘缘，就是说它的所缘境，就是所谓的相分。那第八识它的所缘境有种子，我们前面念过第八阿赖耶识，它称为藏识，就是因为它能藏、所藏嘛。它含藏无量劫以来熏习的种子，到哪里去了？你每天造很多业，生起很多的念头，那这些都到哪里去了？它不是生起以后就消失了，它还要熏回去第八识，成为未来的种子。每一个现行都熏回去成为未来的种子，然后每一个现行都是从种子生起现行，所以我们每一个念头，它不是无由来的，不是没有原因的，是我们八识含藏的种子生起来。</p><p>所以你现在会动任何的一个念头，因为外缘的牵动，牵动你第八识含藏无量的种子——牵动那个种子生起现行来。那生起现行之后，它也不是就结束了，它还会回熏到第八识成为未来的种子，那个我们就称为习气，所以每一个习气都是这样熏出来的，长时间熏习来的。所以我们说“江山易改，本性难移”。只要你后天熏习的，含藏在第八识的这些种子，它就很难改变，除非你再回熏它，或者是改变那个熏习，回熏的那个种子改变，那你的现行才可能改变。</p><p>那已经熏习成习气的那个，就很难改变；除非你重新再熏习它不同的种子。譬如说我脾气很坏，我那个瞋恚的习气很重，已经变成习气，可能不是这一世我的脾气坏，我可能已经好几世脾气一直都很坏。那怎么办呢？我如果不改的话，因为我那个习气的种子在我的第八识它含藏得很好，一点都不会自己改变，所以你叫它不要发脾气是不可能的，因为种子不答应嘛，对不对？所以它就含藏在第八识。所以一有境界来，那个就暴了、习气就暴了，瞋恚就发了。所以，瞋恚的种子已经形成习气的话，它就会变成一股很强的那个业力，习气的那个力量会变得很强。</p><p>所以除非我现在慢慢熏，慢慢修慈心观啦，要发菩提心啦，还有任何的修行方法，能够对治我的瞋恚的，这样才可以把我瞋恚的种子，慢慢、慢慢、慢慢变薄、薄、薄、薄，一直到最后清净了。除非做这样的功夫，要不然它不会自己不见的。所以不是说我做完一件事情就算了，就过去了，没有过去噢！又熏回去成为未来的种子。所以我们身口意三业，不要小看它，每动一个念、说一句话、一个动作，全部都熏回到第八识成为未来的种子。现在就是我们讲的这个境缘，第一个是种子，它含藏无量劫以来的种子，都是你自己熏进去的。它也有本有的，也有新熏的。</p><p>种子那个本有的，就是说我们为什么可以藉由修行，每一个众生都可以成佛，因为我们本来有成佛的种子嘛，这个是本有的；要不然我怎么修都不可能成佛，因为我没有成佛的种子嘛，所以那个是本有的。</p><p>然后像习气这些，我们是新熏的。所以像我们修行的话，也是不断不断在熏习。你说我今天听不懂，没关系，我明天再来听，这次听不懂，我下次再听，慢慢熏。你现在听起来很辛苦是有原因的嘛！因为你过去没有熏习唯识的种子，所以这一世听起来不相应，因为你第八识没有那个唯识的种子，过去没有熏的话（假设啦），过去没有熏的话，你这一世听起来就会很辛苦，学起来很辛苦，因为所有的内容，你第八识没有曾经熏习过，所以没有种子生现行，所以现在听起来不相应，因为你的第八识没有那个唯识的种子，过去没有熏习过，所以这一世会比较辛苦。但是，要不要学？还是要学啊！因为你这一世不学，你还是没有，你下次听还是很辛苦。所以任何佛法三藏十二部的内容，我们听不懂没关系，慢慢熏、慢慢熏。所以学佛修行是无量劫以来不断不断地，每一世都在增长，绝对不是这一世才开始的，一定已经修行了很久。</p><p>那有些相应，有些不相应，有些听了会很法喜，那就是你过去熏得多嘛，你过去修到相应，所以这一世一听就很欢喜，就觉得很相应。那每个人过去修行的那个过程不一样，所熏习的那些善根的种子也都不一样，所听闻、闻思修的种子，每个人熏的也都不一样。</p><p>所以我们现在就明白了，它有本有的，然后有新熏的。那这些所有的种子都含藏在第八阿赖耶识，所以我们说它的境缘，第一个是种子。</p><p>那你要生起一切法，必须要有种子为亲因缘，你才可以生起一切法；不然就无因生嘛，不然就是自生，或者是他生，或者自他共生，或无因生——在《中观》里面知道，这四个都不对：不是自生，也不是他生，也不是自他共生，也不是无因生，也不是自然生的，是什么？因缘所生！所以要有内因为种子，种子为亲因缘，是内因，然后再加上外缘的牵动，不然你这么多种子，你哪一个出来？你哪一个起现行？就是要有外缘的牵动嘛。所以内因加上外缘的牵动，那个种子就生起现行来了；因此，你每天就有很多的身口意的造作，都是种子生现行，做完以后，熏回去成为未来的种子。</p><p>除非你有所对治，要不然它是不会减少，只会越熏越多。我每天我、我、我，越来越坚固，那个有“我”的我执的力量就越来越强，所以我们念念有我的话，那个我执就非常坚固。那我们说一切法无我，然后什么要有空性的智慧，要明白一切法因缘所生、空无自性，那个听到老也是没有什么改变，为什么？因为还是念念有“我”嘛，懂吗？就是你念念还是回熏那个我执的力量，“我”，还是有我、有我，所以你再听闻什么无我的空性的智慧，无我的道理，也是不会改变，为什么？因为你熏习有“我”的那个念头的时间比较长，熏习得比较久，你现在偶尔听一下“无我”，听完就过去了，知道但是都做不到，那就是你的种子没有改变。</p><p>所以我们就知道第八识，刚才讲能藏、所藏嘛，一个是受熏，一个是持种。</p><p>受熏之后的种子，它就能够把持在第八识里面，然后不会坏失的，历久，不管你轮回多久，它都不会坏失，永远都含藏在第八识当中。除非有一天成佛了，所有的种子都清净了，所知障、烦恼障的种子都清净了，这个种子才没有。在这个之前，所有的种子、一切法的种子都含藏在第八识，所以第八识的功能就是受熏、还有持种，受熏习，然后持一切的种子。这些种子有本有的，有新熏的。</p><p>那我们现在明白了，这个种子它是生起一切法的亲因缘，所以这个种子它就是说明能生起万有的功能，它是一股势力，就是要有这个种子，你才能够生起一切宇宙万有。</p><p>那一切种子生起什么？我们一般就是所谓的正报跟依报嘛，对不对？正报的种子生出我们的根身，依报的种子就生起什么？器世间。所以我们说有情世间，有器世间，有正报，有所谓的依报。正报就是我们这个根身，叫做正报；那外面的那个环境，我们所依存的那个环境，外在的这个山河大地，还有整个宇宙的这些器世间，它是属于依报。这些正报跟依报哪里来的？都是种子生起来的。这就是要生起第八识的第二个缘，必须要有境缘。</p><p>所以我们就明白，一切的种子、还有根身、器界是所缘缘。就是我们含藏在第八阿赖耶识里面的根身、还有器界的种子，生起宇宙万有，生起这个正报跟依报，之后呢，作为我们心识的所缘，因为它是相分境嘛，是所缘境。那我们的心去缘它（我们能缘的心叫做见分），所以我们每天看的：色声香味触，这就是我们的所缘境，对不对？所以我们每天面对不同的境界，我们如果明白它是我们八识所变现的相分境，这个所缘境的话，你就不会迷惑颠倒，对不对？不然我们会以为这些一切的境界都在外面嘛，它都是真实存在的，所以它就会牵引我的喜怒哀乐，然后增长我的贪瞋痴慢，然后就造了很多的业。因为看到境界来生起贪爱，不喜欢的就生起瞋恚，没有特别喜不喜欢就愚痴，愚痴就是你当下不明白它是你八识所变现的相分境，这个就是有愚痴在里面，不明白这些境界，这些相分境是怎么来的。</p><p>它到底是怎么来的？它不是本来就有的，不是，都是我们八识所变现的。明白这个道理，我们就不会被它迷惑，当下就知道它是我们心识所变现的，然后我们心识再去缘它，就知道一切的外境是假有，不是真实存在的，我们就不会在上面生起了无量的分别执著，然后造了很多的业，因为它没有离开我们心识所变现的相分。</p><p>明白这个道理很重要，要不然就是很无明愚痴嘛，很颠倒嘛，为什么？我们自己八识变现种种的相分境，然后我们又非常执著它，是不是很奇怪？就是因为不明白这个道理，不明白这一切的相分境都是我们八识所变现的，然后我们心识去缘它的时候，又产生了无量的分别执著，有分别执著就会造业嘛。把这个见分当作是“我”，然后相分当作是“法”嘛，这个我跟法都是真实存在的，因此造作种种的业。</p><p>那我们如果明白这一切的相分都是自己心识所变现的，不要再被它迷惑颠倒，就可以停止造作贪瞋痴种种的业。所以，这个体会也是非常的重要，要明白种子它是能生起万法的一种功能，有机会才能够发嘛，才能够生起现行，所以它是一种很强的功能。</p><p>那宇宙万有，它的本源是第八阿赖耶识来的。所以有人问说：“请问宇宙万有是怎么来的？”你现在就会回答了：“八识所变现的相分境，就是宇宙万有的本源！”现在不是很热闹吗？要找最早最早那个宇宙的起源，最早最早哪里来？就一念无明来的嘛！看可不可以找到一念无明。一念无明才有第八识。本来是真心，一念无明就有八识，所以宇宙万有怎么来的？一念无明来的，才有八识，才变现出根身器界来，很快就找到宇宙的本源了。</p><p>第三个“作意缘”。我们知道心识的活动一定要有“作意”为增上缘。我们念过《百法》就知道嘛：作意、触、受、想、思，一念形成必须要有这个五遍行，所以一定要有作意。</p><p>第四个是“染净缘”。染净缘就是以第七识为染净缘，就是说第八识是清净还是染污的，还是要以第七识为它的染净缘。就是说第七识有没有转识成智？如果第七识的见分还是执第八识的见分为我的话，这个时候第八识称为阿赖耶识嘛，这个我们都知道了，阿赖耶识的名称怎么来的？就是当第七识的见分执八识的见分为我的时候，这个时候的第八识称为阿赖耶识。这个就是“我爱执藏位”，就是有一个“我”，我执就是这样产生了。所以这个时候的第八识是染污的，对不对？</p><p>那第七识如果说转成上品的平等性智之后，就是说成佛之后，这时候的第八识就不能称为阿赖耶识了，要称为“无垢识”，就是“无垢清净识”。这个时候第八识的烦恼障跟所知障的种子完全清净了，所以它是完全清净的第八识，我们给它一个名称，叫做“无垢识”，这时候就是进入“相续执持位”。</p><p>“相续执持位”就是说…，它有另外一个名称，叫做“阿陀那识”，等一下我们会讲到。就是说我们活着的时候，像我们每天，我们都知道我们这个色身是四大的假合嘛，对不对？五蕴的假合嘛：色受想行识，五蕴的假合，然后每个细胞都是生灭生灭的嘛，有没有？地水火风：什么骨头是地啦，什么血液是水啦，呼吸是风啦，体温是火啦，这个都是生灭生灭、无常的，对不对？那你们有没有想过说，我每个细胞都是生灭的，从里到外，地水火风所构成的四大的假合全部都是生灭的——它为什么不会散？四大分散，它为什么不会散？是不是很奇怪？外在有地水火风四大，我们本身也是地水火风四大，诶？它为什么不会散掉？是不是有一个很强的力量去执持它？让它活着的时候不会散，死的时候四大分散嘛，就散了，对不对？活着的时候为什么不会散？就是第八阿赖耶识那个执持的功能。</p><p>第八阿赖耶识它执持我们的身根不会坏（在活着的时候），然后所有身根的那个感受，都是第八识的作用。所以它执持我们的根身，然后执著我们种种的感受，所以它执著这个就是“执受”，让我们的这个色身不会腐烂，不会坏掉；要不然生灭无常的就应该会毁坏，要不然不是分散，就是腐烂，对不对？为什么死了以后才会腐烂？因为第八阿赖耶识的神识离开了身体，懂吗？它还活着的时候，在我们身上的功能，它就是执持我们的身根不坏，然后种种的那个感受都是它在管的。所以我们这一口气不来，断掉了，四大就分散了，肉体就腐坏了，因为第八阿赖耶识怎么样？离开了我们的色身。所以就可以证明，第八阿赖耶识它是一种执持的功能。</p><p>那在凡夫的时候，它是第八阿赖耶识，因为是什么？是染污的嘛！我们叫阿赖耶识的时候，刚才说是染污的嘛。第七识还没有转识成智之前，它的见分执八识的见分为我，所以这个时候的第八识称为阿赖耶识，这个时候是染污的。所以这时候我们的根身、器界，就是我们的正报跟依报，它有这个执持的功能。</p><p>那我们说这所有染污的种子都清净、清净，所知障、烦恼障的种子所有都清净了，所有善恶的种子都完全清净了，这个之后剩下什么？就是成佛了之后（刚才说叫做无垢识嘛），这时候的第八识不能叫阿赖耶识，叫做无垢识，就是说这时候执持的是清净的种子，所以还是有执持哦！不然你说佛菩萨祂要示现的时候，祂那个怎么示现？祂染污的种子已经没有了，祂不是业报身啊，可是祂可以示现佛身，那个是怎么来的？就是这个无垢识的功能，所以它叫做“相续执持位”，就是说它可以从你凡夫一直相续执持我们的根身，一直执持到你成佛，它还是可以怎么样？还是有那个执持的功能，所以它叫做相续执持位，就是说它的功能是不会间断的。</p><p>不管你是有什么样的根身：是凡夫的根身啦，还是六道的根身啦，还是成佛之后的——成佛之后有净土嘛，对不对？也是有正报、有依报啊，那个佛身也是有根身啊！那它是怎么变现的？就是无垢清净识，清净的种子所变现出佛身，还有祂的依报──净土，是这个无垢识所变现的。所以相续执持位，它一直执持这个根身、还有器世间，让它不会坏失，也是执持这个种子不坏失同样的意思。因为所有的根身、器界都是种子所变现的嘛，所以它可以保持一切的种子、还有根身不坏。</p><p>这就是讲到为什么第七识是第八识的染净缘，在染位的时候它称为阿赖耶识，也是能够执持我们的根身，还有器世间（正报跟依报）。那等到成佛之后，它转识成智，第七识转识成智，转成上品的平等性智之后，这时候的第八识称为无垢识，也是同样的在执持这个根身，然后清净的种子可以为众生变现出祂的佛身，还有净土的依报（正报跟依报）。</p><p>那我们就知道，第七识跟第八识的关系非常非常密切。那前面我们讲到第六识也是嘛，染净依也是第七识，第六识跟第七识我们前面介绍过。第七识没有转成平等性智之前，第六识也是念念有“我”的。那转成平等性智之后，就念念是“无我”的，所以第七识都是成为染净依的原因在这里。</p><p>那我们现在看第八识颂，也是，第一个部分是“有漏杂染识”。</p><p>“性唯无覆五遍行，界地随他业力生。”</p><p>“性唯无覆”，就是说第八识的识性是属于无覆无记性的。所谓“无覆”，就是说没有障碍，没有盖蔽的意思。我们前面念过第七识，它是“有覆无记”，还记得吧？有覆，就说明它是有盖覆的，它有障碍，有盖蔽，遮蔽的蔽，被盖住了，被遮蔽了；那就是因为第七识它有什么？有四惑嘛，有没有？还记得吗？四惑是我贪、我痴、我见、我慢，对不对？所以这个四惑它会障碍圣道不能够生起。所以我们现在为什么不能够成就圣道？为什么不开悟、不成就？就是因为这四惑还在，我们念念都有我贪、我痴、我见、我慢，念念都有，所以没有办法成就圣道，所以它是障碍我们圣道的生起，这个叫做“有盖覆”。</p><p>那八大随烦恼，第七识还有八大随烦恼，“四惑八大相应起”嘛，还记得吗？所以八个大随烦恼它会盖蔽我们的真心，不能够清净，所以叫做“有覆”。我们的心本来清净，菩提自性本自清净嘛，现在为什么不清净了？因为有八大随烦恼，所以它没有办法清净；虽然是本来清净，但是八大随烦恼一盖覆，我们的心就不清净了，没有办法恢复到本来清净的真心，那我们就明白那个“有覆”是什么意思。</p><p>那现在第八识它是“无覆”，无覆就是它没有四惑，也没有八大随烦恼，所以它没有四惑的障碍圣道，也没有八大随烦恼的盖蔽真心，所以称为“无覆”。我们就知道，第八识它没有盖覆的，它本来是清净的。</p><p>那什么是“无记”呢？无记就是说在善恶两类当中，无可记别。前面讲过嘛，不能把它归在善，也不能把它归在恶这边，只能另外一类，叫做“无记”。</p><p>那为什么第八识它是无记性的呢？因为第八识它是整个一切有情的总果报体，它只是感果的异熟果报体，就是前七转识它怎么熏，它就怎么含藏嘛。不是受熏持种吗？那受熏的那些习气，是不是它自己造的？不是啊！前面七转识怎么造，它就怎么接收、就怎么含藏嘛！它怎么受熏、怎么持种？前七转识给它熏善的，它就熏习，就含藏那个（善的种子），就受熏，然后持它的种子。然后熏恶的，它就是照样的熏，然后持它的那个恶的种子，怎么熏，它就是怎么持种。它本身有没有造业的力量？没有造业的力量，所以它是无记性的。所以它只是一个总的果报体、一个有情的总果报体。</p><p>像我们去投胎，带什么去投胎？“万般带不走，只有业随身”嘛，这个业在哪里？在第八识含藏。所以我们神识离开身体，这个神识就是第八识，这个肉体都烂坏掉了，我们那个有一个东西去投胎的，那个叫神识，就是第八识。第八识带着什么？我们无量劫所造的那个业力，所以它是总果报体，一切有情的总果报体。这个总果报体就是你过去怎么造业，全部都在这个果报体里面，就是第八识，然后带着这个去投胎。所以我们一投胎，就是过去无量劫以来的那个什么就跟着我们一起来了，跟着我们的生命一起来。所以我们过去所造的一切业它都不会自己消失的，全部都一起带来，还没有报之前，它都含藏在第八识，等待机会报这样而已。</p><p>所以我们知道，第八识它只是一个总的果报体，所以我们不能把它归在是善、还是恶，它只是受熏持种的功能，然后含藏一切果报的种子而已。所以我们知道第八识它只是随着业身去投胎嘛，带着这个业去投胎，然后它自己本身是不会造业的，所以对于善恶它是无所记别，它没有办法记别。一般是善因感善果，恶因感恶果，这两类都有强盛的善恶之体可以记别，说这个是善的、还是这个是恶的。可是第八识它没有这么强盛的善恶之体可以记别，所以我们就叫它“无记性”，这个“无记”是这样子来的。</p><p>那这种情况就好比镜子，有没有？镜子可以反射任何的影像：你青色的来，它就反映青色的；黄色的来，它就反映黄色的，那镜子本身是青色、是黄色吗？都不是，对不对？八识就有一点点像这样的情况。</p><p>镜子它为什么能够反射？是因为镜子的本体它是光明清净的，所以它能够现种种色，任何的形像在它面前，它就可以呈现，如实地反映这样而已；但是它本身不是青黄赤白，也不是种种色；但是因为它本体是清净的、是光明的，因此它有现种种色的这样一个功能。那我们第八阿赖耶识也是同样的，第八识的本体它是清净的，刚才说它是无覆的嘛，它没有盖覆的，没有四惑，也没有八大随烦恼，所以它本身是清净的：不是善的，也不是恶的，它只是如实地反映种种因缘果报的现象而已，一切有情生命的总果报体，它只是如实反映，你造什么样的业，它就如实反映而已，但是它本身是清净的，这就是无记的意思。只是如实反映种种因缘果报的现象而已，这是无记性的意思。</p><p>因为我们刚才说一念无明才有第八识嘛。本来是真心，每个人本来都是真心，一切众生本来是佛，什么时候不是了？一念无明起就不是了。你不要问说“这一念无明什么时候来的？”没有！没有什么时候来！你任何时间起了无明，它就来了！没有什么时候开始，懂吗？任何时候你起了一念无明，你的真心就变成……“唯心所现”嘛，现什么？现第八识，“唯识所变”，八识就变现出刚才讲的根身、器界来了，见分、相分就出来了，这样懂吗？</p><p>所以你说真心跟第八识什么关系？是一个、还两个？真心跟第八识是一个、还是两个？一个的举手！两个的举手！没有举手的就是不确定啦。对啊！它是一个啊！它怎么会变两个？阿赖耶识怎么来的？真心来的啊！真心起无明来的，你说它一个还是两个？两个的话，就是第八识跟真心没有关系，叫两个，对不对？你本来真心，然后一念无明就变成第八识了，它是一个嘛！真心来的嘛，只是它起了无明，变成第八识，这样懂吗？</p><p>所以变成第八识的时候，第八识有四分，我们前面曾经讲过：它有见分、相分、自证分、证自证分。见分、自证分、证自证分都是属于见分，这样懂吗？它是属于见分。然后相分，所缘境叫做相分，能缘的心叫做见分，这个叫做二元对立。有见分、有相分，有能缘、有所缘——二元对立。有我能见的、还有所见的；我能够见的——我能缘的心，缘这个花──这是我所缘的境。所以我能缘的心是见分，所缘的境是相分。</p><p>那这个见分跟相分哪里来？自证分来的，这样懂吗？自证分就等于是我们刚才说第八识的本体（自证分），它一起了二元对立，就有相分跟见分。明白这个道理很重要，因为你只要不起二元对立的分别，相分跟见分就回到自证分了，就回到本体了，这样懂吗？这样离真心就没有太遥远。因为自证分是从真心来的嘛，起无明之后来的，可是它是本体（第八识的本体）。</p><p>那这个自证分还要有一个去验证它，你这个自证分是对还是错，那个叫做“证自证分”。证明这个自证分它是正确的还是错误的认知，所以它还要有一个去验证它的，叫做“证自证分”。但是它们都是属于见分，都是那个本体的功能。</p><p>所以，我们平常只要安住在那个没有二元对立的（当下），你就回归本体了，是不是很快？然后再下去就回归真心了，是不是这样比较快？所以明白道理对修行来讲，有很大的好处。可是你一落入二元对立就完了，就分别执著就来了，然后就造业，后面就是起惑造业了。起惑就是又起了无明嘛，然后又是我啊、你啊、他啊，就开始来了嘛！就我执跟法执又开始了，那就是只有轮回了，那没救了啦！</p><p>所以我们如果说想要很快开悟，很快明心见性，很快回归真心，自性现前，因为它本来就是清净的嘛，我们自性本来是清净的嘛，你只要回归，你只要不落入二元对立，回归到那个本体，那个真心就恢复了嘛，是不是这样很快？这样比较快啦！所以我们平常就是练习尽量不要分别执著，不要落入二元对立，就是不要落入见分跟相分，保持那个自证分就好了，没有分别、没有执著。真心是无念的，不起念，不起心动念，不要分别、不要执著，就回归到自证分，然后再破无明，就可以回归真心了。</p><p>那个无明，就是以为有“我”嘛，叫做无明嘛。本来是明的，真心本来是清净光明，是没有“我”的，就是因为起了那一念无明：以为有我、有法，以为“我”是真实存在的，一切因缘所生法是真实存在的——那个就是无明的产物，懂吗？所以我们现在要破无明也是很快嘛！不要执著见分为我，不要执著相分为法，知道见分跟相分都是什么？自证分所变现的就好了嘛！是不是就回来了？对嘛，很快哈，开悟很快！</p><p>那个才是我们要讲的重点，我们讲八识的重点，就是知道一切都是八识所变现的，就不要再被它骗这样就好了，我们八识就讲完了，重点就是在这里：要明白一切的根身、器界都是八识所变现的相分。那八识所变现的相分境是你自己变的，那你还要执著它？是不是很笨嘛？就不要再执著它，知道是自己八识所变现的就好了，然后不要落入二元对立，很快就可以证到无我，明白见分不是“我”，相分不是“法”，无明就破了嘛，就回归真心了，就是这样子。可是我们课还是要讲的啦！</p><p>下面一句就是“五遍行”，说明第八识相应的心所，它很简单，只有五遍行，其他统统不相应，所以第八识是不是好清净？其他的心所，善心所、恶心所全部不相应，只有五遍行相应。五遍行就是你生起心识的活动一定要的嘛，一定要有五遍行，要不然就没有第八识心识的活动。前五识、第六识、第七识、第八识，一切心识的活动一定要有五遍行，这一念才能够完成，所以第八识，你心识要生起它的功能，就一定要有五遍行，所以这个第八识它只有跟五遍行相应。</p><p>但是，要注意的就是，五遍行是什么？作意、触、受、想、思，对不对？这个“受”，第八识有没有苦受？有没有乐受？第八识会不会忧愁？第八识会不会欢喜？第八识会不会说“我好苦噢”？刚才说它本体是清净的，应该是不会叫苦啦！第八识会不会说“我好快乐”？不会！“我好欢喜”？不会！“我好忧愁”？都没有！所以，苦乐忧喜都没有，它只有“舍受”相应。所以我们只要知道说，它相应的心所只有五遍行，但是这个“受心所”跟其他不一样。受心所有苦、乐、舍三受，或者是苦、乐、忧、喜、舍五受嘛。那第八识因为它是无覆无记性的，所以它只有舍受，其他忧喜苦乐都没有，这样我们知道它虽然跟五遍行相应，但是那个受是只有舍受，这样就可以了。</p><p>但是我们还是要进一步去探讨说，它为什么不跟五别境相应？第八识为什么没有五别境相应呢？</p><p>那五别境第一个就是“欲”嘛。欲就是希望，我希望怎么样，我好乐，对于所好乐的事情，我希望去达成，这个叫做欲。那第八识有没有好乐说“我希望达成怎样？”没有，它只是人家怎么熏，它就怎么接受，它没有什么好乐什么，也没有希望什么，所以它没有欲心所。所以第八识它只是任凭善恶业来转，没有自己喜欢的事情希望去做，所以它就不和欲心所相应。欲心所就是希望嘛，它没有什么希望，也没有什么好乐的事，希望去达成，因此它不跟欲相应。</p><p>第二个“胜解”。胜解就是决定，坚固的决定。我一旦决定了，任何情况之下都不可能改变，这个叫胜解，所以它也有好的，也有坏的。那个邪知邪见，它也是很坚固的胜解嘛，对不对？你要劝他，他也是很难接受啊，为什么很难接受？因为那个已经变成他坚固的胜解了，任何情况之下都不可能改变他的想法了，那个我们叫做胜解。就是他的理解已经到达非常坚固，不能够轻易动摇他的这样一个地步，叫做胜解。所以胜解可以说是决定，对于已经决定的事情，印证把持得很厉害，就是说他抓得很牢，那个观念抓得很牢，绝对不会轻易地改变。</p><p>第八识它也不能够印证把持什么，它也没有什么决定，也不需要决定什么，所以它不和这个胜解心所相应。第八识不需要决定，它也不会牢牢地抓住什么那个想法不放，都不会，因此它没有胜解。</p><p>第三个是“念”。念就是回忆嘛，对于我们过去曾经串习过的事情，你能够明白记忆使它不会忘失，这个我们叫做念。那第八识它的作用呢，它是很弱的那个功能，对于回忆这件事情，它功能是非常弱的，就是它不是非常明利这样的一个状态。所以境界过去了就忘记了，它不能够明白记忆什么，所以我们说它不和念心所相应的原因在这里。所以第八识它没有办法回忆，回忆不是第八识的事情。</p><p>第四个是“定”。定就是专注，让我们的心专注在一个所缘境上，我们叫做定。那第八识可不可以专注呢？它没办法，它每一刹那都任运地去缘不同的境，所以不可能专注在任何的一个境界上，所以我们说第八识它不和定心所相应。</p><p>第五个是“慧”。慧就是简择，就是一种分别，一种分别的智慧。就是对于所缘境，就是你的心去缘那个境界，那你对那个境界能够分别它是善恶、好坏、邪正，这个就是一种慧的作用嘛。我们说我有智慧的选择，我有分别的智慧，就是说任何的事情，我很快就能够决定说这个是对的、还是错的，是好的、还是坏的——这个就是一种简择的能力，我们叫做慧心所的作用，就是能够分别简择。就是对于所缘境能够简择它的邪正、得失、善恶等等的事情。</p><p>第八识它是非常的微细，非常的昧略。昧略，就是它是暗昧不明的，然后非常简略的一种作用，所以它不能够说“我好好地想一想，我好好地思虑”，它都没有办法做这样的作用。所以它不能够审虑，它也没有办法简择，所以我们说它不和慧心所相应。</p><p>而且五别境它也是各别缘不同的境。像欲心所，它是缘所乐境嘛，所好乐的，希望能达成；胜解它是缘决定境；那念呢，它是缘曾习境，就是过去曾经串习的，然后不会忘记嘛；那定跟慧它都缘的是所观境，对于所观察的境界你能够专注不散，我们叫做定；能够分别简择，我们叫做慧。所以，五别境它是各别缘不同的境，就是所乐境、决定境、曾习境，还是所观境。</p><p>可是，第八识它是任运缘现在境，所以第八识它是属于性境、现量。我们讲三境，有没有？第八识属于性境、现量，三量它属于现量，所以它只有现在──每个当下、每个当下、每个当下。所以不像五别境，它可以各别缘不同的境，是不一样的。第八识它是任运地缘现在境，因为它是性境、现量的关系，所以它只能够缘现在境，所以它不能像五别境缘不同的境，所以我们说它不和五别境相应的原因在这里。</p><p>好，那第八识为什么不和十一个善心所，还有根本烦恼、随烦恼相应呢？我们现在知道了，因为第八识是属于什么？无记性的嘛，无记性的话，当然就不和善性跟恶性相应嘛。</p><p>那为什么不和四个不定心所相应呢？四个不定心所，为什么叫做“不定”？就是善、恶、无记不定，所以它也有无记的部分，对不对？但是它是不是永远无记的？不是，它一下善、一下恶、一下无记嘛，所以它这个无记不是恒常相续的，跟第八识不一样。第八识是恒常相续的无记性，所以它跟这个四不定心所的“不定”不完全一样，对不对？不定就是善、恶、无记不定；但是第八识永远是什么？无记，没有间断的时候。</p><p>那四个不定心所有什么？悔、眠、寻、伺嘛。悔就是追悔。第八识既然不会造业，它要不要追悔？说我后悔做了什么事？不用嘛，对不对？因为它不会造业。那第八识也是任运的缘现在境，它需不需要睡眠？它也不需要睡眠。第八识它是完全断绝粗细的两种分别，所以它也没有寻伺的作用。</p><p>寻伺我们说过，它是属于粗分别叫做寻，细分别叫做伺。我们心的那个分别作用，比较粗的我们叫做寻，就不断地寻找，寻求寻求，那个是寻，就是一个境界来，你马上就说“这是什么？”，那个是寻求，这是寻的心所，就是比较粗的分别。这样看过去，这个是……就是这样子，这个是寻求。那伺察的话，就是再细的分别：“哦！这个是康乃馨，那个是胡姬花、茉莉花、白兰花”，这个就是伺，比较细的分别，所以伺就是伺察。所以它都是对于境界，你可以用言语去表达：比较粗的分别，我们叫做“寻”，比较细的分别叫做“伺”，所以它都是属于语言对境界的描述，所以寻伺我们把它归在语、言语的这个方面。</p><p>那我们修过四禅八定就知道嘛，初禅还有寻伺，对不对？二禅就没有了，还记得吗？你们修过的境界，二禅里面没有寻伺的，所以二禅已经没有言语的作用了，已经没有言语的活动。所以二禅以上都是剩下微弱的意识而已，没有言语上可以描述的粗分别还是细分别的寻跟伺，都没有了。所以寻伺的作用是我们人道有，就是欲界有，然后到初禅还有，二禅以上就没有寻伺的作用了。</p><p>那我们也念过前五识嘛：“眼耳身三二地居”，有没有？初禅没有鼻舌二识，因为它已经禅悦为食，它剩下眼、耳、身三识而已，鼻识跟舌识初禅已经没有了，因为它禅悦为食，已经不用欲界的段食。</p><p>所以第八识它没有寻伺的作用。</p><p>这样我们就看，第八识它相应的心所非常的少，只有五遍行。所以它为什么能够保持清净的原因也在这里：所有的善心所也不相应，恶心所也不相应，烦恼心所统统不相应，只有最基本的心念的活动──五遍行，这样而已。</p><p>下面一句：“界、地随他业力生。”</p><p>这个是说第八识的界、地。界，是指三界；地，是指九地。就是说第八识它所活动的范围，可以周遍三界九地。就是是什么让我们轮回在三界六道当中，我们刚才说过嘛，是谁去投胎的？第八识，所以我们就知道是第八识让我们轮回在三界六道当中，所以第八识它所活动的范围就是三界九地。九地，就是我们前面讲过嘛：九地就是欲界、色界、无色界——三界，就是包含了六道当中。所以是我们第八识这个神识去投胎的，所以它一定要遍三界九地才可以。</p><p>那八识让我们轮回在三界六道当中；但是，是什么力量让第八识不断地在三界六道当中轮转呢？一下子生善趣，一下子堕恶趣呢？什么力量去的？业力嘛，对不对？谁造的业力？业力哪里来的？业力是第几识造的？前六识造的，对不对？第七识不会造业，我们讲过，现在也知道第八识不会造业。前五识是帮助第六识的一个助缘而已，但是它本身造业力量并不强，只是说前五识的生起必须要有第六意识的分别，你才知道看到了什么、听到了什么，但是造业力量最强的还是第六识。</p><p>所以，是八识让我们轮转在三界六道当中；但是它是什么力量去的？是业力，谁造的业力？第六识造的业力。所以如果说，过去前六识造的是五戒十善业等等，那我们这一世就会生在人道或者是天道当中；如果我们过去世前六识造的是犯戒、破戒，或者十恶业等等的，那这一世我们就会招感三恶趣的果报。</p><p>所以，这个引业会引生我们到哪一道去，这不是八识可以决定的，对不对？是由前六识的业力来决定的，前六识造什么业，到时候就引生到哪一道去。在三界六道当中轮转，是靠前六识所造的业力来决定的，所以说“界地随他业力生”。会投生在三界九地的哪一地当中，完全随“他”，那个“他”，就是指的前六识。这个“业”，就是由前六识所造的，不管是福业、非福业，还是不动业，就是善恶业，还有那个色界、无色界它是属于不动业。福业、非福业、不动业都是由前六识所造的，看哪一类的业力最强盛，就由那一股强盛的业力牵引生在三界九地当中，这就是“界地随他业力生”的意思。</p><p>所以，我们现在知道了，第八识它本来没有生死，它只能够随着业力来转，而成为三界一切有情所招感的总果报体。</p><p>那你要问了：作为这个三界的总果报体，难道前五识不可以吗？第六识不可以？第七识也不可以吗？那就要知道，我们刚才说那个总果报体是第八识嘛，那前五识为什么不可以？我们刚才已经讲了，它不能周遍三界九地，对不对？我们刚才讲了，初禅没有鼻舌二识嘛，然后初禅只有眼耳身三识，二禅以上前五识没有了，所以它不能遍，所以它不能说我只能在欲界受报，然后色界、无色界是没有办法受报的，不可以这样子。所以作为总果报体，你必须要遍三界九地，所以你不管投生在哪里都可以受报，对不对？所以前五识不能作为这个受报的总果报体。</p><p>第六识它没有相续，你也不能说一下子有果报，一下子没果报，一下子受报，一下子没受报，不可以呀。所以那个有间断的第六识，它也不能够作为有情生命的总果报体。</p><p>第七识也不可以，因为第七识怎样？它不是业力所生的。它必须要业力所生的，它才可以总和这个业力，然后去受报。那第七识不是，它是有覆无记的，所以第七识它不是业力所生的，所以也不可以。</p><p>所以，只有第八识它能够遍三界九地，没有间断，恒常相续，而且它是业力所招感的。必须要具备这三个条件：就是周遍、恒常、还有业招（业力招），才能够作为三界一切有情所招感的总果报体。所以我们说“界地随他业力生”就是这个意思，作为一切有情的总果报体，只有第八识可以担任这个角色。</p><p>我们今天就讲到这里。</p><p>（师颂，众师兄跟颂）愿以此功德，普及于一切，我等与众生，皆共成佛道。</p> </div></div>"
},{
    "title": "11.第八识(2)",
    "author": "净莲上师",
    "date": "2012年11月22日",
    "html": "<div class=\"B1_text\"><div id=\"fontsize\">\n<p style=\"text-align: center;\">最尊贵的净莲上师讲授<br/></p><p style=\"text-align: center;\">讲于新加坡Orchid Country Club</p><p style=\"text-align: center;\">二○一二年十一月二十二日</p><p>喇嘛、法师、各位居士大德：</p><p>大家晚上好！</p><p>我们继续看，第八识规矩颂。</p><p>“二乘不了因迷执，由此能兴论主诤。”</p><p>这两句颂是说第八识的行相非常深隐幽微，不但凡夫难以发现它的行相，就是二乘圣者也难以了达，由于如此，才兴起了大乘菩萨论主的论诤。这就是这两句颂的意思。</p><p>“二乘”，指的是声闻乘、缘觉乘，我们所谓的“小乘”，就是二乘人，指的是小乘人。小乘人不了解第八识。那二乘人为什么不能够了达第八识呢？是因为迷执的缘故。那又为什么会迷执呢？因为二乘人他们只知道有一个生灭无常的第六识，他们知道前五识、第六识；但是他们不承认有第七识、第八识，就是因为迷执的关系。</p><p>所以，以他们的定力，他们也修止观；但是他只能看到生灭无常的第六识，因为第八识太深细，行相非常深隐幽微的意思就是说，它太深细了，甚深最甚深，微细最微细。那除了证到佛（究竟圆满的佛）才能够完全地了知这么深细的第八识，所以二乘人他是没有办法了达第八识的。</p><p>所以，以他们思惟来修、来观一切生命无常的现象，也只能看到第六识，所以一直都不知道有一类相续的阿赖耶识，所以坚持不承认有第八识，因此说他“迷”；而且认为第六识可以受熏持种，因此说他“执”。所以这边“迷执”的意思是说：他不了解有一个第八识，所以说他迷，因为迷了，所以不知道有第八识；因为坚固执著第六识可以受熏持种。我们昨天说第八识的功能它能够接受熏习，还有持一切法的种子，这个受熏持种的功能，对小乘人来讲，第六意识就可以完全代替第八识受熏持种这样的一个功能，所以我们说他“执”，就是坚固地执著第六识的功能可以包含了受熏、还有持种等等第八识的功能，所以我们说他“执”，因为他坚固就是这样认为。</p><p>那么二乘人他为什么不知道有个阿赖耶识呢？因为佛没有对二乘人说。那佛为什么不对二乘人说阿赖耶识呢？有两个原因：</p><p>第一个是，他们的智慧太浅薄了。我们知道小乘人的智慧只到哪里？他们只破了见思惑嘛，只证到我空，没有破所知障，没有法空的智慧，因此我们说他的智慧太浅薄，没有办法了解第八识。</p><p>第二个原因是，第八识不是二乘人所证悟的境界，不是他们要证的境界。因为二乘人想要解脱生死、跳出轮回、证入涅槃的话，他不需要了解到这么深细的第八识。他只要（我们刚才讲的）破见思，然后断我执，这样就可以了，就可以出三界，然后入涅槃。所以第八识不是二乘人所证悟的境界，所以佛不对二乘人来说，就是基于这两个理由。</p><p>所以我们先说第一个，因为阿赖耶识太深细了，是甚深微细的境界，不是二乘人这样浅薄的智慧所能了知，所以佛不对二乘人说，这是第一个理由。二乘人他只有我空的智慧，没有法空的智慧，因此他所知障没有破，法执没有断，当然不可能去思量证悟这么深细的第八识。</p><p>所以别说是二乘人不了解，就算是大乘登地的菩萨也未必完全地了解第八阿赖耶识。就是我们说他登初地之后，必须要破四十一品的无明，所以每一地他破一品无明，这样一品一品破，但是他也没有办法究竟地了知第八阿赖耶识。一定要完全究竟的圆满成佛之后，转八识成四智之后，他才能够完全地了知第八识——这么深细的第八识全部的内容。所以不是二乘人不知道，登地以上的菩萨也未必完全地了知。</p><p>所以佛说法，祂不是说想到什么就说什么，而是要观察众生的机宜所能够接受的程度，才决定要说什么样的法。假如说了众生不能够接受的法，不但不能够利益众生，反而还会增加众生的执著。</p><p>那譬如佛在《解深密经》当中就说道：“阿陀那识甚深细，一切种子如瀑流，我于凡愚不开演，恐彼分别执为我。”</p><p>这个就是一个很好的例子，佛为什么不轻易地说？是因为阿陀那识甚深细。“阿陀那识”就是我们昨天说的那个相续执持位，从凡夫一直到成佛，它都能够执持一切法的种子，怎样熏到第八识，它就执持这一切的种子还有根身不会坏，所以我们活着的时候我们的根身不会腐烂，四大不会分散，就是因为有阿陀那识的执持，所以阿陀那识叫做“执持识”。其实那个“陀那”就是“执持”的意思，阿陀那，“陀那”那两个字就是执持，所以阿陀那识也叫做执持识。它执持诸法熏成的种子，还有它是一切色根的依处，所以它可以执持这个根身不坏的原因在这里。</p><p>所以我们昨天也说了，它是属于相续执持位嘛，所以我们看到相续执持位，就知道它指的是阿陀那识，就是从凡夫一直到成佛，它都能够执持种子还有根身不坏。所以即使是成佛之后，仍然可以相续地执持它的功能，因此才能够显现什么？净土的依正庄严，就是因为有阿陀那识。不然我们种子都清净了，那佛身还有祂的净土是怎么变现的呢？就是这个阿陀那识，它永远有这个执持功能。</p><p>“一切种子如瀑流”，因为阿陀那识甚深细，甚深细就是说因为阿陀那识它的本体非常的深隐精微，就是它很深细，然后又很隐藏的，不太容易去了知它，所以我们用“深隐精微”来形容这个阿陀那识它深细的程度。所以阿陀那识又叫做“微细识”，就是指它的本体是非常微细的，那它可以含藏一切的种子不坏失，才有下面的一句说“一切种子如瀑流”。</p><p>“一切种子”，就是指我们前七转识所造的一切业，受熏到第八识成为种子；“如瀑流”是比喻好像瀑流水一样的流转不停。瀑流，就是我们看那个瀑布嘛，有没有？哗啦、哗啦、哗啦……这样一直流，它是这样一直流，然后不会停息，这样子来比喻这个一切的种子。</p><p>那就是说，第八识它从无始以来是微细的生灭，我们不容易观察到，它是非常微细地在生灭生灭，然后念念都在受熏成种子。这个我们昨天都解释过了，你一念生起来怎么样？又回熏到第八识成为未来的种子，所以每一个种子都是新熏或者本有的。所以第八识它念念都在受熏成为种子，怎么熏它就怎么含藏这个种子，然后慢慢形成我们所谓习气的种子。</p><p>这个习气的种子在因缘成熟的时候，它就可以发起现行，种子生现行，就是要有外缘的牵动嘛。以这个引业来讲，就是说我们每一世会投生在哪一道，就是看你临终引出来的那个习气业力的种子是哪一个，来决定你会投生在哪一道。所以，由这些习气的种子发起现行，而引生到六道来轮回，然后每一道都有它的根身、还有器世界，就这样的流转不停，所以我们说“如瀑流”。好像那个瀑流水一样，瀑布一样这样轮转不息，就是我们一直在六道当中轮回不断的原因就是种子生现行，一切的种子又含藏在第八识。那这个种子哪里来？熏来的、受熏来的，所以不断地熏成种子，种子又不断地生起现行，所以在六道不断不断地轮转。就是你投生到哪一道，因为不同的业，投生在不同的道，然后变现出那一道的根身、还有外在的器世间，就是依报跟正报，都是由这个种子来的。</p><p>“我于凡愚不开演”，这个“凡”就是指凡夫；“愚”，就是指二乘人来说。因为我们刚才说，二乘人他不能够通达法无我嘛，因为他只证到我空，没有证到法空，只能断我执，不能断法执。所以相对能够断法执、见法空的大乘菩萨来说，他还是愚痴的，所以这边的“愚”是指二乘人。</p><p>所以佛说：我对于凡夫二乘人不常开演第八识的原因，就是因为下面一句：“恐彼分别执为我”。恐怕这个二乘人听了这么深细的第八识的道理之后，又误会了、又误起分别，把第八识当作是真实的“我”，又执以为“我”，把第八识又把它执为“我”。</p><p>因为我们刚才说阿陀那识它非常的深细，从凡夫一直到成佛，它都能够有那个执持的力量，所以佛……你要说这个第八识是真实存在的呢？还是说它不是真实的？如果佛说第八识是真实的，那二乘人因为愚痴的关系，那个智慧没有到达这么高，就是他只能体会我空的道理，法空的道理并不明白。所以，这个时候佛如果跟二乘人说：如果说第八识是真实的，那他们就会误以为含藏在第八识里面一切的善恶的种子都是真实的，对不对？第八识既然是真实的，所以含藏在第八识的一切善恶种子都是真实的，那会有什么样的结果？一切善恶的种子都是真实存在的噢！所以我现在怎么样断、怎么修，它都是真实存在的哦！所以我修了半天，我的种子会不会清净？不会清净啊！对不对？因为它是真实存在的啊！</p><p>所以这样的话，我怎么样修行，这个善恶业的种子、这些染污的种子都没有办法去除，那众生就会继续地迷惑颠倒。就是说“我怎么样修都不可能解脱，也不可能尽除这些染污的种子”，那众生就会继续地迷惑颠倒，然后把虚妄当作真实。本来不是真实的，现在把它当作真实的，因为如果佛说第八识是真实的，就把这个虚妄的第八识，把它当作是真实的，然后永远轮回在六道当中，对不对？因为你一切的种子都不能清净嘛，那就只有永远轮回啰！恶的种子就堕三恶道，一直在三恶道；那善业的种子就一直在三善道，你是不可能解脱的。就会变成有这样的过失，所以很难说它是真实的。</p><p>那如果佛说第八识不是真实的，第八识不是真实的。我们昨天说过，第八识哪里来的？真心来的，唯心所现嘛，那你现在说第八识不是真实的，可是第八识的本体又是真如，对不对？它要回归真心的，可是你现在说它不是真实的，那第八识是虚妄的！那我如果想要明心见性，想要见我的真心，我想要证到真如，我是不是另外还要再去找一个真如？因为你跟我说第八识不是嘛！那我就另外再去找啰！这样又有过失。</p><p>所以说真实也有过失，说不真实也有过失，很难说，因为它太深细，不是二乘人可以去证悟的境界。</p><p>所以佛说第八识是真实的，就会有继续轮转的这样一个过失。如果说第八识不是真实的，可是第八识的本体又是真如，离开了本体，又到哪里去找一个真如，对不对？所以这样的话，众生就会“弃真为妄”，就是第八识是假的，那我就把第八识丢了，认为第八识是虚妄的，然后另外再去找一个真实，另外再去找一个真心，找一个真如，那就再往外面去找了。我们说要往里面找，结果现在变成要往外找，因为你说里面那个第八识不是。</p><p>所以变成说：佛不论说是真实、还是非真实，都很难说得清楚。因此，除非时间恰当、根机恰当、机缘成熟，佛才会说。这就是为什么不常开演第八识的原因，就是怕他们以第六意识的分别去意会，又起了“我”的执著：把刚才讲的阿陀那识，又把它当作是真实的“我”。本来是无我的，现在说有一个阿陀那识，它是相续执持的，那就把这个相续执持的这个东西，又把它当作是…把它抓得紧紧说：“这个就是‘我’，不然是谁去轮回呀？那成佛的是谁呀？不是都是这个吗？”就会误解了。所以佛就很难说清楚，所以就干脆不说。</p><p>其实，佛祂也不是完全没有提到“阿赖耶”的名称，我们看《增一阿含》当中它就有。佛就说过：“要爱阿赖耶、乐阿赖耶（就是好乐那个乐）、欣阿赖耶、喜阿赖耶。”</p><p>又在经中说到“根本识”，其实有出现“根本识”这样的名称，还有“心”，其实佛说的都是阿赖耶识，都在说第八识，只是二乘人不知道，不知道佛在《增一阿含》里面讲“根本识”，指的就是第八识，佛在讲“心”的时候，其实就是在讲第八识。所以二乘人不知道，以为佛没有说。所以这是第一个理由。</p><p>第二个理由，佛为什么不对二乘人详细说第八识的原因呢，就是因为第八识不是二乘人证悟的境界。因为二乘人是以解脱为目的嘛，他也没有要发菩提心、行六度，然后发愿度众生，没有发这样的愿，那他们就希望一心赶快求解脱。那求解脱需要什么条件？就是断我执就可以了，破见思惑就可以解脱了。所以在断除执著方面，只要断除第六意识上面粗显的我执就可以了，可以不管那个俱生我执，因为我们前面说到俱生我执要八地菩萨才能断，那你如果要求得自己的解脱的话，不需要断俱生我执，只要断第六意识的分别我执就可以了。</p><p>那在悟理方面（悟那个佛法的道理，悟理这个方面），只要体会得到那个我空的真如就可以了，就是证到“我空”就可以，可以不必理会“法空真如”是否依然存在。就是说他证到我空就可以，那个法空可以不用证到，一样可以证得涅槃。所以小乘的涅槃，你不用证到法空，只要证到我空就可以，就是所谓的破见思惑，就可以证得小乘的涅槃。就是因为这样，就是说你只要以解脱为目的的话，其实不用讲到这么深的第八阿赖耶识。所以佛最初在阿含会上就只讲到六识，有前五识、有六识。第七识、第八识都没有讲。</p><p>为什么只讲到六识？就是我们刚才讲的，那个小乘人他修习止观，教他观无常啊、生灭啊、无我啊，他只能观到六识，因为六识是可以自己觉察到的，就是我们念念观我们的妄念嘛，生灭生灭，那就是第六意识，很容易就可以观察到。可是，第七识我们讲它是内执，第八识又是含藏种子，那个非常深细的，是没有办法观察得到。也是因为佛在阿含会上只讲到第六识，所以二乘人就牢牢地执著，认为这个心识的活动只有到六识，根本不承认有第七识、有第八识的存在。</p><p>那下面一句：“由此能兴论主诤”。</p><p>因此，大乘唯识论主便兴起了种种的论诤，证明大乘经中确实到处都说到“阿赖耶”，而且还举了十大理由来证明，这个就是“由此能兴论主诤”这一句偈颂的意思。</p><p>我们看《成唯识论》就知道了，成唯识论有十家的唯识学家，不断不断地论辩，所以唯识学家举出了十大理由，证明阿赖耶识的存在，就是对这个二乘人来说的，你们有兴趣可以去看《成唯识论》，它举了十大理由，就是这边讲的“能兴”。</p><p>所以这些大乘的唯识学家、这些论主就兴起了种种的论诤。就是引经据典，哪一部经佛曾经怎么说，然后怎么样、怎么样，所以就证明大乘经中到处都有说到第八阿赖耶识，还举了十大理由来证明。</p><p>我们看下一句：</p><p>“浩浩三藏不可穷，渊深七浪境为风。”</p><p>这两句颂是说明第八识的行相，和它的意义是什么。</p><p>“浩浩三藏不可穷”，这个“浩浩”就是广大没有边际的样子，是形容阿赖耶识的行相非常的深广无涯。所谓的“行相”就是能缘的见分，我们看到行相，就知道它指的是我们能缘的心，就是见分，能缘的见分。那所缘的什么？相分嘛。那就是指这个能缘的心，这个见分是非常广大的。第八阿赖耶识广大到什么？就一切都是它变现的嘛，一切法都是它变现的，你可以想象得多么的广大，全部都是第八阿赖耶识的变现，所以我们说它能缘的心非常广大。</p><p>那它所缘的境当然也是非常的广大，是无量无边的，遍诸法界，一切的法界都是它所缘的相分境。你就知道我们第八阿赖耶识能缘的心，它有多么的广大，一切的法界都能够缘到。不是我们这个小小的地球哦，也不是我们这一个小小的银河系哦，有无量无边的银河系，有没有？一切的法界都能够遍缘，那就知道第八阿赖耶识这个能缘的见分，它有多么的广大。所以用“浩浩”来比喻，广大到没有边际的样子，就是说它能缘的心，广大到实在是没有办法形容，就没有边际的，只能说它无量无边，所以它所缘的也是无量无边的法界。首先就是形容这个第八阿赖耶识，它的范围是非常非常广大。</p><p>“三藏”，我们现在很熟了，三藏大家都会背了，阿赖耶识具有三藏，对不对？“阿赖耶”是印度话，中国翻译成“藏”嘛，就是藏识的意思，阿赖耶识就称为“藏识”。为什么称为藏识？就是能藏、所藏、执藏嘛，具有这三种意义，所以叫做藏识。</p><p>那什么是“能藏”呢？我们现在也知道了，这个是以它持一切种子——这个持种的功能来说的，我们说它是能藏。因为第八识能含藏无量劫以来的种子不会坏失，所以叫做能藏，能含藏无量劫以来的种子不会坏失。</p><p>那“所藏”的意思呢？就是说第八阿赖耶识所含藏的那些种子是哪里来的呢？它可以含藏一切的种子，但这一切的种子怎么来的？我们也知道了，就是熏来的嘛，所以是前七转识熏习来的。那前七转识造了善业、恶业、无记业，这些现行怎么样？熏回到第八识成为种子，含藏在第八识，所以第八识是一切诸法种子所收藏的地方，叫做所藏。一切诸法种子所收藏的地方，所以叫“所藏”，这个是以它受熏来说。第一个能藏，是持种来说；第二个所藏，是受熏来说（受熏习来说）。所以它有受熏、有持种的功能，这个我们都已经知道了。</p><p>那什么是“执藏”呢？就是我爱执藏，就是我见的来源嘛：第七识执第八识的见分为我，而生起了我见，执著爱藏（zàng），恒不舍离，所以叫执藏，它是这么来的。执著爱藏，永远不会离开，恒不舍离、不舍得离开，就是永远牢牢地抓住那个我爱执藏。有一个“我”，然后又爱得不得了，所以叫做执藏，就是执著爱藏、恒不舍离的意思。</p><p>那这个“不可穷”，就是不可穷尽的意思。什么不可穷尽？就是刚刚“浩浩的三藏”不可穷尽，就是因为第八识有能藏、所藏和执藏的功能，才使得无边的有情，无始以来生死相续，不可穷尽，所以我们用“不可穷”来形容。</p><p>先执著有一个“我”嘛，这个是我爱执藏，是执藏，然后有“我”就生烦恼，有烦恼就造业，造业就熏回到第八识，这个是所藏；然后第八识执持一切的种子，怎么熏习就怎么接受这个种子，这个是能藏。才使得这个历劫的因果不坏不失，生死得以相续，所以说“不可穷”。就是说我们这个生死一直相续，看起来好像没有穷尽的时候的原因是什么？就是第八阿赖耶识能藏、所藏、执藏的功能。首先是有一个“我”嘛，然后起惑造业，然后这个业熏到第八识，然后第八识又执持这一切业力的种子，然后种子生现行再熏回去，种子再生现行，这样子流转，不可穷尽，就是因为浩浩三藏不可穷。“不可穷尽”就是讲这个浩浩三藏，它就是这样轮转不停，就是因为第八识有能藏、所藏、执藏的功能，让我们的生死相续不断。</p><p>第八识的行相虽然是深广无边，浩如大海（我们刚才说浩浩三藏，就是它能缘的见分是非常广大，广大到没有边际，就好像大海水一样，汪洋的大海，你从这边看，好像大海没有边际一样）；但是，重点来了！第八识好比大海水，但是这个大海水是湛然常寂的哦，是平静无波的大海水，是没有波浪的哦，第八识是没有波浪的。所以第八识它只是含藏一切的种子不会坏失，它只是受前七转识的熏习，然后它本身被第七识执以为“我”，但是第八识的本身它是不会造业的，就好比平静无波的大海水虽然深广浩瀚，但是湛然常寂。</p><p>那么，是什么力量使这个大海水起了波涛呢？这个波浪是怎么起来的？八识是平静无波的大海水，什么让它起了波浪呢？就是前七转识嘛！对不对？是前七转识现行的力量起了波浪。那前七转识为什么会掀起现行的波浪呢？我们看大海水为什么会起波浪？是因为什么？大家都看过大海嘛！我们很少看到平静无波，它为什么会起浪？为什么会起浪？是什么？呼呼呼吹的是什么？风啊！有风才会起浪啊！“无风不起浪”不是吗？有浪一定是有风嘛。所以境界的风一吹，前七转识就起了波浪。平静无波的大海水起了波浪，是因为境界的风一吹，外在的境界风一吹：前五识一面对境界，第六识一起分别，第七识什么？一起执著，以为有我、有法，波浪就起来啦！虽然第八识是平静无波，何时起了波浪？有境界来的时候，它就起波浪。至于是小波浪、大波浪，还是惊涛骇浪，就要看它境界是大、还是小。那个会让我们人生起伏很大的，那个就是大波浪；心里小小的波动，那个就是小波浪。所以我们每天都在起波浪，对不对？每天都在起波浪，你眼睛看到什么，是不是就起了波浪？前五识嘛：眼耳鼻舌身，面对色声香味触，有没有？</p><p>你们现在什么周年庆啊、还是什么，现在要到乌节路去看……好美好美！那个有没有起波浪？所以你眼睛看到“哇！好美的！”今年是粉红系列，粉红色。所以眼睛面对种种的色尘，你的第六意识起分别，你第七识起分别：谁看到？“我”看到嘛！看到什么？一切法嘛！一切法是“真实”存在的，所以乌节路整条都是“真实”存在的啰！谁去看？——“真实”的我去看“真实”的耶诞的气息，有没有？这就是起了波浪了。</p><p>所以这个波浪有前五识、有第六识、有第七识，所以我们说“前七转识”起了现行的波浪，种子含藏在第八识，平静无波的第八识，种子不会自己冒起来，一定要境界的风一吹，然后牵动了种子，然后生起现行，生起什么现行？前七转识的现行，就是前五识、第六识、第七识——我们叫前七转识，这个前面都已经讲过什么叫转识嘛，七转识的现行就生起来了，这就懂了，是境界的风。</p><p>所以就是下面一句：“渊深七浪境为风。”</p><p>现在这一句就看得懂了。“渊深”就是比喻这个第八识，我们刚才说它的行相非常微细嘛，而且非常的浩瀚广大，对不对？好像深不可测的、不可探测的那个深渊一样的，就是比喻它非常的深广，很难去摸得清楚，好像深渊一样深不可测。深渊你这样看，看不到底嘛，不晓得它里面到底是怎么回事。这个来比喻第八识，就是行相非常的深广微细，用“渊深”来比喻，就是深渊的意思啦，这个渊非常深。</p><p>“七浪”，就是指前七转识所掀起现行的波浪，叫做七浪，就是前七转识现行的波浪。那波浪是怎么生起的呢？“境为风”——境界为风，因此吹起了波浪。所以我们说“境风吹识浪”，这一句就是这个意思：境界的风一吹，就生起了前七转识的波浪，叫做境风吹识浪。所以平静无波的大海水，为什么会掀起波浪来呢？就是因为风吹的缘故。</p><p>这大海水比喻第八识，对不对？本来平静无波的大海水；波浪，就是指前七转识现行的波浪；吹的风，就是境界的风。每一个小水滴聚积而成大海水，对不对？大海水怎么来的？每个水滴慢慢积成的嘛，每个水滴好比种子、一切法的种子，每一个种子都是好比小水滴，无量的种子积聚成大海水，就是用这个来比喻。</p><p>所以第八识好比大海水，由无量的种子所积聚，只要外境的风一吹，就会牵动第八识里面含藏的种子怎么样？生起现行，就掀起了前七转识现行的波浪来，就是所谓种子生现行。所以第八识它不会自己起波浪，因为第八识只是含藏种子，大海水，每个小水滴含藏种子。所以第八识不会自己起波浪，一定要有外缘的牵动。所以境界的风一吹，就掀起了前七转识现行的波浪。所以这个波浪，我们现在知道，它包含了面对境界的前五识，还有管分别的第六识，还有恒审思量有我、有法的第七识，所以我们才会说这个波浪是由前七转识现行所起的波浪。这样这一句就明白了。</p><p>接下来：“受熏持种根身器，去后来先作主公。”</p><p>这两句颂是说明第八识的作用。有五个，有没有看出来？第一个是“受熏”，我们讲第八识就是受熏嘛；第二个“持种”，持一切种子；第三个“根身”，我们的根身，第八识所变现的，正报；还有“器”，就是外在的器世间，这是第四个了——依报，都是八识的变现。所以八识的作用：有受熏、有持种、有根身（正报）、器界（依报），都是第八识的作用。</p><p>还有第五个：“去后来先作主公”。我们昨天也说了，“去后”，最后去，有没有？我们这口气断了，最后离开的是第八识。哪一个最先到？神识先到。我们入胎之后，那个神识先到，所以说“去后”，最后去，来呢？最先来，最先来投胎嘛。作主公的是什么？就是第八识的功能。所以，这两句颂我们就知道第八识的功能有五个。</p><p>第一个“受熏”，现在我们都很清楚了，就是第八识能够受前七转识的熏习。那我们要问说：难道前五识就不能够受熏吗？第六识不能受熏？第七识不能受熏吗？只有第八识才能够接受这个熏习吗？所以我们就要讨论：如果说它本身是善性或者恶性的，它就不能受熏，对不对？如果它本身是善性的，我们不是说有善性、恶性、无记性吗？它如果本身是善性的，它不能够受恶性的熏习，对不对？恶性来，它不能熏，因为它本身是善的；同样的，它本身是恶性的，它不能够接受善性的熏习，对不对？</p><p>所以它本身一定要无记性的才可以，才能够受熏。它本身是无记性的，那善法来熏的时候，它就接受善法的熏习，熏成善法的种子嘛，对不对？那恶法来熏的时候呢，就接受恶法的熏习，熏成恶法的种子。那第八识它是无记性的，所以它可以接受善恶的熏习。</p><p>那我们知道前五识、第六识是通三性的，所以不能受熏，有没有？我们念过前五识是三性的：善、恶、无记性都有，第六识善、恶、无记性都有，所以它不符合这个条件。那它如果善的时候呢？恶的来熏怎么办？就没有办法。所以前五识、第六识因为它是通三性的，因此它不能够成为受熏的这个条件。它本身一定要无记性的才可以，不可以一下善、一下恶、一下无记，那很混乱嘛！对不对？它如果善的时候，恶来的时候它也没有办法；它恶的时候，善来的时候，它也没有办法熏，所以它必须本身一定要无记性。而且是一类相续，中间不可以有间断说“我今天放假了”，不可以。一类相续都是无记性的，所以随时可以受熏、接受熏习，这样才可以。</p><p>那你说第七识也是无记性的，对不对？第七识是有覆无记性，对不对？它也是无记的，那第七识为什么不可以受熏呢？那就是因为它本身是属于有覆的无记嘛，就是有四惑、有八大的盖覆，所以它也不能受熏。所以一定要无覆无记性的才能够接受熏习。所以只有第八识能够担任这样的角色（前五识、第六识、第七识都不可以）。因此只有无覆无记性的第八识能受到善恶法的熏习。</p><p>那这些受熏的种子都到哪里去了呢？就都含藏在第八识成为未来生起现行的种子嘛，对不对？这就是它第二个功能。所以，第八识第二个作用就是“持种”。第八识能执持一切的种子，不论这个种子是有漏的、无漏的，是世间的、还是出世间的，还是本有的、还是新熏的，都能够让它不坏失，执持一切的种子不坏失，全部都含藏在第八识，不坏不失——这就是第八识第二个作用，能够持一切种子的作用。</p><p>这样就要小心了，对不对？我们每天身口意在做什么？就是要小心了，对不对？不是说我造了业，然后就结束了，我这句话说完就结束了，我这件事做完就结束了，我动一个坏念头就结束了，没有哦！全部都熏回去！我们现在很清楚了，任何一个都熏回去成为未来的种子。外缘的境界风一吹，那个种子又生现行了，生完现行造了业再熏回去，成为习气的种子、业力的种子、烦恼的种子，没完没了。我们刚才说好像瀑流水嘛，就是这样子来的，为什么这个轮回不断呢？就是种子生现行嘛，没完没了，就是第八识的功能有受熏的功能、有持种的功能。所以不要以为说“我造了业就结束了，事情做完就算了”，没结束也没算，因为这些业全部都熏回到第八识，成为未来的种子，等到因缘成熟的时候就受报，就生起现行，就受报了嘛。</p><p>所以有一句话就说“纵经千百劫，所作业不亡，因缘会遇时，果报还自受。”你含藏在第八识的这些还没有报的这些种子，你就是“纵经千百劫”，时间这么长，怎么样？你所造的这所有的业都不会亡失，都不会消失的。“因缘会遇时”，时候到了，就报了，因缘会遇的时候；“果报还自受”，全部回到自己的身上。所以不是不报，是时候未到，造业的时候要小心谨慎。所以不管你相不相信因果，你是怎么造业的，到时候就怎么回到你的身上。</p><p>那我们每天是不是都在受报嘛？对不对？其实我们每天遇到的事情，每一件事情都是因缘果报的展现：今天比较顺了，是什么？善业成熟啦，很简单；今天不太顺，恶业成熟了；没有顺不顺，无记业成熟了。每一件事情都是果报的显现。果报哪里来？就是自己过去造的嘛，所以怨不了人，都是这样来的。</p><p>所以，一切都是业力的展现，果报的展现，包含我们这一世的根身，有没有？根身，像每个人六根明不明利啦，还是暗钝啦，身体健不健康啦，还是体弱多病啦——这些都是过去世所造的业。那这些业识的种子含藏在第八识，到了这一世就变现出了这一世的根身。所以我们这个色身的构造，每一个细胞都是业力的显现，懂吗？</p><p>那像这一世我们都得到了人的根身，那其他众生也都各有各的根身，像天道，天人有天人的根身，畜生有畜生的根身，饿鬼有饿鬼的根身，那地狱也是有地狱的根身。我们说四生嘛，不论是胎生、卵生、湿生、还是化生，都是由各自的业力变现出不同的根身来，所以这就是第八识第三个作用──“内变根身”，作为正报。我们这个正报、这个根身是八识所变现的，凭什么变现？凭过去我们造的业力所变现的。</p><p>那么外在这个器世间呢？也是同样是第八识所变现的，这个就是第八识第四个作用，就是“外变器世间”作为依报。从外在的山河大地，一直扩大到整个广大的宇宙，都是第八识所变现的。所以你会居住在什么样的环境，都是自己业识所变现的。所以你再想怎么移民到哪里去啊，也没有离开自己八识所变现的环境，懂吗？一切的依报是自己八识所变现的，你怎么移民到哪里都一样，宇宙的任何一个角落，都没有离开你自己八识所变现的器世间。</p><p>那我们就要问了：你也住在新加坡，我也住在新加坡，难道我们的业力相同吗？我们的业都相同吗？都在新加坡，我们的业力是不是都一样呢？没错嘛，对不对？整个新加坡是所有新加坡的居民共业所成就的（我们现在是在讲依报，外在这个环境），所以新加坡会建设成什么样，是不是所有新加坡居民每一个居民共业所成就的新加坡？现在不管要盖什么，这边很热闹、那边怎样啦，是整个新加坡共业所成就的。扩大到整个宇宙，从一个小地区国家，一直扩大到整个宇宙都是同样的道理。我们所认知的太阳系、星球，各个不同的世界，也都是居住在这个世界上的每一个有情共同业力所成就的。那我们共同的业力，就共同变现出相同的器世间，共同的业力变现出共同的器世间，就是外在的环境。这个依报是共同的业力所变现的，我们变现出我们所依存的这个空间来，就是所谓的依报。</p><p>又要问了：你变现的器世间，我来享用？还是我变现的器世间，你来享用？共业所成就的嘛，那是我变给你用？还是你变给我用？不可以我变给你用，自己变自己用，只是因为我们的业是共业，所以看起来好像是同一个环境，同一个居住环境；但是，你所受用的环境是你自己变现的。因为业力相同，所以看起来是相同；可是我没有办法变现给你享用，没办法，你也没有办法变现出这个外在环境给我享用，没办法。各自变现各自用，懂吗？</p><p>就好像这一室的很多灯光；但是这个光明是每一个灯光所造成的，这个就是共业所成就的，共同业力所成就的：有千盏的灯的光明，每一盏灯就比喻各别的业，可是一个房间里面有千盏灯一起照，我们看的就是共业所变现的这个外在环境──依报。但是每一个个别的灯照，懂吗？这个所有的光明是每个灯所照射出来的光明。所以自己照射自己显现，然后自己受用，就用这个来比喻。</p><p>所以，虽然是共业所成就的器世间，还是各人变现各人享用，只是大家的共业相同，因此看起来是个相同的世界而已。所以就不用担心说“万一我死了，明天太阳还会不会再升起呢？”这你不用担心！“会不会我死了，世界也毁了？”这个你也不用担心！因为只要共业还在，世界还是依然怎么样？继续地转动，因为它是共业所成就的，只要共同的业力还在，明天太阳还是会升起，地球还是照样的转动。</p><p>所以现在我们就已经知道了，我们的根身──这个正报，还有我们的器世间──这个依报，都是自己的第八识所变现出来的。那会变现出什么样的根身器界来，就要看我们第八识有哪些业识的种子，而这些业识的种子都是自己造业、自己熏习而成的，就是因为第八识有受熏、持种的功能嘛。</p><p>所以，每个人长得不一样，对不对？你会长得怎么样，然后你会有什么样的父母，你会居住在什么样的环境，要怪谁？要怪父母说把你生成这样子吗？不公平，对不对？说我不喜欢住在这里，是谁的错？所以自己长得什么样，然后你会有什么样的父母，你会居住什么样的环境，这个都怨不了人的，都是什么？你自己第八识所变现的。自己造业自己受，事实上是这样。我们明白这个道理，可以少了很多的怨天尤人：就是对现实的环境不满，或者对我这个根身不满意啊，对我的父母不满意啦，还是我的兄弟姊妹不满意啊，你会生在一个家庭，就是共业造成的嘛，共同业力所成就的这个家庭。外在环境也是共同业力所成就的，都没有离开我们自己的业力所变现的，所以都跟别人没关系，懂吗？只是我们会聚在一起，是因为我们的业力共同，相同的业力才会在一起。但是，你自己的业都是自己造的，你怨不了别人，都不是别人的错，所以都不能责怪别人。</p><p>这是共业嘛。</p><p>那你说同样的环境，为什么有的人他住得比较好？有的人住豪宅，有的人住破屋子，为什么同样是人，每个人福报不一样？就是共业当中有别业，对不对？我们讲过有共业、有别业。共同业力所成就的，那还有各个的不同的受报，就是我们说有引业跟满业嘛。你会投生到哪一道，是引业牵引你投生到那一道；可是，同样的那一道，又有不同的业报的差别，那个是满业的差别，那个就属于个别的别报。所以它有共业、有别业，这样明白了？</p><p>所以虽然同样都生在新加坡，每个人条件不一样，每个人福报不同，所居住的环境不同，对不对？那个是又有别业在里面。所以相同的引业当中，都在人道当中，但是有满业的差别，就是共业当中有别业。</p><p>这样我们就对这个正报、依报很了解了，反正都是八识所变现的。</p><p>“去后来先作主公”，这是第八识第五个作用，就是去后来先作主公。死的时候第八识最后离去，受生的时候第八识最先到来，所以说“去后来先”。</p><p>“作主公”，是说作为善恶业所招感的主公，就是第八识是真异熟果，我们昨天说它是总果报体，对不对？第八识是总果报体，所以它是作为招感异熟果报的主公。所以说，使我们不断生死相续、去后来先的主公是谁呢？就是第八识，它是真正的总果报体。死的时候最后离开身体，带着业识的种子，投生的时候（这个我们昨天都讲过了），就是“万般带不走，唯有业随身”，所以你这一口气断了之后，这个四大分散、肉体腐烂，但是有一个神识，就是第八识，还会再去投胎，所以它是最后离开身体的，最先去入胎的。带着什么？带着你无量劫以来，业力的种子再去投胎。</p><p>所以，在你投生的时候，这些业识的种子就会变现出那一道的根身、器界来。所以受生的时候，它是最先来，死的时候最后去。生的时候先来，死的时候最后去，都是由第八识来作主，所以说“去后来先作主公”。这个意思就是说，你投生的时候，你业识的种子哪一个先成熟，就变现出那一道的根身、器界来，懂吗？所以譬如说你在这边出生的，你出生的那个时候你就看到这个世界了，其实是你八识所变现的那个根身，你会长得什么样，是男生啦、是女生啦，带着种种的基因，有没有？每个基因都是业力的种子所变现的。所以一出生，这个根身还有器世界就形成了，是你自己所变现的，这样应该明白了。我们今天刚好讲到一个段落。</p><p>来回向：</p><p>（师颂，众师兄跟颂）愿以此功德，普及于一切，我等与众生，皆共成佛道。</p> </div></div>"
},{
    "title": "12.第八识(3)",
    "author": "净莲上师",
    "date": "2012年11月23日",
    "html": "<div class=\"B1_text\"><div id=\"fontsize\">\n<p style=\"text-align: center;\">最尊贵的净莲上师讲授<br/></p><p style=\"text-align: center;\">讲于新加坡Orchid Country Club</p><p style=\"text-align: center;\">二○一二年十一月二十三日</p><p>喇嘛、法师、各位师兄：</p><p>晚上好！</p><p>我们继续看“无垢清净识”的部分。</p><p>“不动地前才舍藏，金刚道后异熟空。”</p><p>这两句颂是说，第八识要到八地前，才能够舍去“藏识”之名，到金刚道后，才空去异熟识。</p><p>“不动地”是指八地菩萨。那在八地之前，因为是有功用行，观智的力量还很薄弱，所以没有办法灭除顽强的俱生我执。</p><p>这个之前我们介绍过，在八地以前，因为他那个观察的智慧还很薄弱，入定的时候可以暂时无我；但是一出定之后，那个“我”的观念又出来了，是因为俱生我执还没有去除的关系，所以他没有办法念念相续，因为观慧的力量太薄弱。一直要到第八地，他能够任运无功用。任运，就是随时不用再起任何的功用了，之前还要起功用。八地之后，因为观慧的力量非常的强，所以他不用再起任何的功用，可以任运自然的就保持那个念念无我。所以一直要修到八地，任运无功用，生起无漏的智慧，才能够伏灭俱生的我执，永远不再现起。</p><p>所以我们知道，俱生我执什么时候才断？八地菩萨才能够断，永远都不会再现起俱生我执了。所以说“不动地前才舍藏”，到了这个时候，才能够舍去“藏识”的名称。藏识就是阿赖耶识，为什么叫阿赖耶呢？就是第七识的见分执八识的见分为“我”，念念执八识的见分为“我”，这个我们就称为阿赖耶识。</p><p>那到了八地，俱生我执断，这时候的第七识念念恒审思量“无我”，懂吗？之前是念念恒审思量有我，叫做阿赖耶识。俱生我执断了之后，因为证到无我了，所以第七识恒审思量念念无我了，因此就能够舍去藏识的名称，所以说“不动地前才舍藏”，就是第八识要到八地之前，才能够舍去阿赖耶识、藏识的名称。</p><p>那这个时候的第八识叫做什么呢？叫做“异熟识”，已经没有阿赖耶识这个名称了，所以对八地以上的菩萨，都不能够说他还有阿赖耶识，没有了，已经没有藏识的名称。那这个时候第八识叫做什么呢？叫做“异熟识”。</p><p>那为什么叫做“异熟”？异熟，就是果报的意思。我们看到唯识的名相，看到异熟，就知道它指的是果报，因缘果报。那这个果报为什么叫做异熟呢？就是它从造因（就是从造业这个因），一直到感果，它是异性而熟、异时而熟、异类而熟，所以我们称为“异熟”。从因到感果，从你造业到感果，它这个时间，不是说我马上造业马上感果，有没有？它的因到果，它的时间是不一样的。而且它的性质、还有类别也不一样。譬如说我这一世好杀生，我的果报是什么？多病嘛，所以不是说我杀你一刀，然后你就砍回来一刀，不是这样。所以从造因跟感果，它的性质跟种类往往也会不同，所以我们才称为“异熟”，就是“果报”的意思。</p><p>那到成佛之前，一切众生都要受到业报的影响，只是这个业有善业、恶业、染业、净业的差别。像我们知道为什么会堕到三恶道？就是因为恶业比较多嘛，那为什么会生在三善道？就是善业比较多。那这个十法界来说：六道相对四圣法界，六道是染业比较多，四圣法界是净业比较多，所以都不能够脱离果报，就是现在讲的异熟，所以这个时候的第八识就称为“异熟识”。不管是善业、恶业，染业还是净业，都是有果报。只要在十法界当中，都没有离开善恶、染净业的果报，因此，这个时候第八识就称为“异熟识”。</p><p>那这个异熟识要到什么时候才能够空呢？就是说所有的果报，含藏在我们第八识的这些果报的种子，什么时候才能够完全的清净呢？那我们要先知道，我们含藏在第八识的种子里面有哪一些内容，对不对？是什么让我们起惑造业的？就是我执、法执嘛。那我执、法执从哪里来的？我执从烦恼障来的，法执从所知障来的。所以你想要空去这个异熟识里面所有的种子的话，除非你破除什么？烦恼的种子，烦恼障的种子跟所知障的种子，除非你能够完全断除这个二障的种子，你的异熟才会空嘛，对不对？因为只要有烦恼障、有所知障，你就会生起我执跟法执，然后就会继续造业，继续造业，异熟空不空？异熟就没有办法空，你的果报也没有办法空，因为你造业就一定要受报，所以这个异熟识就没有办法空。除非你能够断除含藏第八识里面的烦恼障跟所知障的种子，才可以空去这个异熟识。</p><p>所以说，只要烦恼障、所知障的种子还在，我们就会生起我执和法执而继续造业，那有业就不可能空去异熟识。所以，除非能够断除二障的种子，没有种子就不会产生两种执著——我执跟法执，不生起两种执著就不会造业，不会造业异熟识就空了。</p><p>但是重点是，要怎么样去断除二障的种子呢？我们怎么样去尽除第八识里面这个烦恼障跟所知障的种子呢？只有一个方法，就是入金刚喻定。只要能够入金刚喻定，就能够断除烦恼障跟所知障的种子，其他没有办法了。</p><p>那什么叫做“金刚喻定”呢？金刚喻定就是一种定境，一种定的名称，它也是一种观慧的名称。就是这个时候观察的智慧非常的明利，非常的坚固，好像金刚一样。像我们现在想要断一个小小的烦恼都没有办法，是因为我们的智慧、观察的智慧，观慧的力量怎么样？太薄弱，一个小小的烦恼都拿它没有办法，何况现在要断除的是它的种子，烦恼障跟所知障的种子，所以它这时候的观慧一定要非常非常的明利，非常非常的坚固，而且强，才能够顿断二障的种子。所以能够入这个金刚喻定，我们就把这个定的名称用“金刚”来形容，就是因为这个时候的观慧非常明利。</p><p>所以菩萨修行到达快要成佛的时候，要先入金刚喻定，这时候的观智非常的明利坚强，能够断烦恼障和所知障的种子。由于这时候的观慧无比的坚固，无上的殊胜，就好像金刚一样，所以就称为“金刚喻定”。</p><p>所以我们就知道，金刚喻定它是一种定境的名称，也是一种观慧的名称。就是你要成佛之前，一定要先入金刚喻定，要不然你二障种子没有办法断除，所以要先入这样的一个定境当中，然后断除二障的种子。</p><p>那你入这个金刚喻定，顿断这个种子，就是第一刹那（成佛有两个刹那）：第一刹那就是入这个金刚喻定，然后断除这个二障的种子；第二刹那就成佛了。所以从金刚喻定到成佛，它中间是没有间断的，就是两个刹那：第一个刹那入金刚喻定，顿断二障种子，第二刹那就成佛，这中间没有间断，所以它另外一个名称叫做“无间道”。它也可以称为“金刚道”，所以它有三个名称：金刚喻定、金刚道、无间道。</p><p>为什么叫“无间道”呢？就是因为在断除二障种子的第二刹那没有间断，这中间不会说“我停一下，然后我才成佛”，不是。它中间没有间断就可以成佛了，所以称为无间道。无间，就是没有间断的意思，就第二刹那就可以成佛。</p><p>所以，在成佛的前后有两个刹那：前一个刹那入金刚喻定，叫做无间道，也叫做金刚道。在这个无间道当中，用这个强而有力的观慧，永远断除二障的种子，然后第二刹那成佛，这个时候的种子才完全清净。没有因，就不会感果，所以说“金刚道后异熟空”，这句偈颂就是这个意思。“金刚道”就是我们刚才讲的，入了金刚喻定，这个之后顿断二障的种子，你的异熟才空。因为没有种子就不会造业，没有造业就不用受报，所以这时候异熟才会空。除非你把种子都完全尽除了，你才可能不再有果报现前，没有因就没有果嘛，所以要到金刚道后异熟识才空。</p><p>所以成佛之后，没有阿赖耶识的名称了，也没有异熟识的名称了，对不对？异熟识也空了嘛，这个时候的第八识我们就称为“无垢识”。之前我们介绍过，完全没有垢染的、清净的清净无垢识，所以第八识就称为“无垢识”了。</p><p>所以成佛的时候，大圆镜智和无垢识同时发起，就是：</p><p>“大圆无垢同时发，普照十方尘刹中。”</p><p>就是成佛的时候，大圆镜智和无垢识同时发起，普照十方微尘数的刹土之中，所以，这两句颂是说明第八识的转识成智和大圆智所起的作用。</p><p>那第八识到什么时候转识成智呢？就是要到异熟空的时候，也就是到成佛的时候，才能够真正的转识成智，那这时候所转成的智慧就称为“大圆镜智”。所以说“大圆无垢同时发”，就是大圆镜智和这个无垢识同时发起。</p><p>“大圆”，指的就是大圆镜智；“无垢”，就是指无垢识。无垢识，梵文称为“庵摩罗识”，那我们中国就翻译成“白净识”，又白又净、白净识或者无垢识。因为到了金刚道后，已经空去所有一切杂染的种子，这时候的第八识转成清净无漏，所以称为“无垢识”。就是没有丝毫的垢染，是纯粹清净的，所以我们给它一个名称，叫做“无垢识”。那这个时候它所执持的是一切纯无漏的种子，那这些无漏的种子就能够变现净土的依正庄严，也就是自受用身——就是正报，还有自受用土——是依报，这个是以自己来说，就是法身的成就。所以第八识一转成无垢识，就能够发起大圆镜智，所以说，大圆镜智和无垢识同时发起。</p><p>那为什么称为“大圆镜智”呢？因为这个时候智慧的作用好像镜子一样，镜子它能够明白清楚地显现种种的影像，这是镜子的功能，能够清楚明白显现各种的影像。现在讲的大圆镜智也是同样的道理，它能够显现一切的身心世界，所以我们只能用镜子来比喻。这个镜子又圆又大，所以叫做大圆镜。圆，就是比喻它无所不照。就好像说，我们如果挂一颗水晶球还是圆球，悬在空中，是不是四面八方，十方都能够照到？就是用这个比喻，悬挂一个圆球在空中，就能够照十方，就是说十方无所不照，这就是“圆”的意思，就是圆照的意思，就没有一方会遗漏的。所以，所照的没有遗漏，我们就用“大”来比喻。所以为什么叫“大圆智”？这个“圆”，就无所不照；“大”就是比喻所照的没有遗漏，十方都能够遍照。</p><p>所以大圆镜智所起的作用，就是能够圆照整个法界，没有丝毫的障碍，而且它是相续不断，是从来没有间断的时候。这就是你成佛之后，大圆镜智是它就自己能生起，很自然地就任运能生起，而且祂尽未来际，度化有情是没有间断的时候，就是我们之前讲的一个什么？相续执持位，那个阿陀那识。在你成佛之后，它也能够继续地执持你的佛身还有净土，这个正报跟依报的庄严，能够继续尽未来际，来利乐一切的有情。</p><p>那它可以遍照十法界，这个非常重要，你的智慧必须要能够普遍的照耀整个法界，这个时候你才知道哪个法界的哪个角落里面的众生，然后他需要你化现报身、还是化身、还是小化身去度化他们。那你如果不能够圆照的话，你也不知道哪边因缘成熟了。虽然不是佛自己决定的，要看哪一个地方、哪一个众生的因缘先成熟，你会很自然就到那边去化现，是没有错。但是大圆镜智它能够圆照整个法界，这就是用又圆又大来比喻这个大圆镜智，它是这样子来的。</p><p>所以，大圆镜智就好像一千个太阳同时照，这么强的光明晃耀，我们来比喻大圆镜智那个智慧照耀的功能，好像同时有一千个太阳在这个虚空当中，同时放射出那个光芒来普照十方微尘刹土之中。所以“十方尘刹”，就是十方世界的意思。这个“尘刹”是世界的另外一个名称，所以我们看到“尘刹”就知道它指的是世界。所以我们也听到另外一个名称，叫做“十方刹土”，就是十方世界的意思，也可以叫做十方尘刹。</p><p>那为什么世界称为“尘刹”呢？就是因为十方刹土它是无量无边的，无量无边怎么形容呢？就好像微尘，微尘很多嘛，微尘几乎是没有办法去数的，无量无数的微尘这么多，所以我们就用这个“微尘”，就像微尘那样多的不可计算，我们就叫做“尘刹”，来形容这个世界，十方世界是无量无边，好像微尘多到没有办法计算，所以是十方尘刹，就是十方世界，或十方刹土的意思。</p><p>那这个大圆镜智不但能够遍照十方无边的世界，同时十方世界中，有情心性的差别也在大圆镜智当中显现出来。所以它不但能够遍照十方世界，而且十方世界有情的心性当中，什么样的有情，然后他是怎么样的心性的种种差别，大圆镜智都可以照到。所以，它不只是照耀到世界，还有世界当中的一切有情心性的差别，都能够在大圆镜智当中显现。这个是要干什么呢？你才知道要化现什么身到那边去度化他们，如果没有显现，你不能够……就是怎么样来应现？你是报身呢？还是化身？所以大圆镜智会先照耀那个世界，还有那个世界的有情。接着，它是完全的自动运作，不用动脑筋，你就可以很……它是怎么样的映现？好像镜子一样嘛，“物来则应，去则不留”，那镜子本身有没有动念说：我这个要照、不要照，没有，对不对？大圆镜智也是同样的。所以佛度众生，祂其实没有用脑筋的，祂就是怎么样来现，什么物来现，然后祂就怎样应，就是感应道交，就是这样感应道交的。</p><p>所以大圆镜智就是它的功能，就是遍照十方无边的世界，而且同时十方世界当中的有情心性的种种差别，也都能够在大圆镜智当中显现出来。</p><p>那这样呢，佛就能够随众生祂所应示现的，应该怎么示现的，祂就应化种种不同的身，还有祂的土，就是正报跟依报嘛，所以这个都是大圆镜智的功能，能够做得到的，所以说“大圆无垢同时发”。</p><p>这个时候是法身显现，能变现的是自受用身和自受用土，自身的正报跟依报的庄严，是大圆无垢同时发的，这个时候是法身显现，就是自己的自身的成就，已经成就佛身了。</p><p>那下面一句：“普照十方尘刹中”的时候，就是怎么样去利益一切的有情。所以这个时候，这一句偈颂就是说经常的现报身或者是化身，尽未来际广度一切的有情。所以这两句，一个是法身，自己先成就法身显现，然后再显现报身跟化身。</p><p>所以我们就知道大圆镜智它的功能，它是能够尽未来际，相续不断，所以佛度众生永远没有疲累的时候，就是因为第八识有这一股执持的力量，叫做阿陀那识嘛。所以我们也不用担心说：佛度众生有没有一天觉得很疲累？永远没有疲累的时候！因为阿陀那识相续执持祂的正报跟依报，就是佛身跟佛土，尽未来际是永远没有间断，永远没有疲累的时候。虽然我们说要请佛住世啊，常转法轮啊，可是其实它是不用担心，因为祂就是已经成佛之后，它自然就会这样子来运作，这都是大圆镜智所发挥的功能。</p><p>讲到这里，我们就可以作一个结论了：我们现在知道，从凡夫到佛果，八识有三个不同的名称，对不对？第一个叫做阿赖耶识嘛、藏识，它是我爱执藏位；第二个名称叫做异熟识，它叫做善恶业果位；第三个名称——阿陀那识，相续执持位。大家都已经很熟了，我们已经连续熏了三个晚上了，都很熟了。</p><p>所以从凡夫到七地，有几个名称啊？凡夫到七地有没有阿赖耶识？有！第七识见分执八识见分为我，念念有我，所以有阿赖耶识。有没有异熟识？我们要不要受报？每天在造业，每天在受报，所以异熟识也没有空，所以我们凡夫也有异熟识。有没有阿陀那识？有啊！要不然我们坐在这边，搞不好等一下四大就分散，晚上睡觉，肉体腐烂掉了，因为阿陀那识离开了，不会！就是因为有阿陀那识的执持，所以能够执持一切的种子，还有这个根身不会坏失。所以凡夫到七地，第八识有三个名称：有阿赖耶识、异熟识、还有阿陀那识。</p><p>那八地以上呢？“不动地前才舍藏”，有没有？已经舍去了藏识的名称，只剩下异熟识跟阿陀那识，对不对？所以八地以上的菩萨，你不可以说他有阿赖耶识啰，因为他俱生我执已经断了，他念念是无我的，所以那个“我”永远不会现前，俱生我执永远已经断除了。</p><p>那到了佛果，就是“金刚道后异熟空”，金刚道，我们刚才讲就是入金刚喻定之后嘛，异熟就空。那空了异熟识，只有阿陀那识了，对不对？那这个时候八识就成了无垢清净识，叫无垢识，对不对？所以就是“大圆无垢同时发，普照十方尘刹中”。从这个时候开始，就尽未来际，永远没有休息的时候，永远做的是利乐有情的事情，利生的工作。</p><p>那我们《八识规矩颂》的课程，到这里就全部讲解完毕。最后，愿一切众生都能早日转八识成四智，究竟圆满成佛。</p><p>好，来我们回向：</p><p>（师颂，众师兄跟颂）愿以此功德，普及于一切，我等与众生，皆共成佛道。</p> </div></div>"
}]