[
    {
        "title": "前言",
        "author": "鸾",
        "date": "2015-07-20",
        "html": "<div class=\"B1_text\"><h2>前言</h2><p>　　<a href=\"https://www.guang5.com/fojing/lengyanjing/\" class=\"keylink\" target=\"_blank\">楞严经</a>是最绚丽的<a href=\"https://www.guang5.com/rmgjc/fofa.html\" class=\"keylink\" target=\"_blank\">佛法</a>瑰宝。洋洋八万言，道尽了宇宙人生的<a href=\"https://www.guang5.com/rmgjc/zhendi.html\" class=\"keylink\" target=\"_blank\">真谛</a>。所以古人有“自从一读楞严后，不看人间糟粕书”的感叹。</p><p>　　末学历时两年多，学习楞严经，依据<a href=\"https://www.guang5.com/fjrw/hcrw/xuanhuashangren/\" class=\"keylink\" target=\"_blank\">宣化上人</a>、圆瑛法师的注解，参阅了<a href=\"https://www.guang5.com/fjrw/jsrw/nanhuaijin/\" class=\"keylink\" target=\"_blank\">南怀瑾</a><a href=\"https://www.guang5.com/fjrw/jsrw/\" class=\"keylink\" target=\"_blank\">居士</a>等大德的著述。在学习的过程中，我发现，<a href=\"https://www.guang5.com/rmgjc/fotuo.html\" class=\"keylink\" target=\"_blank\">佛陀</a>把楞严经中的道理，讲得是非常非常明白的，明白得几乎不能再明白了，只是因为语言文字方面的限制，才使人感觉楞严经晦涩难懂。所以，我写下了这本笔记，力图以最浅显的语言，用人人都能看懂的方式，生动活泼地把楞严经的义理展现出来。为了更有说服力，还结合了当今的科学知识加以说明。这样，一方面加深自己的理解——因为只有当你能讲出来的时候，你才是真正理解透了；另一方面，能让今后学习楞严经的人，多一个参考。</p><p>　　这个笔记只是末学尽自己所能，描述的佛法和楞严经的大概意思，所以有志于实证的同修，在指导自己的<a href=\"https://www.guang5.com/rmgjc/xiuxing.html\" class=\"keylink\" target=\"_blank\">修行</a>时，还请以楞严经原文为准。</p><p>　　最后，祝所有看到这本书的人，都能够迷销惑解，苦灭乐增，超尘拔俗，同归如来性海！</p><h2>引子</h2><h3>　　如来示现</h3><p>　　二千五百年前，在印度恒河流域，有个迦毗罗卫国。国主净饭王，在王后摩耶夫人四十岁那年，喜得太子，取名为“乔达摩？悉达多”。太子天资聪颖，十二岁的时候，就通达了当时的一切学问。但他发现，这些学问并没有解决生老病死这些最根本的苦恼。一切都是无常的，终将变灭。于是，太子常常郁郁寡欢，一个人坐在那里静静地思考。</p><p>　　净饭王为了让太子高兴起来，早早地给他娶妻生子。然而，荣华富贵，娇妻幼子并没有拴住太子的心。终于，在二十九岁那年的一个深夜，太子偷偷地潜出王宫，开始四处寻师访道。遍访了当时流行的种种外道，又经历了6年的苦行，一转眼，二十年过去了，太子始终没有找到解决苦恼的办法。最后，在苦行的折磨下，太子筋疲力尽。当他拖着虚弱的身体，趴在尼连禅河边饮水时，几乎连站起来的力气都没有了。这时，在河边放羊的牧女给太子捧来了羊奶。</p><p>　　太子喝完羊奶，恢复了精神后，坐到在菩提树下，立下誓言：“我若不能了脱<a href=\"https://www.guang5.com/rmgjc/shengsi.html\" class=\"keylink\" target=\"_blank\">生死</a>，到达正觉的<a href=\"https://www.guang5.com/rmgjc/bian.html\" class=\"keylink\" target=\"_blank\">彼岸</a>，宁碎此身，终不起于座！”经过七日七夜的参悟，终于在第七天的夜晚，太子夜睹明星，豁然开朗，一时证得无上正等正觉。</p><p>　　这位太子，就是我们伟大的导师——<a href=\"https://www.guang5.com/fjrw/zhufopusa/zhufo/67019.html\" class=\"keylink\" target=\"_blank\">释迦牟尼佛</a>。</p><p>　　在接下来的日子里，佛陀周游列国，<a href=\"https://www.guang5.com/rmgjc/jiaohua.html\" class=\"keylink\" target=\"_blank\">教化</a>众生。我们所要说的故事，就发生在这期间。</p><p style=\"text-align: center;\"><span style=\"color:#b22222;\"><strong>上部 寻找真我</strong></span></p><p style=\"text-align: center;\"><img alt=\"&#x5E26;&#x4F60;&#x8BFB;&#x61C2;&#x695E;&#x4E25;&#x7ECF;&#xFF1A;&#x4E0A;&#x90E8; &#x5BFB;&#x627E;&#x771F;&#x6211;\" src=\"https://www.guang5.com/uploadfile/2018/0105/20180105034530597.jpg\" title=\"&#x5E26;&#x4F60;&#x8BFB;&#x61C2;&#x695E;&#x4E25;&#x7ECF;&#xFF1A;&#x4E0A;&#x90E8; &#x5BFB;&#x627E;&#x771F;&#x6211;\" /></p><h2>第一章 阿难遇难</h2><p>　　阿难在<a href=\"https://www.guang5.com/rmgjc/huayuan.html\" class=\"keylink\" target=\"_blank\">化缘</a>途中，遭到了淫女的幻术，险些毁掉宝贵的戒体。幸亏<a href=\"https://www.guang5.com/fjrw/zhufopusa/pusa/66965.html\" class=\"keylink\" target=\"_blank\">文殊菩萨</a>及时赶到，用“<a href=\"https://www.guang5.com/fozhou/lengyanzhou/\" class=\"keylink\" target=\"_blank\">楞严咒</a>”救出了阿难。阿难深感惭愧，<a href=\"https://www.guang5.com/rmgjc/chujia.html\" class=\"keylink\" target=\"_blank\">出家</a>修行了这么久，到头来连一个妓女都能轻易毁掉自己。深刻地反省之下，阿难认识到，这都是因为自己平时只重多闻，不务实修。于是，阿难请问<a href=\"https://www.guang5.com/rmgjc/shizun.html\" class=\"keylink\" target=\"_blank\">世尊</a>，十方诸佛当初到底是怎样修行，而成就无上正等正觉的。由此一问，而引出了这一部《楞严经》。</p><p>　　话说侨萨罗国的国王波斯匿王，有个大臣名叫须达多。他非常富有，而且经常周济鳏寡孤独的人，所以大家都叫他“给孤独长者”。一次，长者出访到南方的王舍城，偶然在那里听到了佛陀的讲法，顿时对释迦牟尼佛崇拜得五体投地。于是，他发心在自己的国家建立道场，迎请佛陀来北方弘法。</p><p>　　回国后，长者立即四处寻找合适的场地，找来找去，就觉得祇陀太子的花园适合。这里院落宽敞，环境清幽，又离城不远，交通便利。于是他找到太子，说要买他的花园供养佛陀。太子也很喜欢这个花园，舍不得卖给别人，就跟长者打趣道：“听说你很有钱，这样吧，你用黄金把这个园子铺满，我就把园子卖给你。”太子以为须达多长者一定舍不得，谁知长者听了，二话没说，回家就命人把他的黄金统统搬出来，铺在花园里。太子一看须达多长者来真的了，马上跟长者说：“我是跟你开玩笑的。”长者正色道：“太子是将来的国君，君无戏言，怎么能说话不算数呢！”太子这时也受到了须达多长者的感染，就对长者说：“要不这个园子就算我和你一起供养佛陀吧！”须达多长者就想：“我花了这么多的黄金，怎么能说是我跟你一起供养的呢！”于是说什么也不答应。太子望着满地金灿灿的黄金，突然感觉树上光秃秃的，于是灵机一动，对长者说：“地你用黄金铺满了，树上还没铺黄金呢。所以地算你供养的，树就得算我供养的。”说罢，太子马上命人在花园门口建起一个门楼，上面提上“祇树给孤独园”。意思是祇陀太子的树，给孤独长者的园。</p><p>　　于是，释迦牟尼佛便应须达多长者的邀请，率领他的<a href=\"https://www.guang5.com/rmgjc/dizi.html\" class=\"keylink\" target=\"_blank\">弟子</a>，来到了北方的祇树给孤独园弘法。</p><p>　　这一天是波斯匿王父亲的忌日。波斯匿王迎请佛陀和诸大<a href=\"https://www.guang5.com/fjrw/zhufopusa/pusa/\" class=\"keylink\" target=\"_blank\">菩萨</a>到他的王宫来应供。城中的百姓也借此机会，一起斋僧。佛陀让文殊菩萨安排僧众，到各个斋主家里去应供。阿难由于出了远门，没能赶上文殊菩萨的分派，所以只好自己一个人托着钵，在城中乞食。</p><p>　　佛陀因为乞食的事情，曾经批评过<a href=\"https://www.guang5.com/fjgs/rwgs/244543.html\" class=\"keylink\" target=\"_blank\">须菩提</a>和大迦叶两位尊者。须菩提认为，富人这辈子享福太多，福报享尽，来世就会堕落，应该让他们种<a href=\"https://www.guang5.com/rmgjc/futian.html\" class=\"keylink\" target=\"_blank\">福田</a>，所以专门选择去富人家乞食；大迦叶认为，穷人因为过去生中不知道修福，所以今生受贫穷的果报，应该让他们种下福田，所以专门去穷人家乞食。佛陀就批评他们，心不平等。 阿难想到此事 ，在乞食的时候，不敢有分别，所以不论贫富贵贱，只挨家挨户地依次行乞。</p><p>　　阿难严持<a href=\"https://www.guang5.com/rmgjc/biqiu.html\" class=\"keylink\" target=\"_blank\">比丘</a>的律仪，端严肃穆，目不斜视，行如清风，沿街而走，不知不觉中，来到了一个妓女家的门口。这时，妓女钵吉蹄透过窗户，看到阿难的相貌生得十分俊美，不禁一见钟情，决定以身相许的念头。但是她见阿难一副清净庄严的样子，生怕阿难会拒绝她，于是便央求母亲帮忙。因为妓女的母亲摩登伽，信奉黄发外道，会用娑毗迦罗先梵天咒迷惑人。但是母亲却反过来劝她说：“阿难是跟佛出家的<a href=\"https://www.guang5.com/rmgjc/shamen.html\" class=\"keylink\" target=\"_blank\">沙门</a>，已经抛弃了爱欲，你就打消这个念头吧！”钵吉蹄却无论如何也不肯答应，还信誓旦旦地说：“我这辈子非阿难不嫁！”母亲扭不过女儿，只好用带有先梵天咒咒力的方巾，罩住食物，让钵吉蹄去送给阿难吃。可怜的阿难一接过食物，就被咒力所著，恍恍惚惚地被钵吉蹄牵进了房间。</p><p>　　佛陀这时对阿难所遭遇的一切，早已知晓，于是应供完毕后，便马上率领弟子，返回了祇树给孤独园。波斯匿王听说有事情发生，也率领着文武大臣，跟随佛陀来到了精舍。</p><p>　　释迦牟尼佛安坐在法座上，从头顶放出百宝<a href=\"https://www.guang5.com/rmgjc/wuguo.html\" class=\"keylink\" target=\"_blank\">无畏</a>光，光中化出千叶宝莲，宝莲上有化佛，口中宣说楞严神咒。佛令文殊菩萨持此神咒，马上去解救阿难。</p><p>　　文殊菩萨施展<a href=\"https://www.guang5.com/rmgjc/shentong.html\" class=\"keylink\" target=\"_blank\">神通</a>，一瞬间就出现在了阿难的面前。他催动楞严神咒，阿难立刻恢复了清净。阿难醒后，见自己竟然躺在钵吉蹄的床上，和钵吉蹄如此亲密，一时间羞怒交加，连忙一把推开妓女，连滚带爬地跑到了文殊菩萨的身后，躲了起来。</p><p>　　文殊菩萨在诸大菩萨中，被誉为智慧第一。他知道妓女钵吉蹄得度的机缘已经成熟，也知道马上将要发生的一切，于是不再施展神通，而是领着阿难缓缓地走出房间，步行回到祇树给孤独园。钵吉蹄此时已经深陷情网，不能自拔，自然舍不得离开阿难，于是紧紧地跟在阿难身后，也一同来到了祈桓精舍。</p><p>　　此时，只见慈祥的大菩萨，庄严的大阿<a href=\"https://www.guang5.com/fjrw/zhufopusa/luohan/\" class=\"keylink\" target=\"_blank\">罗汉</a>，清净的大沙门，以及王公大臣，长者居士，都云集在佛陀的周围。大家席地而坐，静静地等候着佛陀讲法。天空中，梵王帝释，天龙八部等一切天众，也一层层地肃立在祥之云中，恭候着佛陀的法音。</p><p>　　阿难和妓女在文殊菩萨的带领下，徐徐穿过四众弟子，来到了佛陀的面前。</p><p>　　佛陀拥有究畅无极的智慧和<a href=\"https://www.guang5.com/rmgjc/yuanman.html\" class=\"keylink\" target=\"_blank\">圆满</a>无碍的神通，善知一切众生的善根因缘。此时，佛以<a href=\"https://www.guang5.com/rmgjc/fayan.html\" class=\"keylink\" target=\"_blank\">法眼</a>观照，见钵吉蹄过去五百世，与阿难都是<a href=\"https://www.guang5.com/rmgjc/fuqi.html\" class=\"keylink\" target=\"_blank\">夫妻</a>，所以今生一见阿难，就想嫁给他。佛陀又见钵吉蹄宿世的善根，而今已经成熟，于是便引导钵吉蹄道：“阿难是出家的沙门，你为什么还要玷污他呢？”</p><p>　　钵吉蹄面对佛陀和国王大臣这么多尊贵的人，虽然有点羞怯，但是为了捍卫自己的爱情，依然鼓起勇气，理直气壮地回答道：“我爱阿难！”</p><p>　　“哦！”佛陀继续平静地问道：“那么，你告诉我，你到底爱阿难哪里呢？”</p><p>　　钵吉蹄这时，仔细地端详跪在地下的阿难，认真地回答说：“我爱他的眼睛，爱他的耳朵，爱他的鼻子，爱他的嘴，我爱他的整个身体。”</p><p>　　佛陀接道：“他眼睛里有眼眵，耳朵中有耳垢，鼻子里有鼻涕，口中会有浓痰，身体内有屎尿脓血，哪里值得你爱呢？”</p><p>　　佛陀的法音，如同清澈的泉水一般，字字句句都洗涤着钵吉蹄那被爱欲染污了的心灵。听到这里，钵吉蹄心头一震。奇怪！清秀俊美的阿难，突然间竟变得污秽不堪，心中的欲火顿时熄灭。</p><p>　　接着，佛陀以海潮一般洪大而澎湃的声音说道：“观身不净。观受是苦。观心无常。观法<a href=\"https://www.guang5.com/rmgjc/wuwo.html\" class=\"keylink\" target=\"_blank\">无我</a>。”</p><p>　　钵吉蹄那狭隘的心灵，犹如滔天巨浪中的一座孤岛，瞬间就被淹没在了般若法海之中，一时间，进入了无人无我的境界，宿世的善根顿时成熟，证得了初果阿罗汉。</p><p>　　钵吉蹄<a href=\"https://www.guang5.com/rmgjc/huanxi.html\" class=\"keylink\" target=\"_blank\">欢喜</a>踊跃，立刻跪倒在佛前，请求佛陀允许她出家。佛陀欣然应允，并赐她法号为“性”。于是，妓女钵吉蹄，就变成了性<a href=\"https://www.guang5.com/rmgjc/biqiuni.html\" class=\"keylink\" target=\"_blank\">比丘尼</a>。在场的大众，无不为她高兴。</p><p>　　接下来，佛陀转向了阿难。满面羞惭的阿难与佛陀慈祥的目光相遇，顿时失声痛哭，哽咽着说道：“世尊，我是佛陀的亲弟弟。我倚仗着佛陀的宠爱，自出家以来，只顾多闻，不务实修，没想到现在遇到一点困难就禁不起考验。世尊，请您慈悲，开示我十方诸佛，最初到底是怎样修行，而成就道业的呢？”\t\t</p></div>"
    },
    {
        "title": "第二章 七处征心",
        "author": "",
        "date": "",
        "html": "<div class=\"B1_text\"><h2>第二章 七处征心</h2><p>　　既然要修心，就得知道心在哪里。就像发兵讨贼，先得知道贼的所在，然后才谈得上怎么讨伐。那么心到底在哪里呢？是在内还是在外，在中间还是在两边，在眼中还是内外同在，还是说不执著的就是心？这些<a href=\"https://www.guang5.com/rmgjc/shuofa.html\" class=\"keylink\" target=\"_blank\">说法</a>，如来都一一加以驳斥。最后，佛告诉阿难，我们平时用来分别感知的那个，并不是我们的真心，那只是虚妄的尘相迷惑了我们的真心。离开这些尘相，还有分别能力的，这才是我们的“真心”。</p><p>　　佛说：“阿难。我问你，当初是什么使你舍弃了<a href=\"https://www.guang5.com/rmgjc/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>的恩爱，而随我出家的呢？”</p><p>　　阿难回答说：“我见如来相貌美好，身体如同琉璃一样明澈，心生欢喜。我就想，这种相貌，应该不是爱欲所生。为什么呢？因为欲气粗重污浊，腥臊臭秽，不能产生这么清净的相貌。我是为了得到这样的相貌，而跟佛出家修行的。”</p><p>　　佛说：“既然这样，阿难。你要知道，一切众生，从无始劫来，生死相续，都是因为不知道<a href=\"https://www.guang5.com/rmgjc/changzhu.html\" class=\"keylink\" target=\"_blank\">常住</a>真心，只会用种种<a href=\"https://www.guang5.com/rmgjc/wangxiang.html\" class=\"keylink\" target=\"_blank\">妄想</a>。妄想是不真实的，所以才会有轮转。你现在要明了真心，就应当用‘至直心’来回答我的问题。十方如来都是因为用‘直心’，才出离生死，成就佛道的，这中间不能有一点委曲。阿难。既然你当初发心是因为如来的相貌，那么，我问你，是什么使你看到如来的相貌，是什么产生了欢喜呢？”</p><p>　　阿难马上回答说：“是我的眼睛和我的心。我的眼睛看到了如来的圣相，我的心产生了欢喜。”</p><p>　　“好，就像你说的那样，是因为眼睛和心。那么，如果不知道眼睛和心的所在，就不能降服尘劳。譬如国王，被贼所侵，发兵讨贼，这些兵要知道贼的所在。同样道理，使你<a href=\"https://www.guang5.com/rmgjc/liuzhuan.html\" class=\"keylink\" target=\"_blank\">流转</a>的，正是眼睛和心。你要停止流转，就要找到眼睛和心的所在。现在我问你，眼睛和心，到底在哪里呢？”</p><h3>　　心在身内</h3><p>　　阿难回答说：“世尊。一切众生的心，都在身体里面。就是如来那青莲花一样的眼睛，也是长在佛的脸上的。所以，我觉得，我的眼睛是在我的脸上，我的心是在我的体内。”</p><p>　　“你现在坐在讲堂中，向外看的祗陀林，你首先看到的是什么？”</p><p>　　“世尊。我在讲堂中，先看到如来，然后看到大众。再往外看，才是到园林。”</p><p>　　“为什么你坐在讲堂里，还能看到外面的园林呢？”</p><p>　　“世尊，因为讲堂的门窗都是开着的，所以我能看到外面。”</p><p>　　“阿难。就像你说的，身在讲堂，透过敞开的门窗，而看到外面的园林。那么，会有众生，身在讲堂，看不到如来却能看见外面吗？”</p><p>　　阿难回答：“这是不可能的，世尊。”</p><p>　　佛告诉阿难：“你就是这样，阿难。你的心一切明了。如果你现前这个明了的心，真的是在身内的话，就应该先了知身内。那么，有‘先看见身内，后看见身外’这样的人吗？纵使看不到心肝脾胃，也应该能看见筋转脉摇，为什么你现在却看不到呢？看不到身内，怎么能看到身外呢！所以，要知道，你说这个能知的心在身内，是不对的。”</p><h3>　　心在身外</h3><p>　　阿难这时恍然大悟，于是至诚顶礼，说道：“我听了如来的话，这才知道，原来我这个能知的心，是在身体外面。为什么呢？比如灯在室内点亮，必然会先照亮室内。透过门窗，才能照到庭院。一切众生，看不到身体内部，只能看到外面，就如同灯光在室外，不能照到室内一样。很明显，一定是这样的。我说的没错吧，世尊？”</p><p>　　佛说：“这些比丘，刚才跟我在室罗筏城乞食。你看他们，一个人吃饭的时候，其他人会饱吗？”</p><p>　　阿难回答说：“不会的，世尊。为什么呢？这些比丘虽然已经证得了阿<a href=\"https://www.guang5.com/sushi/yaoshan/luohanguo/\" class=\"keylink\" target=\"_blank\">罗汉果</a>，但是毕竟各有各的身体。一个人吃饭，怎么能令其他人都饱满呢！”</p><p>　　“同样道理，阿难。如果这个能知的心在身外，身心相离，自然互不相干。那么，心所知道的，身体就感受不到；身体感觉到的，心也不会知道。就像一个人吃饭，不会另其他人饱满一样。现在，你看我的手。阿难。你眼睛看到我的手，心能知道吗？”</p><p>　　阿难回答说：“能知道，世尊。”</p><p>　　“如果能知道，怎么能说心在身面呢！”</p><h3>　　心在眼中</h3><p>　　阿难又对佛说：“世尊。如您所说，看不到里面，所以不在体内；身心相知，就不在体外。所以我想，身心应该在一处。”</p><p>　　佛追问道：“那么，这‘一处’是在哪里呢？”</p><p>　　阿难回答说：“这个能知道的心，看不到体内，而能看见外面，所以我想，它应该潜伏在眼睛里。就像把玻璃杯扣在眼睛上，虽然有东西蒙着，却不会挡住视线一样。心也是这样潜伏在眼睛里，所以眼睛一看到，心马上就能知道。而这个心见不到身体内部，因为它在眼睛里面；能看到外面，是因为跟眼睛在一起。”</p><p>　　佛说：“如果像你说的，心潜伏在眼根里，好像眼睛罩着玻璃一样。那么，当这个玻璃罩在眼睛上的时候，眼睛在看到山河大地的同时，能看到玻璃吗？”</p><p>　　“应该能看到，世尊。”</p><p>　　“那么，你的心如果罩上玻璃一样的眼睛的话，心在看到山河大地的同时，为什么看不到眼睛呢？如果能看见眼睛的话，心就是在眼睛外面了，又怎么能说潜伏在眼睛里呢；如果看不见眼睛，又怎么能说心在眼睛里，就像把眼睛罩上玻璃一样呢！所以，你说潜伏在眼睛里，也是不对的。”</p><h3>　　内外同在</h3><p>　　阿难又道：“世尊。我又想到，众生的身体，腑藏在内，窍穴在外，所以，脏腑在暗处，窍穴在明处。我现在于佛前，睁开眼睛，只见一片光明，这就是看见外面了；闭上眼睛，见到一片黑暗，这就是看见体内了。是这样的吗？”</p><p>　　如来道：“当你闭眼见到黑暗的时候，这个黑暗跟你的眼睛，是相对呢，还是不相对？</p><p>　　如果是相对，黑暗就在你的眼前，怎么能说是体内呢！如果真的成了体内，那么你在暗室之中，没有光亮的时候，这个暗室就成你的脏腑了吗。</p><p>　　如果不相对，那么，你又是怎么看到黑暗的呢！</p><p>　　如果说，眼睛是反观的。这个黑暗是闭目时，眼睛反观所看到的体内，那么睁开眼睛的时候，怎么不能反观到自己的脸呢！如果见不到自己的脸，那就说明眼睛不是反观的；如果能看到自己的脸，那么眼睛和这个能了知的心，就是在<a href=\"https://www.guang5.com/rmgjc/xukong.html\" class=\"keylink\" target=\"_blank\">虚空</a>中了，又怎么说是在体内呢！</p><p>　　如果在虚空，那就不是你了。如来现在就看到了你的脸面，难道说如来也是你？</p><p>　　如果你一定说，眼睛已经看到了，只是身体不知道罢了，那么身体和眼睛就是两个觉知了。难道你一个人能成两个佛？</p><p>　　所以你说见到黑暗就是见到体内，也是不对的。”</p><h3>　　在思维处</h3><p>　　阿难又说：“我常听佛说，由心生故，种种法生；由法生故，种种心生。那我想，这个思维就是我的心。我想到的哪里，心就在哪里产生。所以不是内外，也不是中间。”</p><p>　　“你说心随着思维而有。那么，这个心有没有个体相呢？如果没有体相，又怎么能说它存在呢；如果有个体相，那么，你用手捏一下身体，身体就能感觉到疼痛，这个能知的心，是来自体内呢，还是来自体外？如果在体内，就应该先看到体内的脏腑；如果在体外，就应该先见到脸面。”</p><p>　　阿难突然道：“不对啊，世尊。看是用眼睛看的，知道的才是心，不是用心看的啊！”</p><p>　　如来继续道：“如果你说眼睛能看。那么，你在室内，通过门窗看外面，这些门窗能看吗？而且，如果说眼睛能看，死人也有眼睛，死人能看吗？如果能看，怎么能叫死人呢；如果不能看，又怎么能说看是因为眼睛呢！</p><p>　　阿难。如果这个能了知的心有个体相，那么，它是一体的呢，还是多体的呢？是遍体呢，还是不遍体的？</p><p>　　如果是一体的，你用手去摸胳膊，你的全身就应该都有感觉。如果全身都有感觉，你就不能知道你触摸的是哪里了；如果你能知道你触摸的地方，手和触摸之处就都有感觉，心就不是一体的了。</p><p>　　如果心是多体的，那就成多个人了，哪一个才是你呢？</p><p>　　如果是遍体的，用手触摸身体的时候，跟一体一样解释不通；如果不是遍体，那么触摸头有知觉，再触摸脚就应该没有知觉了。而又你并不是这样。</p><p>　　所以，你说‘想到哪里，心就在哪里产生’也是不对的。”</p><h3>　　心在中间</h3><p>　　“世尊，我听佛与文殊师利法王子谈实相的时候，世尊说，心不在内，也不在外。所以我想，心应该在中间。”</p><p>　　佛说：“你说在中间，这个中间到底在哪里呢？是身外呢，还是在身上呢？</p><p>　　如果是在身上，在体表就不能算中间，在身中就跟在体内是一个意思。</p><p>　　如果在身外，那么是有个处所，还是没有处所呢？如果没有处所，这个中间就不存在；如果有个处所，这个处所就没法确定。为什么呢？如果你确定一个位置为‘中’，从东边看来，这里就是西；从南边看来，这里就是北。没法找到一个‘中’，心又能安置在哪里呢？”</p><p>　　阿难道：“我所说的中，不是这两种。世尊曾说过：‘眼睛之所以能看到种种色相，是因为有眼识。’眼睛有分别性，色尘是无知的，识就生在其中。我说的中，是这个‘其中’的中。”</p><p>　　佛继续说：“如果说心在根尘之中。那么，这个心体，是同时兼具根与尘呢，还是其中之一呢？如果同时具备根与尘，那么心到底是哪种体性呢！物是无知的，眼根却有知，二者体性根本不同，心又怎么可能同时兼具二者呢？</p><p>　　如果不能同时兼具根与尘，那就或者是根，或者是尘，这时，这个‘中’又怎么能成立呢？所以你说心在中间，也是说不通的。”</p><h3>　　心为无著</h3><p>　　阿难继续对佛说：“世尊。我曾见佛与大目犍连、须菩提、富楼那、<a href=\"https://www.guang5.com/fjrw/zhufopusa/shidadizi/66953.html\" class=\"keylink\" target=\"_blank\">舍利弗</a>共同演法的时候，佛常说：‘觉知分别的心性，既不在内，也不在外，不在中间，都无所在。一切无著，这才叫心。’那么我无著，这是不是心呢？”</p><p>　　佛回答说：“你说觉知分别的心无所在。那么，世间的虚空，水陆飞行，诸物诸象，你所不著的这些东西，到底是有还是没有？没有就如同龟毛兔角，你怎么能说不著呢？既然你说不著了，那它就不能是没有。不存在的才叫没有；不是没有，那就是存在。既然存在，又怎么能叫‘无著’呢！所以说心是一切无著，也是不对的。”</p><h3>　　科学的解释</h3><p>　　看到这里，大家可能会想，现在科学早已经解释了视觉的原理。我们看到东西，那是因为光照射到物体上，然后反射到眼睛里，在眼底呈像。然后刺激眼底的神经产生神经冲动，传递给大脑，这样我们就“看”到了。从这个过程来看，看最终是由大脑完成的。</p><p>　　那么，死人也有大脑。死人也能看吗？如果能看，怎么能叫死人呢？如果不能看，怎么说看是因为大脑呢！</p><p>　　现在还通行灵魂的说法，认为灵魂才是真正的我。如果说灵魂就是心的所在，既然有个所在，就应该能指出来。这个灵魂是在身内，还是在身外，在中间，还是在两边？不论在哪里，世尊在前面都已经驳斥过了。根本找不到它的所在，又怎么能说它存在呢！</p><h3>　　真心在哪里</h3><p>　　这时，阿难从座位上站起来，恭恭敬敬地对佛合掌，说：“我是如来最小的弟弟，佛最疼爱我，所以虽然出家，仍然任性，只顾多闻，没有去求证无漏的圣果。因为不能抵御娑毗罗咒，而堕在淫舍。世尊，这都是因为我不知道‘真心’的所在。求世尊怜悯我和在座的大众，开示我们，真心到底在哪里？”</p><p>　　世尊此时从面门放出千百万毫光，明亮得如同千百个太阳。大地震动，无数佛土一时同现。并在如来的威力下，所有的佛土都合成一个世界。诸大菩萨都安住在本国之中，合掌敬听如来的法音。</p><p>　　接着佛一字一顿，郑重地告诉阿难：“一切众生，从无始劫来，沉溺在颠倒妄想中，这都是因为不知道两种根本。一种是‘生死根本’。就是你和一切众生，把攀缘心当作自己。另一种是‘菩提<a href=\"https://www.guang5.com/rmgjc/niepan.html\" class=\"keylink\" target=\"_blank\">涅槃</a>’。就是清净的本体’。她能出生一切万物，而又游离于万物之外。一切众生，都遗失了这个‘真我’，终日忙碌而不<a href=\"https://www.guang5.com/rmgjc/zijue.html\" class=\"keylink\" target=\"_blank\">自觉</a>。阿难，你现在要找回‘真我’，出离<a href=\"https://www.guang5.com/rmgjc/kuhai.html\" class=\"keylink\" target=\"_blank\">苦海</a>，那么，我问你。”</p><p>　　说着，如来举起金色的手臂，曲指握拳，然后问阿难：“你看见了吗？”</p><p>　　阿难说：“看见了。”</p><p>　　“看见什么了？”</p><p>　　“我看见如来举臂屈指，握成拳头。”</p><p>　　佛问：“你是怎么看到的？”</p><p>　　阿难回答说：“我与大众都是用眼睛看到的。”</p><p>　　佛问阿难：“你说，如来的拳头，你是用眼睛看到的。那么，知道你看见的这个‘心’在哪里呢？”</p><p>　　阿难说：“如来问我心的所在，而我以心来寻求这个所在。这个能寻求的，我就把它当作心。”</p><p>　　佛呵斥道：“咄！阿难。这不是你的心！”</p><p>　　阿难大惊失色，连忙站起来问：“这不是我的心，那是什么？”</p><p>　　佛告诉阿难：“这是虚妄的前尘，迷惑了你的真心。你无始劫来，直到今天，认贼为子，迷失了真心，所以轮转。”</p><p>　　“世尊。我是佛宠爱的小弟弟，因为心中爱慕如来，而发心出家。不只是供养如来，就是遍历恒沙国土，承事诸佛及善知识，发大勇猛心，行一切难行的<a href=\"https://www.guang5.com/rmgjc/fashi.html\" class=\"keylink\" target=\"_blank\">法事</a>，我所用的都是这个心。即使是毁谤佛法，永退善根，也是因为这个心。如果这不是心的话，那我就没有心了，就如同土木一样了。离开了这种觉知，我就再也没有别的了。如来怎么说这不是我的心呢！我实在是惊慌失措，我看大家也都是这样。请如来再给我和在场的大众惠赐法音！”</p><p>　　于是，世尊在狮子座上，轻抚阿难的头顶，亲切地说道：“如来常说，一切缘法，惟心所现。一切因果，乃至世界微尘，因心成体。阿难。世间的万事万物，乃至草叶缕结，究其根元，都有体性。即使是虚空，也有名貌。何况我们的真心。</p><p>　　如果你一定认为这个分别感知就是你的心，那么，这个心就应该离开色香味触这些尘业，别有体性。而你现在听我说法，这是因为有我的声音，你才有感知的。即使熄灭一切见闻觉知，内守幽闲，这也还是前尘影事。</p><p>　　我不是非要你承认，这不是你的心。只是你自己细细揣摩，如果离开前尘，还有分别感知的，这才是你的真心。如果离开前尘就没有分别感知的能力了，那么，这个分别感知的能力，也就成前尘影事了。而尘相都不是常住的，一旦变灭，这个能感知的心也就消失了。你阿难就不存在了，那么谁来求证无生法忍呢！</p><p>　　这时，阿难和在场的大众，都默然自失。\t\t</p></div>"
    },
    {
        "title": "第三章 十番显见",
        "author": "",
        "date": "",
        "html": "<div class=\"B1_text\"><h2>第三章 十番显见</h2><p>　　由于长劫以来，阿难已经习惯于以攀缘心为自性了，一时还明白不过来，所以，世尊接下来又从十个不同的角度，给阿难解释真心的所在。世尊先从眼睛入手。如果说是眼睛看到东西的，那么盲人没有眼睛，是什么使他看到的一片黑暗的呢？所以真正使你明见万物的那个见性，是心不是眼。然后，世尊又以见性来代表心，通过对见性的解释，使阿难明了心的所在。</p><p>　　佛接着又道：“世间的一切修行人，虽然能得到种种<a href=\"https://www.guang5.com/rmgjc/chanding.html\" class=\"keylink\" target=\"_blank\">禅定</a>，却不能证得无漏圣果，这都是因为执着于把生死妄想当做了真实。所以你现在虽有多闻，仍然不能成正果。”</p><p>　　阿难听后，又哭道：“自从我发心出家以来，一直以为，佛有那么大的神力，不用我自己修行，自然会赐予我一切的。不知道个人的身心，他人没法替代。今天才明白，我虽然多闻，如果不修行，跟不闻是一样的。如同听人说食，终不能饱。世尊，我和大众现在都被缠缚在烦恼和所知这两种障碍中，不知道真心的所在。惟愿如来怜悯我等，显发妙明真心，打开我们的道眼。”</p><h3>　　能见的，是心不是眼</h3><p>　　这时，如来从胸前的万字中放出千百色豪光，<a href=\"https://www.guang5.com/rmgjc/chana.html\" class=\"keylink\" target=\"_blank\">刹那</a>间周遍所有世界，灌入这些世界中一切如来的佛顶，最后回到阿难和大众身上。</p><p>　　然后，佛对阿难说：“阿难，我现在给你树立如来<a href=\"https://www.guang5.com/rmgjc/zhengfa.html\" class=\"keylink\" target=\"_blank\">正法</a>，让你和十方一切众生都明心见性，获得清净的法眼。</p><p>　　现在你回答我，你看到我的光明拳，拳的光明因何而有，拳是怎么产生的，你是怎么看到的？”</p><p>　　阿难回答说：“世尊的全身光焰巍巍，犹如宝山，因为清净，所以有光明。我是用眼睛看到的。世尊五指弯曲，握拳示人，所以有拳。”</p><p>　　佛告诉阿难：“有智慧的人，都要以譬喻而得开悟。所以，阿难，譬如我的拳，如果没有我的手，就不能成拳。而你没有眼睛，就不会看见。那么，眼和见之间的关系，跟手和拳之间的关系，是一样的吗？”</p><p>　　阿难说：“是的，世尊，没有眼，就没有见；没有手，就不成拳。二者的关系，应该是一样的。”</p><p>　　“你说一样，其实不然。为什么呢？没有手的人，就肯定不会有拳；而没有眼的人，并不是什么都看不见。你可以问问那些盲人 ，他们能看到什么。盲人一定会回答你，只看到一片黑暗。所以，虽然见到的东西单一，但是看的这个能力，并不是没有。”</p><p>　　阿难道：“盲人的眼前只有黑暗，怎么还说他们能看呢？”</p><p>　　佛道：“盲人因为没有眼睛，而只看到黑暗。这与有眼睛的人处在暗室，这两种黑暗，有什么不同呢？”</p><p>　　“世尊。这两种黑暗，好像没有什么不同。”</p><p>　　“阿难。譬如盲人，因为有眼病而看不到东西，只见一片黑暗。当他的眼病恢复了，能看东西了，你因此就认为，是眼睛看到的。那么，譬如再有人，在暗室中只看到一片黑暗，他打开灯就能看到室内的东西了，按你的逻辑，这就应该是灯看见的了？灯怎么能看呢！灯只是帮助我们照明的。看到的，是眼睛而不是灯。同样道理，用在盲人身上，可见，眼睛也只是帮助我们显现事物的，能看的，是心而不是眼。”</p><p>　　阿难和在场的大众，听到如来这翻话后，嘴上虽然已经说不出什么了，但是心里还是没有完全明白。只是默默地合掌，希望如来再继续开示。</p><h3>　　摇动的，是尘不是心</h3><p>　　这时，世尊问骄陈那：“我在鹿园刚成佛道的时候，就为你们五人说法，当时我说：‘一切众生不能明了自性，都是被客尘烦恼所误。’你们当时是因为什么开悟，而征得圣果的呢？”</p><p>　　骄陈那于是站起身来，回答佛说：“世尊，我是因为‘客尘’这两个字而开悟的。譬如旅店，有客人投宿。客人吃住完毕后，就要离开旅店，继续赶路。但是主人就不会离开了。我就这样想：不住的是客，住的是主。所以客尘中的‘客’就是不住的意思。又比如雨过天晴，新日当空。阳光透过云隙，照亮空中的浮尘。浮尘摇动，虚空寂然。我就想，澄寂的是空，摇动的是尘。所以尘就是摇动的意思。”</p><p>　　佛说：“是这样的，骄陈那。”然后，如来在大众中，伸出手臂，握上拳，又松开，又握上拳，问阿难：“你看到什么了？”。</p><p>　　阿难说：“我看见如来的手，在大众中开合。”</p><p>　　佛问阿难：“你看我的手开合，那到底是我的手有开有合，还是你的见有开有合呢？”</p><p>　　阿难回答说：“世尊的宝手在众中开合，我见到如来的手开合，不是我的见性有开有合。”</p><p>　　佛问：“谁动谁静？”</p><p>　　阿难回答道：“是佛的手在动。而我的见性连静都谈不上，更不会有动。”</p><p>　　“是这样的。”接着，如来又从宝掌中，往阿难的左边飞出一道光。阿难循光向左看去。然后，如来又飞一道光到阿难的右边。阿难又扭头向右看去。</p><p>　　佛问阿难：“你的头为什么摇动？”</p><p>　　“我见如来向我左右放光，我左右看，所以头就会摇动。”</p><p>　　“阿难，你看<a href=\"https://www.guang5.com/rmgjc/foguang.html\" class=\"keylink\" target=\"_blank\">佛光</a>而头左右摇动，是你的头在动，还是你的见在动？”</p><p>　　“世尊。是我的头在动。而我的见性，连止都谈不上，又怎么会动呢！”</p><p>　　佛说：“是这样的，阿难。”</p><p>　　接着，如来对大众宣示道：“众生把摇动的，叫做‘尘’；把不住的，叫做‘客’。你们也看到了，阿难的头在摇动，见性却并无所动；我的手在开合，见性却并没有舒卷。那么，为什么你们却要把动的当作自己，把动的当做真实呢！从始至终，念念生灭，遗失了自己的真性，颠倒行事。不见真心，认物为己，在轮回中自取流转。”</p><h3>　　变灭的，是身不是心</h3><p>　　阿难和在场的大众，听到佛的开示后，身心泰然。回想自己无始劫来，丢失了真如的本心，只能在尘缘之中，分别这些幻影。而今终于开悟，犹如失去乳哺的婴儿，忽然遇到了慈母。于是大众一起合掌<a href=\"https://www.guang5.com/rmgjc/lifo.html\" class=\"keylink\" target=\"_blank\">礼佛</a>，希望如来继续讲解身心的真妄虚实，和生灭与不生灭的道理。</p><p>　　这时，波斯匿王从座位上站起来，向佛问道：“世尊，我在没遇到佛之前，曾经听迦旃延和毗罗胝子说，人死后就什么都没有了，这就叫涅磐。现在我虽然遇到佛陀，聆听了佛陀的教法，但是心中仍有疑惑。世尊，怎样能证明这个心是长住不灭的呢？”</p><p>　　佛对波斯匿王说：“大王，你现在这个身体，是象金刚一样不朽呢，还是会慢慢变灭呢？”</p><p>　　“世尊。我这个身体，最终是要变灭的。”</p><p>　　“大王，你的身体还健在，你怎么就知道它将来要变灭呢？”</p><p>　　“世尊。我这个身体虽然还没有消失，但是它每时每刻都在发生变化。就象火焰最终会化为灰烬一样，我的身体最终也会消亡。”</p><p>　　佛说：“是这样的，大王。那您感觉，您的身体跟孩童时代比，发生了那些变化呢？”</p><p>　　“世尊。我在孩童的时候，皮肤润泽。长大以后，气血充沛。而今衰老了，身体枯瘦，精神昏聩，头发花白，面皮褶皱。我恐怕活不了多久了，怎么能跟孩童的时候比呢！”</p><p>　　佛说：“大王，按照您的说法，您好象不是一下子衰老的。”</p><p>　　“世尊。变化是在不知不觉中发生的。我是年复一年，逐渐变成这样的。二十岁的时候，我虽然年少，但是容貌跟十岁的时候比，已经不同了；三十岁比二十岁的时候，就又老了许多。而今我六十有二，回过头来看我五十岁的时候，比现在又强壮多了。世尊，何止是十年一变，如果我仔细观察，是一年一个变化；何止是一年一变，简直一个月一变。甚至每天都再发生变化。静下心来想一想，刹那之间，念念之间都没有停留。所以我知道我这个身体，最终一定会消灭。”</p><p>　　佛说：“大王，你因为看到变化没有片刻停止，所以知道你最终将要泯灭。但是，你知道吗，变灭的同时，在你的身体中，也有不灭。”</p><p>　　波斯匿王合掌向佛，说：“我真的不知道。”</p><p>　　佛说：“我告诉你这个不生灭性。大王，你是多大的时候见到的恒河水的。”</p><p>　　“我三岁生日那天，慈母带我<a href=\"https://www.guang5.com/rmgjc/libai.html\" class=\"keylink\" target=\"_blank\">礼拜</a>耆婆天的时候，经过这条河。那时，我就知道这是恒河水。”</p><p>　　“大王。就像你说的那样，二十的时候就比十岁的时候要衰老，这样一直到六十，念念都在变迁。那么，你三岁时看到的恒河，和你十三岁时比，河水怎么样呢？”</p><p>　　“跟我三岁时，宛然无异。如今我六十二岁了，看这河水，仍然没什么两样。”</p><p>　　佛说：“你现在感叹自己发白面皱，那么你的脸一定比童年的时候褶皱了许多。但是，你现在看恒河，和你童年时看恒河的这个见，有变化吗？”</p><p>　　“没有变化，世尊。”</p><p>　　“大王，你虽然脸上有皱纹，而这个见精，却没有任何褶皱。皱了就是有变化，不皱就是没有变化。变化的才会消灭，不变的就没有生灭。没有生灭，又怎么会随着你的身体而妄受生死呢！”</p><p>　　波斯匿王听后，这才相信，死后只是舍弃了旧的身体，而趋向新生。在场的大众听了无不欢喜。</p><h3>　　颠倒的，是迷不是心</h3><p>　　阿难这时又有了疑问，于是起立，长跪合掌，问道：“世尊。如果这个见闻没有生灭，为什么世尊说我们遗失了真性，颠倒行事呢？”</p><p>　　如来没有马上回答他，而是垂下手臂，手向下指，问阿难：“你现在看我的手，是正还是倒？”</p><p>　　阿难现在已经开始怀疑自己以往的知见了，所以这次不敢贸然回答，却说道：“世间的众生都说这是倒。我不知道到底是正还是倒。”</p><p>　　佛继续问：“如果世间人以此为倒，那么以什么为正呢？”</p><p>　　阿难说：“如来手臂竖起来，兜罗绵手向上指向天空，这样叫正。”</p><p>　　佛于是竖起手臂，对阿难说：“这个颠倒首尾相换，世间的人就一倍瞻视。你们的身与如来的清净法身相比，也是同样的道理。如来的身叫‘正遍知’，你们的身叫‘性颠倒’。那么，你们仔细审查一下，跟佛相比，你们到底颠倒在哪里呢？”</p><p>　　这里，世尊以手臂和颠倒为例，来譬喻如来与众生。不论指下指上，手臂本身并无增减，世尊以手臂本身来比喻如来的清净法身；指下为倒，指上为正，世尊以手臂的颠倒，来比喻颠倒的众生。</p><p>　　不随着颠倒而变，就是如来；随着颠倒而“一倍瞻视”，就是众生。然而。不管怎样颠倒，手臂始终还是手臂。所以，无论“正遍知”还是“性颠倒”，如来与众生，其实都是一个。</p><p>　　这时，阿难和在场的大众，都睁大眼睛，呆呆地望着佛，不知道自己身心颠倒的所在。</p><p>　　佛陀于是用海潮一样的音声，遍告所有的人说：“你们听好，我常常说，一切色相，一切心念，一切感受，一切缘法，都是心所变现的。你的身心，都是妙明真心中所呈现出来的。你们为什么要遗失这个本妙圆明的真心，在灵明的妙悟之中，自取迷寐呢！在迷寐中，唯一能感受到的，就是晦暗的空虚。为了填补这份空虚，于是，晦暗中就结出色相。色相既然产生，妄想由此而起。妄想对色相产生了执着，色身因此形成。身体产生后，则种种感知在内乱搅，种种思绪向外奔驰，从此再无片刻安宁。整日浑浑昏昏扰扰，以为这就是自己的心性了。一旦把这当成了的心，就会认为心在身体之内。殊不知，山河大地，乃至虚空，无不在妙明真心之中。好比广博澄清的大海，你遗弃不要，却把那漂浮在海面上的一个水泡当做大海。你们真是迷了又迷，就如同我刚才垂手那样。如来说，真是可怜悯者！”</p><h3>　　可还的，是尘不是心</h3><p>　　阿难听佛为他指明了真心的所在，感激涕零，又向佛问道：“我听到如来宣说如此妙法，虽然明白了真心的所在，但是，我还是在以攀缘心听法。这个以攀缘心听来的真心所在，我不敢确定那就是我的真心。”</p><p>　　佛说：“你们以攀缘心听法，这样，听来的法也是攀缘的，并不是真实的。如同用手指把月亮指给人看，那人应该循着手指去看月亮。如果去看手指，以为手指就是月亮，这样不仅找不到月亮，也错认了手指。何止是错认手指，也是不识明与暗。月亮为明，手指为暗。把手指当作月亮，就是混淆了明与暗。</p><p>　　阿难，你也是这样。如果以为听我说法的音声的，就是你的心，这个心自然应该离开音声后，还有分别性。好比旅客寄宿在旅亭，短暂地停留一下就走了，终究不会长住于此的。而掌亭人却不会走，所以叫他亭主。</p><p>　　同样道理，如果真是你的心，就不会离去。怎么会离开声音，就没有分别性了呢！岂止是声音，分别我的容貌，乃至连分别都没有，只独守空冥，如果认为这就是你的心，那么离开外缘，没有分别的时候，谁还是你？”</p><p>　　阿难问：“如果我的攀援心是外尘所产生的，各有所还，那如来说的妙明真心，为什么就无所还呢？请世尊慈悲，为我解说。”</p><p>　　佛说：“阿难，你现在见我的这个见精，虽然不是妙明真心，但它就像捏目望月一般，虽然有重影，见到的却是真月，并不是水月镜花。阿难，你现在听好，我现在就告诉你无所还的原因。</p><p>　　日轮升天，则有明耀；中夜黑月，云雾晦暝，则有昏暗。户牖之隙，则见通达；墙宇之间，则见壅塞。分别之处，见种种缘；顽虚之中，遍是空性。风沙四起，就会昏暗；雨过天晴，又见清净。阿难，你看这些变化，我一一告诉你可还之处。明还日轮。为什么呢？没有太阳就没有光明。光明属于太阳，所以明归日轮。暗还黑夜，通还门窗，拥塞还墙，顽虚还空，昏暗还尘，清明还晴。世间的一切，都是如此。而你见到这一切的这个见性，还给谁呢？如果还归明，则不明时，就见不到暗。明暗通塞，种种差别，而这个能看的见性，却没有差别。这些可还的自然不会是你，而不可还的见性，不是你还能是谁呢？可见，你的真心，本来就具备见的能力，是你自己迷失，遗失了本妙真心，而漂流在生死苦海中。所以如来说，真是可怜悯者。”</p><h3>　　能见的，是心不是物</h3><p>　　阿难又道：“我虽然知道这个见性是不可还的，但是怎么知道它就是我的真性呢？”</p><p>　　佛告诉阿难：“阿难，你现在虽然没有证到无漏，但是承佛的神力，看初禅天是不成问题的。天眼第一的阿那律，看阎浮提世界犹如掌上观文；诸大菩萨能看百千世界；十方如来，则一切国土，无不尽见。相比之下，众生所看到的，不过一分一寸而已。</p><p>　　阿难。现在你我一起向四天王的宫殿看去，这中间所看到的水陆空行，种种形象，虽然明暗不同，无非都是前尘的分别留碍。你现在就在其中仔细分别，哪个是物，哪个是你。</p><p>　　阿难，从最远处的日月宫——是物不是你，到七金山——虽然光艳巍巍，也是物不是你，渐渐看到云腾鸟飞，风动尘起，树木山川，草芥人畜，都是物不是你。阿难，这或远或近的事物，虽然物性有别，但都是你的见精所见。物类虽然有别，见性却并无不同。这个微妙的见性，就是你的真性。</p><p>　　如果见是外物，那么，你也应该可以看见我的见。</p><p>　　如果你认为，看见了我所看见的事物，就是看到了我的见。那么，我看不见的时候，你怎么看不到我的‘不见’之处呢？如果‘不见’能被看到，那自然就不是‘不见’了；如果你看不到我的‘不见’之地，见自然就不是外物了。既然不是外物，不是你自己还能是什么呢？</p><p>　　而且，如果见是物，那么，你看物的时候，你既然见到物了，物也能看见你。体性纷杂，你和我还有这个世间，就无法安立了。</p><p>　　阿难。你见的时候，是你不是我。见性周遍，不是你还能是谁呢！为什么怀疑你的真性不是真的，还要向我来求证呢！</p><h3>　　见性无碍，犹如虚空</h3><p>　　阿难又问佛：“世尊，如果这个见性一定是我，那么刚才我跟如来看四天王的日月宫时，这个见周遍整个国土；退回到精舍的时候，就只看见园林厅堂，檐宇廊回。世尊，这个见本来周遍一界，现在在室内，就变得只能盈满一室了。是这个见缩小了呢，还是墙壁令它断绝了呢？”</p><p>　　佛给阿难解释说：“世间的一切，或大或小，或内或外，都是前尘物事，不能因此而说见有伸缩。比如一个方形的器皿，中间有个方形的空间。那么我问你，这个空间的形状是固定的，还是不固定的呢？如果这个空间，固定的就是方形，那么在其中再放一个圆形的器皿，空间的形状就不该变成圆形；如果不是固定的，那么，在这个方形的器皿中间，就不会有这个方形的空间。</p><p>　　阿难，你说不明白见性大小的道理，其实这就跟这空间是一样的。</p><p>　　阿难。如果想要器皿里的空间没有方圆之相，你只要把器皿拿走就可以了，因为虚空本来就没有方圆之相。你不能说再把虚空改变个形状。</p><p>　　如果象你说的那样，在室内的时候，见性就缩小了。当你抬起头看太阳的时候，难道还得把自己的见性，抻到太阳那去吗？</p><p>　　如果说墙壁能夹断见性，那么，在墙上凿个小孔，见性上是不是也会留下一个凿痕呢？这不是是无稽之谈吗！</p><p>　　一切众生，从无始劫来，以物为己，迷失了真心，被物所转，在其中或内或外，或大或小。若能转物，则同如来。身心圆明，不动道场，于一毛端，遍能含摄十方国土。”</p><h3>　　万事万物，无不是见</h3><p>　　阿难已经习惯了沉迷于外物，一时间还转变不过来，所以继续又问：“世尊，如果这个见精就是我的妙心，现在就在我的面前，见性是我，我的身心又是什么呢？我的身心，确实是能分别的；见却没有分别的能力，它都不能分辨我的身体。如果见确实是我的心，令我见到一切，见性是我，身不是我，这不就成如来刚才说的‘物能见我’了吗！我实在不懂，请如来为我解说。”</p><p>　　佛解释说：“你说见性在你面前，其实不是这样的。如果见性在你眼前，你能看到它。既然有个所在，就一定能够指出来。</p><p>　　现在，我和你坐在祇陀林中，看着周围的树林池塘和亭台楼阁，上有日月，前有恒河。你在我的面前，可以用手一一指出来这些事物。阴暗的是树林，光明的是日月，拥塞的是墙壁，通达的是虚空。乃至花草树木，毛发沙尘，虽然大小迥异，但只要有个形象，就都可以指出它的所在。如果见性在你的眼前，你应该也能用手指出见性的所在。</p><p>　　阿难，如果虚空是见性，既然已经是见性了，又怎么能是虚空呢；如果物相是见性，既然已经是见性了，又怎么会另成他物呢！你仔细地把这个微妙的见性，从世间万象中剥离出来，就像前面那些事物一样，明明白白地指给我看。”</p><p>　　阿难回答说：“我在这个讲堂中，远眺恒河，上观日月，纵目所望，举手所指，都是外物，没有见性。世尊，别说我一个初学，就是那些大菩萨们，也不能在万物之中，剥离出一个见性来。使它离开一切外物，而独立存在。”</p><p>　　佛说：“是这样的，阿难。没有一个见性，能离开一切事物而独立存在。我再问你，你再仔细分辨一下，这些事物之中，下到我们所住的林苑，上到空中的日月，这万事万物，哪一个不是见呢？”</p><p>　　阿难仔细思维了一翻，然后回答道：“我真不知道哪一个不是见。为什么呢？如果树不是见，那我怎么会见到树呢；如果树是见，那怎么又会是树呢？同样道理，如果虚空不是见，我怎么能看到虚空呢；如果虚空是见，那它又怎么会是虚空呢？。所以我想，这万事万物，如果仔细推究，又无不是见。”</p><p>　　佛说：“的确是这样的。”</p><p>　　这时，在场的大众，还没有证到无学果位的人，听到佛的这翻话，心中一片茫然。以往的知见，现在都被颠覆了，一个个都惶恐不安。如来知道众人都惊慌失措，心生怜悯，安慰阿难和大众说：“诸位善男子，如来是真语者，绝无虚妄。如来所说的义理，都是亲身证得的。不象那些外道论师，只会诡辩。你们要仔细思维如来的话，不要白白仰慕如来一场，也别辜负了如来对你们的一片苦心。”</p><p>　　这时，文殊师利菩萨怜悯在场的大众，于是从座位上站起来，走到佛前，恭敬地礼拜合掌，对佛说：“世尊，在场的大众，都不明白如来所讲的既是见性，又非见性的道理。世尊，如果这些前缘，色空等相是见，就应该能指出见的所在；如果不是见性，就应该根本看不到。在场的大众，都不知道这是怎么回事，所以惶恐不安。希望世尊慈悲，再给大家解释一下，前尘物事和此见精，到底是什么，它们之间到底是怎样的关系。”</p><p>　　佛告诉文殊菩萨和大众说：“十方如来和诸大菩萨，安住在三摩地中，对见和所见的诸缘，以及所思所想，都如水月镜花一般，本无所有。这一切本来都是妙明真心，为什么一定要在其中分出个是非来呢！</p><p>　　文殊，我现在问你，你是文殊，那么，还另外有一个叫‘是文殊’的吗？还是根本就没有文殊？”</p><p>　　“世尊，我确实是文殊，没有另外一个‘是文殊’。为什么呢？如果还有个‘是’的话，就成两个文殊了。文殊也确实有，不是没有，只是没有是和非而已。”</p><p>　　佛说：“是这样的，文殊。你就是你，本来清净湛然，明明了了，没必要另加分别。这个微妙的见性和色空诸缘也是这样的，本来都是真如本心，是虚妄产生了色空、见闻等事。就如同眼花的时候，看到了两个月影，你说哪个是月，哪个非月呢！</p><p>　　文殊，真实的月亮只有一个，这中间并没有什么是月非月。所以，你对见性和色尘所做的种种分别，都是幻妄中的痴想而已，根本不可能得出一个合理的结论。</p><p>　　其实，这都是真如本心的作用——她使你在迷失以后，还能有所指。虽然有所指，但却没法给出一个合理的解释。”</p><h3>　　见非因缘 性非自然</h3><p>　　阿难问佛：“世尊，就像佛说的那样，觉缘遍满十方法界，湛然常住，没有生灭的。这与娑毗迦罗黄发外道所谈的冥谛，及投灰外道等所说的有真我遍满十方，有什么差别呢？世尊也曾在楞伽山，为大慧说：‘那些外道常说‘自然’，我说的‘因缘’，并不是那个境界。’我现在看这个觉性自然，不生不灭，远离一切虚妄和颠倒，似乎不是因缘和自然。请世尊开示，使我不入群邪，获得真实的妙觉明心。</p><p>　　佛告诉阿难：“我又设方便，又谈真实地给你讲，你仍然不能明白，还迷惑为自然。阿难！如果是自然，就要有个自然体。你且看这妙明的见中，以谁为自体呢？以明还是以暗，以空还是以塞？以明为体，就看不见暗；以空为体，就看不见塞。反过来也是如此，以暗为体，明的时候，见性断灭，又怎么能看到明呢！</p><p>　　阿难道：“哦，原来这微妙的见性，不能归于自然。世尊，那见性是因缘所生吗？”</p><p>　　“阿难，如果见性是因缘所生，那么，如果产生见性的因不在了，见性就不存在了。比如，如果是因明而生，那么在暗处，明不存在了，见性也就随之消失，你怎么能见到暗的呢！同样道理，如果是因暗而生，那有怎么能见到明呢！所以，如果见性是因缘所生，就不可能遍见一切。</p><p>　　要知道，这个精妙的见性，非因非缘，亦非自然，非不自然。无是无非。离一切相，总一切法。你为什么还要去揣摩，用世间的戏论名相去分别计度呢！这就像用手去抓虚空一样，徒劳无益。”</p><h3>　　见非眼见</h3><p>　　阿难又问：“世尊，如果这个微妙的见性，非因非缘，世尊为什么常说见性要有四个条件，空、明、眼、心呢？”</p><p>　　如来回答道：“阿难。我说的那些世间的因缘相，不是第一义。阿难，我再问你，世间人说我能看见，怎么样是见，怎么样是不见呢？”</p><p>　　“世尊，世间人因为日月灯光的照明，而能看见种种相，这叫见；没有这三种光，就不能见。”</p><p>　　“阿难，如果没有光明，就不能见，那黑暗应该是看不见的。如果说能看见黑暗，这只是没有光亮而已，怎么能说是看不见呢！阿难。如果在黑暗中看不到光明，就叫‘看不见’。那么在光明中看不到黑暗，这也应该叫‘看不见’。明中不见暗，暗中不见明，但是不论明与暗怎么争夺，你的见性却没有片刻的消失。由此可知，这两者都应该是‘见’，怎么能说是看不见呢！</p><p>　　所以，阿难，要知道，见到光明的时候，见性不是光明；见到黑暗的时候，见性不是黑暗；见到空的时候，见性不是空；见到塞的时候，见性不是塞。所以，你的见性，并不是你所看见的东西。真正的见性是游离于你的所见之外的，根本触及不到的，又怎么能用因缘、自然与合和相来解释它呢！</p><p>　　你们这些声闻，狭劣无知，不能通达清净实相。我今天的教诲，你要好好思维，不要在菩提路上心生<a href=\"https://www.guang5.com/rmgjc/xiedai.html\" class=\"keylink\" target=\"_blank\">懈怠</a>。”\t\t</p></div>"
    },
    {
        "title": "第四章 因缘与和合",
        "author": "",
        "date": "",
        "html": "<div class=\"B1_text\"><h2>第四章 因缘与和合</h2><p>　　所见的一切的都是虚幻的，能见的那个才是真心。好比用手捏眼睛，看到的月亮就会有个重影。众生的妄见，就好比是这个月影。它本来就是不存在的，明智的人不该去研究一个不存在的东西到底是什么。如果说见性是能合和的，那么它一旦与某个东西合而为一了，就没法再看其他事物了，你又是怎么看到其他事物的呢；如果说见性是不能合和的，你又是怎么看到世间万物的呢？所以见性根本就谈不上合和与不合和。一切都不过是虚妄地幻化而已。</p><h3>　　两种妄见</h3><p>　　阿难说：“世尊，我虽蒙佛为我解释因缘、自然、合和与不合和，但我还是没能明白。听世尊说，见性并不是眼见，我就更糊涂了。”</p><p>　　于是，世尊又耐心地解释道：“你虽然博闻强记，但是对于微密的观照，心中仍然没有明了。你现在听好，我细细地给你解释。阿难。一切众生，在生死中轮回，都是因为两种错误的妄见所致。一种是‘个别的妄见’，一种是‘共同的妄见’。</p><p>　　个别的妄见是怎么回事呢？阿难。比如人有眼病，看东西重影。夜里看灯光，就会有个五色重迭的光影。你说这个五色光影，是灯呢，还是见呢？如果是灯，那么，没有眼病的人为什么看不到？如果是见，见成了光影，这个人又是用什么看到这五色光影的呢？</p><p>　　再者，阿难，如果这个光影，离开‘灯’而能独立存在，那么你看其他物体，桌椅板凳之类的，也应该能看到这个光影；如果离开‘见’而能独立存在，那就不该是眼睛看到的光影。为什么这个人却是用眼睛看到的呢！</p><p>　　所以，要知道，真正有形色的是灯，光影是病眼产生的。所以这个光影，不能说它是灯，也不能说它是见，也不能说它非灯非见。</p><p>　　就好比我们用手挤眼睛，然后看月亮。这时，眼中就会出现两个月亮。这第二个月亮，既不是月亮本身，也不是月影。为什么呢？因为它是捏出来的，明智的人不应该去研究这个捏出来的月亮，因为它本来就是虚妄的。病目所见的光影也是这样，它本来就是不存在的。你能去研究一个不存在的东西，它到底是灯是见，还是非灯非见吗？</p><p>　　阿难，我们再来说‘共同的妄见’。这个阎浮提世界上有或大或小的很多国家。如果有相邻的两个小国。其中一个国家，因为国人的业报成熟，灾相并起。或者看见双月双日，彗星飞流，或者看见月晕七重，霓虹贯日。但是这些恶相，只是这个国家的人能看到，另一个国家的人却看不见。</p><p>　　阿难，我现在为你详细地分析这两件事情。前面那个眼病中所看到的光影，虽然好像是真的，但是仔细辨别就会发现，其实那是眼病所造成的，并不是灯产生的，也不是见的问题。而你现在用眼睛看到的山河大地和一切众生，这也是无始劫来的见病所造成的。跟眼病中所见的五色光影是一样的。</p><p>　　看这个动作和所看到的一切，好像是真实的，其实都是真如本心中所现的眼病而已。不但你所看到的一切是病，就是你看的这个动作，也是病。而能够觉察到这一切的本觉真心，却不是病。</p><p>　　因为能觉察到这个病，所以不在病中。既然它觉察到了见，怎么还能把它归为见闻知觉呢！所以你现在看到我和你，以及世间的一切众生，这都是见病，而不是见病的主体。这个见病的主体，是你的真如本性。它不是病，所以不能叫见。</p><p>　　阿难。众生共同的妄见和个别的妄见，道理是一样的。一个人所见的五色光影，是眼病所生；一国人所见的不详之相，是那一国人共同的见业中所起的恶瘴。这都是无始劫来的妄见所生。这个世界所有的国家，和四大海水，整个<a href=\"https://www.guang5.com/rmgjc/suoposhijie.html\" class=\"keylink\" target=\"_blank\">娑婆世界</a>，乃至十方国土，一切众生，本来都是妙明真心。因为见、闻、觉、知这些虚妄病缘的牵引，合和在妄相上，所以才会随着妄相生生死死。若能远离这些妄缘，不取不舍，就灭除了生死的根本，圆满了不生不灭的菩提自性。”</p><h3>　　真心不合</h3><p>　　“阿难，你虽然知道了这个妙明真心，不是因缘而生，不是自然而有，但是仍然不明白，这个真如本心，并不是合和而来的，也不是不合和的。</p><p>　　阿难，我再以前尘影事问你。你这个真如本心，是与明合，是与暗合；是与通合，是与塞合？你看明的时候，明在眼前，这个见在哪里呢？如果见是可以辨别出来的，那它到底是什么形象？如果没有见，你又是怎么看见明的呢？如果因为看到明，就说明是见。那么，明如果成了见，又是什么使你看到明的呢？如果见是圆满周遍的，那明在什么地方呢？如果明是圆满周遍的，那又哪有地方留给见呢？见和明，本来是两种东西，如果溶合在一起，那它又叫什么呢？它又是什么呢！暗、通、塞等等诸相，也是一样的道理。</p><p>　　而且，如果见与明合，遇到暗时，明就消灭了。已经与明合了，就不能再与暗相合，你又是怎么看见暗的呢？如果你看到暗的时候，不叫‘见与暗相合’，那么看到明的时候，又怎么能叫‘见与明相合’呢？暗、通、塞也是这样。”</p><p>　　阿难这时对佛说：“世尊。我想，这个真如本心，与那些尘相和心念是不能合在一起的。”</p><p>　　“阿难。你说这个微妙的见性是不能相合的，是不能与明合，不能与暗合，是不能与通合，还是不能与塞合？如果是不能与明合，那么，见与明一定有个边缘。如果他们的边缘不相交，我们自然见不到明。根本就见不到明，又怎么能谈得上见与明的边缘呢？这又自相矛盾了。暗，通，塞也是同样道理。</p><p>　　而且，既然这个见性是不能合和的，那么见与明就是互相抵触的了。好比耳朵和光明一样，毫不相干。这样，见都不知道明的所在，合不合和就更谈不上了。暗、通、塞等也是一样。</p><p>　　阿难，你还没有明白，一切浮尘，都是幻化。随处出生，随处消灭。虽说它是幻妄，其本体却都是妙明真心。乃至五阴、六入、十二处、十八界，都是因缘和合就虚妄地发生，因缘消散就幻化地消灭。殊不知这生灭去来，都是如来藏妙真如性。在常住真心之中，去寻求来去、迷悟、生死，自然了不可得。\t\t</p></div>"
    },
    {
        "title": "第五章 五阴虚妄",
        "author": "",
        "date": "",
        "html": "<div class=\"B1_text\"><h2>第五章 五阴虚妄</h2><p>　　所谓的五阴是身心世界的五种最基本的形态。其中，色阴指的是有形的色相。受阴是有形世界对心理的影响。想阴是心理世界的思维活动。行阴指的是身心世界的存在状态。识阴则是最深层的，指的是对有形世界和心理世界一切现象反应。世尊对五阴一一加以分析，最后证明，这五阴其实都是虚妄的。不过如病目中所现的灯影一般，根本没有一个独立的体性，本体都是如来藏。</p><p>　　“阿难。为什么说五阴是真如本心呢？”</p><h3>　　色阴虚妄</h3><p>　　比如有人抬头看天空，只看到一片清净的虚空，再没有其他东西。后来，这人<a href=\"https://www.guang5.com/rmgjc/wuyuan.html\" class=\"keylink\" target=\"_blank\">无缘</a>无故地瞪着眼睛一直看，时间久了，眼睛由于疲劳而发花，于是看到了许多花点。色阴也是这样。</p><p>　　阿难。这些空中狂花，不是从虚空中来的，也不是从眼睛里出现的。</p><p>　　如果是来自虚空，那么当你的眼睛不再疲劳，看不到狂花的时候，狂花去了哪里呢？它不能钻到你的眼睛里去，因为它来自虚空，所以也只能回到虚空中去。虚空如果能出能入，虚空就成实体了。如果虚空是实体，怎么还能容纳狂花在其中生灭呢！这就如同你阿难不能再容纳一个阿难一样。</p><p>　　阿难。如果是眼睛里出现的，那么它消失的时候，也应该回到眼睛里。如果狂花有见性，它回到眼里的时候，你就应该能看到自己的眼睛。如果狂花没有见性，而眼睛有见性，那么它回到眼睛里的时候，你的眼睛就应该还能看到狂花，又怎么会消失呢！</p><p>　　而且，如果狂花是实体，那么看到狂花的眼睛，就应该是清静的，又怎么能叫‘眼花’呢！</p><p>　　所以，色阴本来虚妄，不是因缘，也不是自然。”</p><p>　　这是世尊，按着当时人的知识水平，从逻辑的角度来解释的。空中的狂花，是幻化出来的。世尊以狂花为例，说明我们所见的一切色相，都像空中狂花一样，虚妄不真。你找不到它的来源，找不到它的去处。就是它存在的时候，你也找不到它的存在的实体。</p><p>　　现在的科学研究发现，世间万物，都是由原子分子构成。只是因为原子的内部结构不同，和原子间的结合方式不同，才形成了千差万别的不同物质。原子是由原子核和核外电子构成。原子核又是由质子和中子构成。质子和中子呢，又是由什么构成？构成这个构成的，又是什么？我们可以这样无限地追问下去。到最后剩下的是什么，只能是虚空。因为只要不是虚空，我们就还可以再分。当分到不能再分的时候，剩下的就只能是虚空。</p><p>　　色相怎么能是虚空呢！如果色相是虚空，它怎么能叫色相呢？如果色相不是虚空，那构成它的又是什么呢？没有构成，又怎么可能成为色相呢；有个构成，它就可以分解。当分到不能再分的时候，就只能是虚空。</p><p>　　用数学来解释这个事情，则更加直观。我们都知道，把一个东西平均分成几份，在数学上用除法。除法也可以表达成分式。如果把要分解的个体用1来表示，把分解的次数用x来表示，那么分解的这个动作，就可以表示为1/x。我们要把这个个体无限地分解下去，x的取值，就是无穷大。那么，把一个个体无限地分解，看看它最后到底是什么，这个过程，用数学语言来描述，就表达为：对1/x，当x趋于无穷大的时候，求它的极限。这是一个最基本的极限问题，大家都知道，答案是0。</p><p>　　0就是什么都没有。所以数学给我们答案，就是：“把一个物体进行无限地分解，最后得到的，是什么都没有的。”所以，数学更直观地证实了我们的结论：一切色相，本来就没有实体，终究是虚妄的。</p><h3>　　受阴虚妄</h3><p>　　“譬如有人，手足安适，身体调和，几乎感觉不到自己的存在。忽然无缘无故地举起两手，互相摩擦，于是有了冷热滑涩等感觉。受阴也是这样。</p><p>　　阿难。这个虚幻的触觉，不是从虚空而来的，不是从手掌中产生。</p><p>　　如果是从虚空而来，既然它能触到手掌，也应该能触到身体。虚空不可能有选择地来触啊！</p><p>　　若是手掌产生的，不应该等到合掌的时候才有啊！而且，如果确实有‘受阴’这个东西在合掌的时候产生，当手掌分开的时候，它就应该还在。既然存在，身体就应该能感觉到它的出入。它在体内的往来，身体也应该一直能感觉到。又怎么能只在接触的时候，才发现它的存在呢！</p><p>　　所以，这个触觉，也是虚妄的。不是因缘而生，也不是自然而有。”</p><p>　　科学认为，触觉是外物接触到皮肤，刺激皮肤内的触觉神经，产生神经冲动。冲动信号通过神经传递到大脑，最后由大脑产生触觉。如果说大脑就是产生触觉的主体，那么死人也有大脑，也有神经，死人有没有触觉呢？如果有，怎么能叫死人呢；如果没有，又怎么能说是大脑产生的触觉呢！可见，从科学的角度来看，受阴也是虚妄的。</p><h3>　　想阴虚妄</h3><p>　　“阿难，譬如有人，谈酸梅的时候，口中就会产生口水。想着踏在悬崖边，脚底就会酸涩。想阴也是这样的。</p><p>　　阿难，产生口水的这个‘酸’的念头，是从哪里来的呢？它不是酸梅产生的，也不是从嘴里进去的。</p><p>　　如果酸梅有‘酸’的念头，酸梅就应该自己来说，用不着等别人来说。如果是嘴产生的，就应该是嘴听到有人谈论酸梅，又怎么需要耳朵呢！如果是耳朵听到后，产生了酸的念头，为什么耳朵不流口水呢！踏悬崖的反应，也是一样的道理。</p><p>　　所以想阴是虚妄的，不是因缘和自然性。”</p><p>　　想阴，在科学的语言中，叫“思维”。现代科学认为，思维是大脑的产物。那么死人也有大脑，死人也能思维吗。如果能，怎么能说他死了呢；如果不能，怎么能说大脑产生的思维呢！所以，从科学的角度来看，想阴也是虚妄的。</p><h3>　　行阴虚妄</h3><p>　　“阿难。譬如瀑布的流水，波浪相续，前扑后继。行阴也是这样的。阿难，这种流动性，不是虚空所生，不是因水而有，不是水本身的属性，又不离开虚空和流水。</p><p>　　阿难。如果这个流动性是虚空所生，那么十方无尽的虚空，就都成为波浪，整个世界就被淹没了。如果是因水而有，水不再是水，而成了流动，那么构成瀑布的又是什么呢？如果是水本身的属性，那么静止时的水又是什么呢？如果离开了虚空和水而能存在，那么虚空无处不在，流动又怎么可能跑到虚空之外呢呢！如果没有水，又是谁在流动呢？</p><p>　　所以行阴也是虚妄的，不是因缘和自然性。”</p><p>　　世尊以瀑布的流动性为例，来解释行阴的虚妄。瀑布的流动，找来找去，也找不到这个流动到底在哪里。所以行阴也是这样，根本找不到一个行阴的所在。</p><p>　　行阴，用现代的语言来讲，就是运动。科学把运动定义为“物质存在的状态”。下面，我们根据科学定义，找一找这个“运动”的所在。那么，这个运动是虚空所生，还是因物质而有，是物质本身的属性，还是离开物质和虚空而独立存在的呢？</p><p>　　如果是虚空所生，整个虚空就都应该在做这个运动，为什么只有这单独的个体在动呢？如果跳是虚空所生，整个世界就都应该在跳；跑是虚空所生，整个世界就都应该在跑，又怎么可能单独一个人在跑，在跳呢？如果是因物质而有，物质既然成了运动，那么运动着的，又是谁呢？如果说运动是物质本身的属性，那么静止的又是谁呢？如果离开虚空而独立存在，那么虚空遍满一切处，其大无外，运动还能跑到哪里去呢？如果说离开物质而单独存在，那么运动着的，又是谁呢？</p><p>　　找来找去，也找不到这个运动，所以，运动本身也是虚妄的。</p><h3>　　识阴虚妄</h3><p>　　“阿难。譬如有人，用塞子塞住瓶的两个口，然后带着一个空瓶子，远行千里，到他国去叛卖瓶内的虚空。这瓶子里的虚空，既不是从别处带来的，也不是从本地装进去的。如果是从别处带来的，那么，既然把虚空装走了，在原来的地方，就应该少了一块虚空；如果是从本地装进去的，那么，打开瓶塞，就应该有虚空流出来。虚空怎么可以移动呢！所以，阿难。识阴也是虚妄的，不是因缘和自然性。”</p><p>　　世尊在这个例子中，以虚空比喻真如本性。以瓶子中的虚空，比喻迷失的个体。</p><p>　　真如自性本来明了。而我们却背离了本有的明了，一定要寻求一个内容作为明了的寄托。这个依内容而存在的明了，我们就叫做“无明”。明了对内容坚固的寄托，我们就称为“执着”。“<a href=\"https://www.guang5.com/rmgjc/wozhi.html\" class=\"keylink\" target=\"_blank\">我执</a>”就是执着于我相。“法执”就是执着于<a href=\"https://www.guang5.com/rmgjc/faxiang.html\" class=\"keylink\" target=\"_blank\">法相</a>。</p><p>　　一切的一切，本来无一不是真如本性。就像虚空一样，浑然一体。</p><p>　　而我们却由于无明，被我执和法执这两个执着，把自己塞在了色身当中。就如同用两个塞子，把虚空塞在瓶子中一样。</p><p>　　我们被塞在色身中，以为这就是我了，整日东游西逛，洋洋自得。今天吃点，明天送点。今天挣点钱，明天花点钱。以为自己真的得到了什么了，失去了什么。这就好比把虚空塞在瓶子里，游走叛卖一样，以为到了另一个地方，就是另一个虚空了。</p><p>　　殊不知不论哪里的虚空，都是一个虚空。盆里的也好，碗里的也好，屋里的也好，院里的也好，其实都是一个整体，根本无法分割。万事万法也是这样，其实都是一个真如本性。无论形状怎样千姿百态，无论性质怎样千差万别，无不同是“如来藏妙真如性”。</p><p>　　所以，在湛然清静，周遍圆满的真如本性中，硬是去分别你我是非的识阴，也是虚妄的。\t\t</p></div>"
    },
    {
        "title": "第六章 六入虚妄",
        "author": "",
        "date": "",
        "html": "<div class=\"B1_text\"><h2>第六章 六入虚妄</h2><p>　　从这一章开始，如来将从身心世界的交互的角度，来说明我们的一切感知都是虚妄的，一切的本体，都是如来藏妙真如性。感知的内容，来自于六种渠道——眼、耳、鼻、舌、身、意。这六种渠道称为“六入”。世尊分别讲述了这六入的成因，然后就开始寻找这六入的来源。找来找去，却发现根本也找不到一个源头，所以，这六入最终都是虚妄的。犹如空中狂花，都是病目中的幻化而已。其本体都是如来藏。</p><p>　　“阿难。为什么说六入也是如来藏妙真如性呢？”</p><h3>　　眼入虚妄</h3><p>　　“阿难，前面说的那个看花了眼的人，他能见的眼和所见的狂花，都是妙觉明心中，类似于瞪久发花产生的疲劳现象。只因为明、暗这两种虚妄的尘相，在其中引发了见。见吸收这些尘相，就成为见性。离开明暗这两种妄尘，这个见就根本不存在。</p><p>　　阿难。要知道，这个见，不是从明暗而来，也不是眼根所出，也不是虚空所生。为什么呢？</p><p>　　如果是因明而生，就应该见不到暗；如果是因暗而生，就应该见不到明。如果是眼根所生，而眼根没有明暗，没有明暗就没有见。如果是虚空所生，那么虚空在看到种种尘相的同时，也应该能看到你的眼啊！而且，如果是虚空所生，那应该是虚空在看。虚空的见又怎么会成为你的眼见呢！</p><p>　　所以，这个见根本就是虚妄的，不是因缘而生，不是自然而有。”</p><p>　　我们背离了湛然周遍、正觉圆满的真如自性，硬要去寻求一个明了的内容。这一寻求，真如自性中，就幻化出明、暗之相，由此一步一步，产生了眼入之见。</p><p>　　按现代的科学观念来理解，我们看到色相，是因为物体表面的反射光照到眼睛上，通过眼球的折射，刺激眼底的视神经产生神经冲动。这些神经冲动，以电脉冲的形式传递到大脑。再由大脑把这些信号整合，产生认知，我们才“看”到这个物体。</p><p>　　所以，我们的见，最终不过是大脑产生的一个信号而已。而大脑是由细胞构成的。细胞是由原子构成的。原子是由什么构成的呢？这样无限地推下去，最后得到的，只能是虚空。可见，大脑本身就是虚妄的。它所产生的视觉，又怎么可能真实呢！</p><h3>　　耳入虚妄</h3><p>　　“阿难。譬如有人，用手迅速塞住耳朵。时间久了，耳根发生疲劳，头脑中就会有嗡嗡声。耳根和这个疲劳而引起的声相，都是我们妙觉心中产生的，类似于‘瞪久发花’的现象。因为动静这两种妄尘引发了闻，闻再进一步吸收这两种尘相，就产生了听闻性。所以闻一旦离开动静这两种尘相，就根本不存在。</p><p>　　这个闻，不是从动静而来，不是从耳根所出，不是凭空而生。为什么呢？</p><p>　　如果是从静中来，静中没有响动，闻性中就应该只有安静，而没有声响。同样道理，如果是从动中而来，动中没有静，我们的耳朵，就应该没有片刻安宁。如果是从耳根所生，耳根没有动与静，没有动静就没有闻。如果是凭空所生，虚空如果能听了，也就不是虚空了。而且，如果闻性是虚空所生，又怎么会成为你的闻性呢！</p><p>　　所以，耳闻也是虚妄的。”</p><p>　　世尊用“手捂耳朵，脑中就有嗡嗡声”这个比喻，来说明听觉产生的过程。本来没有什么声响，一切都是清清静静的。手无端地捂住耳朵，耳朵被捂得发生疲劳后才产生了嗡嗡声。听闻性也是这样。自性本来清清静静的，因为无明妄动，而结出了动、静这两种妄尘，然后一步步形成了听闻性。而无明本身就是真如自性中，类似于空中狂花一样的幻相，所以依赖于无明而生的听闻性，不是虚妄又能是什么呢！</p><p>　　现代科学发现，我们听到声音，是因为声波刺激到耳膜，引起耳膜的震动。震动以神经冲动的形式传递到大脑，于是产生了听觉。</p><p>　　同样，听觉最终也是大脑内的一个神经信号。大脑都是虚妄的物质构成的，依赖于大脑而存在的听觉又怎么真实得了呢！</p><h3>　　鼻入虚妄</h3><p>　　阿难。譬如有人，猛抽鼻子，抽得久了，鼻子发生疲劳，就会有凉的感觉。然后就能感觉到通塞虚实，乃至闻到香臭的气味。</p><p>　　鼻根和这个因疲劳而引起的嗅觉，都是我们妙觉心中产生的，类似于“眼睛瞪久发花”的现象。只因为通塞这两种妄尘，引发了“闻”，闻再进一步吸收这两种尘相，就成为了“闻性”。所以，这个闻离开通塞这两种妄尘，根本就不存在。</p><p>　　要知道，这个闻，不是从通塞而来，不是鼻子所出，也不是凭空而生。为什么呢？</p><p>　　如果是从通而来，怎么能知道塞呢；如果从塞而来，就不能知道通，又怎么能闻到香臭呢！如果是从鼻根所生，鼻根没有通塞，这个闻又是从何而来的呢！如果是虚空所生，就应该能闻到你的鼻子。而且虚空的闻，又怎么会跑到你的鼻子里呢！</p><p>　　所以，要知道嗅觉是虚妄的，不是因缘而生，不是自然而有。”</p><p>　　鼻子本来没什么感觉。突然无端地猛抽，疲劳之后才能闻到气味。闻性也是这样的。真如自性本来湛然清净。然而，就像眼睛瞪久了就会看到狂花一样，真如自性中，幻化出了无明的狂花。无明结暗成色，于是有了通塞之相，进而形成闻性。这一切都是无明的幻化。</p><p>　　科学认为：气味物质刺激嗅觉细胞，使嗅觉细胞产生神经冲动。神经冲动通过神经系统，把味觉信息传递到大脑皮质特定的区域，最终形成嗅觉。</p><p>　　可见，嗅觉的产生最终也是依赖于大脑。而大脑的物质性，决定了大脑本身就是虚妄的，所以嗅觉也同样是虚妄的。</p><h3>　　舌入虚妄</h3><p>　　“阿难。譬如有人，用舌头舔自己的嘴唇。舔得久了，舌头发生疲劳。这个人如果有病，舌头就会有苦味；如果没病，就会微微有甜的味道。不去舔舐的时候，舌头就是淡然无味的感觉。</p><p>　　舌头和这些因为疲劳而引起的味觉，都是我们妙觉心中产生的，类似于“眼睛瞪久发花”的现象。因为甜苦和淡这两种妄尘，引发了味，味再进一步吸收这些尘相，就成为味性。这个味性，离开甜苦和淡，根本就不会存在。</p><p>　　阿难。这个味，不是从甜苦而来，不是因淡而有，也不是凭空所生。为什么呢？</p><p>　　若是从甜苦来，怎么能知道淡呢！若是从淡而有，甜苦就无从感知，何况其他味道。若是从舌根而生，离开甜淡，味道就不会存在。若是凭空而生，那应该是虚空知道味道，而不是你的嘴。虚空的感知，怎么会进了你的嘴呢？</p><p>　　所以要知道，舌入是虚妄的，不是因缘而生，不是自然而有。”</p><p>　　味性的产生，就像自己舔嘴唇那样，舔得久了，就会产生味道。如空中看久了会结出狂花一样，妙觉心中，结出了甜苦和淡这两种妄尘，甜苦和淡引发了味。味再吸收甜苦和淡，就形成了味性。</p><p>　　味觉的产生，科学解释为：物质溶解在口中后，与分布在舌头表面的味觉细胞发生化学反应。这个反应因释放能量，而产生电脉冲。电脉冲信号沿着神经系统传到大脑后，产生味觉。</p><p>　　所以，同样的，因为大脑本身就是虚妄的，所以味觉也终究是虚妄的。</p><h3>　　身入虚妄</h3><p>　　“阿难。譬如有人，用一个冰凉的手，去摸暖和的手。如果凉多，暖手就会变凉；如果热多，凉手就会变热。这种因为两手相合而产生的触觉，和两手分开而产生的离感，也都是接触久了发生疲劳所产生的。</p><p>　　身体和这个触觉，都是妙觉心中产生的，类似于“瞪久发花”的现象。因为离合这两种妄尘，引发了触，触再吸收这两种妄尘，就形成触性。所以，这个触，离开离合，根本就没有自体。</p><p>　　阿难。要知道，这个触，不是从离合而来，不是因身体而有，也不是凭空所生。</p><p>　　若是从合而来，离就应该觉察不到；从离来也是一样的道理。如果是身体所生，没有离合，触就不会存在！若是凭空所生，虚空的触觉觉，你又怎么会知道呢！</p><p>　　所以要知道，身入也是虚妄的。不是因缘所生，不是自然而有。”</p><p>　　世尊用手做比喻，让我们明白触觉形成的原因。一冷一热的两只手相握手，手之所以能感知到冷热、离合，是因为两手接触久了，发生疲劳所致。触觉也是这样，妙觉心中，就像疲劳的眼睛看到空中狂花一样，产生了离、合之相。离合引发了触，触再吸收离合，所以产生了触觉。</p><p>　　现在一般认为，触觉是由分布在皮肤真皮层里的触觉感受器，在接受外界的机械刺激后，产生神经冲动，神经冲动以电脉冲的形式传递到大脑而产生的。而大脑本身就是虚妄的，所以触觉也只能是虚妄的。</p><h3>　　意入虚妄</h3><p>　　“阿难。譬如有人，疲劳了就会睡觉，睡够了就会转醒。对种种尘相都能够明了，当然有时也会有所遗忘。在这种生、住、异、灭中，吸收往昔的习气，前后不相逾越，而形成意根。这个意根和尘劳，都是妙觉心中产生的，类似于“瞪久发花”的现象。只是因为生灭这两种妄尘，汇集了能够觉知的意，然后吸收眼、耳、鼻、舌、身这五根所返回来的信息，而形成意性。</p><p>　　阿难。要知道，这个能够觉知的意，不是从醒寐生灭而来，不是从意根所出，也不是凭空而生。为什么呢。</p><p>　　如果是从醒来，寐的时候，意已经随醒而去了，又怎么能知道寐的存在呢。若是因生而有，灭的时候，意已经随生而去了，又是谁能经历的灭呢。若是从意根所出，意根中没有醒寐生灭，意又从何而来呢！如果是凭空所生，那应该是虚空知道，跟你又有什么关系呢！</p><p>　　所以，要知道，意入是虚妄的，不是因缘所生，不是自然而有。”</p><p>　　对于<a href=\"https://www.guang5.com/rmgjc/yishi.html\" class=\"keylink\" target=\"_blank\">意识</a>来说，睡醒就是“生”，此时，意识从无到有。能思忆就是“住”，意识开始行使功能。开始遗忘就是“异”，这时，意识逐渐发生变异，变得不清楚了。睡着了就是“灭”，意识不再行使功能，而是进入睡眠状态。在生、住、异、灭这四种状态中循环，吸收尘劳中的习气为内容，这样就形成了意识。</p><p>　　现在认为，意识是大脑的产物，是大脑神经活动的结果。而大脑本身就是虚妄的，意识又如何能真实呢！\t\t</p></div>"
    },
    {
        "title": "第七章 十二处虚妄",
        "author": "",
        "date": "",
        "html": "<div class=\"B1_text\"><h2>第七章 十二处虚妄</h2><p>　　十二处指的是六根和六尘。一般认为，眼、耳、鼻、舌、身、意这六根，面对色、声、香、味、触、法这六尘，而产生了心理世界的全部内容。那么，这十二处到底在哪里呢？这一章里，世尊从六根找到六尘，甚至找到虚空，到处都找不到这十二处的来源。所以，十二处本身也是虚妄的，本来都是如来藏。</p><p>　　佛接着解释道：“阿难，为什么说十二处也是如来藏妙真如性呢？”</p><h3>　　见与色，两处虚妄</h3><p>　　“阿难。你看这园中的树林和泉池庭院，到底是这些色相产生了我们的眼见，还是我们的眼根产生了这些色相呢？</p><p>　　如果是眼见产生了色相，那么虚空没有色相，就不是眼见所生。不是眼见所生，就应该看不见虚空。看不见我们怎么知道那是虚空呢！如果是色相产生了眼见，那么虚空没有色相，就不能产生眼见。没有眼见我们怎么知道那是虚空呢！</p><p>　　所以，要知道，眼见与色空，都没有一定的处所，都是虚妄的。不是因缘所生，不是自然而有。”</p><p>　　现代的解剖学发现，我们看到色相，是因为物体的反射照到眼睛上，通过眼球的折射，在眼底的视网膜上呈相。视网膜上的感光细胞包括视杆细胞和视锥细胞。视杆细胞负责接收低分辨率的单色光，主要用于夜间的视觉；视锥细胞则负责接收高分辨率的彩色光，主要负责白天的视觉。它们把光转化成电信号，通过神经节细胞把神经信息进行编码，产生神经冲动。这些神经冲动传递到大脑的视神经中枢，形成视觉。</p><p>　　下面，我们简单了解一下神经冲动传递的过程：神经细胞的细胞膜上，有供粒子通过的通道。通常这些通道是关闭的。受到刺激后，这些通道就会张开。细胞膜内外液体中的离子，通过张开的通道发生流动，从而导致细胞膜内外出现电位差。这个电位差被称作“动作电位”。一个点的电位变化，会带动周围细胞的电位都发生变化。周围细胞再使它们临近的细胞产生电位变化。电位差就这样一步一步地传递开来，这就是神经冲动的传递过程。</p><p>　　可见，视觉的形成，就只跟两个因素有关，一个是来自色相物质的反射光，一个是体内与之呼应的神经冲动。那么，视觉到底是反射光呢，还是神经冲动呢？</p><p>　　如果是反射光，那么，同样的光照到门窗上，门窗是不是就有了视觉呢？门窗有了视觉，门窗就不是门窗了；门窗没有视觉，就说明视觉不是反射光。</p><p>　　如果是神经冲动，那么，同样的神经冲动在体内所有的神经中发生，怎么会单单只是视觉中枢的产生视觉呢！如果说神经冲动就是视觉，那么体内所有的神经，就都应该有视觉。这样一来，全身就都成眼睛了，人体就杂乱了。</p><p>　　不是光，也不是神经冲动，视觉还能是什么呢？找不到这个视觉，所以，说光和神经冲动产生视觉，终究是虚妄的。</p><h3>　　听与声，两处虚妄</h3><p>　　佛陀继续说：“阿难。你再听这祈陀园中，用斋前敲鼓，集会时撞钟，钟鼓的音声，前后相续。你说，是声音跑到耳朵里来呢，还是耳朵到声音那去？</p><p>　　如果是声音到耳朵里，好比我去室罗筏城乞食，那么在祇陀林就不会有我。声音也是一样，如果来到阿难的耳朵里，那么目健连、大迦叶就应该听不到。更何况一千二百五十位沙门，一听到钟声，就都来用斋。</p><p>　　如果说是耳朵跑到声音那儿去，好比我回到祇陀林中，那么室罗城就没有我了。同样道理，你听到鼓声，耳朵就已经跑到击鼓的地方去了，钟声就应该听不到。更何况其他种种声响，如果耳朵不过去，也应该听不到。</p><p>　　所以，要知道，听和声，都没有一定的所在。所以听与声，两处都是虚妄的。不是因缘所生，不是自然而有。”</p><p>　　二千年前的人，不知道声音传播的原理。这是世尊按着当时人们的知识水平来讲的。</p><p>　　现在我们都知道，声音的传播，是因为物体发生震动，在分子间作用力的带动下，使周围空气的分子产生同频率的震动。这个震动是以震源为中心，以每秒340米的速度，向四面八方同时传播的，就像水波那样一层层荡漾开去。所以，同一个声音，四面八方所有的人都可以听到。</p><p>　　震动经过耳廓的收集，通过外耳道，引起耳膜的震动。耳膜连接着听骨链，由听骨链把这个震动传递到内耳的耳蜗中。耳蜗的形状像一个海螺，里面充满了淋巴液。淋巴液发生同频率的共振后，使耳蜗壁上毛细胞和盖膜之间的相对位置发生变化，从而刺激毛细胞产生电位差。由电位差形成神经冲动，通过听觉神经系统传入大脑皮层的颞叶听觉中枢，于是便产生了听觉。</p><p>　　尽管经历了复杂的过程，我们不难看出，听觉的形成，最终也就决定于两个因素：一个是由空气震动形成的声波，一个是由电位差形成的神经冲动。</p><p>　　那么，听到底是声波呢，还是神经冲动呢？</p><p>　　如果是声波，那么同样的声波，同时传递给了周围所有的物质。花草树木，亭台楼阁都受到了声波的刺激。如果说声波就是听觉，那么花草树木，亭台楼阁就都有了听觉。这样一来，世界就杂乱了。</p><p>　　如果说是神经冲动，那么同样的动作电位，此起彼伏地在体内所有的神经上传递，形成了同样的神经冲动。这样一来，全身就都产生了听觉。怎么会单单只有听觉中枢产生听觉呢！</p><p>　　不是声波和也不是神经冲动，所以声音和听觉也终究是虚妄的。</p><h3>　　香与闻，两处虚妄</h3><p>　　“阿难，你闻到这炉中的<a href=\"https://www.guang5.com/sushi/yaoshan/tanxiang/\" class=\"keylink\" target=\"_blank\">檀香</a>了吧！这种香如果烧一铢，室罗筏城四十里之内都能闻到。你说，这种香味，是旃檀木生的，还是你的鼻子生的，还是凭空所生呢？</p><p>　　阿难。如果是鼻子所生，鼻子又不是旃檀，怎么会有旃檀的香气呢！而且，既然说是闻到香气，鼻子吸入的才叫闻，鼻子产生的，怎么能叫闻呢！</p><p>　　如果是生于虚空，虚空一直存在，这种香也应该一直存在，为什么一定要烧这旃檀木才能闻到香味呢！</p><p>　　如果是旃檀木所生，檀木燃烧后变成烟，鼻子因为接触到烟才闻到香气。而香烟升空后，并没有飘散多远。何以四十里之内的人，都能闻到香味呢？</p><p>　　所以要知道，香与闻，都没有一定的处所，所以香和闻，都是虚妄的，不是因缘所生，不是自然而有。”</p><p>　　科学研究发现，我们之所以能闻到气味，是因为气味物质的颗粒粘着在嗅觉细胞上，引起细胞膜中的G蛋白产生变化，从而形成环磷酸腺苷。环磷酸腺苷能激活离子通道，使细胞产生动作电位，从而形成神经冲动。神经冲动以电脉冲的形式传送到嗅球。嗅球中有2000多个球囊。在这里，来自同一细胞的信息被汇集到同类的球囊中，然后由球囊激活僧帽细胞。每个僧帽细胞只由一个球囊激活。这样，表达特定味道的信息能得以维持。最后，由僧帽细胞，通过神经系统，把味觉信息传递到大脑皮质特定的区域，最终形成嗅觉。</p><p>　　那么从科学的角度来看，嗅到底是气味呢，还是神经冲动呢？</p><p>　　如果说是气味，那么同样的气味，飘散到你鼻孔的同时，也飘到了你的衣服上，头发上和皮肤上。如果说嗅觉是气味产生的，那么衣服、头发和皮肤也都有嗅觉了吗？这当然不可能。</p><p>　　如果说是神经冲动产生的，那么，同样的神经冲动，发生在身体所有的神经上，难道全身就都有嗅觉了吗？如果全身都成了鼻子，身体还是身体了吗？</p><p>　　所以外界的气味和自身的嗅觉，终究是虚妄的。</p><h3>　　尝与味，两处虚妄</h3><p>　　“阿难。你常在早上和中午，随大众外出行乞。有时会遇到酥酪、醍醐这些上等的美味。你说，这些味道，是生于空中，还是生于舌头，还是在食物中产生的？</p><p>　　阿难。如果是舌头产生的，你的口中只有一个舌头。当你吃酥的时候，舌头变成酥的味道，再吃石蜜，舌头就不应该有变化。如果没变化，还是酥的味道，那你怎么能知道石蜜的味道呢！如果说，再吃石蜜就变成石蜜的味道了，一个舌头又怎么能有多个味道呢！</p><p>　　如果是食物产生的，食物又没有感知，怎么能知道自己的味道呢！而且食物如果知道了，那是食物的感知，又怎么会成为你的味觉呢！</p><p>　　如果是虚空产生的，那虚空就有味道了。你尝尝虚空，到底是什么味道？如果是咸味，虚空周遍，咸到你的舌头，也应该咸到你的脸。那么这个世界上的人，就跟海里的鱼一样了。而且，虚空常在，咸味就应该常在，这样又怎么能知道有淡呢！不知道有淡，就不会懂得咸。这样一无所知，又怎么能叫味觉呢！</p><p>　　所以，要知道，舌与尝，都没有一定的处所。尝与味二者都是虚妄的，不是因缘所生，不是自然而有。”</p><p>　　现在一般认为，我们所能直接感受到的味道，有甜、咸、苦、酸和鲜五种，其他味道是由这五种味道合成的。感受味觉的器官叫味蕾。它主要分布在舌头表面的乳头中，外面有一层盖细胞，里面是细长的味觉细胞。这些味觉细胞的上端与呈味物质接触，下端与神经纤维相连。每个味蕾都有一个味孔。呈味物质溶解后，从味孔进入味蕾，刺激味觉细胞。咸和酸靠电位变化引起神经冲动；甜、苦和鲜用化学反应引起神经冲动。最后，由神经系统把这些冲动传递到大脑味觉中枢，形成味觉。</p><p>　　同样的，味觉也是由呈味物质，经过一系列的作用，最终产生神经冲动形成的。</p><p>　　那么味到底是呈味物质呢，还是因为神经冲动呢？</p><p>　　如果说是呈味物质的溶化而产生味觉。那么同样的物质，溶化在水里，水就有味觉了吗？溶化在石头上，石头也有了味觉？这显然说不通。</p><p>　　如果说是神经冲动产生了味觉，全身的神经，都可以产生神经冲动，那么全身就都有味觉了？我们吃了一块糖，难道脚上也有甜味？这不是无稽之谈吗！</p><p>　　所以外界的味道和自身的味觉，终究是虚妄的。</p><h3>　　触与身，两处虚妄</h3><p>　　“阿难。我令你们每天三摩其头，提醒自己‘守口摄意身无犯，莫恼一切诸有情。’阿难，感知这个触觉的主体，是手还是头呢？</p><p>　　如果是手，为什么头也有感觉；如果是头，为什么手又有感觉。如果手和头，都是触觉的感知主体，那么阿难，你就应该有两个阿难了。如果手和头，是同一个触觉。那么手和头就应该是一体的。既然是一体，那就无所谓‘触’了。</p><p>　　所以，身和触，都没有一定的处所。二者都是虚妄的。不是因缘所生，不是自然而有。”</p><p>　　皮肤内感受触觉的器官是触觉小体。触觉小体呈卵形，小体内有许多横列的扁平细胞。神经纤维的轴突分成细枝，盘绕在扁平细胞间。皮肤受到外界的接触、挤压、冷热等刺激后，在触觉小体内产生神经冲动，通过神经系统的层层传递，最后到达大脑，形成听觉。</p><p>　　那么，触到底是刺激呢，还是神经冲动呢？</p><p>　　如果是刺激，同样的刺激，在其他物质上一样发生。你去推门，你受到了门的压力，门也一样受到了你的压力，那么门也有触觉吗？门若有触觉，就不是门了。</p><p>　　如果是神经冲动，同样的神经冲动，发生在身体所有的神经上，难道你推一下门，后背也能感到门的压力吗？</p><p>　　所以，外界的刺激和自身的感受，终究是虚妄的。</p><h3>　　意与心，两处虚妄</h3><p>　　“阿难。你的意识之中，常有或善或恶，或者非善非恶的思维。这些思维，是心本身的呢，还是离开心之外，别有处所呢？</p><p>　　如果就是心本身，那么思维就不是外尘，不是心所反映的，怎么会有个独立的所在呢！</p><p>　　如果离开心以外，还有一个处所，那么，这个心外的思维，是有知呢，还是无知呢？如果有知，那就是心了。不是你的心，也不是外尘，自然就是他人的心了。因为如果还是你的心，又怎么会在你之外，而不与你合一呢！如果无知，那么，它既不是色声香味，离合冷暖，又不是虚空，它到底在哪里呢？不能说，这人世间，还有虚空之外吧！</p><p>　　而心本身并不是外尘，又怎么会有个处所呢！</p><p>　　所以，要知道，思维和心，都没有一定的所在。意识和思维，都是虚妄的，不是因缘所生，不是自然而有。”</p><p>　　现在认为，意识和思维，是脑的产物。构成大脑的基本单位是神经元和胶质细胞。每一个神经元通常拥有几百个，甚至几千个突触与其他神经元联结。突触的联结型式是复杂多样的，神经元与神经元之间，以电的和化学的方式形成神经冲动，相互传递信息。整个脑就是一个巨大的神经网络系统。</p><p>　　尽管拥有复杂的结构和功能，但是，大脑完成意识和思维的活动，最终也是通过神经冲动。</p><p>　　如果说，意识和思维就是神经冲动。那么同样的神经冲动，发生在体内所有的神经上，难道说全身就都能思考了吗？难道我们能用脚来想问题？</p><p>　　所以说，意识和思维，都是虚妄的。\t\t</p></div>"
    },
    {
        "title": "第八章 十八界虚妄",
        "author": "",
        "date": "",
        "html": "<div class=\"B1_text\"><h2>第八章 十八界虚妄</h2><p>　　在这一章中，世尊探讨了由六根面对六尘，所形成的六种感觉世界。这些感觉世界到底在哪里呢？在六根中？没有所对应的尘相，六根就不会有感觉。在感官中？这些感官都是身体的组成部分，而身体对应的只是触觉。在尘相中？尘相却并没有觉知的能力。那么，是根与尘共同产生的？根与尘，一个有知，一个无知，属性不同，又怎么能形成同一个感觉世界呢？找来找去也找不到这个感觉的所在。所以，这六种感觉终究是虚妄的。依赖于感官而存在的六根与六尘，也就都成了虚妄。</p><p>　　如来继续说：“阿难，为什么说，十八界本是如来藏妙真如性呢！</p><h3>　　眼<a href=\"https://www.guang5.com/rmgjc/sejie.html\" class=\"keylink\" target=\"_blank\">色界</a>虚妄</h3><p>　　阿难。你知道，因为眼根和色相，而产生了视觉。那么，视觉是眼根所生，以眼为界呢，还是色相所生，以色为界呢？</p><p>　　阿难，如果是眼根所生，没有色与空，就没有可看的东西，纵使有识，又有什么用呢！你的见又不是青黄赤白，没有长短方圆。任何表示都没有，世界要从哪里安立呢？</p><p>　　如果是色尘所生，那么，在色尘不发生变化的时候，你面对虚空，虚空中没有色尘，这时你应该没有视觉，你又是怎么见到虚空的呢！</p><p>　　如果色尘发生改变，你也能够知道发生了变化。如果你的视觉不随着变迁，你又怎么能知道色尘发生了改变呢？色相变，视觉就变，自然无法形成界相；不变又不能知道虚空的所在。</p><p>　　如果是眼根和色尘共同所生。眼根和色尘是不同质的，眼根有识，色尘无识，由他们产生的视觉世界也必定不同质。二者相合，中间就必定会有缝隙；二者相离，彼此所产生的视觉界则必定各回本源。体性杂乱，如何成界！</p><p>　　所以，要知道，眼根、色尘、以及视觉世界，三处都是虚妄的，不是因缘所生，不是自然而有。”</p><p>　　佛陀的论述，此时由点及面。不但能见的眼，所见的物，乃至整个视觉世界，都是虚妄不实的。</p><p>　　那么，从科学的认识角度来看，视觉世界是什么呢？</p><p>　　现在的解剖学发现，对事物形成认识，其实是丘脑的功能。丘脑神经元中的遗传信息具有觉知的特性。丘脑能够将各个遗传信息合成为一个特殊的信息集合，这个信息集合就是对事物的觉知，我们称之为丘觉。</p><p>　　丘觉一般不会随意合成发放，特别是关于客观事物的丘觉，需要样本的激活才能由丘脑合成。样本的产出是大脑的功能。大脑通过对来自视、听、嗅、尝、触等信息的分析，产出需要的样本，发送到丘脑，激活丘脑使之合成一个相应的丘觉。丘觉再发放到大脑的联络区，点亮样本，从而产生意识。</p><p>　　简单来说，眼睛就像一个摄像头，把看到的景物转换成信号，输送到大脑。大脑就像一个处理器，把这些信号合成为样本，在大脑的联络区显示出来。最后由丘脑通过联络纤维，把识别这些样本的丘觉发放到联络区，点亮样本，我们才算“看”到了。所以，视觉世界，最终就是在大脑的联络区形成的。</p><p>　　这样看来，视觉世界的形成过程，不过是一些信息在神经系统中处理的过程。先由眼睛把光信息转换成能在神经系统中传递的电信息，再由大脑把这些信息加工为成形的样本，最后由丘脑发放代表意识的遗传信息，点亮这些样本，形成视觉世界。</p><p>　　如果说，代表色相的电信息--样本，代表眼根的遗传信息--丘觉，，都不过是一些信息而已，那么，我们把同样的信息处理过程，在计算机中实现，是不是计算机就有了视觉呢？如果有了视觉，那计算机还是机器了吗；如果没有，怎么能说视觉就是信息呢？</p><p>　　所以说，视觉就是信息，终究是说不通的的。</p><h3>　　耳声界虚妄</h3><p>　　“阿难。你知道，耳朵听到声音，而形成听觉世界。这个听觉是耳根所生，以耳根为界，还是声音所生，以声音为界呢？</p><p>　　阿难。若是耳根所生，没有动和静，耳根都不会存在，又怎么会有听觉，形成听觉世界呢！</p><p>　　如果是耳朵所生，耳朵属于身体，对应的是触觉，更不会形成听觉界。</p><p>　　如果听觉是声音所生。而声音没有听闻性。没有听闻性，又怎么会有声相呢！</p><p>　　假设声音也有了听闻性，声音也能听到声音，那么声音所听到的声音又是谁呢？如果就是声音本身，能听与所听根本就是一个，又怎么会形成能听和所听两个主体呢；如果不是声音本身，那么声音所听到的声音，又是谁呢？</p><p>　　所以，可见耳根、声尘以及所形成的听觉世界，三者都是虚妄的，不是因缘所生，不是自然而有。”</p><p>　　同样的，从信息的角度来讲，声音通过耳的处理，由声波变成电信息。电信息以神经冲动的形式，经过重重处理，在大脑联络区形成样本。样本激活丘脑中的遗传信息，发放丘觉，最终在联络区形成听觉世界。</p><p>　　如果说听觉就是电信息和遗传信息，那么，同样的信息，我们在机器设备中实现，是不是这些机器就有听觉了呢？在人工智能领域，早已模仿了人体的感官，制造了无数的智能机器人。事实证明，无论多么尖端，多么精密的机器人，没有人的操纵，最终只能是一堆废铁而已。</p><h3>　　鼻香界虚妄</h3><p>　　“阿难。你知道，鼻子和香味，产生了嗅觉。这个嗅觉是鼻根产生的，以鼻根建立的嗅觉世界，还是香味产生的，以香味建立的嗅觉世界呢？</p><p>　　如果是鼻子所生，那么，你认为什么是鼻子呢？是这个肉质的鼻子呢，还是这个能产生嗅觉的知性呢？如果是肉质的鼻子，肉属于身体，而身体对应的是触觉，触觉又怎么会形成嗅觉世界呢；如果是能产生嗅觉的知性，那么，这个能知的主体又是谁呢？如果是这个肉质的鼻子，肉对应的是却是触觉；如果是鼻孔中的虚空，那么虚空知道，虚空就应该是你，如果虚空是你，那么你阿难，就应该是个无形无相的虚空，而不是这个肉身；如果是鼻子中的香气，那么香气知道，跟你的鼻子又有什么关系呢！</p><p>　　如果嗅觉是香味所生，比如眼有见性，这个见性就看不到眼睛。同样道理，香味有嗅觉，嗅觉就应该不知道香味。如果嗅觉知道香味，就应该不是香味所生；嗅觉不知道香味，嗅觉就没有知性。没有知性，就没有嗅觉世界。不知道香味，嗅觉世界就不是以香味建立的。</p><p>　　没有嗅觉世界，也就没有建立嗅觉世界的鼻根和香味。所以，要知道，鼻根，香味和嗅觉世界，也都是虚妄的。不是因缘所生，不是自然而有。”</p><p>　　鼻子把气味转化成电信号，通过层层处理，形成样本信息。样本点亮丘觉，最后在大脑的联络区形成视嗅觉世界。</p><p>　　我们知道，丘觉就是遗传信息的集合。那么，什么是遗传信息呢？遗传信息，就是指生物分子脱氧核苷酸--也就是DNA--中，碱基对的排列顺序。如果说DNA是生物体所特有的，是不能在钢铁之躯的机器人中复制的，那么，现在可以利用生物技术进行克隆。</p><p>　　如果克隆一个与我的丘脑，一模一样的丘脑。这个丘脑拥有我的丘脑所拥有的全部遗传信息。这时，如果说遗传信息就是最终的知觉，那么这个丘脑，就拥有了我的全部知觉，它不是我还能是什么？</p><p>　　而“我”这个概念，本来就是为了把“我”这个个体，与其他个体区分开来而存在的。如果我能被任意复制，那么到底哪一个才是我？这样一来，“我”就失去了存在的意义，我也就不称其为我了。</p><p>　　所以，说遗传信息就是知觉，最终只能得到一个自相矛盾的结论。</p><h3>　　舌味界虚妄</h3><p>　　“阿难。舌根和味道，产生了味觉。那么，味觉到底是舌根所生，是舌根产生的味觉世界；还是味道所生，是味道产生的味觉世界呢？</p><p>　　如果是舌根所生，那么<a href=\"https://www.guang5.com/sushi/shuiguo/ganzhe/\" class=\"keylink\" target=\"_blank\">甘蔗</a><a href=\"https://www.guang5.com/sushi/shuiguo/wumei/\" class=\"keylink\" target=\"_blank\">乌梅</a>、黄莲石盐、细辛姜桂，就都没有味道了。舌根产生了一切味道，那么品尝味道的又是谁呢？舌头总不能自己品尝自己吧！</p><p>　　如果是味道产生的，那么品尝味道的就是味道自身了。味道却不能自己品尝自己，就如同舌头不能自己品尝自己一样。</p><p>　　而且，一切味道，如果不是由同一个体产生的，味觉又由味道产生，那么感觉味道的主体，也就成多个了；如果味觉只有一个主体，味觉是味道所生，这就变成味道也只有一个了。没有了分别，也就构不成意识，更谈不上意识界了。</p><p>　　所以，舌根，味道和味觉世界，都是虚妄的，不是因缘而生，不是自然而有。”</p><p>　　舌头把味道转化成能在神经中传导的电信号，在大脑中形成样本。丘脑中表达意识的遗传信息点亮样本，形成味觉世界。</p><p>　　而对事物形成意识的丘觉，是通过遗传获得的。对具体事物的认识，可以通过后天的学习，通过建立联结路径来获得。但是认识的这个能力，却无法通过学习获得。我们能知道“冷、热”，是因为丘觉中遗传有冷热。我们不能知道超声波，紫外线，是因为丘脑中没有遗传这样的丘觉。</p><p>　　如果说，知觉就是遗传来的。那么，这个遗传的来源，他的意识是哪里来的？这个来源的来源又在哪里？这样不停地找下去，根本找不到一个源头。知觉总不能凭空而有啊！</p><p>　　所以，说知觉是遗传来的，也是站不住脚的。</p><h3>　　身触界虚妄</h3><p>　　“阿难。身体和所接触的物体，产生了触觉。那么触觉是身体所生，由身体产生了触觉世界呢；还是所接触的物体所生，由物体产生了触觉世界呢？</p><p>　　如果是身体所生，身体没有”离、合“之相。没有离合就没有触觉，又怎么产生触觉世界呢！</p><p>　　如果是接触的物体所生，就跟你的身体没关系。离开身体，又是谁来知道这个离合的呢。</p><p>　　阿难。外物不会自己与自己接触而产生触觉，必定要跟身体接触才会有触觉。因为触觉而感知到身体，这个触觉就是外物的；因触觉感知到外物，这个触觉就是身体的。是身体的，就不是外物的；是外物的，就不是身体的。所以，终究不会是外物和身体所共有的触觉。</p><p>　　所以，触觉根本就没有身体和外物两个所在。在身体，就是身体自己的属性；离开身体，就如同虚空。没有内外，又怎么会有中间呢！没有中间，也就无所谓两边。这样，触觉世界又因何而立呢！</p><p>　　所以，要知道，身根、外物和触觉世界，三处都是虚妄的，不是因缘而生，不是自然而有。”</p><p>　　触觉也是一样。皮肤把外界的刺激转化成电信号，以神经冲动的形式传播。然后，经过重重处理，在大脑中形成样本。最后样本点亮丘觉，形成触觉世界。</p><p>　　如果说丘脑中的遗传信息就是知觉。而遗传信息指的就是细胞的DNA分子中，碱基对的排列顺序。所谓的碱基对，不过是些原子结合在一起。原子是物质，不是意识。就像色相无论怎样合和，也合不出虚空一样。物质再怎么排列，也都是物质而已，不可能排列出知觉来。</p><p>　　最简单的例子：死人也有同样的DNA，同样的碱基对，同样的排列顺序。死人有知觉吗？如果有，怎么能叫死人呢；如果没有，怎么能说知觉就是碱基对的排列顺序呢？</p><p>　　所以，说知觉就是丘脑中的遗传信息，也是说不通的。</p><h3>　　意思界虚妄</h3><p>　　“阿难。意识和思维，产生了意识世界。那么意识到底是意根所生，是意根形成的意识世界；还是思维所生，是思维产生的意识世界呢？</p><p>　　如果单是由意根所生，那么在意根中必须有所思量，才能形成意识。没有所思，意识就没有内容。什么都没有，又怎么能说意识存在呢！</p><p>　　又，意识与思维都有能分别的知性。那么这两者的是相同呢，还是相异呢？若是相同，则思维就是意识，又怎么能说思维是意识所生呢；若是相异，那么思维就应该没有知性。没有识性，又怎么能是意识所生呢？如果有知，那么还用的着意识了吗？不是相同，也不是相异，又怎么能形成意识世界呢？</p><p>　　如果是思维所生。思维的内容，无非是色、声、香、味、触这五尘，这五尘分别对应着五根，了了分明，并不是意识。如果一定说意识是思维所生，那么你仔细观察，思维到底是什么样的。离开色空、动静、通塞、苦甜、合离等相，五尘就不会存在，思维也就终无所得。生则随着色空等相而生，灭则随着色空等相而灭，来源都不存在了，思维能成什么形象呢！连形象都没有，又怎么会产生意识世界呢！</p><p>　　所以，要知道，意识和思维，以及意识世界，三处都是虚妄的。不是因缘而生，不是自然而有。”</p><p>　　一般认为，意识是丘脑的功能。丘脑中的神经元有特殊的遗传信息。这些遗传信息，或者自由合成为丘觉，发放到联络区形成意识；或者被样本点亮而合成丘觉，发放到联络区形成意识。自由合成时，形成的是想象一类的主观意识；样本点亮合成时，形成的是对客观事物做出反应的意识。</p><p>　　无论如何，一切丘觉的活动，归根结底，都是大脑神经元的反射活动，都是以神经冲动的形式完成的。如果说意识就是神经冲动，那么全身的神经都有同样的神经冲动，全身就都应该有意识！如果说意识就是遗传信息，死人也有同样的遗传信息，死人怎么没有意识呢？</p><p>　　那么，意识是通过神经冲动传递的遗传信息吗？</p><p>　　遗传信息的传递，表现为DNA指导蛋白质的合。DNA位于细胞核中，蛋白质却在细胞质中。DNA这样的大分子是不可能穿过核膜到达细胞质的，所以，DNA先合成信使核糖核酸，即mRNA，使它带有合成蛋白质所需的全部遗传信息，也就是特定的碱基对排列顺序。然后，mRNA离开细胞核，穿过核膜，与细胞质中的核糖体结合。此时，再由转运RNA，即tRNA，带着氨基酸与mRNA对号入座，并由tRNA翻译mRNA中的遗传信息。于是，一个个氨基酸被不断加长，构成蛋白质的肽链就这样形成了。这就是遗传信息的传递过程。</p><p>　　神经冲动的传递，实质是动作电位的传递。可见，遗传信息的传递和神经冲动的传递，二者根本就是风马牛不相及的。所以，说意识是通过神经冲动传递的遗传信息，也是说不通的。</p><p>　　以上，佛用种种譬喻，层层说理，通过五阴、六入、十二触、十八界，详细地讲述了感知的虚妄。所以，一切感知其实并无实体，其本质都是如来藏妙真如性。接下来，佛又继续解释世界的虚妄。\t\t</p></div>"
    },
    {
        "title": "第九章 七大假合",
        "author": "",
        "date": "",
        "html": "<div class=\"B1_text\"><h2>第九章 七大假合</h2><p>　　解释完了身心世界的交互，在这一章里，世尊又对构成身心世界的七种元素，分别加以论述。地、水、火、风、空、见、识这七种元素，找来找去，都找不到它们的来由。其实，它们的本体，都是如来藏妙真如性。就像水结成冰一样，冰虽然浮在水面上，但是本体依然是水。七大也是如此，虽然各有形态，本体却都是如来藏。众生迷失，如来藏就随着众生的业缘而做显现。所以一处执镜，一处生火；一处捧珠，一处生水；一处扇衣，一处生风。无知的人把这当做因缘所生，或者自然现象，这些解释，其实都是迷失的心灵所做的分别计度而已。就如同去研究捏出来的月影一样，毫无意义。</p><p>　　阿难这时又问佛：“世尊，如来常说，世间的一切万物，种种变化，都是四大在因缘和合的情况下生成的。而现在，如来把因缘和自然全都否定了。我不明白这到底是怎么一回事。求如来怜悯众生的愚迷，开示这其中真实的道理吧！”</p><p>　　如来回答阿难说：“阿难。你想求证无上菩提，所以，我为你开示了第一义谛。但你现在，还是在用世间的戏论和妄想来缠绕自己。你虽然多闻，但是就如同只会说药的人，当真药现前的时候却不认识。如来说，真是可怜愍者。你现在听好，我再为你解说。”</p><p>　　阿难默然地承受佛圣旨。</p><p>　　“阿难。就像你说的，四大和合形成了世间的种种变化。阿难。如果这四大不能和合，就不能构成万物，就像虚空不能与色相和合一样；如果说四大能够和合，那么，这四大就也要随着变化而生灭不停了。这样有生有灭，又怎么能作构成万物的本元呢？</p><p>　　阿难。水能结成冰，冰还能化成水。这个过程，无所谓合和与不合和。四大也是这样。</p><h3>　　地大妄现</h3><p>　　你看地性：粗的是大地，细的是微尘，再细微的是邻虚尘，再分下去就是虚空了。阿难。如果把邻虚尘析成虚空，就说明是虚空出生了色相。你刚才说因为和合，出生了世间的种种变化。你且看这个邻虚尘，是用几个虚空和合成的呢？总不能由邻虚尘，合成邻虚尘吧！而且，邻虚尘既然可以析入虚空，那么是用几个色尘，合成的虚空呢？</p><p>　　把色相和合，得到的还是色，不是空；把虚空和合，得到的还是空而不是色。色尘还可以解析，虚空怎么能合和呢！</p><p>　　你不知道，如来藏中本来就具有色性。它清净本然，周遍法界，随着众生心量和业缘的不同，而做显现。世间无知的人，以为是因缘和自然产生的。其实，这都是识心所做的分别计度。只要有所言说，就没什么实义。”</p><p>　　如来藏妙真如性中，本来就具足地大。只因为一念无明，产生了种种心念和种种业缘，而扭曲了真如本心，才最终结出地大。这个过程，就像水结成冰一样。如来藏就好比是水，地大就好比是冰。冰本来就是水。只是因为外界的温度变化，才使水的形态发生变化，而结成了冰。同样的，地大本来就是如来藏，只是在无明的心念和业缘的驱使下，如来藏才结出了地大。</p><h3>　　火大妄现</h3><p>　　“阿难。火性本来没有自体，而是寄宿在诸缘之中。你看城中的百姓，要做饭的时候，手拿着阳燧，在太阳下求火。阿难。所谓和合，就像我跟你与一千二百五十位比丘，大家构成一个群体。虽然一体，究其根本，还是各有各的自体，各有各的姓名种族。如<a href=\"https://www.guang5.com/fgsl/\" class=\"keylink\" target=\"_blank\">舍利</a>弗是<a href=\"https://www.guang5.com/rmgjc/poluomen.html\" class=\"keylink\" target=\"_blank\">婆罗门</a>种，优卢频螺是迦叶波种，阿难是瞿昙种。</p><p>　　阿难。如果火性是因为和合而有，那些人手拿燃镜在太阳下求火，这个火是从镜子中产生，还是从艾绒中出来，还是从太阳中而来呢？</p><p>　　阿难。如果从太阳中来，既然能烧着你手中的艾绒，那么火来的时候所经过的树林，就也应该被点着。</p><p>　　如果是从镜子中产生，那么既然能烧着艾蓉，镜子自己为什么不被熔化呢？镜子拿在你手里，连一点热的感觉都没有，怎么可能熔化呢！</p><p>　　如果是生于艾绒，为什么还要镜子和阳光相接才能生火呢。</p><p>　　你再仔细观察。镜在手中，日在天上来，艾蓉在地，火又是从哪里游历于此的呢。太阳和镜子，相距甚远，无法和合。火总不可能没个来由，自己产生吧！</p><p>　　你不知道，其实火性是如来藏中本自具足的。它清净本然，周遍法界，随着众生心量和业缘的不同，而做显现。阿难。要知道，世人一处执镜，一处火生。遍法界执镜，则满世间起火。周遍世间，哪有方所！世间无知的人，惑为因缘和自然性。这都是识心的分别计度。但有言说，都无实义。”</p><h3>　　水大妄现</h3><p>　　“阿难。水性不定，流息无常。如室罗筏城中的迦毗罗仙、斫迦罗仙、钵头摩、诃萨多等幻师，求太阴精来调和幻药。这些幻师，在月圆之夜，手执五方石所炼成的水精方珠，用月亮来求水。这水是从方珠中出来的，是空中自有的，还是从月亮中来的呢？</p><p>　　阿难。如果从月亮中来的，那么，既然月亮能令远方的方珠流水，那么所经过的林木，就也应该流水。如果林木也能流水，那何必要用方珠；如果林木不能流水，就说明水不是从月亮降生的。</p><p>　　如果是方珠所出，那么方珠中就应该常有流水，又何必非要等到月圆之夜呢！</p><p>　　如果是空中所生，空性无边，水也应该无际。这样一来，从人到天，一同沉溺，又哪里来的水陆空行呢！</p><p>　　你再仔细观察，月在天上升落，珠在手中把持，承珠的水盘由人敷设，水到底是从哪里流出来的呢！月和珠相隔遥远，不可能和合。水总不能无中生有吧！</p><p>　　如来藏中本具水性，清净本然，周遍法界，随众生心，而做显现。一处执珠，一处水出。遍法界执，满法界出，生满世间，哪有方所，不过是随业发现而已。世间无知的人，以为是因缘和自然性。这都是识心的分别计度。但有言说，都无实义。”</p><h3>　　风大妄现</h3><p>　　“阿难。风性没有自体，动静无常。当你整理<a href=\"https://www.guang5.com/rmgjc/jiasha.html\" class=\"keylink\" target=\"_blank\">袈裟</a>，进入到集会的大众中时，衣角飘动，会带起微风，拂过人面。这个风是袈裟所生，还是来自虚空，还是生于人面呢？</p><p>　　阿难。如果是袈裟所生，那么你披的就是风了。袈裟随风飞扬，就应该离开你的身体。我现在在大会中，你看我的袈裟，风在哪里？这垂下的衣服里，根本没有藏风的地方。</p><p>　　如果是虚空所生。那么，你的袈裟不动时，怎么就没有风呢！虚空常在，风也应该常有才对。没有风的时候，虚空也应该消失啊！没有风是常有的事情，虚空如果消失了，会是什么样子呢！如果有生有灭，虚空就不是虚空了。既然虚空常在，那么，常在的虚空又怎么会生出时有时无的风来呢！</p><p>　　如果风是被拂的脸面所生，这个风就应该吹到你的身上，怎么还会倒过来，吹到产生它的脸面上呢！</p><p>　　你仔细观察。整理袈裟的是你，被拂的脸面是别人的，虚空寂然不动。风是从哪里吹来的呢！风和虚空，体性相隔，无法和合。总不能风是无中生有的吧！</p><p>　　你不知道，如来藏中本来具足。风大与真如本性，无二无别，清净本然，周遍法界。阿难。你一个人拂动衣服，就有一缕清风。遍法界拂衣，则满国土生风。周遍世间，哪有方所！不过是循业发现而已。世间无知之人，惑为因缘及自然性。这都是是识心的分别计度。但有言说。都无实义。”</p><h3>　　空大妄现</h3><p>　　“阿难。虚空没有形体，因为色相才能显现出来。比如室罗筏城的居民，在离河很远的地方安立新居时，都要挖井。这时，挖出一尺的土，就会出现一尺的虚空。挖出一丈的土，就有一丈的虚空，随挖随有。这个虚空，是因为泥土被挖出来而产生的，还是因为穿凿而产生的，还是无因自生的呢？</p><p>　　阿难。如果是无因自有的，那么未凿土之前，怎么没有？只见坚实的大地，全无通达的虚空。</p><p>　　如果是因为泥土被挖而产生的，那么泥土出来时，应该见到虚空进去。如果只见泥土先出来，而没有虚空进去，怎么能说虚空是因为泥土被挖出来而产生的呢。如果说没有土出和空入这个过程，那么虚空和泥土就是一体的了。如果是这样，泥土被挖出来的时候，虚空怎么不一起跟着出来呢。</p><p>　　如果是挖出来的，那么挖井时，一锹一锹挖出来的，就应该是虚空，而不是泥土；如果不是挖出来的，那么挖出泥土后，又怎么见到虚空了呢！</p><p>　　你再仔细观察，仔细思考。挖是随着人手，上下翻覆，土是从地而出，二者根本不在一起，虚空怎么能随着挖而产生呢！挖和空，一实一虚，不能和合。虚空总不能是自己产生自己的吧！</p><p>　　所以，要知道，虚空的本性是<a href=\"https://www.guang5.com/rmgjc/yuanrong.html\" class=\"keylink\" target=\"_blank\">圆融</a>周遍，没有动摇的。跟地、水、火、风同在如来藏中，本无生灭。阿难。你心智昏迷，不知道四大原本就是如来藏。你现在观察虚空，是出是入，还是非出非入？你不知道，如来藏中，本有的自性就是真正的虚空，虚空的本体就是如来藏妙真如性，清净本然，周遍法界。随着众生心量的不同，而做显现。</p><p>　　阿难。有一口空井，就有一井虚空。十方虚空，无不如此，遍满法界，哪有方所，不过是随着业缘而做显现。世间无知的人，惑为因缘和自然性。这都是识心的分别计度。只要有所言说，都无实义。”</p><h3>　　见大妄现</h3><p>　　“阿难。见本来没有自体，因为”色“”空“二相才产生了见。比如你在祇陀林中，朝晖夕阴。夜晚的时候，有月则光明，无月则黑暗。明与暗是因为有见才得以明辨的。那么，这个见与明暗虚空，是同体呢，还是异体呢？还是非同非异呢？</p><p>　　阿难。如果见与明暗虚空同为一体。明与暗本来对立。暗时无明，明时非暗。见与暗一体，就看不到明；与明一体，就看不到暗。而没有见，如何能知道明暗呢？明暗交替，此生彼灭，而见无生灭。无生灭的见，又怎么能与有生灭的明暗构成一体呢？</p><p>　　如果见与明暗虚空不是一体，那么离开明暗和虚空，这个见到底是什么形象呢？离开明暗和虚空，见就如同龟毛兔角一样，根本没个着落。明暗本来对立，见怎么能与明暗同时能成为一体呢；而离开二者又没有见，又怎么能说见与明暗不是一体！</p><p>　　划分虚空和见，却发现根本找不到二者衔接的边缘，所以怎么能说空与见不是一体的呢！无论明暗如何交替，见总能如实照见，这样又怎么能说见与明暗相异呢！</p><p>　　你再观察，仔细地辨析。明是太阳所生，暗是因为黑夜无月。通属虚空，塞归大地。这个见精，应该归于谁呢？见和虚空，一个有知，一个无知，二者性质不同，根本谈不上合和与不合和。这个见精总不能是自己迸出来的吧！</p><p>　　见闻觉知的本性，是圆满周遍，没有摇动的，与无边的虚空，再加上摇动的地、水、火、风，和在一起称为”六大“。它们本性圆融，都是同一个如来藏，本无生灭。</p><p>　　阿难。你的心性沉沦在无明之中，不明白见闻觉知，本来就是如来藏。你再好好想想，这个见闻觉知，是生是灭，是同是异，还是非生非灭，非同非异。你还不知道，如来藏就是见的本体，见就是如来藏所本具之见，清净本然，周遍法界。随众生心性的不同而做显现。</p><p>　　这一个见，能遍见法界。听嗅尝触，也同样周遍，圆满十方，哪有方所！不过是随着业缘而做显现罢了。世间无知的人，惑为因缘和自然性，这都是识心的分别计度。只要有所言说，就都没有实际意义。”</p><h3>　　识大妄现</h3><p>　　“阿难。识性无源，只是在六根面对六尘时才显现出来。你现在遍观在场的大众，依次循历，就如同镜子一样，只有观照，不加分别。这时，你所用的就是识性。你的眼识会依次地辨认出，这是文殊，那是富楼那，这是目犍连，那是须菩提，这是舍利弗。这个能知的识性，是生于见，还是生于色相？是生于虚空，还是没有因由，突然迸出来的呢？</p><p>　　阿难。如果你的识性是生于见中的，那么，没有明暗和色空，就没有见。见尚且没有，从哪里来的识呢！</p><p>　　如果识性是生于色相中的，不是生于见中。色相没有见性，所以识性就见不到明暗。不见明暗，就没有色空。没有色空就不会有色相。既然没有色相，识性又怎么能从色相中产生呢！</p><p>　　如果识性生于虚空，不是由色生的，也不是由见生。不是见生，识性就无法辨别色相。不能辨别色相就不知道明暗色空。不是色生，识性就没有尘缘。没有尘缘，见闻觉知就无处安立。这样一来，虚空也就跟没有一样了。有也如同无物，即使产生了识性，又能用它来分别谁呢？</p><p>　　如果识性是没有因由，突然迸出来的！那么，为什么不能在太阳地里，迸出来能看见月亮的眼识呢！</p><p>　　你再仔细推敲，见发自你的眼睛，色是所对之境。有形的就能辨别出它的相貌，无形的也能知道它的存在，这个能辨别的识性到底是从哪里来的呢？识性摇动，见性澄静，体性不同，谈不上和合与不和合。听闻觉知，也是如此。总不能这个识性是自己产生自己的吧！</p><p>　　这个识心，根本无所从来。识心和见闻觉知，圆满湛然，无需借助外缘而生。识心、见闻觉知，连同虚空，以及地、水、火、风，同称七大，真性圆融，都是如来藏妙真如心。</p><p>　　阿难。你心性粗浮，不明白见闻觉知和识心，就是如来藏。你看眼耳鼻舌身意这六处识心，为同为异，为空为有？还是非同非异，非空非有？</p><p>　　你不知道，如来藏就是识性觉知的真体。识性本来就是如来藏，妙觉湛然，遍周法界，含吐十方，哪有方所！不过是随着业缘而做显现罢了。世间无知的人，惑为因缘和自然性。这都是识心的分别计度。凡有言说，都无实义。”</p><p>　　这七大都不过是真如本心在无明的扭曲下做的显现而已。就好比水在外界环境不同时，可以结成冰，化为雨，蒸成雾，漂为云，降为霜，凝成雪，或者冻成雹。虽然形态各异，但本质上却都是水。</p><p>　　万事万物也是一样。真如本心被无明扭曲，在妄想和业缘的作用下，如同水结成冰霜雨露一样，幻化出了七大。再由七大，结成山河大地，万类霜天，六趣四生，生死沉浮。这一切虽然绚丽多姿，千差万别，却一刻也没有离开我们的真心。</p><p>　　无论自身的感知，还是外在的世界；无论是眼耳鼻舌身意，还是山河大地，鸟语花香；无论是悲欢离合，还是生死沉浮，说到底，都是如来藏妙真如性，通过扭曲的心灵，而做出的“折射”而已。</p><p>　　这就好比雨后的阳光，在虚空中，会折射出七色的彩虹一样。如来藏妙真如性，在扭曲的心灵中，就折射出了我、感知、意识，乃至万事万物。彩虹本就是阳光，只是阳光在虚空的折射下，所做的另一种显现而已；同样道理，万事万法其实就是如来藏，只是如来藏在扭曲的心灵中，所做的种种显现而已。所以，因缘合和，只是折射出万物的条件，而不是产生万物本体的原因。</p><p>　　这时，阿难和在场的大众，蒙如来开示，心开意解。他们感觉身体荡然无存，心无挂碍。各自都明白了此心遍满十方。见十方虚空，犹如掌上观文。一切世间所有的事物，都是菩提妙心。心精遍圆，含裹十方。反过来再看这个父母所生之身，犹如虚空中的一抹微尘，若存若亡；又如大海中的一珠水泡，若有若无。自己的本心，湛然常住。此时心中，欢喜无量，于是一同在佛前发愿：</p><p>　　“微妙湛然，不动总持的真如本性，世间稀有。</p><p>　　长久以来的颠倒梦想，而今一并消除。</p><p>　　不再需要长劫的求索，而今终于获知了清净法身的所在。</p><p>　　愿我们都能证得这个真如本心，然后普度恒河沙数的众生。</p><p>　　把我们的身心，奉献给微尘一样众多的刹土，以此来报达佛恩！</p><p>　　请世尊为我们做证，五浊恶世，发誓先入。</p><p>　　如果有一个众生没有成佛，我终不入涅槃。</p><p>　　勇猛雄壮，大慈大悲的世尊啊！请您再宣妙法，除去我们心中最微细的隐惑。</p><p>　　令我们早日证得无上正觉，在十方佛土中，安立道场，教化众生。</p><p>　　虚空可以消亡，我的誓愿终无改变！”\t\t</p></div>"
    },
    {
        "title": "第十章 世界的产生",
        "author": "",
        "date": "",
        "html": "<div class=\"B1_text\"><h2>第十章 世界的产生</h2><p>　　如果说一切都是如来藏妙真如性，那么世界又是怎么产生的呢？对此，如来解释道，世界产生的原因或者说动力，是因为背离了自性本明的‘明了’--或者称之为‘无明’--对‘明了的内容’的追求。在无尽的追求中，幻化出了虚空大地，草木金石，胎卵湿化，生死缠缚。然而自性本身却并无增减。因为这一切，都是幻化的空中楼阁而已。</p><p>　　这时，富楼那弥多罗尼子，听完佛的讲解后，心中产生了疑问，于是从座位上站起来，右膝着地，恭敬地合掌问佛：“大威德世尊。您善为众生演说第一义谛。您常说，在所有弟子之中，我为说法第一。但是，我今天听如来的说法，就像耳聋的人，听百步之外蚊蚋的叫声一样，本来就听不见，更何况是如此微妙的声音。世尊，阿难虽然开悟，但是习漏未除。就是我们这些已经证得无漏圣果的阿罗汉，听了如来的说法，心中也仍有疑惑。”</p><p>　　前面如来和阿难等常说“有漏”，这次富楼那又提到“习漏”，那么这些“漏”到底是什么意思呢？宣化上人是这样解释的：</p><p>　　习气不是一天有的，是从无始劫以来，生生世世习染来的、学来的，于是就有种种的漏。什么叫“漏”？漏就是烦恼，烦恼就是“习漏”。“习漏未除”就是指他的烦恼还没有除尽，这种习气没有去尽，这叫余习。余习，就是余留的习气，由前生那儿来的，也就和这个“业”是差不多的性质。</p><p>　　讲到这个“习”，佛有个弟子叫毕陵伽婆蹉。他证了果后，每次到要过河的地方，他就叫河神了。河都有河神的，这个河神是个女性。他说：“小婢住流！”小婢，就是使奴唤婢的婢，就是仆人。以前中国不是有丫环、奴婢的吗？就是这个奴婢。毕陵伽婆蹉尊者叫“小婢住流”，就是说：“你这个小奴才！赶快给我把水停止住，我好过河！”</p><p>　　因为证果的罗汉过河，可以叫水不流的。他有这种权利。那么住流，这一定要河神来住流，所以他到那地方，就叫“小婢住流”。</p><p>　　左一次、右一次都这样叫，这个河神因为他是阿罗汉，也敢怒不敢言。很多次后，这河神于是就到佛那儿去控告毕陵伽婆蹉了，她说：“您这个弟子，这个毕陵伽婆蹉！他一过河的时候，就对我叫‘小婢住流’。啊，我真是气得不得了！佛您要教化这个弟子，不要让他这么粗野。怎么叫我‘奴才’？叫我‘小婢住流’呢？”</p><p>　　佛一听，就对毕陵伽婆蹉说：“毕陵伽婆蹉！你过来，向这位河神来道道歉！”道道歉，就是认认错，再不要这么讲了。你说毕陵伽婆蹉怎么样啊？他说：“小婢！你莫怪！”就是因为叫河神“小婢”，所以她才生烦恼的。现在道歉，还叫她“小婢”这个河神气坏了，说：“佛您看您这个弟子！当着您，都这么叫我‘小婢’！”</p><p>　　释迦牟尼佛就说：“你知道为什么他叫你‘小婢’吗？因为在五百世以前，你是他的工人，做了他的工人很久很久，所以他叫‘小婢’叫惯了，现在他见着你就叫‘小婢’，这是一种余习，以前的习气没有改变，所以现在还这样称呼你。”</p><p>　　这样一讲，这河神才没有话讲了。喔，这原来是一种因果！所以这个事情也就解决了。为什么总这样叫她“小婢”呢？这就是“习漏未除”，过去生中所习染来的，他还没有改变。“</p><p>　　接下来，富楼那弥多罗尼子就提出了他的疑问：”世尊。如果世间的六根、六尘、所有的阴、处、界都是如来藏，清净本然，那么，为什么会突然生出山河大地这些有形有相的东西，次第迁流，周而复始呢？</p><p>　　世尊又说，地水火风，本性圆融，周遍法界。世尊。如果地性周遍，怎么会容水在其中呢？水性周遍，火就无隙可乘，又怎么会有水性和火性，同时都遍满虚空，而又互不干涉呢？世尊。地性障碍，空性通虚，二者又怎么可能同时周遍法界呢？我实在不明白这其中的道理，希望如来宣流慈音，拨我迷云。“说罢，五体投地。</p><p>　　如来答道：”如来现在就为你们这些停留在罗汉境界中的人，宣说佛法最真实的道理。令你们都能发起向上，进求无上正觉之心。富楼那。你问清净本然，怎么会忽然产生山河大地。你常听如来说，性觉妙明，本觉明妙。对吧？“</p><p>　　富楼回答道：”是的，世尊。我常听如来宣说此样的义理。“</p><p>　　”这里的觉和明，你说是自性本来明了，把这个自性本有的明了叫觉呢？还是觉知万物的这个明了，叫觉呢？“。</p><p>　　富楼那说：”如果自性本来就是明了的，明了与万物同为一体，那么就没有明了的内容了。“</p><p>　　佛说：”如果说，没有内容就没有明觉。而有个内容，这个内容却又是虚妄的。“</p><p>　　为什么说：”有个明了的内容，这个内容就是虚妄的呢？“这是因为，明了的一切内容，不外乎五阴、六入、十二处、十八界和七大。而如来已经逐个辨析过，最终证明这些都是虚妄的。所以说”有个明了的内容，这个内容就是虚妄的“。</p><p>　　”如果说，没有明了的内容，就没有明了。那么，如来藏妙真如性就不能明了，不能明了又怎么能做我们的心呢！</p><h3>　　世界相续</h3><p>　　“自性本来明了。依赖于内容而存在的明了，终究是虚妄的。自性本有的明觉，并不是你所明了的内容。</p><p>　　明了一旦有了个内容，作为它的寄托后，就产生了虚妄的功能。 这样，在无同无异中，出现了炽然的差异。有相异就有相同。相同和相异进而又产生了无同无异。</p><p>　　这样继续扰乱下去，便在相互的对待中发生疲劳。疲劳引发了尘相。尘相一旦产生，就像一滩浑水一样，自己就搅合起来，尘劳烦恼由此而生。动起来形成世界，静下来化作虚空。虚空就是相同，世界就是相异。而那无同无异的，才是真正的有为法。</p><p>　　顽空和明了相对，产生摇动。所以有风轮，执持世界。”</p><p>　　迷失了真如自性后，最初只能见到晦昧的顽空。这个过程，世尊在讲“七处征心”的时候也提到过。自性本来就是明了的，不需要有个对境。而背离自性的明了，我们称之为“无明”的，却一定要把明了寄托在内容上。于是，清净的自性中，便幻化出了顽空作为它明了的内容。接着，无明就开始在顽空中搜寻它赖以寄托的内容。这一搜寻，就产生了摇动。这个摇动，就是风的属性。</p><p>　　“在摇动中，对明了的坚持，形成了滞碍。而这其中的金，则是对明了的坚持达到了‘坚定’的程度。所以有金轮，保持国土。”</p><p>　　顽空中一无所有。但是，无明却‘坚持’要有个内容。于是，无明又幻化出“滞碍”来自欺欺人。当“坚持”达到了“坚固”的程度时，这个“坚固”，就成为金的属性。</p><p>　　“坚固的金和摇动的风，相磨而生出火光。火光有变化性，金有润泽性，所以在火光的蒸腾下，形成水轮，遍含十方。</p><p>　　火性蒸腾，水性倾降。两者相交，形成了坚固的色相。湿的成为巨海，干的成为洲滩。所以大海中常有火光，洲滩中常有江河。水势劣于火势，就结为高山。所以山石敲击就能出火，熔化就能成水。土势劣于水势，就抽为草木。所以林木焚烧则能成土，搅拌就能出水。</p><p>　　就这样，妄性相交，相递为种，由此形成了世界相续。”</p><h3>　　霍金的宇宙</h3><p>　　以上是佛陀对宇宙起源的描述。而今天，人们所依赖的科学，自她诞生的那天起，就开始执着地不断探索宇宙的本源。爱因斯坦的广义相对论，把这个探索带到了一个新的高度。量子力学的诞生，又弥补了广义现对论的不足。英国大物理学家，被誉为爱因斯坦之后世界上最伟大的科学思想家的斯蒂芬·霍金，把量子力学和广义相对论结合在一起，发展出来宇宙自发创生的图景。下面，我们就以霍金来代表科学的声音，看看科学对宇宙起源的解释。</p><p>　　以下是霍金2006年访问中国时，于6月19日，在人民大会堂做的题为《宇宙的起源》的演讲的摘录：</p><p>　　“詹姆·哈特尔和我发展宇宙自发创生的图景有一点像泡泡在沸腾的水中的形成。</p><p>　　其思想是，宇宙最可能的历史像是泡泡的表面。许多小泡泡出现，然后再消失。这些泡泡对应于微小的宇宙。它们膨胀，但在仍然处于微观尺度时坍缩。它们是另外可能的宇宙，由于不能维持足够长的时间，来不及发展星系和恒星，更不用说智慧生命了，所以我们对它们没有多大兴趣。</p><p>　　然而，这些小泡泡中的一些，会膨胀到一定的尺度，到那时，它们可以安全地逃过坍缩。它们会继续以不断增大的速度膨胀，形成我们看到的泡泡。它们对应的就是以不断增加的速度进行膨胀的宇宙，这就是所谓的暴胀。</p><p>　　正如每年的价格上涨一样，通货膨胀的世界纪录应归于一战以后的德国，在18个月期间价格增大了一千万倍。但是，它和早期宇宙中的暴胀相比实在微不足道。宇宙在比一秒还微小得多的时间，里膨胀了十的30次方倍。和通货膨胀不同，早期宇宙的暴胀是非常好的事情。它产生了一个非常巨大的，均匀的宇宙，正如我们观察到的。然而，它却不是完全均匀的。”</p><p>　　“早期宇宙中的无规性，意味着在有些区域的密度，比其它地方的稍高。由于这些额外密度所产生的引力的吸引，使这个区域的膨胀减缓。而且最终能够使这些区域坍缩，形成星系和恒星。请仔细看这张微波天图，它是宇宙中一切结构的蓝图。我们是极早期宇宙的量子起伏的产物，上帝的确在掷骰子。”</p><p>　　借助美国宇航局的微波背景辐射探测器，一个国际天文学家小组新获得了“婴儿期”宇宙迄今最精细的照片。</p><p>　　如果把霍金所描述的图景和佛陀的描述加以对应，我们可以把霍金说的“小泡泡”，对应于如来说的，风轮在其中执持世界的“顽空”。这些“小泡泡”是怎么产生的？霍金的研究，目前还没有涉及。如来告诉我们，这是因为无明背离了自性，而去寻求一个内容，作为寄托明了的对境。所以，自性随顺无明而幻化出了“顽空”。</p><p>　　霍金说的“有些区域的密度，比其它地方的稍高”，可以对应于“对明了的坚持，而形成的滞碍”。为什么这些区域的密度会比其他地方高呢？霍金在他的名著《时间简史》中，谈到这里的时候，也画了一个问号。在佛陀的讲解中， 我们可以得到答案：这是因为无明对明了的“坚持”，才使自性在顽空中收缩出了“滞碍”。于是表现为“有些区域的密度，比其它地方的稍高。”</p><p>　　“这些区域坍缩，形成星系和恒星”，可以对应于“火性蒸腾，水性倾降。两者相交，形成了坚固的形色”。</p><p>　　霍金的宇宙，从小泡泡开始，那么，我们不妨追问，这些小泡泡出现之前，宇宙是怎样的呢？霍金在《时间简史》中提出了一个假设：</p><p>　　“人们从无边界假定得知，宇宙沿着大多数历史的机会是可以忽略不计的。但是有一族特别的历史比其他的历史有更多机会。这些历史可以描绘得像是地球的表面。在那儿与北极的距离，代表虚的时间。并且离北极等距离的圆周长，代表宇宙的空间尺度。宇宙是从作为单独一点的北极开始的。当你一直往南走去，离北极等距离的纬度圈变大。 这跟宇宙随着虚时间的膨胀相对应。宇宙在赤道处达到最大的尺度。并且随着虚时间的继续增加而收缩，最后在南极收缩成一点。尽管宇宙在北南二极的尺度为零，这些点不是奇点，并不比地球上的北南二极更奇异。科学定律在这儿有效，正如同它仍在地球上的北南二极有效一样。”</p><p>　　也就是说，在虚时间的概念中，可以把宇宙演化的过程，用地球表面的经度和纬度来模拟。经度表示宇宙演化的时间，纬度表示宇宙的尺寸。这样一来，宇宙演化的时间，就变成一个圆圈了。也就是说，宇宙在生灭中，无始无终地循环。但是，这个时间指的是“虚时间”。虽然有个北极点，可以表示它的开始，但是，这个点也只是概念性的，并不是真实存在的。</p><p>　　霍金继续说：“上述这些也许暗示，所谓的虚时间才是真正的实时间。而我们叫做实时间的东西，恰恰是子虚乌有的空想的产物。在实时间中，宇宙的开端和终结都是奇点。这奇点构成了科学定律在那儿不成立的空间时间边界。但是，在虚时间里不存在奇点或边界。所以，很可能我们称之为虚时间的，才真正是更基本的观念。而我们称作实时间的，反而是我们臆造的。”</p><p>　　霍金所提到的“奇点”，跟如来所说的“无明”，何其相似！霍金的宇宙自奇点诞生。一经诞生以后，在宇宙无穷的循环中，奇点就变成了一个概念。如来所说的宇宙，自无明诞生。一经诞生以后，也是根本找不到一个无明的所在。关于无明所在的问题，如来在下一章会具体讲到。</p><p>　　奇点诞生以前的宇宙呢？在霍金的模型中，由于用经度代表时间。所以，这就好比在问“北极点以北是什么”一样没有意义。无明也是这样。由于它背离了真如本性，依赖于内容而存在。而真如本性并不是无明所明了的内容，所以在无明中，根本找不到真如本性。这就好像在霍金的模型中，找不到北极点以北一样。</p><p>　　正如经度是圆圈一样，宇宙在虚时间中的循环也是无限的，这又与如来所说的轮回相吻合。只要参不破这个无明，轮回就将永远继续下去，无始无终。只是如来所说的循环，是在多个时空中完成的。光天道中，就有二十八层天，何况还有其他五道。而现在，对完成物理学家的梦想--“大一统理论”呼声最高的“弦理论”，就直接触及到了多维时空的问题。弦理论确信，至少需要十个维度才能建立一个理论框架，让引力与量子力学互相兼容。弦理论科学家假定，宇宙中所有粒子都被局限在一个四维的膜宇宙（brane)中。而膜宇宙又漂浮在一个更高维度的体宇宙（bulk)里。几种特殊的粒子可以从膜宇宙中穿入穿出。</p><p>　　可见，科学的发展，只是在越来越多地证实佛法。一代一代的物理学家，从伽利略到牛顿，从爱因斯坦到今天的霍金，他们穷经皓首，孜孜不倦地所要明白的问题，其实2500年前，佛陀就已经亲身证实了。不但证实了，而且还在证实以后，周游各国，勤勤恳恳地宣讲了四十九年。</p><p>　　所以，可以毫不夸张地说，佛法，其实就是真正的科学，是最终极的科学。</p><p>　　只不过两者探索世界的方式不同。科学是通过仪器对物质世界的观察和数学公式的推导来认识宇宙的，而佛法是通过亲身实证来认识宇宙，所以导致二者在描述世界时，角度也有所不同。</p><p>　　然而，宇宙不但产生了物质世界，也产生了我们生命本身。所以，当然的，我们既可以通过对物质世界的探索来认识宇宙，也可以通过对自身的探索来认识宇宙。那么，哪个途径更快捷呢？结果显而易见。如果科学能正视佛法，相信“大一统理论”的实现，将会少走许多弯路。</p><h3>　　众生相续</h3><p>　　佛陀继续说道：“富楼那。无明之所以是虚妄的，不在于别的，只是因为它依赖于内容而存在。虚妄的明了一旦被限制在内容之中，则见不外乎色相，听不外乎声音。连同香、味、触、法，六种妄尘一旦成就，见闻觉知，从此分开。有共同业缘的众生，彼此缠缚而生；有独立业缘的众生，则以离合的形式化生。</p><p>　　胎生的众生，最初一点灵明，在黑暗之中见到光亮，并对产生光亮的色相，生出欲想。与自己的喜好不同，就产生厌憎；与自己的喜好相同，则产生喜爱。一旦流露出爱欲，就种下了投生的种子。而<a href=\"https://www.guang5.com/rmgjc/qingai.html\" class=\"keylink\" target=\"_blank\">情爱</a>的想法，则被纳成胞胎。所以父母的交媾一旦发生，有相应业缘的众生就会被吸入，形成胎儿。</p><p>　　胎卵湿化这四类众生，各有成因。卵生是因为乱想，胎生是因为情欲，湿生是因为合和，化生是因为离旧应新。情想合离，化育出芸芸众生。他们彼此牵缠，互相变易，随着各自的业缘，而生死沉浮。众生因此得以相续。</p><h3>　　业果相续</h3><p>　　富楼那。情想一旦和爱欲结合在一起，爱欲就不能舍离。所以会有世间的父母子孙，相生不断。这都是以欲望和贪婪为本。</p><p>　　贪婪再与爱欲互相滋润，贪婪便不能舍离。由此，世间的胎卵湿化四类众生，弱肉强食。这都是以杀戮和贪婪为本。</p><p>　　人以羊为食。羊死为人，人死为羊。类似这样，十类众生，死死生生，互相食啖，恶业牵缠，无穷无尽。这都是以偷盗和贪婪为本。</p><p>　　你欠我的命，我还你的债。以此因缘，经百千劫，常在生死。你爱我的心，我怜你的色。以此因缘，经百千劫，常在缠缚。杀、盗、淫，这三者为一切业缘的根本。以此因缘，业果得以相续。”</p><p>　　志公禅师曾做过一首偈子，生动地描述了业果相续的情景。</p><p>　　志公禅师是南北朝时期的得道高僧。传说他是由一位姓朱的妇人从鹰巢中抱回来，所以他的手脚长的都像鹰爪。他七岁出家，法号宝志。齐武帝时期，志公禅师就屡现神异，江东一带的官员和百姓都非常崇信他。齐武帝以妖言惑众，讲志公禅师下狱。虽然下狱了，但人们依然见他云游于市，狱卒去牢房检查，见禅师仍在牢中。</p><p>　　于是，梁武帝即位后，立刻下诏：“大士宝志，迹拘尘垢，游甚冥寂，水火不能燋濡，蛇虎不能侵惧。语其佛理，则声闻之上；谈其隐伦，则遁仙高者，岂可以俗法常情空相疑忌？自今中外，任使宣化。”于是，志公禅师得以出狱，此后常被梁武帝邀到宫中去请教佛法。至今还有《梁武帝问志公禅师因果文》流行于世。</p><p>　　因为梁武帝崇信佛法，所以当时<a href=\"https://www.guang5.com/\" class=\"keylink\" target=\"_blank\">佛教</a>非常兴盛。百姓家有个婚嫁丧娶的，都喜欢找僧人来操办。一次，有个大户人家办喜事，邀请志公禅师前去唱念。禅师到了以后，四下里一看，吟出一首偈来：“</p><p>　　古古怪！怪怪古！孙子娶祖母。</p><p>　　女食母之肉，子打父皮骨。</p><p>　　猪羊席上坐，六亲锅里煮。</p><p>　　众人来贺喜，我看真是苦。”</p><p>　　原来，这个新郎娶的新娘，就是他的祖母的<a href=\"https://www.guang5.com/rmgjc/zhuanshi.html\" class=\"keylink\" target=\"_blank\">转世</a>。他的祖母最疼爱这个孙子，命终以后，还怕自己死了剩下孙子没人照顾。于是，她见到阎罗王，就求阎罗王让她去照顾孙子。阎罗王慈悲为怀，判她来世给孙子当媳妇，以了却她的夙愿。</p><p>　　来贺喜的宾客中，有个小女孩，正在大口大口地吃着羊肉。而这个羊，就是她的母亲去世后投生的，所以说：“女食母之肉。”</p><p>　　在乐棚中，鼓手正起劲地“咚！咚！咚！”地敲着鼓。原来，鼓手的父亲去世后，投生为驴，这个鼓就是用那头驴的驴皮做的。所以说：“子打父皮骨。”。</p><p>　　在座的客人，一个个喜笑颜开的，其实都是这家人以前吃的猪样投胎来讨债的。所以说：“猪羊席上坐。”</p><p>　　厨房的锅里，正在熬着肉汤。这些肉都是这家人前世的六亲眷属，而今投胎做了畜生，被人宰杀。他们前世吃的猪羊而今做了人，又来吃他们。前世你吃我，今生我吃你。所以说：“六亲锅里煮。”</p><p>　　正如佛说的，众生由于贪爱和杀戮，在业缘的牵引下，“经百千劫，常在缠缚。”志公禅师最后说：“众人来贺喜，我看真是苦。”这就是轮回的真相。</p><p>　　接下来，如来总结道：“富楼那。这三种颠倒相续，都是因为在自性的本明之外，非要寻求一个明了的内容，因而产生了妄相。从妄见中，生出了山河大地这些有为相，次第迁流，幻中生幻，终而复始。\t\t</p></div>"
    },
    {
        "title": "第十一章 如来藏",
        "author": "",
        "date": "",
        "html": "<div class=\"B1_text\"><h2>第十一章 如来藏</h2><p>　　这一章里，如来讲述了如来藏妙真如性与种种幻妄，圆融无碍的境界。首先，如来藏中并无幻妄，所以一旦<a href=\"https://www.guang5.com/rmgjc/juewu.html\" class=\"keylink\" target=\"_blank\">觉悟</a>以后，就不会再度迷失。这就好比一个迷路的人，经人指点，找到方向后，就不会再迷路一样。同时，如来藏又不会拒绝任何幻妄。明了本就是如来藏的性质。背离了如来藏的妄明，它之所以还能”明“，是因为它用的就是如来藏的明。所以，妄明的本质就是如来藏。那么妄明中所幻化的一切，不是如来藏还能是什么呢！所以如来藏并非一切幻妄，如来藏又就是一切幻妄。如来藏中没有”是“与”非“，凡夫怎么能用是非之心，去测度如来藏妙觉性海呢！</p><h3>　　觉后无迷</h3><p>　　富楼那继续问佛：”如果这个妙觉真心，本来明了，不增不减，无端地忽然产生山河大地，诸有为相。如来今日已经证得妙空明觉，山河大地这些有为的习漏，什么时候会复生呢？“</p><p>　　佛告诉富楼那：”譬如一个迷路的人，在一个聚落中，把南当成了北。这个迷，是因迷而有，还是因悟所出呢？“</p><p>　　富楼那说：”既不是因为迷，也不是因为悟。为什么呢？迷本来也没有根。所以，这个迷怎么能从迷中出生呢；悟就是不迷。既然是不迷，自然就不会产生迷。“</p><p>　　如来继续道：”这个迷人，正在迷惑的时候，忽然遇到明白人点醒了他，令他觉悟。富楼那。你说这个人，在这个聚落中，还会再迷惑吗？“</p><p>　　”不会的。世尊。“</p><p>　　”富楼那。十方如来，也是这样。迷没有本体，本性就是空的。本来没有迷。好像有个迷的感觉，一旦明白过来，迷也就消失了。明白以后，也就不会再迷了。又比如眼睛有翳病的人，见空中有花。翳病一旦好了，空中的花就消失了。忽然有个人，在空花消失的地方，等着新花再次出现。你说这个人，是愚蠢呢，还是智慧呢？“</p><p>　　富楼那回答说：”空中原本就没有花。花是幻妄所生。见到花消失在空中，已经是颠倒了，还要让它再出来，这实在是痴狂。这样的狂人，根本谈不上是愚蠢还是智慧。“</p><p>　　佛说：”既然是这样，你为什么还要问，诸佛如来的妙觉明空中，何时会再次生出山河大地呢！又比如金矿提炼成真金，就不会再有杂质。木头烧成灰，就不会再成为木头。诸佛如来菩提涅槃，也是这样。“</p><h3>　　色尘如影</h3><p>　　”富楼那。你还问道，地水火风，本性圆融，周遍法界。水火为什么不相陵灭。又问虚空和大地，都周遍法界，彼此本不该相容。富楼那。虚空自己没有色相，却不拒绝色相的发挥。为什么呢？富楼那。虚空中，日照则明，云积则暗；风吹则摇动，霁澄则清；气凝则浊，土积成霾，水澄成映。这千差万别的种种形象是另有所生，还是虚空所有？</p><p>　　富楼那。如果是另有所生，那么，日照之时，光明如果是源自太阳，那么十方世界，就应该跟太阳同为一个颜色。如果同为一个颜色，你为什么还能在空中见到太阳呢？若是虚空自明，虚空应该自行照耀，为什么夜黑云重的时候，就没有光亮呢？</p><p>　　要知道，光明既不是太阳，也不是虚空，又不异于太阳和虚空。色相本来就是虚妄的，无可指陈。犹如空中狂花，只能结出空果。为什么还要追究谁侵凌了谁呢？真如觉明，也是这样。</p><p>　　你若想去‘明了’虚空，就有虚空出现。地水火风，各个明了，就各个出现。若都想明了，就都出现。怎么会全部出现呢？富楼那。譬如一汪清水中，有一个日影。有两个人同时观看水中的日影。这两个人一东一西，反向而行，就会各有一个日影，随着二人而走。一东一西，并没有一个确切的地方。你不应该因此强问，一个日影，怎么会跟着两个人走呢。如果说这两个人一人一个太阳，为什么大家看到的又是同一个日影呢？这样翻来覆去地推究这些幻相，根本拿不出什么真凭实据。</p><p>　　你用色相和虚空倾夺如来藏，如来藏就随着色空，周遍法界。因此，在其中会有风动空澄，日明云暗。众生迷闷，背觉合尘。所以会有这些尘劳妄相。</p><h3>　　科学的巅峰</h3><p>　　对于如来前面说的，色尘就好比如来藏随着心念所显现的幻影，科学界最近提出的“全像式模型理论”，正好与此不谋而合。下面，我们不妨结合Michael Talbot的论文，来了解一下全像式模型理论。</p><p><strong>　　一个惊人的实验</strong></p><p>　　一九八二年，巴黎大学的物理学家Alain Aspect所领导的一个研究组织，进行了一项也许会成为二十世纪最重要的实验。他们发现在特定的情况下，次原子的粒子们，例如电子，同时向相反方向发射后，在运动时能够彼此互通信息。不管彼此之间的距离多么遥远，十公尺或是十万万里远，它们似乎总是知道相对一方的运动方式。在一方被影响而改变方向时，双方会同时改变方向。</p><p>　　这个现象的问题是，它违反了爱因斯坦的理论：没有任何通讯能够超过光速。由于超过了光速就等于能够突破时间的界线，这个骇人的可能性使一些物理学家试图用复杂的方式来解释。但是它也激发了一些更有革命性的解释。</p><p>　　例如，伦敦大学的物理学家David Bohm相信，Aspect的发现是意味着客观现实并不存在。尽管宇宙看起来具体而坚实，其实宇宙只是一个幻象，一个巨大而细节丰富的全像摄影相片。</p><p><strong>　　Bohm的全像式理论</strong></p><p>　　Bohm相信，次原子的粒子能够彼此保持联系，不是因为它们之间来回发射着某种神秘的信号，而是因为它们的分离是一种幻象。在现实的某种较深的层次中，粒子不是分离的个体，而是同一来源的延伸。</p><p>　　为了使人们更容易理解他的假设，Bohm打了一比方：想象一个水箱，里面有一条鱼。也想象你无法直接看到这个水箱，你对它的了解是来自于两台摄影机。一台位于水箱的正前方，另一台则位于侧面。当你看着两台电视监视器时，你可能会认为在两个萤光幕上的鱼是两个单独的个体。毕竟，由于摄影机是在不同的角度拍摄的，所得到的影像也会不同。但是当你继续注视这两条鱼时，你会发现两者之间似乎有某种联系。当一条鱼转身时，另一条也会转身；当一条面对前方时，另一条总是面对侧方。这时，你可能会做出结论，认为这两条鱼一定是来回发射着某种联系信号。但这并非事实。这正是在Aspect的实验中，次原子粒子的实际情况。</p><p>　　Bohm认为，次原子粒子之间的超光速连接现象其实是在告诉我们，现实有更多更深的层次是我们没有觉察到的，就像那水族箱。而且，我们会把次原子粒子看成分离的个体，是因为我们只看到它们部份的现实。这些粒子不是分离的“部份”，而是一种更深沉与更基本的整体的片面。这种整体具有全像摄影的结构，无法分割。</p><p>　　下面我们需要了解一下全像摄影。全像摄影用镭射光作为光源，并将光源发出的光分为两束。一束直接射向感光片，另一束经被摄物的反射后再射向感光片。两束光迭加后产生干涉，形成底片。人眼直接去看这种感光底片，只能看到像指纹一样的条纹。但如果用激光去照射它，人眼透过底片就能看到跟被拍摄物体完全相同的三维立体影像。而且，如果全像相片的底片被割成两半，然后再用雷射光照射，会发现每一半都会呈现整个的影像。事实上，把这一半再分为两半，然后再分下去，每一小块底片中都会包含一个较小的，但是完整的影像。不像平常的相片，全像相片的每一小部份都包含着整体的资料。</p><p>　　所以，Bohm说，现实中的一切都是由类似于全像摄影底片一样的幻影粒子所组成，于是整个宇宙实际上是一个巨大的投影，一个全像式的幻象。这就表示，在现实的更深层次，宇宙中的一切都是相互包含、密切关连的。每个事物都沟通贯穿着一切事物，一切事物都交互贯穿于一个事物。一切的终极本质，是一个无破绽的巨网。</p><p>　　在一个全像式的宇宙中，甚至连时间与空间都不再是基本不变的。因为在一个没有分离性的宇宙中，位置的观念会瓦解。时间与三度空间就像电视监视器中的鱼，只是一种更深层秩序的投影。过去、现在、未来都共同存在于当下的一念。</p><p>　　这种超级全像式的宇宙还包含了什么，永远是一个开放而无解答的问题。为了方便讨论，假设这种超级全像式的结构是宇宙一切事物的根源，至少它包括了过去和未来所有存在的次原子粒子--一切事物和能量的所有可能组合--从雪花到夸粒子，从蓝鲸到伽玛射线，它可以被视为一种宇宙性的储藏库，包括了所有存在过的一切。</p><p><strong>　　Pribram的全像式脑部模型</strong></p><p>　　在脑部研究的领域中，史坦福大学的脑神经学家Karl Pribram也完全相信现实的全像式本质。</p><p>　　近几十年来，许多研究显示，记忆的储存不是单独地限于特定的区域，而是分散于整个脑部。在一九二零年代的一连串历史性的实验中，脑部科学家Karl Lashley发现，不管老鼠脑部的什么部位被割除，都不会影响它的记忆，它仍旧能表现手术前所学到的复杂技能。唯一的问题是，当时没有人能提出一套理论来解释这种奇怪的“整体存在于每一部份”的记忆储存模式。</p><p>　　到了一九六零年代，Pribram接触到全像摄影的观念，才发现了脑神经科学家一直在寻找的解释。Pribram相信记忆不是记录在脑神经细胞中，或一群细胞中，而是以神经脉冲的图案横跨整个脑部，就像雷射绕射的图案遍布整个全像摄影的底片上。换句话说，Pribram相信头脑本身就是一个全像摄影机。</p><p>　　Pribram的理论也同时解释了人脑如何能在那么小的空间中储藏那么多的记忆。曾经有人估计过，人类的头脑在一生中能够记忆约一百亿位（bits)的资料，大约是五套大英百科全书。相似的，全像摄影也具有惊人的资料储存容量。只要改变两道雷射照射底片的角度，就可以在同一张底片上记录许多不同的影像。有人示范过，在一公分立方的方块底片上，可以储存一百亿位的资料。</p><p>　　如果脑部是根据全像摄影的原理来操作，我们就比较容易了解我们那能“迅速从庞大的记忆仓库中取出所需的任何资料”的特殊的能力。如果一个朋友要你告诉他，当他说“斑马”这个词时，你会想到什么。你不需要笨拙地搜字母档案，相反地，一些联想，如“条纹”、“马”、和“非洲野生动物”等会立刻跳入你的脑中。的确，人类思考过程的一项最惊人的特征是：每一件数据都似乎与其它所有资料相互连接。这也是全像摄影幻象的另一项基本特性。因为全像摄影幻象的每一部份都与其它部份交互关连着，这也许是大自然的交互关连系统的最终极例子。</p><p>　　在Pribram的全像式脑部模型的启发下，另一项谜题--脑部如何翻译它从感官所得到的大量波动，如光波、声波等，使之成为我们知觉的具体世界--也随之解开。记录与解读波动正是全像摄影最擅长的，它能把显然无意义的波动图案转变为连贯的影像。Pribram相信，脑部也有一个镜头，在用全像式原理来数据式地把感官收到的波动转变为我们内在知觉的世界。我们的脑部根据外在波动的输入，以数学方式建立出“坚固”的现实。</p><p>　　事实上，Pribram 的理论得到了越来越多脑神经学家的支持。有大量的证据显示，脑部正是使用全像式原理来进行操作的。</p><p><strong>　　全像式模型理论</strong></p><p>　　当Pribram的全像式脑部模型与Bohm的理论放在一起时，才显现出最令人匪夷所思的地方：如果这个世界的坚固只是一种次要的现实，而真正“存在”的是一团全像摄影式的波动，头脑也具有全像式结构，它只从这团波动中取出部份波动，数学式地转换成感官知觉，那么，客观现实是什么呢？</p><p>　　简单地说，客观现实就停止了存在。正如东方<a href=\"https://www.guang5.com/rmgjc/zongjiao.html\" class=\"keylink\" target=\"_blank\">宗教</a>的教义，物质世界是一种maya，一种幻象。虽然我们以为我们是实质的生物，活在一个实质的世界中，这也是一个幻象。我们其实是漂浮在充满波动的大海中的一个“接收者”。</p><p>　　这种对于现实的惊人的新观点，Bohm与Pribram的合成理论，被称为“全像式模型理论”。</p><p><strong>　　在应用中的发展着的理论</strong></p><p>　　Stanialav Grof是马里兰心理研究中心的主任及霍普金斯大学医学院心理学系助理教授。</p><p>　　在一九六零年代，Grof研究使用LSD（一种迷幻药）做为心理治疗工具的利弊。他有一名女性病人，在迷幻状态中回溯她曾经是一条史前时代的雌性爬虫。她不仅描述了被困在这种爬虫身体中的感觉，同时还说明，在雄性爬虫身上最具有吸引力的部位，是头两侧的一块彩色鳞片区域。使 Grof惊讶的是，尽管这位女患者事前没有对这种爬虫的任何知识，但是在这之后，他从一位动物学家处证实，爬虫头部的彩色部位在性的挑逗上，的确扮演着重要角色。</p><p>　　那位女人的经验并不独特。在Grof的研究过程中，他遇到的病人们几乎回溯了进化史上的所有生物。这个研究影响了电影《替换状态》（Altered States )中人退化为猿猴的情节。这些经验常常会含隐晦的动物学细节，而后来都被证实是正确的。</p><p>　　也有没接受过多少教育的人，突然能详细地描述波斯祅教和印度教的仪式，或者能给予令人信服的灵魂出体报告，或预见未来，或倒退回前世的回忆。Grof称此现象为“超个人经验”（transpersonal experiences)。在六十年代晚期，他创立了心理学的一支，称为“超个人心理学”（transpersonal psychology)。</p><p>　　但是这几十年来，Grof和他的同僚都无法提供一个理论体系，来解释他们所看到的奇异的心理现象。但是全像式模型理论的出现改变了这个情况。如Grof最近所言，如果心灵的确是一个整体的一部份，这个整体像一个巨大的迷宫，它不仅连接一切心灵，包括过去、现在、未来，同时也连接一切原子，一切生物，以及时间与空间本身的无限，那么，心灵偶尔会涉足于这个迷宫，产生超个人的经验，就似乎不足为奇了。</p><p>　　Bohm与Prigram也指出，许多宗教或神秘经验，如与宇宙合一的超越体验，或许也是因为进入了全像式领域之中。如他们所言，也许过去许多伟大的神秘体验者所谈论的一种“宇宙一体”的感觉，只是因为他们知道如何进入他们心灵中一切真正与宇宙合一的那部份。</p><p>　　全像式模型理论也可以应用到所谓的基础科学，如生物学和医学。维琴尼亚州Intermont大学的心理学家Keith Floyd指出，如果现实世界只是一个全像式的幻象，那就不能再说脑部产生意识，而是意识创造了脑部和身体，以及环绕着我们四周的一切。被我们当成实有的世界，都是意识所创造的。</p><p>　　如此对世界和生物结构的观点逆转，使研究者发现，医学及我们对于医疗程序的了解，也可以被全像式模型理论所改变。如果身体的实质结构只不过是意识的全像式投射，那么，我们每个人对于自身<a href=\"https://www.guang5.com/rmgjc/jiankang.html\" class=\"keylink\" target=\"_blank\">健康</a>的责任就要大大超过目前医学知识所容许的。现在我们视之为奇迹般的疾病康复，就可以得到解释：由于意识的改变，而影响了全像式身体的改变。同样的，一些令人争议的新医疗技术，如意念的想象，之所以会如此有效，是因为在全像式的领域中，意念的影像是与“现实”一样的真实而有效。</p><p>　　甚至在“非寻常现实”（non-ordinary reality）中的异象与经验，也可以在全像式模型理论之下得到解释。生物学家Lyall Watson在他的《未知事物的礼物》（Gift of Unknown Thing）一书中描述了他与一位印度尼西亚女巫士的接触。</p><p>　　她借着表演一种仪式舞蹈，能够使一整排树瞬间消失在空气中，又能使树群重新出现，然后再消失。虽然目前的科学无法解释此类事件，但是如果“坚硬”的现实只是全像式的投影，那么这种神通经验就有理可循。也许我们公认什么是“存在”或“不存在”的，只是因为我们所谓共识下的现实，是架构于人类的潜意识中，一切心灵都相互连接的领域。</p><p>　　如果这是真实的，这将是全像式模型理论中最重要的意义所在，因为这表示如Watson的经验之所以是不寻常的，只是因为我们没有智慧促使我们的心灵来相信如此经验是真实的。在全像式的宇宙中，我们改变现实结构的可能性是无止境的。目前我们所觉知的“现实”只是一幅画布，等待我们着手画任何我们想要的图画。任何事都有可能，从用意念的力量来弯曲汤匙，到人类学家Castaneda与亚基印地安巫士Don Juan的奇幻经验。因为神通是一切生命的本能。魔术是我们的天生权利。这并不比我们在梦中创造现实的作法更为神奇！</p><p>　　以上就是目前科学关于全像式模型理论的探索。</p><p>　　不难看出，全像式模型理论所说的原理，与如来所说的如出一辙。Bohm所说的“更深沉与更基本的整体”，正是如来所说的“如来藏妙真如性”。而“全像式幻象”，正是如来所说的“空中狂花”。“ ‘存在’或‘不存在’只是因为我们所谓共识下的现实”，正是如来所说的“众生共同的妄业”等等。</p><p>　　全像式模型理论仿佛就是在用科学的语言来解释佛法。科学发展的到这里，终于实现了与佛法的殊途同归。</p><p>　　所不同的，只是科学对于全像式模型理论所揭示的真理，还处在不断地探索和完善中，而如来却早已亲身证得，并且和盘托出。接下来，我们就看看如来是怎样解释这个所谓的“更深沉与更基本的整体”的。</p><h3>　　如来藏</h3><p>　　如来继续说道：“我以不灭不生的妙明与如来藏相合。如来藏的全体就是妙明，圆照法界。所以，在如来藏中，一为无量，无量为一。小中现大，大中现小。不动道场，遍十方界。身含十方无尽虚空。于一毛端，现宝王刹。坐微尘里，转大法轮。只因为灭尘合觉，所以显发真如妙觉明性。</p><p>　　而如来藏本妙圆心，不是心也不是空，不是地也不是水，不是风也不是火，也非眼耳鼻舌身意，非色声香味触法。非眼识界，乃至非意识界。非明亦非无明。非无明尽。乃至非老非死。非老死尽。非苦非集。非灭非道。非智非得。非大涅槃。所以，不是一切世间法和出世间法。</p><p>　　如来藏元明心妙。即是心即是空。即是地即是水。即是风即是火。即是眼即耳鼻舌身意。即是色声香味触法。即是眼识界。乃至即是意识界。即是明即是无明。即是无明尽。乃至即是老即是死。即是老死尽。即是苦集灭道。即是智即是得。即檀那。即是精进、持戒、忍辱，精进，禅定、般若。即是波罗蜜多。乃至即是大涅槃。常乐我净。所以，就是一切世间法和出世间法。</p><p>　　如来藏妙明心元，离即离非，是即非即。世间的<a href=\"https://www.guang5.com/rmgjc/liudao.html\" class=\"keylink\" target=\"_blank\">六道</a>众生和出世间的声闻缘觉，怎么可以用自己的所知之心，来测度如来的无上菩提呢！用世间的语言，入佛知见。就如同琴瑟箜篌琵琶，虽然有妙音，如果没有妙指，终究发不出声来。你与众生，也是这样。本觉的真心，人人圆满。我一按指，则流出性海妙音。你一举心，则扬起幻妄尘劳。这都是因为你不勤求无上觉道，爱念小乘，得少为足。\t\t</p></div>"
    },
    {
        "title": "第十二章 无戏论法",
        "author": "",
        "date": "",
        "html": "<div class=\"B1_text\"><h2>第十二章 无戏论法</h2><p>　　这一章里，世尊最后揭示了妄想和因缘的本质，终于使阿难和富楼那豁然开朗。妄想既然是妄，怎么会有因呢！所谓的因，只能是妄想自己，以妄因妄，以迷因迷。画地为牢，作茧自缚而已。一旦醒悟过来，妄想就荡然无存。菩提也不是因缘所生。因为有生就会有灭。有生有灭，是生灭法。无生无灭，才是菩提。所以，所谓的因缘、自然、合和等，明白的再多，也只是妄想的中的戏论而已。何必逗留在视听的妄尘中，自己欺骗自己呢！不如远离贪爱，勤修无漏法，求证无上菩提涅槃之道。</p><h3>　　妄想的来源</h3><p>　　富楼那又问：”我与如来的宝觉圆明，真妙净心，本来无异。而我因为妄想，长久以来，被困在轮回之中。今日虽然得证圣果，却仍然没有究竟。敢问如来，一切众生，为什么会有妄想，而自蔽了妙明，受此沦溺呢？“</p><p>　　佛告诉富楼那说：”我拿一个世间的事情问你。在室罗城中，有个人叫演若达多。一天早上他照镜子，见镜子中的头面目清晰，眉目可见，越看越是喜爱。突然他想到，自己的头为什么看不到自己的脸呢。于是就以为自己是鬼魅，而吓得号哭狂奔。富楼那。你说，这个人为什么狂奔？“</p><p>　　富楼那说：”只是因为此人的心发狂了，没有别的原因。“</p><p>　　佛说：”自性本有的妙觉，明圆遍照，本来明了，不假外求。既然称为妄，怎么会有因呢！如果有所因由，怎么还能叫妄呢！妄想自己辗转相因，从迷到迷，迷上加迷，历经尘劫。虽然经佛发明，仍不能返还。这样的迷因，只能是因迷自有。认识到迷本无因，妄想就无所依存了。生尚且没有，更谈不上灭。</p><p>　　觉悟的人，就好像清醒的人说梦中的事，即使心中明白，又怎么能把梦中的事拿出来呢！何况妄想没有原因，本无所有。就像城中的演若达多，没来由地就以为自己没有头，发狂而走，当狂心歇下来的时候，头不会再得到一个；即使狂心未歇，他又能失去什么呢？</p><p>　　富楼那。妄想就是这样的，它能因何而在呢！你只要不随着世界、业果、众生去相续，这三种因缘断了，心中演若达多那样的狂性自然就会歇息，歇即菩提。</p><p>　　胜净明心，本来周遍法界，不是从别人那里获得的，所以，哪里需要辛辛苦苦地去修证呢！譬如有人，衣服中就揣着如意宝珠，自己却毫无所知，到处乞食。虽然他确实贫穷，宝珠却不曾丢失。忽然遇到智者，告诉他如意宝珠，能随你的心愿，想要什么，就能变出来什么。乞丐因此的到了巨富。这时他才明白，宝珠不从外得。</p><h3>　　因缘和自然</h3><p>　　这时，阿难又在大众中站出来，顶礼佛足，然后站起来问道：“世尊刚才说‘杀、盗、淫这三个业缘断了，三因不生，心中的狂性自然歇息。歇即菩提。不从他处获得’，这不就是因缘吗！明明白白的。为什么如来还摒弃因缘呢？我是从因缘而开悟的。世尊。不光是我们年轻的声闻，在场的大目犍连及舍利弗、须菩提等老梵志，也是听了佛说的因缘法而开悟，得成无漏圣果的。世尊今天说菩提不从因缘而得，这样，王舍城中拘舍黎等说的自然法，就成了第一义。请世尊大发慈悲，解开我的迷闷。”</p><p>　　佛告诉阿难：“就如城中的演若达多，狂性的因缘如果灭除，不狂的本性自然会流出来。因缘自然之理，最多不过如此。</p><p>　　阿难。如果说，演若达多的头是自然的。那么本自其然才叫自然。既然本来就是这样的，又怎么会发狂奔走呢？</p><p>　　如果说是自然本有的头，会由于因缘而发狂。那么，为什么自然本有的头，不会由于因缘而真的失去呢？</p><p>　　头本来也没有失去。狂性也是虚妄的。本来没有发生任何变化，何须借助因缘来解释呢！</p><p>　　如果狂性是自然的，本来就存在。那么没有发狂的时候，它在哪里呢？</p><p>　　如果不狂是自然的，头又不会产生狂念，是什么原因使他发狂的呢？</p><p>　　如果知道了头一直都在，意识到自己不该发狂，则因缘和自然，就都成戏论了。</p><p>　　所以我说，三种相续断了，就是菩提心。如果因此就认为是菩提心产生了，生灭心灭掉了，这还是属于生灭法。灭生俱尽，才是真如。所以修行也得会‘无功用道’。如果还有一个自然，这样就是自然心生，生灭心灭了。这还是生灭法。</p><p>　　无生无灭，名为自然。比如世间的各种相，杂和在一起，这叫做和合性。不是合和而来的，称作本然。本然也不然，和合也不合，和合和本然全都离开，连离合都没有，这才是‘无戏论法’。</p><p>　　菩提涅槃，还很遥远。除非经过历劫的辛勤修证，否则，虽然你能记忆如来恒河沙数的清净妙理，终究也只是戏论而已。虽然你对因缘、自然通达明了，人间称你为‘多闻第一’，但是仍然不能摆脱摩登伽女之难。否则，何必等我用楞严神咒，使摩登伽女的欲火熄灭，证得阿那含果，干枯了她的爱河，在我的佛法中精进修行，你才能得到<a href=\"https://www.guang5.com/rmgjc/jietuo.html\" class=\"keylink\" target=\"_blank\">解脱</a>呢！</p><p>　　所以，阿难，你虽然长久以来，记忆如来的妙法，不如一日修无漏之法，远离世间的憎爱。就像摩登伽女那样，她本来是个妓女，由于楞严咒的神力，销除了她的爱欲，于我座下出家，法名性比丘尼。她与罗睺罗的母亲耶输陀罗比丘尼，都通晓了夙世因缘，知道自己多生多劫，都是因为贪爱而受苦，因此一念之间，修无漏善法，而出离生死的缠缚，蒙佛授记。为什么你还要自己欺骗自己，逗留在视听的妄尘中呢！”\t\t</p></div>"
    },
    {
        "title": "第一章 二决定义",
        "author": "",
        "date": "",
        "html": "<div class=\"B1_text\"><p style=\"text-align: center;\"><strong><span style=\"color:#b22222;\">下部 修证真我</span></strong></p><p style=\"text-align: center;\"><img alt=\"&#x5E26;&#x4F60;&#x8BFB;&#x61C2;&#x695E;&#x4E25;&#x7ECF;&#xFF1A;&#x4E0B;&#x90E8; &#x4FEE;&#x8BC1;&#x771F;&#x6211;\" src=\"https://www.guang5.com/uploadfile/2018/0105/20180105034632394.jpg\" title=\"&#x5E26;&#x4F60;&#x8BFB;&#x61C2;&#x695E;&#x4E25;&#x7ECF;&#xFF1A;&#x4E0B;&#x90E8; &#x4FEE;&#x8BC1;&#x771F;&#x6211;\" /></p><p>　　反闻闻自性，性成无上道！</p><h2>第一章 二决定义</h2><p>　　道理明白了以后，接下来，世尊开始教阿难具体的修行方法。修行首先是“发心”。用妄尘中的生灭之心，去求证如来的无生灭之果是不行的。所以，必须要用自性本有明性--就是游离于一切视听之外的，那个能视能听，能明了一切的明性--伏住一切生灭，将其旋归本明，以这个无生无灭的觉心，作为因地的发心才行。其次，因为是六根把众生缠缚在有形世界中，所以要修行就要打开六根。而六根功能各异，这就需要在六根中选择最为圆通的一根入手。只要一根归元，显发本明，其余五根，随即脱落。六根一旦解除，一切幻妄顿时消灭，真如本性自然显发。</p><p>　　阿难和在场的大众，听了如来的教诲后，消除了心中的疑惑，了悟到真如实相，身心得到从未有过的轻安。</p><p>　　阿难感动得热泪盈眶，于是再次顶礼，长跪合掌，对佛说：“无上大悲的佛陀啊！您打开了我迷闷的心。您能以种种因缘，方便提携，引导沉沦的众生，出离苦海。世尊。我虽然知道了如来藏妙觉明心遍十方界，含育如来十方国土。如来又责备我多闻无功，不如实修。我就如同漂泊的旅人，忽然遇到天主赐给我鲜花做成的房子。但是，虽然房子有了，却要有门才能进去。所以，惟愿如来指示我和大众，获得无余涅槃的方法。还没有证得圣果的<a href=\"https://www.guang5.com/rmgjc/xingzhe.html\" class=\"keylink\" target=\"_blank\">行者</a>，怎样才能摄伏计度攀缘的心，得到总持，入佛知见呢？”说罢，五体投地。在场的大众，也都一心恭候如来的慈旨。</p><p>　　这时，世尊怜悯在会的缘觉声闻，对于真如自性，还不能<a href=\"https://www.guang5.com/rmgjc/zizai.html\" class=\"keylink\" target=\"_blank\">自在</a>趋入，也为了能让将来的众生，明白修行之路，于是对阿难和大众宣示道：“你们发起坚定的菩提心，勤求如来圣境，不知疲倦，首先应该明白最初发起觉悟之心的二种决定义。什么是初发心的二决定义呢？</p><h3>　　发心根本</h3><p>　　第一义。你们应该审查一下因地的发心，与果地的觉，是不是相同的。阿难。如果在因地，以生灭心为修行的本因，以求佛乘不生不灭的境地，那是不可能的。所以，你应该明白，有形世间的一切都是会变灭的。阿难。你看世间的一切，谁能永远不坏呢？但是，却绝不会有烂坏的虚空。为什么呢？因为虚空是不会改变的，所以始终不会变灭。</p><p>　　你的身体中，坚硬的属地，湿润的属水，温暖的属火，摇动的属风。因为四大的缠绕，把你湛圆的妙觉明心，分散成视、听、觉、察。从始至终，五重浑浊。</p><p>　　什么是浊呢？阿难。譬如水本来是澄清的，土本来是滞碍的，二者本不相容。有人把尘土投入净水之中，从此，土不再滞碍，水也不再澄清。这时的样子，就叫做‘浊’。你的五浊，也是这样。</p><p>　　阿难。你见虚空遍十方界。空和见是不能分开的。如果有空无见，空就会因为无处显发而没有体相；有见无空，见就会因为缺乏内容而变得没有觉知。空与见交织在一起，虚妄因此形成，这是第一重浑浊，名为劫浊。</p><p>　　你的身体由四大构成。见闻觉知，被有形的身体塞在里面。地水火风与见闻觉知交织在一起，构成虚妄，这是第二重浑浊，名为见浊。</p><p>　　你心中的所忆所想，引发了种种知见，并通过六尘表达出来。离开六尘，知见就没有体相；离开知见，六尘就没有体性。知见和六尘交织在一起，构成虚妄，这是第三重浑浊，名为烦恼浊。</p><p>　　你朝夕之间，都在变灭不停。知见使你总想留在世间，业力却牵引着你轮转于他方国土。知见和业力交织在一起，构成虚妄，这是第四重浑浊，名众生浊。</p><p>　　见闻觉知本来是一体的。因为被尘相限制，而彼此隔离开来。本性虽然相同，功用却已经各异。一同一异交织在一起，构成虚妄，这是第五重浑浊，名为命浊。</p><p>　　阿难。你现在要通过见闻觉知，契入如来常乐我净的涅槃妙德，这就应该先找到死生的根本。依据不生灭的自性，以自性的湛明，把虚妄的生灭伏住，使其旋归元觉，得到那原本无生无灭的明觉，以此作为因地的发心，然后才能圆成果地上的修证。”</p><p>　　具体怎样把生灭心伏住，旋归元觉，得到无生灭的心呢？对此，圆瑛大师解释的非常精辟：“旋”字即下手工夫。将自己圆湛心中，提起一段心光，不外照根身器界，但内照本源心性，自可旋浊成清，旋妄复真矣！ “</p><p>　　如来继续说道：”这就好比要澄清一杯浑水，只要把它静静地放在那里，时间久了，沙土自然会沉淀下去，露出清水。这叫做初步伏住客尘烦恼。如果把泥土全部除去，只剩纯水，这就是永远断除了根本无明。这时，明相精纯，什么都可以变现，永远不会再有烦恼，一切都符合涅槃的清净妙德。</p><h3>　　烦恼根本</h3><p>　　第二义。你们既然决定发菩提心，对菩萨乘勇猛精进，抛弃有为相，就应当仔细审查烦恼的根本。这无始劫以来造做诸业，滋养生死的，到底是谁在作，谁在受？阿难。你修菩提，如果不审查烦恼根本，就不能知道虚妄的根尘，到底何处颠倒。颠倒的地方都找不到，又怎么降伏颠倒呢？</p><p>　　阿难。你看世间解结的人，不知道结的所在，怎么能解开呢！没听说虚空可以被解开的。为什么呢？因为虚空没有形象，无结可解。你的眼、耳、鼻、舌、身、意这六贼，劫夺了你自家的珍宝。因此无始劫来，与众生世界产生缠缚，所以对有形的世间，不能超越。</p><p>　　阿难。什么叫众生世界呢？世为时间，界为方位。东、西、南、北、东南、西南、东北、西北、上、下合称为界；过去、未来、现在为世。方位有十个，时间有三段。一切众生，都是由这些幻妄而编织成相。于是，身体中就会有世相和界相的贸易迁变，相交相涉。</p><p>　　界虽然有十方，但上下没有确定的位置，中间又没有固定的地方。所以，只用东西南北就可以确定方位了。东西南北四个方位，与过去、现在、未来三世配合。三四四三，总括为十二重世界。以此为基础，重迭三层，从十到百，从百至千。这样，六根之中，便各有一千二百种功德。</p><p>　　阿难。你在其中判断一下优劣。眼睛只能看到前面，看不到后面。加上左右，只能看到三分之二的空间，所以，眼根只有八百功德。</p><p>　　耳朵听声音，四面八方，毫无遗漏。， 兢兢业业，没有休息。所以，耳根能圆满一千二百种功德。</p><p>　　鼻子闻气味，靠的是呼吸的出入。有出有入的时候能闻到，而间歇的时候，就闻不到了。所以，三分中缺一分，鼻根只有八百功德。</p><p>　　舌根用来讲法。世间出世间的一切智慧，言语虽然有限，道理却无穷无尽。所以，舌根圆满一千二百种功德。</p><p>　　身体的触觉，要靠接触。有接触的时候有感觉，一旦离开就没有知觉了。离是一分，合是双方，所以三分缺一，身根只有八百功德。</p><p>　　意识默默地包容了十方三世，世间出世间一切法。无论圣凡，都是如此。所以意根圆满一千二百功德。</p><p>　　阿难。你要在生死欲流之中逆流而上，返本还源，就应当先检验这六根的受用，谁合谁离，谁深谁浅，谁为圆通，谁不圆满。你要在这六根之中，找到最为圆通的一根。然后，依靠最圆通的这一根，来超越这妄想所编织成的业流。</p><p>　　要知道，依圆通的根来修持，与用不圆通的根相比，迟速的差别，犹如日与劫的差别。我已经告诉了你这六根的功德。你可以详细选择，哪一根可入。然后，我会为你讲解修行的方法。</p><p>　　十方如来，对于十八界，一一修行，都获得了无上菩提。这中间，本来并没有优劣。但你根基下劣，还没能圆证自在，所以我令你一门深入。通过一根而证入无妄的境界，所有的六根，一时都得清净。</p><h3>　　六根同源</h3><p>　　阿难问佛：“世尊。为什么逆流而上，深入一门，就能令六根一时都得清净呢？”</p><p>　　佛告诉阿难：“你已经证得须陀洹果，灭掉了见惑。但你还不知道，根中积累了无始劫来所形成的虚妄习气。这种虚习，是要靠修行来断除的。何况这中间还有生住异灭，千头万绪。你先看看眼前这六根，是一还是六？</p><p>　　阿难。如果说是一，耳为什么不能见，眼为什么不能闻，头为什么不能走，脚为什么不能说呢？如果说是六，那么，比如今天我给你讲了这个微妙的法门，你的六根，谁来领受？”</p><p>　　阿难说：“我是用耳朵听到的。”</p><p>　　佛说：“如果是耳朵自己听的，跟身、口又有什么关系呢！你为什么还能用口来请教其中的义理，用身来实践修证的行为呢？</p><p>　　耳不能见，眼不能闻，所以六根不是一，而是六；耳听到法后，口能问法，身能行法，所以六根不是六而是一。这样一来，难道说这六根既是一，又是六？</p><p>　　所以，阿难，要知道，六根既不是一个，也不是六个。这都是因为无始劫来的颠倒沉沦，在圆湛的自性中，幻化出一和六的分别。你虽然证得须陀洹果，消融了六尘的差别，却还没有灭掉形成六根的这一念分别法执。</p><p>　　比如虚空，能适应所有容器。但是，由于容器形体各异，而导致容器中虚空的形态也随之各异。如果除去容器，这时，虚空就同归一体。其实，虚空哪里会因为容器，而变得相同或者相异呢！更何况是一和多个这样的名目了。</p><p>　　六根的受用，也是这样。</p><p>　　由明暗二种形相，在圆湛的自性中粘着湛觉，而引发了见。见精映出种种色相，并与色结合，而形成眼根。眼根聚合清净的四大，形成眼睛，形如蒲萄。从此，眼根便被局限在眼睛中，奔逐于色相。</p><p>　　动静相击，在妙圆的自性中粘着湛觉，而引发了听。听精映现出声尘，卷声成为耳根。耳根集合清净的四大，形成了肉耳。耳朵的形状如同一片卷着的叶子。从此，耳根便被限制在声尘中，而流逸于声音了。</p><p>　　通塞相发，在妙圆的自性中粘着湛觉，而引发了嗅。嗅精映现出香尘，纳香成为嗅根。嗅根集结清净的四大而形成鼻子。鼻子的形状如同垂下的手抓。从此，嗅根便被限制在嗅尘之中，奔流于香味了。</p><p>　　甜淡相参，于妙圆的自性中粘着湛觉，而引发了尝。尝映衬出味尘，绞味成味根。味根结合清净的四大形成舌头。舌头的形状，如同偃月。从此，味根便被限制在味尘中，奔逸于味觉了。</p><p>　　离合相摩，在妙圆的自性中粘着湛觉，从而映现出触，抟触成根。触根聚集清净的四大而成为身体。身体的形状如同腰鼓颡。从此，触根便被限制在触尘之中，终日追逐触觉了。</p><p>　　由生灭这二种相续，在妙圆的自性中粘着湛觉，引发了知。知映衬出法相，揽法成根。意根再纠集清净的四大而成为意识。意识就好像在一个幽暗的房间里看东西似的。从此，浮根四尘，就留恋在意思之中了。</p><p>　　阿难。这六根用自性本有的觉明，去另寻明了。从而失去了觉性，沾着在妄相上发光。所以，你如今离开明暗，就无所见。离开动静，就不能听。离开通塞，就没法嗅。离开甜淡，就失去尝。离开离合，触无所出。离开生灭，知无所寄。</p><p>　　你只要不追随明暗、动静、离合、甜淡、通塞、生灭这十二种有为相。选择一根，使它脱离妄尘的粘着，伏归真元，显发本有的明觉。本明一旦显耀，则其余五根的粘着，随即脱落。不用前尘所引起的知见，使一点灵明不随根而走，而是由根来显发。这样，六根就能互相为用。</p><p>　　阿难。你不是知道吗！在场的阿那律陀，无目而视。”</p><p>　　阿那律陀无目而视是怎么回事呢？原来，阿那律尊者本来是佛的堂弟，白饭王的儿子。但是，他有个毛病，就是好睡觉。佛一讲经，他就睡觉。佛就呵责他：“咄咄胡为寐，螺蛳蛤蚌类。一睡一千年，不闻佛名字。”阿那律陀从此奋发图强，发愿再不睡觉。于是，他七天七宿都没合眼，眼睛就瞎了。佛怜悯他，教他修“乐见照明金刚三昧”。他修这个法的时候，就得到了天眼通。在佛的弟子中，阿那律陀尊者是“天眼第一”。 所以，虽然阿那律陀的眼睛坏了，但他仍然可以“无目而视”。</p><p>　　“跋难陀龙，无耳而听。”</p><p>　　跋难陀龙是个龙神，掌管摩竭陀国的降雨。它使摩竭陀国风调雨顺，所以摩竭陀国的百姓都叫他“善欢喜”。这个龙的耳朵聋了，成了个聋龙。但是这个聋龙也能听。他用什么听呢？龙有一对须子，那对须子可以听。</p><p>　　“殑伽神女，非鼻闻香。”</p><p>　　“殑伽”是印度一条河的名字，发源于雪山的阿耨达池。这个河神是个女的，她没有鼻子，但是仍然可以闻。她用什么闻呢？她用眼睛来闻。</p><p>　　“骄梵钵提，异舌知味。”</p><p>　　骄梵钵提是梵语，翻译到中文叫“牛呞”。“牛呞”就是牛喘气的声音。牛喘气的声音很大，而骄梵钵提出气就像牛喘气那么粗。为什么会这样呢？这是因为骄梵钵提在往昔的因地，做小<a href=\"https://www.guang5.com/rmgjc/shami.html\" class=\"keylink\" target=\"_blank\">沙弥</a>的时候，和一位老和尚在一起。这老和尚证虽然得罗汉果了，但是他老得牙都掉了，吃东西就要慢慢地嚼。这个小沙弥就跟老和尚开玩笑说：“你啊，吃东西真像牛！”就因为说这么一句话，所以他就生生世世得这果报，出入气和牛喘气一个样。但是他现在已经证得阿罗汉果了，所以佛就叫他常在天上住，不要住在人间。为什么呢？因为怕有人看见他也犯恶口。他的舌头像牛的舌头一样，但是他可以知道味道。</p><p>　　“舜若多神，无身有触。在如来佛光的中，可以暂时映现出他的身体。”</p><p>　　舜若多神就是虚空神。他一直因为没有身体而苦恼。所以如来应世的时候，他就求佛赐给他一个身体。佛就用佛光照耀虚空，令他能暂时地显现出身体来。这个身体，就像风一样。这样，他也有了触觉。</p><p>　　“那些得到灭尽定的声闻僧，比如在场的摩诃迦叶，他们很久以来就已经熄灭了意根，也一样圆明了知，并不须要心念。”</p><p>　　摩诃迦叶尊者，现在还在云南的鸡足山中入灭尽定。因为他受佛的付嘱，等<a href=\"https://www.guang5.com/rmgjc/mile.html\" class=\"keylink\" target=\"_blank\">弥勒</a>佛下生的时候，要把释迦牟尼佛的衣钵交给弥勒佛。</p><p>　　“阿难。如果你的六根完全剥脱，自性的智光，滢滢照耀。此时，世界的一切浮尘，形形色色的一切变化，犹如热汤销冰，应念化成无上知觉。</p><p>　　阿难。世人看都是通过眼睛来看。比如有人，闭上眼睛，眼前只见一片黑暗，分不清哪个是头，哪个是足。这时，如果用手沿着身体上下摸索，虽然看不见，却依然可以分辨出哪个是头，哪个是足。可见，不论六根中的哪一根，觉知都是相同的。见是要有光明的，黑暗中就什么也看不见。但知觉却是本有的，因此即使在黑暗之中，人也不会昏聩。所以根尘消亡之际，知觉怎能不圆满遍照呢！</p><h3>　　闻性不灭</h3><p>　　阿难又问：”世尊。就像佛说的，因地的发心，要在不生灭处发心，这样才能与果地相应。世尊。果地中的菩提、涅槃、真如、<a href=\"https://www.guang5.com/rmgjc/foxing.html\" class=\"keylink\" target=\"_blank\">佛性</a>、庵摩罗识、空如来藏、大圆镜智，这七种虽然称谓有别，但都是清净圆满，坚如金刚王般常住不坏的。而见和听，离开明暗、动静，就没有自体。心念离开前尘，就无所有。为什么要用这毕竟断灭的六根，作为修行的正因，来求证如来七个常住不坏的果地呢？</p><p>　　世尊。离开明暗，见毕竟空。没有前尘，念则消灭。我前思后想，仔细推求，本来没有我的心，那么又是谁立的修行之因，来求证无上正觉的呢？“</p><p>　　佛告诉阿难：”你虽然多闻，但是未尽诸漏。心中只知道颠倒的原因，当颠倒真的现前时，你还无法辨别。为了让你信服，我就以尘事为例，给你解释。“</p><p>　　于是，如来令罗睺罗敲钟一声，然后问阿难：”你听到了吗？“</p><p>　　阿难和大众都说：”听到了。“</p><p>　　等钟声消失后，佛又问：”现在你听到了吗？“</p><p>　　阿难和大众都说：”听不到了。“</p><p>　　这时，罗睺罗又击一声。</p><p>　　佛又问：”现在听到了吗？“</p><p>　　阿难和大众又说：”听到了。“</p><p>　　佛问阿难：”你为什么听到，又为什么听不到呢？“</p><p>　　阿难和在场的大众一起回答说：”击钟的时候，我听到了。时间长了，声音消失，就听不到了。“</p><p>　　这时，如来又令罗睺击钟，问阿难道：”有声音吗？“</p><p>　　阿难和大众都说：”有声音。“</p><p>　　片刻，声音消失后，佛又问：”现在还有声音吗？“</p><p>　　阿难和大众回答说：”没有声音。“</p><p>　　稍后，罗睺罗又撞钟。佛又问：”有声音吗？“</p><p>　　阿难和大众都说：”有声音。“</p><p>　　佛问阿难：”怎么有声，怎么无声的呢？“</p><p>　　阿难和大众回答佛说：”钟被敲击，发出声音，这时有声。时间长了，音响双绝，就无声了。“</p><p>　　佛对阿难和大众说：”你们的回答怎么混乱了呢？“</p><p>　　大众和阿难马上问佛：”哪里混乱了？“</p><p>　　佛说：”我问你听，你就说听。我问你声，你就说声。一会是听，一会是声，这样怎么不是混乱呢！</p><p>　　阿难。声音消失了，你就说听不到了。如果真的听不到，闻性就消失了，人就如同枯木。当钟声再响起来的时候，你怎么还能知道呢？或有或无的是声音，怎么能说你的闻性时有时无呢？如果闻性真的没有了，谁能知道它没有呢？</p><p>　　所以，阿难。流入你耳中的声音，它自己有生有灭。并不是你的闻性随着声音，有生有灭。你到现在还颠倒地把声音当做闻性，难怪你会把真常当做断灭。总不能说，离开动静的声尘和通塞的耳根，就没有听闻性了吧！</p><p>　　比如熟睡的人，家人在他旁边捣米。他在梦中，听到捣米声，会把它当做是击鼓或撞钟。即使在梦中，他也会觉得奇怪，这钟声怎么会是敲木头的声音呢？醒来后他才知道，原来是有人在捣米。阿难。这个人在梦中，哪里会知道静摇、开闭、通塞呢！虽然他在睡觉，闻性却不会昏昧。纵使你的身形销毁，命光迁谢，闻性又怎么会消亡呢！</p><p>　　众生从无始劫来，追随色声，念念流转，从不明白自性的真常。不随顺真常，只一味地追逐生灭，因此生生世世杂染流转。如果抛弃生灭，守护真常，常光现前，尘根识心应时销落。想相为尘，情识为垢，二者远离，你的法眼即时清明，怎能不成无上知觉！</p><h3>　　结在六根</h3><p>　　阿难继续问道：“世尊，如来虽然说了第二决定义，但是我看世间解结的人，如果不知道结在哪里，终究不能解开。世尊。我和此会中的声闻众，也是这样。从无始际开始，便与无明，同灭同生。虽然得到了多闻的善根，名义上已经出家，但还是一时明白，一时糊涂。惟愿大慈世尊，怜悯沦溺的众生，为我们指明，身心的结到底在哪里，怎样才能解开。”说罢，五体投地，洒泪如雨，翘首期盼。</p><p>　　这时，世尊怜愍阿难，以及在会的大众，也想为未来的一切众生，植下出世之因，于是便以阎浮檀紫光金手，摩阿难的顶。立刻，十方佛国世界，六种振动。如微尘一样众多的如来，在各个世界中，从头顶放出宝光，汇聚到祇陀林，灌入释迦牟尼佛之顶。在场的大众，从未见过这样<a href=\"https://www.guang5.com/rmgjc/shusheng.html\" class=\"keylink\" target=\"_blank\">殊胜</a>的境界。</p><p>　　这时，阿难和与会的大众，同时听到十方微尘数的如来，异口同音，告诉阿难说：“善哉。阿难。你欲了知俱生无明。其实，使你轮<a href=\"https://www.guang5.com/rmgjc/zhuansheng.html\" class=\"keylink\" target=\"_blank\">转生</a>死的结根，就是你的六根，更无他物。你欲了知无上菩提。其实，令你速登安乐解脱、寂静妙常的，也是你的六根，并非他物。”</p><p>　　阿难虽然听到这样的法音，心中仍然没有明白，于是，跪问佛陀：“为什么说，令我生死轮回，安乐妙常的，都是六根，并非他物呢？”</p><p>　　佛告诉阿难：“根与尘本来同源，缠缚和解脱也并无二致。识性虚妄，犹如空中狂花。阿难。由尘而产生知，因根而有相。相和见都没有自性，彼此依存。所以，你而今在知见上另立一个知，这就是无明的根本。在知见上没有见，这就是涅槃的无漏真净。这其中怎么还能更容他物呢！”</p><p>　　接下来，世尊又详细地解释道：“</p><p>　　真性中的‘有’和‘空’，都是因缘的幻化。</p><p>　　无所作为，没有起灭，犹如空中狂花一样不真实。</p><p>　　说‘虚妄’是为了显示‘真实’，但有了真和妄的分别，真与妄就同成虚妄了。</p><p>　　既然‘真’和‘非真’都不是真实的，哪里还会有能见和所见呢。</p><p>　　这中间并没有实性，就如同硬币的正反面，只能彼此相互依存罢了。</p><p>　　凡圣的差别，只在于六根是‘结’还是‘解’。</p><p>　　你不要偏执于空，也不要偏执于有，二者都是虚妄的。</p><p>　　迷失于虚妄的晦暗就是无明，能显发自性的觉明就是解脱。</p><p>　　解结要有次第，六根一旦解开，一念法执也随之消亡。</p><p>　　解结时要选择圆通的一根，逆流而上。一旦通达，便汇入正觉的圣流。</p><p>　　自性微妙不可思议，只因为被习气的洪流所遮蔽。</p><p>　　恐怕众生弄不清真假，所以我一般不讲这样真实法。</p><p>　　说到底，都是自心取自心。这一取，本来无幻也生出了幻。</p><p>　　如果不取，就没有‘无幻’。无幻尚且不生，幻又从何而来呢！</p><p>　　这便是妙莲华、金刚王宝觉、如幻三摩提。</p><p>　　依循此法，弹指间便能超越无学，而证入圣流。</p><p>　　十方一切诸佛，都是遵循此路，而步入涅槃的。</p><h3>　　六解一亡</h3><p>　　这时，阿难及在场的大众，听到如来的无上慈诲，心目得到了从未有过的开明。阿难合掌顶礼，再次问佛：”我听到如来，以无尽的大悲，从真如自性中流出的真实法句，心中仍然没能达到六解一亡。以及解结的次第，我仍然不明白。祈求世尊大发慈悲，再施法音，洗涤我的沉垢。“</p><p>　　如来听后，伸手从桌上拿起了夜摩<a href=\"https://www.guang5.com/rmgjc/tianren.html\" class=\"keylink\" target=\"_blank\">天人</a>供养的花巾。在大众前，打了一个结。然后问阿难：”这是什么？“</p><p>　　阿难和大众回答说：”这是结。“</p><p>　　如来接着又打一个结，又问阿难：”这是什么？“</p><p>　　阿难和大众又回答说：”这是结。“</p><p>　　这样，世尊一连打了六个结。每打一个结，都问阿难，这是什么。阿难和大众都回答说，这是结。</p><p>　　佛对阿难说：”我第一次打完，你说叫结。这个花巾，只有一条。第二、第三次，你怎么还叫它结呢？“</p><p>　　阿难回答佛：”世尊。这条花巾，虽然是一条。但是我想。如来打一次，就成一结。如果打一百次，就成一百个结。何况目前只有六个结。为什么如来只许第一个叫结，第二、第三个就不叫结呢？“</p><p>　　佛说：”你知道，这个花巾本来只是一条。我打了六次，所以有六个结。你现在仔细观察，花巾是一体，所打的结各异。我要把第六个结，叫第一个结，这可以吗？“</p><p>　　”不可以。世尊。第六个结毕竟不是第一个。纵使我尽毕生的才智来申辩，也没法使这六个结混乱。“</p><p>　　佛说：”六个结虽然不同，但究其根本，却都是同一条花巾上的。若要令其混乱，终究不能得逞。你的六根，也是这样。虽然它们本来一体，却彼此相异。你一定不希望这样，而喜欢浑然一体。那么，怎样才能浑然一体呢？“</p><p>　　阿难回答说：”如果这些结存在，是非就会随之而来。此是彼非，此非彼是。如来如果能解开这些结，令它们再无彼此。一个尚且没有，哪里还会有六呢！“</p><p>　　佛说：”六解一亡，也是这样。由于你无始劫来，心性狂乱，知见妄发。因为妄想不息，所以引发尘相。如同眼睛疲劳而产生狂花一样。本来湛然的精明中，没来由地胡乱生出山河大地，世间万相，生死涅槃。这些都不过是颠倒的狂花而已。“</p><p>　　阿难又问：”那么，这些劳相和这花巾上的结，怎么解除呢？“</p><p>　　如来右手握住花巾的一头，左手向左边拉。然后问阿难：”这样解吗？“</p><p>　　”不是的，世尊。“</p><p>　　如来又用右手往右边拉，问阿难：”这样解吗？“</p><p>　　”也不是。世尊。“</p><p>　　佛对阿难说：”我用手，往左拉，往右拉都不能解。那你说，怎么能解开？“</p><p>　　阿难回答说：”世尊。应该在结的中心解，这样就解开了。“</p><p>　　佛说：”如是。如是。若要解结，应该在结心。阿难。我说佛法从因缘生，这并不是指世间和合的粗相。如来对世出世间一切法，都明了其最根本的原因。随其所缘，乃至恒河沙数的世界之外落下一场雨，如来也知道所有雨滴的数目。现前的种种，松树的直，荆棘的曲，天鹅的白，乌鸦的黑，如来都明了其中的因缘。所以。阿难。随你心中选择六根，根结一旦解除，尘相自灭，幻妄销亡，不是真还能是什么呢！阿难。我再问你。这花巾上的六个结，如果同时去解，能六个结同时解开吗？“</p><p>　　”不能。世尊。这些结本来就是一个一个打的，解也得一个一个来解。六个结虽然在同一条花巾上，但不是同时打成，解的时候，怎么能同时解除呢！“</p><p>　　佛说：”六根的解除，也是这样。六根初解之后，先证得人空。接着，空性圆明，便得到法解脱。解脱了法以后，人空法空都不再生，这样便从三摩地的定境中，获得了无生忍。\t\t</p></div>"
    },
    {
        "title": "第二章 二十五圣各述圆通",
        "author": "",
        "date": "",
        "html": "<div class=\"B1_text\"><h2>第二章 二十五圣各述圆通</h2><p>　　那么，具体怎样修行，才能打开根结呢？接下来，二十五位圣贤，分别讲述了自己的修行方法。不单单是六根，他们是从六尘、六根、六识和七大入手来修行的，最终都获得了圆通。那么，这其中，到底哪一个方法才是最方便的呢？世尊让智慧第一的文殊菩萨来做总结。文殊菩萨逐一点评了这二十五个法门，最后得出结论--<a href=\"https://www.guang5.com/fjgs/gygs/243621.html\" class=\"keylink\" target=\"_blank\">观世音菩萨</a>的耳根圆通是最适合阿难和末法时期众生的。</p><p>　　阿难和诸大众，蒙佛开示以后，心无疑惑。他们同时合掌顶礼，而对佛说：“我们现在感觉身心洁白，畅快无碍。但是，我们虽然明白了六解一亡的道理，却还没有达到圆通的本根。世尊。我们这些声闻，长久以来，飘零在生死海中，孤苦无依，做梦都想不到能成为佛的弟子。现在，我们就如同走失的孩子，忽然遇到了慈母，怎能不抓住这个机会，证得圣道呢！如果听到了如来的教诲，而不去躬行实践，这就和根本没听到是一样的。希望世尊大发慈悲，告诉我们具体该怎么去修证。”说罢，五体投地，期待着佛的教诲。</p><p>　　于是，世尊向在场的诸大菩萨，和诸漏尽大阿罗汉说：“你们这些菩萨及阿罗汉，在我的法中，得成无学。我现在问你们，你们最初发心，悟十八界的时候，哪一门最为圆通，从哪里下手能最方便地进入三摩地正定？”</p><h3>　　六尘圆通</h3><p>　　1、声尘</p><p>　　骄陈那等五比丘，这时从座位上站起来，顶礼佛足，回答佛说：“我在鹿苑和鸡园中，看到如来最初成道。佛为我们三转<a href=\"https://www.guang5.com/rmgjc/sidi.html\" class=\"keylink\" target=\"_blank\">四谛</a>法。我是听到佛的法音而开悟的。如来印证我为‘最初得解’。声音微妙而圆满，我因为音声而证得阿罗汉。佛问圆通，如我所证，音声为上。”</p><p>　　2、色尘</p><p>　　优波尼沙陀，接下来从座而起，顶礼佛足，说道：“我也是在佛最初成道的时候，有幸得到如来的教化。佛教我观不净相，我因而生起大厌离心。一切色相，体性都是不净的。白骨终究化为微尘，归于虚空。我因此悟得空色皆无，而成就了无学道。如来印证我名‘色性空’。虚妄的色尘既然消亡，自性本具的妙色自然现前。我通过色相，而证得阿罗汉。佛问圆通，如我所证，色因为上。”</p><p>　　3、香尘</p><p>　　香严童子，随后站起来，顶礼佛足，而对佛说：“如来教我仔细观察一切有为相。我辞别如来，便静静地坐在道场中观察。我见有比丘烧沉水香，香气默默地飘入我的鼻子。我观察这个香气，不是木头所生，也不是来自虚空，既非烟又非火，去无所去，来无所来，由此意识消亡，证得无漏圣果。如来印证我为‘香严’。虚妄的香尘散灭，自性的妙香遍圆。我通过香尘，而得证阿罗汉果。佛问圆通，如我所证，香严为上。”</p><p>　　4、味尘</p><p>　　药王、药上二位法王子和与会的五百梵天，从座位上站起来，顶礼佛足，说道：“我从无始劫来，生生世世为良医。口中遍尝这娑婆世界的草木金石，计其数目，有十万八千种之多。苦辣酸涩，甜淡甘辛，是冷是热，有毒无毒，我都能明了。承事如来后，我明白味性非空非有，不是身心，也不离身心。我通过分别味道的成因而开悟，如来印证我们兄弟为‘药王’和‘药上’，在此会中，位列法王子。我因为味道，而启发觉明，荣登菩萨之位。佛问圆通，如我所证，味因为上。</p><p>　　5、触尘</p><p>　　跋陀婆罗和他的同伴十六位菩萨，顶礼佛足，对佛说：”我们在威音王佛的时候，听到佛法而出家。在僧众沐浴的时候，我们随着队列进入浴室，这时忽然有所感悟：水既不是洗濯尘垢，也不是洗濯身体，中间安然，得无所有。虽然历时久远，宿习至今犹在，所以今天跟佛出家，得证无学，蒙佛印证我为‘坚守’。虚妄的触觉消融，自性的妙触现前。佛问圆通，如我所证，触因为上。“</p><p>　　6、法尘</p><p>　　摩诃迦叶及紫金光比丘尼等，接着站起来，顶礼佛足，而对佛说：”过去劫中，在这个世界，有佛出世，名‘日月灯’。我有缘亲近日月灯佛，在佛的座下闻法修学。佛灭度后，我继续燃灯供养佛的舍利，并以紫光金，涂佛的形像。从此以后，世世生生，身体常有紫金光。这位紫金光比丘尼就是我的眷属，与我同时发心<a href=\"https://www.guang5.com/rmgjc/xiudao.html\" class=\"keylink\" target=\"_blank\">修道</a>。我观察世间的六尘都会变坏，便以空寂，修灭尽定。我的身心，能度过百千劫犹如弹指顷。我以空法而成阿罗汉。世尊说我头陀行第一。虚妄的法尘销落，自性的妙法开明。一切诸漏，灭尽无余。佛问圆通，如我所证，法因为上。</p><h3>　　五根圆通</h3><p>　　1、眼根</p><p>　　阿那律陀尊者从座位上站起来，顶礼佛足，对佛说道：“我刚出家的时候，常喜欢睡觉。如来呵斥我畜生的习气太重。我听到佛的呵责，七日七夜睁眼不眠，因此双目失明。世尊怜悯我，教我修‘乐见照明金刚三昧’。我从此不用眼睛，就能观见十方世界。用自性的见精看去，就如同看手中拿着的果粒。如来因此印证我为阿罗汉。佛问圆通，如我所证，旋见归元，这是第一。</p><p>　　2、鼻根</p><p>　　周利槃特迦尊者接着站起来，顶礼佛足，对佛说道：”我没有读过书，缺乏智慧，最初遇到佛，听佛说法后就出家修行。那时，我学习如来的一句偈子，一百天中，记得前面，忘了后面。佛怜悯我愚痴，教我安居静处，调出入息。我在观察自己呼吸的过程中，细细体会生住异灭等刹那间发生的变化。直到一切微细的变化都穷尽的时候，我的心豁然开朗，一切无碍，证得漏尽阿罗汉。蒙佛印证我为无学。佛问圆通，如我所证，返息循空，这是第一。</p><p>　　3、舌根</p><p>　　骄梵钵提从座位上站起来，顶礼佛足，说道：“我有口业，过去劫中，戏弄沙门，因此世世生生有牛齝病。如来教我修一味清净的心地法门。因此灭掉妄心，得入正定。我观察味觉，不在外物，也不是身体，因此一念之间，而超脱一切世间的有漏。内脱身心，外遗世界。远离<a href=\"https://www.guang5.com/rmgjc/sanjie.html\" class=\"keylink\" target=\"_blank\">三界</a>的束缚，犹如逃脱牢笼的小鸟。离垢销尘，法眼清净，而成阿罗汉。如来亲自印证我已经登上无学道。佛问圆通，如我所证，还味旋知，这是第一。</p><p>　　4、身根</p><p>　　毕陵伽婆蹉从座位上站起来，顶礼佛足，对佛说：”我初发心跟佛修道，常听如来说世间苦、空、无常等不可乐的事情。在城中乞食的时候，我也在心中回味着如来的教言，一不小心被路边的毒刺扎伤了脚，全身疼痛。我就思维，我的身体虽然觉得疼痛，但是我的清净心并没有痛觉。我又思惟，我这一个身体，能有两个感觉吗！这样摄念没多久，忽然感觉身心完全空了。二十一天之内，就脱尽诸漏，证得阿罗汉果，并得到世尊的亲自印证。佛问圆通，如我所证，纯觉遗身，这是第一。</p><p>　　5、意根</p><p>　　须菩提接着站起来，顶礼佛足，而对佛说：“我旷劫以来，心无挂碍。记得受生已经经过如恒河沙数次了，每次初到母胎，就知道空寂。乃至十方世界全部成空，也令一切众生证得空性。后蒙如来启发，明白自性本具的明觉，才是真空。空性圆明，而证得阿罗汉果，一时顿入如来宝明空海，知见与佛齐等，因此如来印证我为无学。解脱空性，我为第一。佛问圆通，就我的所证，一切诸相都归入非相，能非和所非一并除尽，旋法归无，这才是第一。</p><h3>　　六识圆通</h3><p>　　1、见识</p><p>　　接着，舍利弗从座位上站起来，顶礼佛足，对佛说道：”我旷劫以来，心见清净。这样经过恒河沙数生，对于世出世间的种种变化，一看就懂，没有任何障碍。我在路上，遇到迦叶波兄弟谈论‘缘起性空’的道理，而悟到此心无际，因此跟佛出家。在如来的教化下，见觉明圆，因而一切无畏，证得了阿罗汉果。我的成就，都是因为佛为我讲法。所以，我就如同从佛的口中出生，从佛法中化生。佛问圆通，就我的经验，心见发光，光到极处，则入如来知见，这是第一。“</p><p>　　舍利弗尊者，出生在辩论世家。他的舅舅摩诃拘絺罗是当时有名的大论师，他母亲也喜欢辩论。舍利弗的母亲平时本来辩不过哥哥拘絺罗，但是，自从怀了舍利弗后，突然就每次都能辩赢。拘絺罗知道，这一定是因为她肚子里的孩子。他生怕将来辩不过自己的外甥，这也太丢人了。于是，趁着外甥还没出生，拘絺罗就跑到南印度去学习深造了。</p><p>　　舍利弗八岁的时候，就通达了一切典籍，名震一时。一次，吉利长者宴请国王和当时的名流。舍利弗也作为论师，位列上首。宴席上，大家见他这么小的年纪就有这么高的地位，都纷纷与他攀谈。小舍利弗谈吐不凡，常常语惊四座。国王十分赏识他，当场赏给他一个村庄。</p><p>　　跟佛出家后，七天之内，舍利佛就通达了一切法藏，所以在声闻弟子中，舍利弗被尊为”智慧第一“。为什么舍利弗能有这样的智慧呢？这是因为，在过去生中，舍利弗刚发心修道的时候，就以释迦牟尼佛为师。当时，老师教他修般若法门，让他每天诵楞严咒，<a href=\"https://www.guang5.com/fozhou/dabeizhou/\" class=\"keylink\" target=\"_blank\">大悲咒</a>，<a href=\"https://www.guang5.com/fozhou/shixiaozhou/\" class=\"keylink\" target=\"_blank\">十小咒</a>。舍利弗从此，生生世世受持此法，所以今生能有这样的智慧。</p><p>　　拘絺罗学成归来后，舍利弗已经跟佛出家了。拘絺罗十分不甘心，心想：”我的外甥这么聪明，竟然跟着一个沙门走了！一个沙门能有什么本事？“于是，拘絺罗千里迢迢地找到佛陀，要求佛陀跟他辩论，并且约定：如果他赢了，佛陀就要把外甥还给他；如果他输了，就把自己的头割下来给佛。佛陀观察拘絺罗的善根已经成熟，想借此机会度化他，于是就答应了。</p><p>　　拘絺罗道：”我以‘不受’为宗。“</p><p>　　佛陀接道：”那你受不受你所立的‘不受’这个宗呢？“</p><p>　　拘絺罗想：”如果受，这个“不受”的宗就破了；如果不受，自己立的宗如果自己都不接受，那也不行。这样一来，不是输定了吗！“他马上想到自己的脑袋，于是拔腿就跑。跑着跑着，又反应过味来：”大丈夫怎么能言而无信呢！“于是，他又回到佛陀的面前，要把脑袋割下来给佛。</p><p>　　佛陀却道：”我要你的脑袋干什么。在我的教法里，没有这样的事。你既然认输，就留下来跟我修道吧。“</p><p>　　于是，拘絺罗也加入到了佛陀的僧团中，并很快证得了阿罗汉果。</p><p>　　须达多长者在北方翻修祇树给孤独园的时候，请求佛陀派一个设计和监工的人，世尊就派去了舍利弗尊者。当地的外道听说这里要为佛陀建设立道场，纷纷前来阻止。他们还专门组织了一个辩论大会，想要当面辩倒舍利弗。于是，舍利弗尊者一个人，与北方所有外道展开论战。最终，所有的外道都被舍利弗所折服。很多外道论师，还当场皈依了<a href=\"https://www.guang5.com/rmgjc/fomen.html\" class=\"keylink\" target=\"_blank\">佛门</a>。从此，佛陀在北方弘法的障碍，被一扫而光。</p><p>　　佛陀率领僧团到达祇树给孤独园后，以舍利弗为契机，不请自说地宣讲了《弥陀经》。佛在经中说道：</p><p>　　在这个世界的西方，十万亿佛土以外，有一个世界，名叫极乐。那里有佛，名阿弥陀。<a href=\"https://www.guang5.com/rmgjc/jileshijie.html\" class=\"keylink\" target=\"_blank\">极乐世界</a>，没有苦，只有乐，所以叫极乐。</p><p>　　极乐世界，金沙铺地，亭台楼阁都是由七宝合成。微风吹拂着宝树和罗网，发出美妙的声音，犹如百千种乐器同时演奏，听了使人心旷神怡，并且能自然生起<a href=\"https://www.guang5.com/rmgjc/nianfo.html\" class=\"keylink\" target=\"_blank\">念佛</a>念法念僧之心。白鹤、孔雀、鹦鹉等珍禽异鸟，飞翔在亭台林间，以优雅的叫声，唱演着五根、五力、七菩提分、八圣道分等种种妙法。天上不时降下绚丽的天花。极乐世界的众生，用衣襟接满了天花，飞往他方世界去供养诸佛。一来一往，只需要一顿饭的功夫。</p><p>　　往生到极乐世界的众生，都在七宝池，八功德水中的莲花里化生。他们的<a href=\"https://www.guang5.com/rmgjc/shouming.html\" class=\"keylink\" target=\"_blank\">寿命</a>跟阿弥陀佛一样，都是无量无边的。极乐世界有数不清的大阿罗汉和大菩萨。一旦往生到极乐世界，就可以跟这些圣贤聚会在一处。往生到极乐世界，就可以在修行的道路上永不退转，甚至可以一生成佛。所以一切众生，都应该发愿，往生到西方极乐世界去。</p><p>　　如果有人，在一天、两天乃至七天中，执持阿弥陀佛的圣号，一心不乱，此人临命终时，心不颠倒，就可以往生到极乐世界。</p><p>　　由于极乐世界的境界实在太殊胜了，佛生怕众生不敢相信，于是，十方如恒河沙一样无量无边的诸佛，都异口同声地嘱咐众生，一定要相信这部不可思议，一切诸佛所共同护念的经典。</p><p>　　凡是受持《弥陀经》的众生，就会被一切诸佛护念，在菩提的道路上，永不退转。所以，如果有人已经发愿，今生发愿，或者将来发愿，往生阿弥陀佛国，此人于菩提道必不退转，或者已经往生，或者今生往生，或者将来会往生。所以，一切众生，都应该发愿往生西方<a href=\"https://www.guang5.com/rmgjc/jingtu.html\" class=\"keylink\" target=\"_blank\">净土</a>。</p><p>　　据此，后人有了专门以求生西方净土为目标的修行法门，称为”<a href=\"https://www.guang5.com/rmgjc/jingtufamen.html\" class=\"keylink\" target=\"_blank\">净土法门</a>“。净土法门，从东晋时期，庐山<a href=\"https://www.guang5.com/fjsy/fengmao/6518.html\" class=\"keylink\" target=\"_blank\">东林寺</a>的慧远大师开始，历朝历代，高僧辈出，并常有诸佛菩萨示现其中。从古至今，成就者无数，并集有《<a href=\"https://www.guang5.com/jtz/jtsxl/\" class=\"keylink\" target=\"_blank\">净土圣贤录</a>》，专门记载历代往生者事迹。甚至直到今天，往生的事情，仍然屡见不鲜。</p><p>　　2、闻识</p><p>　　<a href=\"https://www.guang5.com/fjrw/zhufopusa/pusa/66966.html\" class=\"keylink\" target=\"_blank\">普贤菩萨</a>接着站起来，顶礼佛足，对佛说道：”我已经在恒河沙数如来的座下，做法王子。十方如来，教他有菩萨根基的弟子，修普贤行，就是以我的名字来命名的。世尊。我用心闻，来分别众生的所有知见。哪怕在恒河沙数世界之外，有一位众生，发心修普贤行，我都会乘六牙白象，分身百千万亿，<a href=\"https://www.guang5.com/rmgjc/suinian.html\" class=\"keylink\" target=\"_blank\">随念</a>随到。即使他因为业障深重而见不到我，我也会暗中为他摩顶，安慰他，帮助他，令他成就。佛问圆通，我的本因就是，心闻发明，分别自在，这是第一。“</p><p>　　那么，什么是普贤行呢？</p><p>　　世尊在刚成道的时候，诸大菩萨都云集到佛的周围，向佛请法。于是，世尊就为这些法身大士，说了《<a href=\"https://www.guang5.com/fojing/huayanjing/\" class=\"keylink\" target=\"_blank\">大方广佛华严经</a>》。在最后，由普贤菩萨为此次法会做总结。普贤菩萨告诉大家，要想成就如来的无量功德，应该修十种广大行愿。一者、礼敬诸佛。二者、称赞如来。三者、广修供养。四者、忏悔业障。五者、<a href=\"https://www.guang5.com/rmgjc/suixi.html\" class=\"keylink\" target=\"_blank\">随喜</a>功德。六者、请转法轮。七者、请佛住世。八者、常随佛学。九者、恒顺众生。十者、普皆回向。把这十种行愿都做到无穷无尽，这就是是普贤行。命终以后，这十大愿王会引导行者，往生到阿弥陀佛的西方极乐世界。到了极乐世界，就可以分身无量，广利众生，圆满普贤菩萨的十大愿王，圆成佛道。</p><p>　　传说唐朝时候的拾得和尚就是普贤菩萨的<a href=\"https://www.guang5.com/rmgjc/huashen.html\" class=\"keylink\" target=\"_blank\">化身</a>。</p><p>　　当时，<a href=\"https://www.guang5.com/rmgjc/tiantai.html\" class=\"keylink\" target=\"_blank\">天台</a>山的国清寺，有一位丰干禅师。一次，他偶然在赤城的山道上拣到了一个婴儿，于是带回寺中抚养。因为他是捡来的，所以大家就叫他”拾得“。</p><p>　　长大以后，拾得任斋堂的香灯。忽然有一天，他登上供桌，与佛像面对面地吃饭，还指着憍陈如的圣像道：”小果声闻！“然后，双手掐腰，傍若无人地哈哈大笑。众僧见状，忙把他赶了出去。</p><p>　　接着又让拾得在斋堂洗碗。每次洗完了碗，拾得都要滤出碗中的残渣，给后山的寒山子吃。寒山子住在寒岩的山洞中，因为谁也不知道他的姓名和来历，所以就以山为名，叫他”寒山子“。寒山子平日里穿着一副破衣短袄，戴着一个桦树皮编的帽子，拖着一双大木屐。他面容枯藁，语出无常，时而对着天空谩骂，时而自言自语，所说的却都暗合佛理。</p><p>　　寒山和拾得相交甚笃，二人时常在一起谈笑。一次，寒山问拾得：”世间有人谤我、欺我、辱我、笑我、轻我、贱我、恶我、骗我，如何处治？“拾得道：”你只忍他、让他、由他、避他、耐他、敬他、不要理他、再待几年你且看他。“ 寒山又问：”还有什么法子可以躲得过？“ 拾得道：”弥勒菩萨做过一首偈子，我念给你：‘</p><p>　　老拙穿衲袄，淡饭腹中饱。补破郝遮寒，万事<a href=\"https://www.guang5.com/rmgjc/suiyuan.html\" class=\"keylink\" target=\"_blank\">随缘</a>了。</p><p>　　有人骂老拙，老拙只说好。有人打老拙，老拙自睡倒。</p><p>　　涕唾在面上，随他自干了。我也省力气，他也无烦恼。</p><p>　　这样波罗蜜，便是妙中宝。若知这消息，何愁道不了。’“</p><p>　　一次，寒山问丰干和尚：”古镜不磨，如何照烛？“</p><p>　　丰干答道：”冰壶无影像，猿猴探水月。“</p><p>　　”这是不照烛，和尚再说说。“</p><p>　　丰干又道：”万德不将来，教我道什么。“</p><p>　　听到这里，寒山和拾得都起立礼拜。</p><p>　　一天中午，寺主用罢午斋，出来散步，见拾得正在院子里扫地，就走过来跟他聊天：”你叫拾得，因为你是丰干捡回来的。你本来姓什么，住在哪里啊？“</p><p>　　拾得放下扫帚，叉手而立。寺主不解其意。</p><p>　　寒山在傍边捶胸道：”苍天！苍天！“</p><p>　　拾得问道：”你这是干什么。“</p><p>　　寒山答道：”你没见东家人死，西家助哀的吗。“</p><p>　　说着，二人一哭一笑地扬长而去。</p><p>　　后来，又让拾得去护持寺里的伽蓝神庙。每天僧人供奉伽蓝<a href=\"https://www.guang5.com/rmgjc/hufa.html\" class=\"keylink\" target=\"_blank\">护法</a>的食物，都被林子里的鸟雀啄得一片狼藉。拾得见了，就用竹杖敲打伽蓝圣像，责备道：”你自己的食物都保护不好，还怎么保护道场！“当天晚上，全寺的僧人都梦到护法神说：”拾得打我。“第二天早上，大家谈论起来，发现所做的梦竟然都一样，于是全寺哗然，这才知道拾得不是寻常人。</p><p>　　又有一次，寺里的僧人集体诵戒，正赶上拾得放牛回来。只见拾得唱着道歌，把牛群赶到了戒场门外，然后自己靠在门框上，拍掌大笑道：”这些悠悠的人又来聚会了。“首座和尚训斥道：”疯人怎么可以妨碍说戒！“拾得却道：”我再也不放牛了，这些牛多半都是庙上管事的僧人。“说着，拾得叫着过世僧人的法号，群牛一个一个地应声而过。僧众惊愕不已，心里都开始反省自己的所作所为，生怕将来也堕落成牛。</p><p>　　当时，杭州的闾丘胤在家候补知府 ，等了多年，弄得贫病交加，终于等到省府派他去任台州知府。他行将赴任的时候，头疼病突然发作，百药罔效。正巧这时，丰干和尚求见。门人不认得丰干和尚，所以对他说：”我家老爷正在害病，不见客。“丰干和尚道：”你告诉他，我是特地来救他的。“闾丘胤一听，连忙把和尚迎进来。丰干和尚命人盛来一碗净水，对着水诵咒，然后把水撒在手心，对着闾丘胤的脑袋排了三下，头痛顿时止住了。闾丘胤大喜，忙问和尚法号，来自哪里，然后请丰干和尚为他看一看此行的吉凶。和尚一一作答，最后叮嘱他，到任以后一定要拜谒文殊、普贤。闾丘胤忙问：”这两位菩萨在哪里？“”国清寺斋堂里洗碗的寒山、拾得便是。“</p><p>　　闾丘胤刚到任三天，便到国清寺去进香。拈罢香，太守问陪在旁边的道翘禅师道：”这里有个丰干禅师吗？“道翘师答有。”他住在哪里？寒山拾得又是谁？“”寒山、拾得现在在斋堂执役。丰干就住在藏经楼后面，现在那里已经没人住了，只有虎常来咆哮。“闾丘胤来到丰干禅师的寮房，只见虎迹纵横。道翘师解释道：”有一次，丰干和尚骑着一只老虎，口唱道歌，直入松门。这些足迹，恐怕就是那只虎留下的。“闾丘胤听了，对丰干和尚越发崇敬，于是问道：”丰干禅师在寺里，每天都做些什么？“道翘答：”只是舂谷子，供养合寺僧众的粥食。夜里就唱道歌“。闾丘胤四下里一看，只见墙壁上题着两首偈子。</p><p>　　一首写道：”本来无一物，亦无尘可拂。</p><p>　　若能了达此，不用坐兀兀。</p><p>　　一首写道：“余自来天台，凡经几万回。</p><p>　　一身如云水，悠悠任去来。</p><p>　　逍遥绝无闹，忘机隆佛道。</p><p>　　世途岐路心，众生多烦恼。</p><p>　　兀兀沉浪海，漂漂轮三界。</p><p>　　可惜一灵物，无始被境埋。</p><p>　　电光瞥然起，生死纷尘埃。</p><p>　　寒山特相访，拾得常往来。</p><p>　　论心话明月，太虚廓无碍。</p><p>　　法界即无边，一法普遍该。”</p><p>　　然后，闾丘胤又来到斋堂，见寒山和拾得正围在火炉旁说笑。闾丘胤倒头便拜。僧众忙道：“大官拜这两个疯子干什么？”闾丘胤为众僧说明原委后，二人握着闾丘胤的手，嘻嘻哈哈地，就像逗小孩似的，对闾丘胤说：“丰干饶舌，丰干饶舌。丰干是弥陀。弥陀你不认识，拜我们干什么。”说着步出松门，再也不回来了。闾丘胤一听丰干是弥陀，连忙回杭州去找丰干，却听说丰干已经回天台山坐化了。</p><p>　　后来，闾丘胤又备了些衣服和药品，到寒岩去拜访寒山和拾得。二人见了闾丘胤，高声道：“贼！贼！”说着，便缩到岩缝中去了。然后传来声音：“你们要各自好好努力。”说罢，岩石缝便合上了。闾丘胤哀慕不已，命道翘师整理二人的遗物。道翘在林间的树叶和村野人家的墙壁上，发现了三百多首寒山的诗作，于是整理成《寒山子诗集》流传于世。</p><p>　　3、鼻识</p><p>　　孙陀罗难陀接着从座位上站起来，顶礼佛足，向佛汇报道：“我刚出家时，跟佛修学，虽然持戒，却没有<a href=\"https://www.guang5.com/rmgjc/dingli.html\" class=\"keylink\" target=\"_blank\">定力</a>，心常散动。世尊教我和俱絺罗观鼻端的白相。我用心观了二十一天，见鼻中的气息，出入如烟。身心从内向外，圆洞明了。整个世界，都成清虚，如同玻璃一样明澈。接下来，烟相渐渐消失了，鼻息全成白色。心地开明，诸漏净尽。出入息此时化为光明，遍照十方世界，从此证得阿罗汉果。世尊为我授记，当证菩提。佛问圆通，我因为观息，久而久之，得到发明，明照圆满，灭尽诸漏，这是第一。</p><p>　　4、舌识</p><p>　　富楼那弥多罗尼子从座而起，顶礼佛足，对佛说：”我旷劫以来，辩才无碍，宣说苦、空、无常的道理，深达实相。恒河沙数如来的秘密法门，我在大众中，畅演得淋漓尽致，得无所畏。世尊知道我有大辩才，便教我用音声轮来弘扬佛法。我在佛前，助佛讲法，因为狮子吼，而证得成阿罗汉果。世尊印证我为说法第一。佛问圆通，我以法音，降伏魔怨，销灭诸漏，这是第一。</p><p>　　5、身识</p><p>　　优波离随即站起来，顶礼佛足，对佛说：“我随佛逃离王城，出家修道，亲眼看见如来六年苦行，降伏诸魔，制诸外道，解脱世间的贪欲诸漏。我承佛的教戒，而成就三千威仪，八万细行。性业遮业，全部清净。因此而得到身心寂灭，成阿罗汉。我是如来众中的纲纪，如来印证我持戒修身，身心清净，最为第一。佛问圆通，我通过执身，身得自在。接下来执心，心得通达。然后身心一切通利，这是第一。</p><p>　　6、意识</p><p>　　大目犍连从座而起，顶礼佛足，对佛说：”我当初在路边乞食的时候，遇到优楼频螺、伽耶、那提三迦叶波，为我宣说如来因缘法的深义。我顿时心得通达，而发心出家。如来以神力，令我袈裟着身，须发自落。我游行十方，毫无挂碍。通过神通而发明自性，证得阿罗汉果。如来推我，神通第一。不只是世尊，十方如来都赞叹我的神力圆明清净，自在无畏。佛问圆通，我旋虚妄分别的意识，还归湛然不动的心性，使自性的圆光得以宣发，就如同浑水，沉淀久了自然澄清，这是第一。“</p><h3>　　七大圆通</h3><p>　　1、火大</p><p>　　乌刍瑟摩来到佛前，合掌顶礼，对佛说：”我记得久远劫前，我多贪欲。那时，有佛出世，号空王佛。彼佛告诉我，多淫欲的人，如同被猛火所烧，并教我遍观四肢以及全身百骸的冷暖。我因此而神光内凝，化淫欲心成智慧火。从此诸佛都叫我为‘火头’。我以火光三昧力而成就阿罗汉果。我发大愿，诸佛成道后，我为力士，亲自为诸佛降服魔怨。佛问圆通，我通过谛观身心的暖触，使神光智火<a href=\"https://www.guang5.com/rmgjc/liutong.html\" class=\"keylink\" target=\"_blank\">流通</a>无碍，而销灭诸漏。以智慧的宝焰，而登无上正觉。这是第一。</p><p>　　2、地大</p><p>　　持地菩萨随即从座位上站起来，顶礼佛足，而对佛说：“往昔在普光如来住世的时候，我为比丘。那时我常在关隘渡口，田野险道等妨害车马的地方，或者添平坑洼，或者修造桥梁，或者帮人负重。这样经过了无量诸佛。直到毗舍浮佛出世，那时世上多饥荒，我帮人负重，不管远近，只收一钱。一次，国王设斋请佛应供，我就站在平地上等候如来。毗舍如来见到我后，为我摩顶，对我说：‘应当平心地。心地平则世间大地，一切皆平。’我听后，立刻心得开明。我见构成我自身的微尘与造成世界的所有微尘，平等无别。微尘的自性是不相触摩的，所以刀兵加身，也无所碍。我因此悟到无法所生的道理，而成就成阿罗汉果。而今已经更进一步地修行菩萨道，只要听到如来宣讲楞严经，阐述佛的知见，我就来为做证明。佛问圆通，我是因为谛观身体和世界的微尘，等无差别，本来都是如来藏，只是因为虚妄而引发了尘相。尘相销灭，智慧的圆光自然发明，由此证得无上道。这是第一。</p><p>　　3、水大</p><p>　　月光童子从座位上站起来，顶礼佛足，对佛说：”记得在过去恒河沙劫以前，有佛出世，名号为水天如来。佛教座下的菩萨们修习水精来进入正定。身体中的水性并无差别。最初是观唾液鼻涕，体液精血，乃至大小便利，在身体中旋绕。接下来，观想身体中的水与体外世界乃至宇宙中的水，等无差别。我当时水观初成，入定时身体能化成水，还不能做到无身。一次我在禅堂中入定的时候，我的弟子透过窗户，看见屋里只有一滩清水，并没有人。他童稚无知，捡起一个瓦砾投入水中，只见水花四溅，然后他左顾右盼，见仍然没有人，就走了。我出定后，突然觉得心痛。就像舍利弗被违害鬼打一样。我就思惟：‘我已经证得阿罗汉道，早已远离病缘。为什么今天会忽然心痛呢。莫非我要退转？’这时，我的弟子找到我，告诉了我他扔石头的事。我告诉他，再见到水的时候，可以开门进来，把石头拿出去。‘我于是再次入定，弟子把石头捡出去，我这才恢复过来。以后又经过了无量诸佛，我一直停留在这个境界中。直到山海自在通王如来出世，我才能消灭身相，使自身的水与十方世界的水无二无别，通过水性而回归自性真空。我现在在如来座下，得童真之名，参与菩萨的圣会。佛问圆通，我因为水性一味的流通，而得到无生，圆满菩提，这是第一。</p><p>　　4、风大</p><p>　　琉璃光法王子从座而起，顶礼佛足，对佛说道：“记得在过去恒河沙劫以前，有无量声佛出世，开示菩萨妙明本觉之道。彼佛教弟子们观察世界和众生的身体，都是由虚妄的风力所转成的。我当时观察空间安立不动，时间迁流不止，身体的行住坐卧，心念的此起彼伏，这一切变化，都是风力运行所致，本来无二无别。而风性本来来无所来，去无所去。因此，十方微尘一样众多的世界和颠倒的众生，同是虚妄。乃至三千<a href=\"https://www.guang5.com/rmgjc/daqianshijie.html\" class=\"keylink\" target=\"_blank\">大千世界</a>，每一世界内的众生，就如同在一个封闭的容器中，啾啾乱鸣的蚊蚋。在一分一寸那么点的地方，鼓动狂闹。这样修行没过多久，我就证得无生法忍。心地开明后，我见到东方的不动佛国，并在彼佛身边，做法王子。然后承事十方诸佛，身心发光，洞彻无碍。佛问圆通，我以观察风力无依，而悟菩提，这是第一。</p><p>　　5、空大</p><p>　　虚空藏菩萨从座而起，顶礼佛足，对佛说：”我在定光佛座下，证得无边身。那时，我手拿四大宝珠，照明十方微尘数的佛刹，化成虚空。又于自心中现大圆镜智，放出十种微妙的宝光，流灌十方尽虚空际。一切佛刹，映入镜中，涉入我身。我的身体如同虚空，没有障碍，能进入微尘一样众多的国土，在其中广做佛事，随顺众生。我之所以能得到这样的神力，是因为我谛观四大本无所依，只是随着妄想而生灭。虚空与四大，形象上虽然有别，本性上却并无二至。诸佛的国土，也是由四大和虚空构成，所以本来同源。这共同的源头，就是如来藏妙明真心。我因为找到了本源，而证得无生法忍。佛问圆通，我以观察虚空无边，而进入正定，妙力圆明，这是第一。</p><p>　　6、识大</p><p>　　弥勒菩萨接着站起来，顶礼佛足，对佛说：“在往昔微尘数劫以前，有佛出世，名日月灯明如来。我在佛前出家，因为贪图名利，好结交权贵。于是，世尊教我修习惟心识定，观想三界<a href=\"https://www.guang5.com/rmgjc/weixin.html\" class=\"keylink\" target=\"_blank\">唯心</a>所生，万法唯识所变。我因此心不外求，而得入正定。历劫已来，我在此定中，承事了恒河沙数诸佛，名利之心，完全消灭。直到<a href=\"https://www.guang5.com/fjrw/zhufopusa/zhufo/67020.html\" class=\"keylink\" target=\"_blank\">燃灯佛</a>出世，我才圆满地成就识心三昧。此时，尽虚空界如来的国土，净秽有无，都是我的心所变现。世尊，我明了这惟心所变，唯识所现的道理，能从识性中流出无量如来，而今蒙佛授记，做下一位佛。佛问圆通，我以谛观十方世界，惟识所现，识心圆明而证入实相，远离幻妄和执著，得证无生法忍，这是第一。”</p><p>　　弥勒菩萨，弥勒是姓，名叫“阿逸多”，意思是无能胜。弥勒菩萨生在印度的波罗奈国、劫波利村一个叫波婆利的大婆罗门家。按印度的习俗，孩子一出生就要请相师看相。相师给阿逸多看完后，惊异地说：“此儿具足轮王相，长大必定要当转轮圣王。”这话传到国王那里，满朝文武一议，生怕国内发生政变，于是决定杀掉这孩子。波婆利便将阿逸多藏到他舅父家。舅父一考虑，这样也不是长久之计，于是稍一张大，便让阿逸多跟佛出家。弥勒菩萨从小<a href=\"https://www.guang5.com/rmgjc/shenghuo.html\" class=\"keylink\" target=\"_blank\">生活</a>在富裕的家境中，出家后，依然交游族姓，不避奢华。一次，国王将一件金缕袈裟供养给佛陀，佛将它转赐给诸大比丘。大家看到这么华丽的袈裟，谁都不敢要。只有弥勒菩萨坦然受之，并且天天穿在身上乞食。一些比丘对此议论纷纷，弥勒菩萨却毫不放在心上。</p><p>　　优波离问佛：“阿逸多虽然出家，但是不修禅定，不断烦恼，佛说此人成佛无疑，那么他命终会生到什么国土去呢？”</p><p>　　佛说：’十二年后，弥勒在波罗奈国、劫波利村他出生的地方，结跏趺坐入灭，然后直接上升到兜率天。他的肉身结成舍利，就像铸造的金像一样。天人们寻即起立宝塔，供养舍利。弥勒上升到兜率天后，在七宝台、摩尼殿内的狮子床坐上化生，具三十二相，昼夜不停地转大法轮，度化天众。“</p><p>　　世尊曾预言，本次佛法，只能传一万两千年。正法住世一千年，像法住世一千年，末法住世一万年。所以，我们现在正处在末法时期的第一个一千年中。末法时期结束后，世间就再没有佛法了。五十六亿七千六百万年后，弥勒菩萨会从兜率天下生到人间。那时，他的父亲名叫妙梵，母亲名叫摩波提。弥勒菩萨象释迦牟尼佛当年一样，因为感悟到世间的一切都是变灭无常的，于是出家修行，并在华林园的龙华树下，证得佛果。这时，人间才会再有佛法。</p><p>　　现在供奉的弥勒菩萨，大腹便便，笑口常开的，那其实是布袋和尚。传说布袋和尚就是弥勒菩萨的化身。</p><p>　　布袋和尚是唐末梁初时的人，不知道他来自哪里，只是以一个孤儿的形象，流浪到浙江奉化岳林寺东面的长汀村，被张重天收养，因此自号”长汀子“。后来出家，法号契此。</p><p>　　契此和尚整天用竹杖挑着个布袋，行走于田间乡里。他随处寝卧，言语无常。人家问他叫什么，他说：”我有一布袋，虚空无挂碍。展开遍十方，入时观自在。“于是大家就都叫他”布袋和尚“。</p><p>　　布袋和尚常四处行乞，募修岳林寺，无论走到哪里，常有十八个小儿围绕在他周围玩耍。到了人多的地方，和尚就打开布袋，把里面的东西洒满一地，一个一个地拿起来问人：”你道这个是什么？“这样问了许久，又都装入袋中，飘然而去。一次，和尚用纸包着屎给人看，说：”这个是弥勒内院的。“又或者拿着一文钱给人看，说：”这个是龙华会里的。“</p><p>　　布袋和尚曾跟四个农夫比赛插秧，谁输了谁请吃夜饭。四位农夫是做惯了的，只见他们手起苗落，不一会儿田中就绿了一大片。布袋和尚眼看就要输了，却呵呵笑着，吟起诗来：”</p><p>　　手捏青苗种福田，</p><p>　　低头便见水中天。</p><p>　　六根清净方成稻，</p><p>　　退后原来是向前。“</p><p>　　曾有僧人问：”什么是祖师西来意？“和尚放下布袋，叉手而立。僧人继续问：”莫非别有所在？“和尚拿起布袋，抗在肩上就走了。</p><p>　　又有一次，和尚在寺前伫立良久。众僧问：”站这里做什么？“</p><p>　　和尚答：”我在等个同参释迦未生的人。“</p><p>　　众僧笑道：”释尊说法利生，灭度很久了。“</p><p>　　和尚却道：”你们只知道佛灭度，却不知道佛未生。“</p><p>　　接着说偈子道：</p><p>　　”无生无死佛家风，</p><p>　　不堕古今莫定踪。</p><p>　　触处圆明常湛寂，</p><p>　　龙华鸡足两无从。“</p><p>　　有乡人问：”你为什么老拿个布袋？“和尚答道：”包纳乾坤。“”包纳乾坤是什么样？“和尚说偈道：</p><p>　　”圆觉灵明超太虚，</p><p>　　目前万物不差殊。</p><p>　　十方法界都包尽，</p><p>　　惟有真如也太迂。“</p><p>　　和尚去福建化缘，化到一批木料，就把木料装进袋子。这时，岳林寺的井里，就源源不断地有木料涌出来。乡人都叹为神异，于是纷纷前来岳林寺帮工。当时，福建有位陈居士帮和尚募化。临别时，陈居士问：”和尚姓什么，哪年生人，法腊几何？“</p><p>　　布袋和尚答道：”我这布袋与虚空齐年。“</p><p>　　居士道”若有人问我，我该怎么答复呢？我怕落人是非。“</p><p>　　和尚于是说：”我姓李，二月八日生。“接着颂道：”</p><p>　　是非憎爱世偏多，仔细思量奈我何。</p><p>　　宽却肚皮常忍辱，放开逸日暗消磨。</p><p>　　若逢知己须依分，纵遇冤家也共和。</p><p>　　要使此心无挂碍，自然证得六波罗。“</p><p>　　居士见布袋和尚谈吐不俗，于是又问：”弟子愚鲁。如何得见佛性？“</p><p>　　和尚道：”</p><p>　　即个心心心是佛，十方世界最灵物。</p><p>　　纵横妙用可怜生，一切不如心真实。</p><p>　　腾腾自在无所为，闲闲究竟出家儿。</p><p>　　若睹目前真大道，不见纤毫也大奇。</p><p>　　万法何殊心何异，何劳更用寻经义。</p><p>　　心王本自绝多知，智者只明无学地。</p><p>　　非凡非圣复若乎，不强分别圣情孤。</p><p>　　无价心珠本图净，凡是异相妄空呼。</p><p>　　人能弘道道分明，无量清高称道情。</p><p>　　携锡若登故国路，莫悉诸处不闻声。“</p><p>　　居士深以为异，于是顶礼道：”求和尚再留斋一宿，以尽弟子的敬意。“当晚，和尚又为陈居士提了一首偈子：”</p><p>　　吾有一躯佛，世人皆不识。</p><p>　　不塑亦不装，不雕亦不刻。</p><p>　　无一块泥土，无一点彩色。</p><p>　　工画画不成，贼偷偷不得。</p><p>　　体相本自然，清净常皎洁。</p><p>　　虽然是一躯，分身千百亿。“</p><p>　　布袋和尚在四明--也就是今天的宁波--的时候，常与蒋宗霸交游。和尚让他常念”摩诃般若波罗蜜多“，所以当时的人都称蒋为”摩诃居士“。一天，两人同在长汀沐浴。宗霸忽然见布袋和尚背上生着眼睛，连忙顶礼道：”你是佛啊！“布袋和尚忙制止他说：”不要这么说。“又对宗霸道：”我与你相聚四年，可谓有大因缘。我要走了，你不要担忧。“洗罢，两人来到蒋摩诃家，和尚缓缓地问：”你要富贵吗？“摩诃说：”富贵怎能久远，我只要子孙久远就可以了。“于是，和尚给了蒋一个布袋，里面套着无数的小布袋，还有一口箱子和一条绳。然后说：”这就是你后代的事。我就以此向你作别吧！“</p><p>　　和尚曾在封山，向沉居士化得一块地方，意欲归隐于此，并对大众说：”明年今月今日，我取弥勒果供养大众。“贞明三年的三月三日，和尚果然在岳林寺东廊下的磐石上坐化。</p><p>　　十年后，会越师派人入蜀中办事。使者经过蜀中栈道的时候，又遇到了布袋和尚。和尚对使者说：”四明的蒋摩诃，见到他帮我捎个话，告诉他好好爱惜自己，将来好与我相见。“当时，蒋摩诃正在跘跨山、十二盘的高峻处筑庵而居。他养了一条<a href=\"https://www.guang5.com/sushi/yaoshan/dahuang/\" class=\"keylink\" target=\"_blank\">大黄</a>狗，米吃完了，他就在狗脖子上系一百钱，让狗出去买米。使者捎来布袋和尚的话后，蒋摩诃说：”我知道了。“于是设斋，大会亲友，沐浴更衣，趺坐而逝。</p><p>　　晋天福初年，莆田县令王仁煦，又在天兴寺遇到了布袋和尚。后来又在福州的官舍遇到和尚，和尚从怀中拿出来一个密封着的信，交给王仁煦，对他说：”我七日不来，你就打开这封信看。“七天后，仁煦如约拆开，见信中只写着一首偈子：”弥勒真弥勒，化身千百亿。时时示世人，世人俱不识。“下面还有九个字：”不得状吾相，此即是真。“</p><p>　　至此，才知道布袋和尚原来就是弥勒佛。</p><p>　　7、根大</p><p>　　大势至法王子与其同伦五十二位菩萨一起，从座而起，顶礼佛足，对佛说：”在过去恒河沙劫以前，有佛出世，名为无量光。一劫之内，相继有十二位佛出世。最后的一位佛名为超日月光，彼佛教我念佛三昧。譬如有两个人，一个人专心思念另一个人，而另一个人却完全遗忘了他。这两个人，相逢如同不逢，相见如同不见。如果两人互相思念，越来越深，这样，就会生生世世，如影随形，不相乖异。十方如来怜念众生，就如同母亲思念自己的孩子。孩子如果逃逝的话，母亲尽管思念，又有什么办法呢！孩子如果也思念母亲，就如同母亲思念孩子一样，母子二人就会生生世世，永远在一起了。如果众生的心能够忆佛念佛，现在或者将来，必定见佛，跟佛在一起。不需要假借任何其他方法，自然能得心地开明。好比抹了香粉是人，身上就会有香气，这就叫做香光庄严。我以念佛之心，而证得无生法忍。现在在这个世界，摄受念佛的人往生净土。佛问圆通，我没有其他选择，只是都摄六根，净念相继，得三摩地，这是第一。“</p><p>　　<a href=\"https://www.guang5.com/fjrw/zhufopusa/pusa/66971.html\" class=\"keylink\" target=\"_blank\">大势至菩萨</a>在西方极乐世界，与阿弥陀佛和观世音菩萨一起，被尊为西方三圣。</p><p>　　民国时期的高僧，净土法门的第十三代祖师--<a href=\"https://www.guang5.com/fjrw/hcrw/yinguangdashi/\" class=\"keylink\" target=\"_blank\">印光大师</a>，就是大势至菩萨再来。</p><p>　　印光大师，一八六一年，生于陕西省合阳县。年轻时习儒，受韩愈之流的影响，常批判佛教，后来大病一场，而幡然悔悟。二十一岁的时候，于终南山南五台莲花洞寺出家。晒经时，大师偶然读到《龙舒净土文》，知道了净土法门的殊胜，从此开始一心念佛。后来，在戒期里因为书写过多，眼病复发，深感人生之苦，念佛则更加精进，眼病竟然不药而愈。因此对净土法门更加深信不疑。</p><p>　　光绪十九年，大师随华闻和尚入京，为普陀山法雨寺迎请<a href=\"https://www.guang5.com/fojing/dzj/\" class=\"keylink\" target=\"_blank\">大藏经</a>。然后，就在法雨寺的藏经楼<a href=\"https://www.guang5.com/rmgjc/biguan.html\" class=\"keylink\" target=\"_blank\">闭关</a>阅藏，精进念佛，数十年如一日。直到民国七年，徐蔚如居士把大师的往来书信整理成册，以《印光法师文钞》为题刊印流通时，印光大师才开始普遍为海内外的四众弟子所遵崇。</p><p>　　大师一生淡泊名利，勤俭劳作。民国十一年，大总统徐世昌亲赠大师”彻悟圆明“的匾额，大师置若罔闻。有人问到此事时，大师道：”实在是无此福德，惭愧尚且来不及，又有什么值得荣耀的。“如此盛名之下，大师直到圆寂之前，从来都是自己扫地擦桌，洗衣倒水，绝不用人伺候。大师吃饭，每次吃完都要用舌头把碗舐净，然后再用水冲碗，把水嗽口后咽下。</p><p>　　大师一生，慈悲济世。民国十五年，长安被围困。解围之后，大师马上从印文钞的款项中拨出三千银元，汇过去赈灾。二十四年，陕西大旱，当时大师正在主持报国寺。接到王幼农居士书信告急后，大师马上从报国寺的开销中提出一千银元汇过去。寺里的开支，只剩下一百多元了，大师也不以为意。二十五年，大师应邀主持上海护国息灾法会。法会期间，听说绥远的灾情后，大师把得到的供养，二千九百银元全部捐了过去，又另从印文钞的款项中拨出一千银元用于赈灾。类似的事情，不胜枚举。</p><p>　　大师的慈悲，泽及异类。十九年，印祖以七十高龄，从上海太平寺搬到苏州报国寺时，寮房内臭虫很多，床席、窗户，茶几上到处都是。德森师要帮印祖大师清理房间，却被印祖大师拒绝道：”古大德不耐臭虫的干扰时，就对臭虫说：‘畜生，你到我这儿找差事，我要勒令你迁单。’臭虫一听，就相继而去。我修行不够努力，没有这样的感应，还有什么话可说。“因而泰然处之，不以为意。民国二十二年，臭虫忽然绝迹了。</p><p>　　大师的修行，常有不可思议处。印祖常用大悲咒加持水、米，利益众生。民国二十一年，吴恒荪的母亲病危，他的妻子到报国寺向印祖求了一杯大悲水。吴母服下去，就恢复了大半，再没危险了。他们的孩子，遍身生疮，医药罔效，服了印祖加持的大悲水，就痊愈了。吴泽南的母亲将要命终，舌头本来已经僵硬，不能说话。泽南请报国寺的僧人前去助念。德森师为老人服下印祖加持的大悲米，老人就能随众念佛了。最后，大声念佛三句，随后逝去。</p><p>　　青帮大亨顾竹轩，本来极其不孝。母亲去世后，突然悲痛不已，他认为母亲的死是因为念佛，于是想混入佛门，毁坏佛教，以泄其恨。打定主意后，他马上动身，从上海来到苏州的报国寺，要皈依印光大师。到了大殿，却找不到大师，于是他一个人在殿里徘徊。道明师走上前来问他：”你是来皈依的吗？“顾竹轩听了大吃一惊，他的想法没跟任何人说，于是反问：”你怎么知道？“道明师说：”早上师父交待过，今天有一个人来皈依，要我不要挡他，带他过去。“顾竹轩听罢，不禁打个冷战。心想：”这老和尚不得了，我在上海还没动身，他就知道了。佛法了不得，我破坏不了，还是来个护持吧。“皈依后，他还不甘心，就问印祖：”我在上海还没动身，你怎么就知道我要来皈依？“大师轻描淡写地道：”我授皈依授的多了。早上做功课，觉得今天好像有人会来皈依，就嘱咐他们接一下。“</p><p>　　民国二十六年，大师移居<a href=\"https://www.guang5.com/fjsy/lvyou/3700.html\" class=\"keylink\" target=\"_blank\">灵岩寺</a>。二十九年十月二十七日，大师身体略感不适，于是召集僧众，对大家说：”灵岩寺的主持不能一直空缺着，应该让妙真担任。“大家商议说，十一月九日让妙真升座。大师说：”太迟了。“于是改为初四。大师也说迟。最后定为初一，大师才点头同意。初三晚上，大师对妙真等人开示道：”净土法门，别无奇特，只要至诚恳切，无不蒙佛接引，带业往生。“凌晨一点半，大师从床上坐起来，说道：”念佛见佛，决定生西。“说完，高声念佛。二点十五分，大师洗了把脸，对大众说道：”蒙阿弥陀佛接引，我要去了。大家要念佛，要发愿，要生西方。“说完，面向西方，端身正坐。五点，在念佛声中，大师安详而逝。火化后，得到五色舍利一百多颗。</p><p>　　弟子们悲痛不已，于是纷纷撰文，追忆大师。其中，杨信芳居士写道：”民国廿五年，国历十一月廿三夜，我住在张家，与孝娟睡一个床。半夜睡梦中，遥见观音大士立在一个小岛上，环岛的四面都是海，水天一色。大士身长丈许，璎珞庄严，手持净瓶，就像画上的那样。我在一叶扁舟中。舟驶近海岛，大士招手对我说：“大势至菩萨现在在上海教化众生，你怎么这么昏迷呢，不去闻法！”我无言以对。大士又说：‘印光和尚是大势至的化身，四年后化缘就尽了。’说罢就消失了。忽然骇浪滔天，舟几乎要倾覆，我大呼‘救命’。孝娟把我推醒。“”第二天早上，我把梦告诉张太太，并问：‘有叫大势至的菩萨吗？有和尚名叫印光吗？’张太太素来信佛，吃惊地说：‘大势至乃是西方极乐世界的大菩萨。印光和尚之名，以前曾听孝娟的父亲说过，是普陀山的得道高僧。’我问：‘印光和尚现在在上海吗？’张太太说：‘不知道。’第二天读《申报》，见登有《丙子护国息灾法会通告》，这才知道上海请印光和尚来沪，在觉园主持法会。“”于是，我与张太太母女同去觉园，听印光大师说法。三个人都皈依了印光大师。“”昨天得到了苏州朋友的书信，得知印光大师已经在灵岩山坐化了。大师逝去了，化缘四年，竟跟昔日的梦境说的一样。“</p><p>　　至此，才知道印光大师是大势至菩萨再来。</p><h3>　　耳根圆通</h3><p>　　这时，观世音菩萨从座而起，顶礼佛足，对佛说道：”世尊。过去无数恒河沙劫以前，有佛出世，名观世音。我在彼佛座下，发菩提心。彼佛教我用闻思的方法来修行，而得入正定：</p><p>　　“初于闻中，入流亡所。”</p><p>　　最初从耳根入手，使耳根的闻性不向外驰求，灵光内流，反闻自性。这样，就把耳根从声尘中解脱出来。</p><p>　　“所入既寂，动静二相，了然不生。”</p><p>　　声尘消灭后，继续反闻反照，直到动静二相，了然不生。</p><p>　　“如是渐增，闻所闻尽。”</p><p>　　然后再接再厉，使能闻和所闻都尽灭无余。</p><p>　　“尽闻不住，觉所觉空。”</p><p>　　能闻的耳根和所闻的声尘都消失殆尽后，这时还有个觉知存在。知亦不知，觉亦不觉。使觉知也空掉。</p><p>　　“空觉极圆，空所空灭。”</p><p>　　此时还有一个空相。接下来就要参究这个空。把空参究到极圆处，能空与所空都归于灭。</p><p>　　“生灭既灭，寂灭现前。”</p><p>　　有灭就有生。直到生与灭都消除净尽，得到寂灭常宁。</p><p>　　“忽然超越世出世间一切法，十方圆明。上合十方诸佛本妙觉心，与诸佛如来同一慈力；下合十方一切六道众生，与诸众生同一悲仰。</p><p>　　世尊。因为我供养观音如来，蒙彼如来教我利用闻性，反流内熏，而求证圆通的方法。因为我与诸佛如来同一慈力，使我成就三十二应身，遍入一切国土，度脱众生。</p><p>　　世尊。若诸菩萨，已经得到正定，欲求进一步证得无上道。我就现佛身为他们说法。</p><p>　　若有人在寂静中显发了智慧，而获得圆通，我就现独觉身而为说法。”</p><p>　　“独觉”就是在世间无佛的时候，他自己“春观百花开，秋睹黄叶落”，悟得天地间万事万物自生自灭这种道理，而开悟了，所以叫“独觉”。</p><p>　　“如果有人断了十二缘，圣解妙悟即将圆满的时候，我就现缘觉身而为说法。”</p><p>　　<a href=\"https://www.guang5.com/rmgjc/shieryinyuan.html\" class=\"keylink\" target=\"_blank\">十二因缘</a>是解析了人是如何堕入生死轮回的：无明而生行，行生识，识生名色，名色生六入，六入而有触，触产生了受，受生爱，爱生取，取生有，有缘生，生缘老死“这样一步步堕落到生老病死中了。因为他断了这十二因缘而获得觉悟，所以叫”缘觉“。</p><p>　　”如果有人修苦、集、灭、道四谛法即将圆满的时候，我就现声闻身而为说法。“</p><p>　　观一切都是苦。集是苦的成因。观苦，断集，慕灭，修道。这就是四谛法。因为是听闻到佛的声音为他们宣讲四谛法而觉悟的，所以叫”声闻“。</p><p>　　”若有众生，想要断除欲望，身心清净 ，我就现梵王身而为说法。</p><p>　　若有众生，想要做天主，统领诸天，我就现帝释身而为说法，令其成就。</p><p>　　若有众生，想要身体自在，游行十方，我就现自在天身而为说法，令其成就。</p><p>　　若有众生，想要在虚空中飞行，我就现大自在天身而为说法，令其成就。</p><p>　　若有众生，喜欢统领鬼神，救护国土，我就现天大将军身而为说法，令其成就。</p><p>　　若有众生，喜欢统治世界，保护众生，我就现四天王身而为说法，令其成就。</p><p>　　若有众生，喜欢生在天宫，驱使鬼神，我就现四天王的太子身而为说法，令其成就。</p><p>　　若有众生，喜欢做人主，我就现人王身而为说法，令其成就。</p><p>　　若有众生，喜欢主持一个大家族，对世间的人情往来，乐此不疲，我就现长者身而为说法，令其成就。</p><p>　　若有众生，喜欢清净自居，谈论名言，我就现居士身而为说法，令其成就。</p><p>　　若有众生，喜欢治理国土，定国安邦，我就现宰官身而为说法，令其成就。</p><p>　　若有众生，喜欢研究数术，调心养气，我就现婆罗门身而为说法，令其成就。</p><p>　　若有男子，好学而出家，持诸戒律，我现比丘身而为说法，令其成就。</p><p>　　若有女子，好学而出家，持诸禁戒，我现比丘尼身而为说法，令其成就。</p><p>　　若有男子，喜欢受持<a href=\"https://www.guang5.com/rmgjc/wujie.html\" class=\"keylink\" target=\"_blank\">五戒</a>，我现优婆塞身而为说法，令其成就。</p><p>　　若有女子，受持五戒，我现优婆夷身而为说法，令其成就。</p><p>　　若有女人，喜欢相夫教子，乃至母仪天下，我现女主身及国夫人身而为说法，令其成就。</p><p>　　若有众生，不坏男根，我现童男身而为说法，令其成就。</p><p>　　若有处女，爱处女身，不愿意被侵犯，我现童女身而为说法，令其成就。</p><p>　　若有天人、龙、药叉、乾闼婆、阿修罗、紧那罗、摩呼罗伽、非人、有形无形，想要解脱其类，我就现天人、龙、药叉、乾闼婆、阿修罗、紧陀罗、摩呼罗伽、非人、有形无形而为说法，令其成就。</p><p>　　若有众生，喜欢人身，修行人道，我就现人身而为说法，令其成就。</p><p>　　这就是三十二应身。这都是用三昧定力，通过闻性的熏修，得到的无作妙力而自在成就的。</p><p>　　世尊。我还用这种闻性的熏修，而证得的金刚三昧无作妙力，与十方三世六道一切众生，同一悲心。所以能令众生，获得十四种无畏。</p><p>　　第一种无畏，因为我不观外在的声音，而观能听的自性。所以十方苦恼的众生，只要称念我的名号，我就能观其音声，令其解脱。“</p><p>　　潮州有个姓严的司机，家住北门。1987年农历四月初七的晚9点左右，他在广汕公路上驾驶货车，经陆丰县境时，与对面的车猛然相撞。对方一人当场死亡；一人重伤，后抢救无效也死了。严某的汽车车头凹陷，驾驶室的玻璃被撞得粉碎，严某昏迷。</p><p>　　这时，突然来了一位女士，大约30多岁，仪容端庄，波浪发型，身穿米色的外套，白色的高跟鞋。她轻轻地把严某唤醒，对他说：”你喉干，要点水吗？“严某上身全是血，淌了大汗，正口渴如焚，于是点点头。女士从身后的背包中拿出花瓶型的小水壶，斟酌一盖喂严某饮下，连喝三次。严某神志稍清，于是问女士：”你是哪里来得？“女士说：”我从海外来，我到处救苦。“想再问时候，救护车来了，有人高喊：”走开，走开。“女士霎时间不见了。</p><p>　　经医院的检查，严某额角破皮，足盘、腿部几处有裂伤，内脏骨骼均无损害。但手臂上却发现”G普T\"三个字（G是观音的字首Guanyin,T是陀的字首Tuo，连起来就是“普陀观音”）。医院惊奇地问严某：“此字是何时刺上的？”严某说：“我素来不懂外文，也从不曾臂上刺过字。”严某的岳母名胡明巧，是一位虔诚的<a href=\"https://www.guang5.com/rmgjc/fodizi.html\" class=\"keylink\" target=\"_blank\">佛弟子</a>。每当女婿出车，她就在佛像前诵《<a href=\"https://www.guang5.com/fojing/gsypspmp/\" class=\"keylink\" target=\"_blank\">观世音菩萨普门品</a>》，祈求<a href=\"https://www.guang5.com/fjrw/zhufopusa/pusa/66963.html\" class=\"keylink\" target=\"_blank\">观音菩萨</a>保佑女婿一路平安。严某因此得以逢凶化吉。出自《观音菩萨本迹感应录》续编</p><p>　　“第二种无畏，我旋妄见而回归自性的真见。所以能令众生，遭遇大火，火不能烧。”</p><p>　　曹魏时，有个僧人叫法智。他出家以前，一次独自在草泽中行走，忽然草地燃起了野火，四周都烈焰腾腾。他知道已无路可逃，就专心至志地念诵观世音菩萨。过了一会儿，大火烧过去以后，所有荒草都烧得干干净净，唯独他所站之处没有烧到。出自《高僧传二集》</p><p>　　“第三种无畏，我因为旋虚妄的闻性回归自性的真闻，所以能令众生，遭遇大水，水不能溺。”</p><p>　　我的朋友阿雄，一次在海边游泳。由于一时兴起，游得太远，想往回游时，却发现自己已经筋疲力尽，游不动了。他心里一慌，身体就要往下沉。情急之中，他想起观音菩萨来，于是连忙念“观世音菩萨”。这时，他觉得脚好像突然踩到了<a href=\"https://www.guang5.com/sushi/shucai/haidai/\" class=\"keylink\" target=\"_blank\">海带</a>之类的东西，把他拖起来了。于是边游边走，终于折腾到了岸上。定下神来以后，他一回想，那地方怎么会有海带呢？再说，即使真是海带，海带那么软，怎么可能托得住他呢？这才明白，原来是因为他念观音菩萨，所以观世音菩萨示现神变救了他！</p><p>　　“第四种无畏，我已经断灭一切妄想，心无杀念。所以能令众生误入鬼国，鬼不能害。”</p><p>　　宋朝淳熙年间，铙州的李氏，病死后忽然又醒过来，她说，她进入了冥府，在旷野中行了几里路程，才走到一个城市。他听得人声吵吵杂杂，但是因为黑暗完全看不见。她自己默念说：“我虔诵<a href=\"https://www.guang5.com/fojing/gsypspmp/\" class=\"keylink\" target=\"_blank\">普门品</a>三十几年，今日进入鬼城，菩萨岂能没有救援？”于是她大声疾呼‘救苦救难观世音菩萨’约有一百声，恍忽之间有一只手把着她的左臂而行。渐渐地走到了光明的地方，并且看见大士以妇女身出现，璎珞被体，璀璨照耀，异香芬郁，相好端严。因此她就乞求救命，大士对她说：‘你的命数已尽，好在你的夙缘很好，具有善报，所以我来援救，你可以马上赶回去，约半纪后我们再见吧！“她于是顶礼拜谢。大士举步向西方而去，远远地遥望前导的幡盖，金碧辉煌，震心眩目。豁然之间，她便苏醒过来了。”又过了五年之后，她才无疾而逝。出自《法华感通》</p><p>　　“第五种无畏，我从听闻入手，先断闻根而六根齐销。所以能令众生，临当被害的时候，刀一段一段地折断。使刀割到身上，好像砍在水里一样了无伤痕，就像用气吹光一样，毫无动摇。这是因为我证得了如如不动的自性，所以能加备众生。”</p><p>　　清朝有个和尚，名叫行仁，别号指一。他是河南省光山县张家的子弟。他十五岁那年，在白鹿洞读书的时候，遇到一个异僧告戒他说：“你将有大难来临，能够持念大悲圣号可以解脱。”张生于是一心受持诵念大士圣号。崇祯辛已年，张献忠作乱，破及县城，奸虏烧杀无算。行将屠戮张生时，刀忽然自己断掉了。贼众都觉得奇怪，张生因此得以不死，于是发心剃发为僧。甲申年抵达金陵，随从千华昧和尚受了具足戒。出自《法华感通》</p><p>　　“第六种无畏，我通过闻性的熏修而证得自性的精明。使本有的明光周遍法界。这样，以幽暗为性的药叉鬼、罗刹鬼、鸠槃茶、毗舍遮、富单那等，对称我名号的众生，看都不敢看。”</p><p>　　梁时，僧人惠简，戒行清净。湖北荆州官厅东面，有一座别斋，多鬼怪。当时，王建武当政，拜惠简为师，就请惠简住在那里。惠简看见一个黑色的人，没有眼睛，从墙壁中出来，于是是只默念观音菩萨。鬼说：“承您精进，所以来试探。您神色不动，我岂能再逼您呢？”便又进入墙壁中。于是鬼怪绝迹。出自《高僧传》二集</p><p>　　“第七种无畏，音尘消亡，闻性逆流返入，而远离一切尘妄，所以我能令众生不被枷锁捆缚。”</p><p>　　晋朝有位姓盖名护的山阳人。最初关到监狱里，应当受死罪。他三天三夜诵念观世音圣号，心里没有间断停止的时候。第三夜就见到观音放光，照到他枷锁上，枷锁脱落，门也打开了。他随著光走出监狱，大约行走了二十里路，光才熄灭。出自《观音玄义疏记》</p><p>　　“第八种无畏。声尘灭尽，闻性圆通，因而遍生慈力，所以我能令众生经过险路，贼不能劫。”</p><p>　　元魏末年，有个和尚名叫法禅。一天跟很多和尚走山路，忽然逢遇强盗。法禅看见贼人来势汹汹，知道难以理喻，惟有虔诚诵念救苦救难观世音名号。群贼追不上，又想用弓箭射，箭却射不出去。贼大为惊异，认为和尚都是神人，于是舍命逃走。出自《高僧传》二集</p><p>　　“九者。因为闻性的熏修而远离一切尘相，因此能不被色相所劫夺，所以我能令一切多淫的众生，远离贪欲。”</p><p>　　茂章居士，年少时喜欢看淫秽小说，年纪轻轻就犯<a href=\"https://www.guang5.com/rmgjc/shouyin.html\" class=\"keylink\" target=\"_blank\">手淫</a>和邪淫。信佛之后，他深深地忏悔，发誓戒除邪淫，但身体已经受损。一九四四年，他在上海因为工作劳累过度，身体发热、腹泻。治好之后仍然委靡不振、无力工作，而且经常头晕、目眩、耳鸣、消化不良，医药无效。因思家有老母，若就此而终，母将奈何？一时忧愁万分，寝食不安，遂礼请灵岩寺的德森师，法师开示道：“寿之长短，随业而定，人力难为，何必担心。只应该精进念佛。如果注定命短，不能终养老母，担心又有何用？如果能持斋戒淫，诚心念佛，忏悔宿业，以你的<a href=\"https://www.guang5.com/rmgjc/xiaoxin.html\" class=\"keylink\" target=\"_blank\">孝心</a>，或许可以仗三宝威力加被，消除恶业，转夭为寿。这也要看你发心是否广大至诚，行持是否切实恒久。”茂章听后，顿时释怀，而更加竭诚行持，并遵印光大师开示：作将死已死想，则一切无有难舍可恋者，惟有一心念佛矣。而后，茂章又看了《观音灵感录》，随即发心每日诵普门品一卷，暇时即念观音圣号，仰求宿业消除，善根增长，疾病顿愈，现生得终母养，临终往生极乐。并求先父往生西方，受胜妙乐；老母增福益寿，念佛精进。如是三月，即蒙慈祐，众病悉愈，而精神转佳矣。出自《观音灵感录》续编</p><p>　　“十者。闻根与声尘圆融无碍，消灭了能闻和所闻的对立，所以我能令一切嗔恨的众生，远离恚怒。”</p><p>　　江西临江有个秀才叫高蕃，娶妻樊氏，叫江城。江城长得美貌，性格却很凶暴。婚后不久，高蕃受江城百般欺负，公公婆婆制止不了，两人只好分居过日子。高蕃<a href=\"https://www.guang5.com/rmgjc/tongku.html\" class=\"keylink\" target=\"_blank\">痛苦</a>不堪，身体也越来越衰弱。母亲见了心里忧愁。有一天在梦中见到<a href=\"https://www.guang5.com/fjgs/fojing/31192.html\" class=\"keylink\" target=\"_blank\">一位老人</a>告诉她：“江城前世是净业和尚养的一只长生鼠，你儿子前生作书生的时候偶然来到寺院，把这长生鼠给弄死了。今生是冤业<a href=\"https://www.guang5.com/rmgjc/baoying.html\" class=\"keylink\" target=\"_blank\">报应</a>，人力无法挽回，只有每天早晨虔诚念观音咒一百遍，应当有效果。”于是夫妻俩每天早晨一起念。过了两个月，江城反而比以往更狂暴放纵。有一天，来了一位老和尚正在门外讲佛法，围观的人很多，江城也出去观看。老和尚讲完要了一瓶清水，端水对着江城的脸大声说：“莫要嗔，莫要嗔，前世也非假，今世也非真。咄！鼠子缩头去，勿使猫儿寻。”说完吸一口水喷在她脸上。江城默然不语，擦了脸就自己回去了。从此她痛改前非，性情变得柔和<a href=\"https://www.guang5.com/rmgjc/xiaoshun.html\" class=\"keylink\" target=\"_blank\">孝顺</a>。这样就知道，由亲人代念都能离嗔，何况自己发心念，当然效力更大、更能远离嗔心。《观音灵感录》新编</p><p>　　“十一者。虚妄的尘相销归明觉，遍满法界的身心犹如琉璃一样清澈无碍，所以我能令愚痴颠倒的众生，永离痴暗。”</p><p>　　净宗六组永明延寿禅师，常诵《<a href=\"https://www.guang5.com/fojing/miaofalianhuajing/\" class=\"keylink\" target=\"_blank\">法华经</a>》。一天，梦到观世音菩萨用<a href=\"https://www.guang5.com/rmgjc/ganlu.html\" class=\"keylink\" target=\"_blank\">甘露</a>水灌入他的口中，从此辩才无碍。由于自己终身的趋向未定，于是登上智者岩，做了两个阄，一个是“一心禅观”，一个是“万善庄严净土”。一连七次，抓到的都是净土阄。于是每日定一百零八种佛事，庄严净土。夜晚则去别峰经行念佛，每天念佛号达十万句。附近的村民，常能听到有梵呗天乐和大师的念佛声，响彻天际。著有《宗镜录》一百卷，发明心性的宗旨。《万完善同归集》阐述空有无碍的道理，指归净土。开宝八年二月二十六日早晨，大师焚香之后告别大众，结跏趺坐而化去，时年七十二岁。后来有一僧人从临川来，围绕大师的塔礼拜念佛，整整一年。问其缘故，他说：“我在病中下到阴间，见阎王殿左面供着一个和尚的像，阎王精勤礼拜。我问这和尚是何人，说是杭州的永明延寿禅师，已往生西方净土的上品上生了。阎王尊重大师的<a href=\"https://www.guang5.com/rmgjc/daode.html\" class=\"keylink\" target=\"_blank\">道德</a>，所以才不停地礼拜。”</p><p>　　“十二者。把一切有形融归闻性，身心按住在自性的不动道场中，所以我能涉入世间，又不坏世界，遍供十方微尘数诸佛如来。我能在诸佛身边做法王子，又能令法界无子的众生，求生男孩，便生福德智慧之男。”</p><p>　　宋朝汴京的张庆，做监狱的司狱，对囚犯照顾得无微不至，常告诫他的部属说：“为人不幸罹于法网，我们设若不加怜恤，受罪的人到哪里去申诉呢！”他生平持诵法华经，凡有囚犯被处死后，必定吃斋茹素，并且为之诵经一个月。他的妻子袁氏四十八岁的时候感染瘟疫，死了三天忽然醒过来，告诉他说：“我起先走到一个污秽的地方，忽然见到白衣大士，对我说：’你的丈夫做了很多善事，现在虽然没有子嗣，将来当有子孙兴旺。‘然后用手把我拖出来，我就活了过来。”到了第二年，果然生了一个孩子，后来读书做官。张庆活到八十二岁无疾而终，六个孙子都成了显贵。出自《观音持验记》</p><p>　　“十三者。六根圆通，明照无二，含摄十方世界，犹如大圆镜。十方微尘数如来的秘密法门，受领无余，所以我能令法界无子的众生，欲求女子，便生相貌端正，有福有德，性情柔顺，众人爱敬的女孩。”</p><p>　　王一茗，吉林长春人，天性善良孝顺，结婚多年而无子。信佛后，凡<a href=\"https://www.guang5.com/fangsheng/\" class=\"keylink\" target=\"_blank\">放生</a>印经等功德善事无不尽力，以此为乐。后经人指点，家中供奉了送子观音，每天供养水果，虔诚礼拜，不到一个月就怀孕了，后来产下一个女婴，母子平安，合家欢庆。（王一茗是笔者的佛友，此事乃笔者亲眼目睹。其所供奉的送子观音就是笔者所赠。）</p><p>　　“十四者。在这个三千大千世界中，有百亿个日月。现在住世的法王子，有六十二恒河沙数那么多。他们教化众生，随顺众生，各有各的方便，各有各的智慧。我因为耳根的妙用，而证得圆通的本根，身心微妙，含容法界，所以能令众生持我一个人的名号，与持这六十二恒河沙法王子名号的福德，正等无异。</p><p>　　世尊。我有这十四种无畏，泽被苍生。</p><p>　　世尊。我获得圆通后，进而修证无上道，所以又获得四种不可思议的无作妙德。</p><p>　　一者。由我初证微妙的闻心，心性本有的精明得到显现，脱离闻性的束缚，使见闻觉知，不再分隔，成为圆融的一体。觉性清净，所以我能变现很多微妙的相貌，能说无量无边的秘密神咒。或者现一首、三首、一百零八首，千首万首，乃至八万四千首。二臂、四臂，至一百零八臂，乃至八万四千臂。二目、三目、一百零八目，乃至八万四千清净宝目。或慈或威，或定或慧，救护众生，得大自在。</p><p>　　二者。我通过闻思，摆脱了六尘。如声音能穿过墙壁一样，一切尘相，不再为碍。所以我能现种种形象，诵种种神咒，帮助众生。所以，十方微尘一样众多的国土，都称我为施无畏者。</p><p>　　三者。我所游行的世界，都能令众生不惜舍弃珍宝，而求得到我的哀愍。</p><p>　　四者。我证得究竟的菩提，能以种种珍宝供养十方如来，所以能令六道众生，求妻得妻，求子得子，求三昧得三昧，求长寿得长寿，乃至求大涅槃得大涅槃。</p><p>　　佛问圆通，我通过耳根的熏修，而循入圆湛的自性。用自性来观照，所以能随缘应化，随心自在，逆流反闻，证得正定，成就菩提，这是第一。</p><h3>　　文殊总结</h3><p>　　这时，世尊在狮子座上，从头顶和四肢，一同放出宝光，远灌十方世界微尘数如来及菩萨的头顶。那些如来，也从头顶和四肢一同放光，从微尘数的世界，灌入释迦牟尼佛的佛顶，并灌入法会中诸大菩萨及阿罗汉的头顶。林木池沼，同演法音。光光相错，如宝丝网。</p><p>　　在场的大众，从没见过这样殊胜的情景。一时间，所有人都证得了金刚三昧。天上如雨般降下了百宝莲花。青色、黄色、红色、白色，交相辉映。十方虚空，成七宝色。娑婆世界的大地山河，霎时不现。只见十方微尘数的国土，合成一界，梵呗歌咏自然和鸣。</p><p>　　这时，如来问文殊师利法王子：”这二十五位大菩萨及阿罗汉，各自陈述了自己最初成道的方便法门，都证得了圆通。他们的修行，并无优劣之分。我现在想令阿难开悟，这二十五种行门，哪一个更适合阿难呢？我灭度后，此界众生，欲求无上道，哪一个能让他们更容易成就呢？“</p><p>　　文殊师利法王子，接受了佛旨，便从座位上站起来，顶礼佛足，承佛威神，回答说：”</p><p>　　如来的大觉性海澄清而圆满，圆满澄清的觉性本来妙觉。</p><p>　　元明的观照中忽然产生了一个观照的所在，所在一旦产生，观照随之消亡。</p><p>　　迷失在幻妄中，于是产生了虚空。以虚空为依托，形成了种种世界。</p><p>　　妄想沉淀为国土，知觉形成了众生。</p><p>　　虚空诞生在大觉海中，如同海中泛起了一个水泡。</p><p>　　微尘一样众多的有漏世界，都是依虚空而生。</p><p>　　水泡一旦破灭，虚空尚且没有，何况是欲界、色界无色界这些世界呢！</p><p>　　众生的自性，本来并无二致，但是回归的方法却多种多样。</p><p>　　菩提的圣性，处处通达。不管是顺缘还是逆缘，都是入道的方便之门。</p><p>　　初发心修三昧，选择的路径不同，迟速就会有所差异</p><p>　　色相是妄想凝成的尘相，所以无论怎样精心地参究，也不可能使之明彻。怎么能在不明彻的色尘中，获得明彻的圆通呢！</p><p>　　音声所表达的语言，是依靠文句来明了其意的。而任何文句，都不可能包含一切意义。以片面的含义，怎么能获得圆满的通达的圆通呢！</p><p>　　香是要气味跟鼻子合和才能被感知到的，二者相离就什么都没有。这样时有时无，怎么能获得恒常的圆通呢！</p><p>　　味性也不是本来就有的，只在味道产生的时候才会有。这样不稳定味性，怎么能获得稳定圆通呢！</p><p>　　触是要有外物接触的时候，才能被感知到的。没有外物，就没有触觉。而离合不是恒定的，怎么能通过不恒定的触觉，来获得恒定的圆通呢！</p><p>　　法也叫内尘。有个尘相，就必定有个所在。有个所在就不是圆满周遍的。不周遍的法，怎么能获得周遍的圆通呢！</p><p>　　见性虽然洞达明了，但是只能看前不能看后，这样四维就亏失了一半。怎么能通过这有亏的见性，而获的无亏的圆通呢！</p><p>　　鼻息虽然出入通达，但是出入之间，要有个停顿。有间断的鼻息，怎么能获得无间断的圆通呢！</p><p>　　舌的感知，是要通过味道来获得的。没有味道，就了无所有。这样若有若无，怎么能获得圆通呢！</p><p>　　身体要与外物接触，才会有触觉。分开的时候，身体和外物各有各的边缘。怎么能通过这有限的触觉，而获得圆遍的通达呢！</p><p>　　意根胡思乱想，没有片刻停息。湛然的明觉，在其中根本感受不到。思想念头摆脱不掉，还怎么能获得圆通呢！</p><p>　　见识是眼根和色尘相对而生，但究其根本，却并无实相。本身就是虚妄的，怎么能通过它来获得不虚的圆通呢！</p><p>　　心闻虽然洞彻十方，但是却要有大因缘才能成就，不是初学者能够契入的。所以，要通过心闻获得圆通，谈何容易呢！。</p><p>　　鼻想本来只是为了通过这个方法，把心摄住。但是这样，心就有所住了。有所住还怎么获得圆通呢！</p><p>　　以无碍的法音开悟众生，这要求说法者开悟在先。语言文字并非无漏的实相，怎么能借此获得圆通呢！</p><p>　　持戒只能约束身体，身体以外的就没办法了。不能圆遍一切，怎么能获得圆遍的通达呢！</p><p>　　神通的获得，是宿世的因缘，跟法尘的分别又有什么关系呢！有攀援的心就离不开外物，这样怎么能获得圆通呢！</p><p>　　地性是坚固的，不是通达的。这有为的东西不是菩提圣性，怎么能通过它而获得圆通呢！</p><p>　　如果以水性做观，用的无非是想念。而想念并非真如实性，怎么能由此获得圆通呢！</p><p>　　观火性的方法，只是厌离欲火。而仅仅厌离欲火，并不是真的离开幻妄，所以不能由此获得圆通！</p><p>　　风性有动有静。动静本身就是对立的。有对立就不是无上正觉，初学者怎能由此获得圆通呢！</p><p>　　如果观空性，虚空本是昏钝之相。昏钝就不是明觉。本来就与明觉对立，如何由此获得明觉的圆通呢！</p><p>　　识性念念迁流，本非常住。识心本身就是虚妄的，怎么能通过虚妄的识心，获得真实的圆通呢！</p><p>　　一切行为都是无常。起心动念，都有生有灭。若以此念佛之因，去感往生净土之果，自然万不漏一。但若以此迁流的心念，去感无生灭的圆通之果，就难以契合了。</p><p>　　世尊，佛示现出生在这个娑婆世界，真正适合这个世界众生的修行方法，其实是’音闻‘。</p><p>　　众生要想出离苦海，得到解脱，还是要依耳根圆通。</p><p>　　观音菩萨在恒河沙数劫中，于微尘一样众多的国土，以大自在力，让众生离开恐惧而得到安乐。</p><p>　　观世音菩萨以清净的梵呗之音，使众生摆脱烦恼；以博大的海潮之音，使众生获得解脱。</p><p>　　世尊，正如观音菩萨所说，十方一齐击鼓，十处同时都能听见，圆满而且真实。</p><p>　　眼目隔着障碍就看不到，口与鼻都是稍远一点就没法感觉到，身体要接触才有知觉，心念又是纷繁无绪的。</p><p>　　耳根隔着墙也能听到，远近都可以，这是其他五根所不具备的优势，所以耳根最容易通达到真如实际。</p><p>　　音声虽然有动有静，但是闻性却并非时有时无。虽然没有声音的时候，听不到什么，但闻性还是在的。</p><p>　　没有声音，闻性不会随之消失；有了声音，闻性也不会因此产生。可见闻性是离生灭而恒常存在的</p><p>　　即使是在睡梦中，也不会因为的思维停止，而使闻性消失。可见闻性是超越思维的，这也是其他五根所不具备的。</p><p>　　现在这个娑婆世界，用耳根反闻的修行方法已经得到了宣明。</p><p>　　众生迷昧了本有的闻性，随着声尘流转。</p><p>　　阿难纵然博闻强记，也不免落于摩登伽女的邪法之中，这不就是随着声尘流转而导致的吗！如果能反闻闻自性，自然就能消除这样幻妄。</p><p>　　阿难，你注意听，我借助佛的威神之力，宣说这个如金刚般坚固不动，如幻化般不可思议，能出生一切诸佛正定的法门。尽管你曾听过微尘一样多的法门，但是，如果欲望不先除去，尤其是这个<a href=\"https://www.guang5.com/rmgjc/seyu.html\" class=\"keylink\" target=\"_blank\">色欲</a>之漏不除去，而只一味地追求多闻，这反而会耽误了你。</p><p>　　你应该把听佛说法的这个功夫，用来听你的自性。’听闻‘也不是自己自然而然生出来的，而是因为有声音，才会有个’听闻‘。你把这个听闻旋归自性，与外界的声尘脱离。既然脱离了声尘，旋归自性，这时的听闻，就无所谓听闻了。一根反本还原，六根一齐都得到解脱。</p><p>　　见闻如同眼中的病翳，三界如同空中的狂花。你反闻自性，翳病就被连根拔除。六尘尽销，自性就恢复本来的清净。净到极点，灵光一闪，豁然通达。整个虚空，都含藏在你寂然的观照之中。</p><p>　　这时，再回过头来看尘世，就如同梦中的影事一样。摩登伽女不过是梦中的人物而已，谁能留得住你呢！如同世间的木偶剧，虚构出种种人物。虽然他们表演时活灵活现，但是机关一停，一切都归于寂灭。因为这些幻化的东西都是没有自性的。</p><p>　　六根也是这样，本来都是由一个自性形成。所以，只要一根还原，其他六根就都不复存在。六根不在，六尘就不再为扰，圆明的妙性自然现前。这时还有余留的尘影存在。余尘净尽，自性明净到极点，则成如来。</p><p>　　大众及阿难，你们都应该把闻机倒转过来，反闻闻自性，性成无上道。圆通其实就是这样。</p><p>　　这是微尘数诸佛，步入涅槃门所走的共同的道路。过去诸佛如来，修行这个法门已经成就；现在的诸菩萨，沿着这条路走，而今都各个获得了圆明；未来的修学人，也要按这个方法来修行。不单单是观世音菩萨，我也是从这个方法中证得圣果的。</p><p>　　诚如世尊问我，这一切的方便法门中，哪一种最适合末法众生的根机，以解救末法时期想出离尘世的人，令他们成就如来的涅槃妙心。观世音菩萨所修的法门是最合适的。其余的法门都是靠佛的大威神力加被，才能在相应的事相中舍却尘劳，并不是可以常用的法门。</p><p>　　愿佛加被未来的一切的众生，令他们对于耳根圆通的法门深信不疑。这个法门不但可以教化阿难，而且对末法时代一切堕落的众生都适用。只要用耳根来修，其圆通方便超越其他，真实的道理就是这样的。“</p><p>　　阿难和一切大众，身心了然，这时再看诸佛如来的菩提涅槃，犹如远游之人，虽然还没有回家，但是回家的道路已经清楚了。</p><p>　　在会的一切的大众，天龙八部，有学的声闻、缘觉，及初发心的菩萨，有十个恒河沙那么多，此时都知道了自己的真心，远离一切的尘垢，得到清净的法眼。 无量无边的众生，发无上正等正觉之心。\t\t</p></div>"
    },
    {
        "title": "第三章 四种清静明诲",
        "author": "",
        "date": "",
        "html": "<div class=\"B1_text\"><h2>第三章 四种清静明诲</h2><p>　　知道了修行方法后，在具体的修行过程中，要想远离魔事，心无退失，就必须严持四种净戒。哪四种呢？就是要没有淫心，没有杀心，没有盗心，没有大妄语。不断这四种心而修禅定，要想成就如来的涅槃圣道，就如同南辕北辙一样，是绝对不可能的。这四种净戒持得冰清玉洁，心就不会去攀缘色香味触这些尘相，一切魔事，还怎么可能发生呢！</p><p>　　阿难这时心迹圆明，悲欣交集。此时，他发心想要利益未来的众生，于是合掌礼佛，说：”世尊！我现在已经知道了成佛的法门，在其中修行，再没有疑惑。我常听如来说：’自未得度先度人者，菩萨发心；自觉已圆能觉他者，如来应世。‘我虽然还未得度，但我愿度末劫的一切众生。世尊！这些众生离佛越来越远，那时，邪师说法如恒河沙。他们想要摄心进入三摩地正定，该怎样安立道场，远离魔事，使自己的菩提心没有退失呢？“</p><p>　　世尊称赞阿难道：”善哉善哉！阿难。你常听我戒的时候，宣说修行的三决定义：所谓摄心为戒，因戒生定，因定发慧，这是’三无漏学‘。阿难，怎样摄心，才叫戒呢？</p><h3>　　不淫</h3><p>　　如果一切世界的六道众生，其心不淫，就不会再随生死相续。你修三昧正定，本来就是为了摆脱尘劳。如果淫心不除，尘劳就不能摆脱。纵使多有智慧，禅定现前，如果不能断淫，必落魔道。上品做魔王，中品做魔民，下品当魔女。这些魔也有徒众，他们各各自谓已成就无上道。我灭度后，在末法之中，这些魔民炽盛于世间，广行贪淫，鼓惑众生。令众生落入爱见坑中，错失菩提正路。</p><p>　　你教世人修三摩地正定，先要断心淫，这是如来先佛世尊，第一决定清净明诲。</p><p>　　所以，阿难！如果不断淫而修禅定，这就好像明明是在蒸沙石，却想把它做成饭。即使经百千劫，也只能是热沙。为什么呢？因为这根本就不是饭，只是沙石。你以淫身，求佛妙果，纵使得到些妙悟，也都是淫根，根本成淫，轮转三途，绝对不能出离。如来的涅槃，怎么可能证得呢！</p><h3>　　不杀</h3><p>　　阿难！一切世界的六道众生，其心不杀，就不会再随生死相续。</p><p>　　你修三昧，本来就是为了摆脱尘劳。如果杀心不除，尘不可出。纵使多有智慧，禅定现前，如果不断杀，必落神道。上品的做大力鬼，中品的则为飞行夜叉或者鬼帅等，下品的做地行罗刹。这些鬼神也有徒众，他们各各自称已经证得无上道。我灭度后，在末法之中，这些鬼神炽盛于世间。他们说吃肉也能证得菩提。</p><p>　　阿难！我令比丘吃五净肉。这些肉都是我用神力化生出来的，根本没有命根。婆罗门国，土地蒸湿，又多沙石，草菜不生。我以大悲神力加持，因为大慈悲，假名为肉，而令你们尝出味道。所以，如来灭度之后，还在吃众生肉的，怎么能做佛弟子呢？</p><p>　　你们要知道，吃肉的人，纵使心地开明好像三摩地正定的境界，那也只是大罗刹而已，命终以后，必定沉沦生死苦海，绝不是佛弟子。相杀相吞相食还没完呢，这样的人，怎么出得了三界呢？</p><p>　　你教世人修三摩地正定，其次要断<a href=\"https://www.guang5.com/rmgjc/shasheng.html\" class=\"keylink\" target=\"_blank\">杀生</a>。这是如来先佛世尊，第二决定清净明诲。</p><p>　　所以，阿难！如果不断杀生而修禅定，就好比有人，塞住自己的耳朵，然后高声大叫，希望别人听不到，这叫做’欲盖弥彰‘。清净的比丘，及诸菩萨，在小路上走，都不蹋生草，何况用手去拔。怎么能口称大悲，还取众生的血肉来吃呢！如果比丘不穿东方的丝绵绢帛，以及靴履裘毛、乳酪醍醐，这样的比丘，对于这个世间，才是真能解脱，酬还宿债后，就可以不游三界了。为什么呢？穿了它的皮毛，就跟它结了缘。就好像人吃了地中生长的谷物，脚就不能离地一样。必须使身心，与诸众生，不穿也不吃，我说这个人是真解脱者。</p><p>　　符合我这个说法的，就是佛说的。不符合我这个说法的，就是魔王所说。“</p><h3>　　人类的诞生</h3><p>　　”吃了地中生长的谷物，脚就不能离地。“这是是怎么回事呢？要解释这个问题，还得从人类的起源说起。</p><p>　　有人可能会问，人不是从猿猴进化来的吗？达尔文的进化论早已经证实了这一点。</p><p>　　其实，随着科学的发展，进化论早已无声无息地被主流科学所淘汰了。有人曾对美国二十多年来，的主要大学使用的三十部生化方面教科书进行了调查，结果发现，许多教材完全忽视了进化论。例如，由费城杰斐逊大学的托马斯·戴维林教授编写的一部生化教科书，曾再版三次，索引条目最多五千条，但没有一条涉及进化论；牛津出版社出版了一本北卡罗来那州立大学阿姆斯特朗写的教科书，本书也曾被再版三次，但哪一章都没有提进化论，甚至在索引中也只字未提。在美国所有生物进化类杂志中，发表的真正属于结构进化的文章不足1%。在计算机图书索引中，也没有发现历年来对这一问题研究的一本专著。这是为什么呢？对于那些学识渊博的学者们，我们大约没必要提醒他们：先生，您忘了什么？问题在于进化论的本身。</p><p>　　实际上，早在1871年，即达尔文的进化论刚公布不久，乔圣治·米沃特就对达尔文的进化论提出了疑问：自然选择无法对某些适应性结构的初期阶段作出解释；它不符合不同近似种群的结构共存原则；某些特定的差异有突然发生的可能，而不一定是逐步发生的；有机形式中有众多现象是自然选择无法解释的等待。</p><p>　　1966年在费城的威斯达学院召开了一次由一些数学家和进化生物学家参加的研讨会，会议的主题就是达尔文的进化论。会上数学家们提出，从数学理论的角度出发，达尔文的进化论是根本错误的，他们说：”新达尔文进化论中有许多漏洞，我们认为，这些漏洞用目前生物学家的观点是无法弥补和解释的。“</p><p>　　美国芝加哥大学生态进化系的杰丽·科恩教授说：”无奈，我们只能这样说，新达尔文主义的观点几乎没有什么依据，它的理论基础和实验依据都不足。“</p><p>　　相对于这些科学家的分析，考古学的证据来的更直接。</p><p>　　1938年美国肯塔基州柏里学院地质系主任柏洛兹博士宣布，他在石炭纪砂岩中发现10个人类的脚印。显微照片和红外线照片证明，这些脚印是人足压力自然造成，而非人工雕刻。据估计，有人足痕迹的这些岩石约有2.5亿年历史。</p><p>　　法国有一家工厂使用从非洲加蓬共和国进口的奥克洛铀矿石，他们惊讶地发现，这批进口铀矿石已被人利用过。铀矿石的一般含铀量为0.72%，而奥克洛铀矿石的含铀量却不足0.3%。这一奇怪的现象引起了科学家们的注意。他们纷纷来到加蓬奥克洛铀矿考察，发现了一个不可思议的史前遗迹--古老的核反应堆，由6个区域约五百吨铀矿石构成，输出功率估计为100千瓦。这个反应堆保存完整，结构合理，运转时间长达50万年之久。据考证，奥克洛铀矿成矿年代大约在20亿年之前，成矿后不久就有了这一核反应堆。</p><p>　　南美喀喀湖高原，古城第阿瓦拉克神秘的废墟，有一座用整块红色砂岩雕刻成的巨大神像。神像上刻有一幅完整无缺的星空图，以及上百个符号。考古学家多年研究，终于破译了星图及符号。他们认为，这幅星图所描绘的是2.7万年前的古代星空，那些符号记述的是极为深奥的天文知识。</p><p>　　1921年在非洲赞比亚，人们发现了一个古尼德人的头骨，头骨左方有一个边缘平滑的圆孔，这圆孔唯有子弹射击才能形成。而据考证，古尼德人生活在旧石器时代中期，距今约有7万年。</p><p>　　类似的考古发现，比比皆是。可见，人类的历时，绝不仅仅是教科书中写的那些。人类的起源，也绝不是进化论所讲的那样。下面，我来看看佛陀是怎么说的。</p><p>　　佛告诉我们，有形世界在成、住、坏、空四劫中循环。每经历一轮成住坏空，这叫做一个大劫。每个成住坏空，分别叫一个中劫。</p><p>　　在坏劫的时候，如果是火灾毁灭世界，则二禅天的光音天以下，一切的有形世界，都会被劫火烧成虚空。</p><p>　　空劫过后，大地再次形成。这时光音天的天人来到地上。他们的身体会发光，飞行自在，相貌也都是一样的妙色。大地此时到处涌甘泉。天人们本来是不需要饮食的，但是自从尝了地上的甘泉后，生起贪爱之心，一饮再饮，一发而不可收拾。这样渐渐地，身体不再发光，飞行的能力也丧失了。并且随着饮水的多少，相貌也出现了美丑之别。于是，他们便生出了优劣胜负，傲慢妒忌之心。这样就在心理上，越来越接近人类。</p><p>　　接着，甘泉渐渐干涸。大地上又生出一种叫”地肥“的食物，味道美如醍醐。地肥吃光了以后，又长出”地皮“，味如薄饼。天人吃的越多，身体就越重，并逐渐生出骨骼来，这样，在生理上就越来越接近人类。</p><p>　　地皮被吃光了以后，地上又长出<a href=\"https://www.guang5.com/sushi/wgzl/jingmi/\" class=\"keylink\" target=\"_blank\">粳米</a>。此时的粳米没有皮，营养而美味。而且朝割暮熟，暮割朝熟。天人们吃了粳米以后，便产生了欲望。情欲重的逐渐变成女人，情欲轻的则成为男人。行欲带来的羞耻心，使人们开始搭盖房屋来遮掩，<a href=\"https://www.guang5.com/rmgjc/jiating.html\" class=\"keylink\" target=\"_blank\">家庭</a>由此形成。女人受孕后，诞生了胎生的人类，人道从此诞生。</p><p>　　粳米越来越少，于是每家每户开始贮存粳米，并出现了明抢暗夺这些是非。人们便商议选出一名王者来主持公道，这样便有了争讼，刑罚和杀戮。人类社会从此形成。</p><p>　　随着人所造作的<a href=\"https://www.guang5.com/rmgjc/shane.html\" class=\"keylink\" target=\"_blank\">善恶</a>业力，<a href=\"https://www.guang5.com/rmgjc/diyu.html\" class=\"keylink\" target=\"_blank\">地狱</a>、饿鬼、畜生、修罗道也逐渐形成。</p><p>　　最初的人类，寿命是八万四千岁。随着人心的变坏，每过一百年，寿命减一岁，身高矮一寸。这个寿命和身高，指的是全人类的平均值。具体到每个人，当然要随着给自的业力，有所不同。就这样一直减少到十岁，身高到一尺的时候，就会大灾难发生。或者是刀兵，或者是瘟疫，或者是饥馑，把人类的数量减少为一万人。经历过灾难的洗礼后，人心开始向善。这时，天地间又变得风调雨顺，国泰民安。于是，每过一百年，人类的身高又增加一寸，寿命增加一岁，一直增加到八万四千岁。</p><p>　　这样一来一回，叫一个劫。一千个劫叫一个小劫。二十个小劫为一个中劫。也就是说，在”住劫“中，这样往返二万次以后，世界就开始变坏，进入”坏劫“，直到完全毁灭，变为虚空。”空劫“过后，世界又在”成劫“中再次形成，人类又再次诞生。如此循环，无穷无尽。</p><p>　　自从无明深陷虚妄的幻境之后，生命仿佛被抛入了一个巨大的熔炉，在灾难与无常的煎熬中轮转不息。正像贾谊在《鵩鸟赋》中说的那样：”且夫天地为炉兮，造化为工；阴阳为炭兮，万物为铜。“</p><p>　　无尽的烦恼驱使迷失的心灵，不得不去寻求解脱。无明不息，烦恼不尽。所以，如来的菩提涅槃，迟早是一切生命唯一的归宿。接下来，让我们继续追随佛陀，踏上<a href=\"https://www.guang5.com/fjrw/hcrw/daanfashi/176527.html\" class=\"keylink\" target=\"_blank\">解脱之路</a>吧！</p><h3>　　不盗</h3><p>　　如来继续说道：”阿难！如果一切世界的六道众生，其心不偷，就不会随着生死相续。</p><p>　　你修三昧正定，本来就是为了摆脱尘劳。但是如果偷心不除，就不能从尘劳中解脱。纵使多有智慧，禅定现前，如果不断偷，必定落入邪道。上品的是精灵，中品的是妖魅，下品的是被鬼魅所著的邪人。这些群邪也有徒众，他们各称自己已经成就无上道。我灭度后，末法之中，这些妖邪炽盛世间。他们冒充善知识，欺瞒诈骗，诳惑无知的人，或者危言耸听，令其六神无主，骗得他们家财耗散。</p><p>　　我教比丘，循方乞食，令他们舍弃贪欲，成就菩提。这些比丘，不自己营生，寄于残生，旅泊三界，尽此一生，再无往还。怎奈这些贼人，假借我的衣服，以如来的名义谋利，造种种罪业，都说是佛法。他本身却并不是出家具戒的比丘，修行小乘佛道的人。由此疑误无量众生，终堕无间地狱。</p><p>　　我灭度后，如果有比丘，发心决定修三摩提正定，能于如来的形像前，身然一灯，或烧一指节，或者在身上燃一炷香，我说此人无始劫以来的宿债，一时酬毕。从此告别这个世间，永远摆脱了诸漏烦恼。虽然还没能立即明了无上觉之路，但是，这个人对于佛法，已经生决定心。如果不做这个表示舍身的小小善因，纵使成就了无为，也必须还生成人，酬其宿债。就像我吃马麦那样。“</p><p>　　佛为什么会吃马麦呢？</p><p>　　这是因为有一次，婆罗门阿祇达发心供养如来和五百比丘。可是阿祇达突然被魔所扰，沉迷于无欲，闭门谢客。</p><p>　　当佛陀与五百位比丘只好入城乞食，但一连三天都乞不到任何食物。只有一位养马的人，将马所吃的麦子供养给佛陀和五百比丘。阿难见了十分难过。但是马麦到了佛陀口中，都化成了麦仁。</p><p>　　弟子们十分不解，于是请问佛陀：”为什么福慧圆满佛陀，也会有沦落到吃马麦的地步？“</p><p>　　佛陀于是对大众说：”在过去久远劫以前，有佛出世，名为毗婆叶如来。在槃头摩跋城中，有十六万八千位大比丘常随佛修行。槃头国王和大臣，以及全城的善男信女们，都以虔敬的心供养毗婆叶如来和他的弟子。</p><p>　　当时，城中的梵志山上住着一位婆罗门导师，名叫’因提耆利‘，有五百位弟子追随着他。</p><p>　　有一天，国王设大斋会，先恭请佛陀和他的弟子们。于是，宫中众人非常欢喜地准备了各种珍馐佳馔，并以上等的毛毯铺在座位上，恭迎佛陀的到来。国王摄心长跪，恭敬地执持香炉，对精舍所在的方位说：“斋会时辰已到，恭迎世尊前来应供。”毗婆叶如来，便与弟子们着衣持钵，威仪庠序地来到王宫接受供养。</p><p>　　这时，有位比丘名为弥勒，因为生病无法前来应供，所以毗婆叶如来在斋后，特意为弥勒比丘带回来一些食物。经过梵志山的时候，因提耆利闻到食物的美味，知道国王竟先斋供比丘们而没有请他，嫉妒之情油然而生，愤愤地说道：“这些没有头发的道人应该吃马麦，凭什么受如此美味的供养。”又转身问五百童子们，老师说的对不对？“童子们回答：”老师讲的一点也不错，他们师生都应该吃马麦才对！“</p><p>　　佛陀告诉舍利弗：”当时在山上的那位婆罗门导师就是我的前身。五百弟子就是现在的五百罗汉。当时生病的弥勒比丘就是现在的弥勒菩萨。我因为起嫉妒的恶念，说这些人不应吃美味的佳肴，而应该吃粗糙的马麦，你们亦同声附和，以此缘故，我与你们在地狱中轮回了好几千年。现在虽然已经成道，由于过去的宿殃，所以我们才吃了九十天的马麦。当时我没有说佛陀应吃马麦，只说这些比丘们该吃，所以我现在吃到的是麦仁。而你们附和的时候，因为说了佛陀与弟子们都应该吃马麦，所以你们吃到的是麦糠。</p><p>　　你们看，如来一切恶法都已断灭，一切善法都已具足，能度化诸天、龙神、帝王、臣民及一切众生，这样尚且不能免除过去的宿报，何况尚未得道的凡夫众生呢？所以，应当知晓三世因缘果报的道理，勿犯身口意三业。“</p><p>　　这就是世尊吃马麦的因缘。</p><p>　　”你教世人修三摩地，后断偷盗，这是如来先佛世尊，第三决定清净明诲。</p><p>　　所以阿难，如果不断偷盗而修禅定，这就好比有人想要用水灌满一个漏瓶，纵使灌上微尘劫，瓶子也终究不会满的。如果比丘在衣钵之余，分寸不蓄。乞食的剩余，都布施给饥饿的众生。在集会的时候，合掌向他人行礼。被人唾骂，就跟被人称赞一样。必定要使身和心全部捐舍，自己的身肉骨血与众生共享。不拿如来为度初发心的众生而做的方便说法，为自己辩解，以误初学。佛印证这样的人，是得到了真正的三昧。</p><p>　　我这样的说法，才是佛说，否则就是魔说。</p><h3>　　不妄</h3><p>　　阿难！一切世界的六道众生，虽然身心没有杀盗淫，这三种戒行已经圆满，但是如果大妄语，三摩地正定也不得清净。因为这会成为爱见魔，失却如来种。</p><p>　　这是断却自己的善根，消灭自己的佛种，就像用刀砍断多罗木一样，再也无法长出来了。佛说这样的人，永远地失去了善根，再无<a href=\"https://www.guang5.com/rmgjc/zhengjian.html\" class=\"keylink\" target=\"_blank\">正见</a>，沉沦三途苦海，终究是不会得到三昧正定的。</p><p>　　我灭度后，敕诸菩萨及阿罗汉，应身生到末法之中，作种种形像，度脱轮转于生死中的众生。或作沙门、白衣居士、人王宰官、童男童女，乃至淫女寡妇，奸偷屠贩，利用与他们共事的机会，称赞佛乘，令他们的身心进入三摩地正定。却始终不会说：’我是真菩萨、真阿罗汉。‘把如来的密因，轻易地告诉无知的人。除非临终的时候，暗中透露出来。“</p><p>　　唐代高僧，华严宗的初祖杜顺和尚，是文殊菩萨的化身。他的身份，就是临终的时候透露出来的。</p><p>　　杜顺和尚生于南北朝时的陈武帝定二年，雍州万年县杜陵人，本名法顺，俗姓杜。</p><p>　　年幼时，杜顺常在家后面的坟包上为小朋友说法。十八岁，皈依因圣寺魏珍禅师出家，专修禅观。行踪所至，常有灵异，当时的百姓称他为<a href=\"https://www.guang5.com/pic/tsfj/jietudunhuang/\" class=\"keylink\" target=\"_blank\">敦煌</a>菩萨，隋文帝也非常敬信他。杜顺和尚曾经将一双道鞋放在市门，三日不失。有人问他原因，他说：”我从无量劫来，未曾盗人一钱，自无盗缘。“</p><p>　　有人生病，杜顺和尚只要跟他面对面地坐在那里，过一会儿这个人的病就好了；有人说不出话，到了杜顺和尚那里，就能说得出来；有人耳朵聋了，去见了杜顺和尚，就能够听到声音。世间人对杜顺和尚的神通，都非常崇拜。</p><p>　　唐太宗也对杜顺和尚敬仰有加，把他当成佛一样看待。有一年，唐太宗生热病，下诏问杜顺和尚：”朕为劳热所苦，以大师的神力何以灭除？“杜顺和尚上表道：”皇上以圣德统治天下，小病何忧？但颁大赦，圣躬自安。“唐太宗听从他的建议，下诏大赦天下，病马上就好了。太宗为表彰杜顺和尚，赐号为”帝心“。</p><p>　　杜顺的操行，高洁严谨，对于华严义理，颇能契悟，曾著有彰显华严宗旨的《五教止观》，及契入一心法界的《法界观门》。文章做成后，和尚将文章投入熊熊烈火中，并祝祷说：”如果合佛心，则一字不毁。“火熄灭后，果然一字不毁。</p><p>　　晚年，有一位追随杜顺和尚多年的弟子来向他告假，说是要到<a href=\"https://www.guang5.com/fjsy/fengmao/6503.html\" class=\"keylink\" target=\"_blank\">五台山</a>去朝文殊菩萨。杜顺和尚便让他帮忙捎两封信。临行前，还送他一首偈子：”游子漫波波，台山礼土坡，文殊此便是，何处觅弥陀。“</p><p>　　弟子并没有领悟。于是，他先按着地址，找到了青娘子。原来青娘子竟然是个妓女。妓女打开信，看完后，说：”哦！我的事情也办完了，我也走了。“说完，就坐化了。弟子很奇怪，一看信才知道，原来青娘子竟然是观音菩萨。</p><p>　　接着，弟子又按地址找了猪老母。猪老母竟然是一头老母猪。弟子依然把信给了这头老母猪。谁知道，老母猪看完信后，点点头，也立化了。弟子一看信，原来猪老母竟然是普贤菩萨。</p><p>　　弟子千里迢迢，终于来到了五台山。在五台山麓上，弟子遇到一位慈祥的长者。长者问他：”你来做什么啊？“弟子回答道：”我来礼文殊菩萨。“”文殊菩萨已经去长安教化众生了。“弟子马上问：”他是谁啊？“”就是杜顺和尚。“弟子一听，惊讶得呆立半响。等弟子回过神来的时候，长者已经不见了。于是，弟子连忙星夜兼程地赶往长安。可是，当时正值浐水暴涨，三天他才赶到。这时，杜顺已经坐化多时了。</p><p>　　原来，自从弟子走后，贞观十四年十一月二十五日，杜顺和尚于雍州南郊的义善寺，普会善信，向大家告别。接着，和尚特意入宫，向唐太宗辞谢，然后坐化在太阶殿的御床上，世寿八十四岁。太宗把杜顺和尚的肉身留在宫中供养了七天，异香时发。</p><p>　　所以，正如世尊所说，真正的菩萨再来，都是不让人知道的。一让人知道，那就要马上走人。</p><p>　　世尊继续说：”怎么能用大妄语来惑乱众生呢！你教世人修三摩地正定，接下来再断除大妄语，这是如来先佛世尊的第四决定清净明诲。</p><p>　　所以阿难，如果不断大妄语而修三摩地正定，这就像把人粪刻成栴檀形，想要得到香气一样。这是不可能的。我教比丘，直心是道场。在四威仪的一切行中，尚且不允许有虚假，怎么能自称得到上人法呢？譬如穷人，自称帝王，这是在自取诛灭。何况法王之位，怎么偷窃得来呢？因地不真，果招纡曲。这样来求如来的菩提正果，就如同咬自己的肚脐一样，谁能办得到呢？</p><p>　　如果比丘心如直弦，一切真实，入三摩地正定，则能永无魔事。我印证是人，成就菩萨无上知觉。</p><p>　　如我这样说，名为佛说；不如此说，就是魔说。</p><p>　　阿难！你问摄心，我告诉你，入三摩地正定的修学妙门，求菩萨道，就要先持这四种律仪，持得象冰霜一样洁白，这样自然不能生出一切枝叶。心业的贪嗔痴，口业的绮语、妄言、恶口、两舌，就再也没有产生的因由。阿难！这四件事如果能不遗失，心尚且不会去攀缘色香味触这些尘相，一切魔事又怎么会发生呢？“\t\t</p></div>"
    },
    {
        "title": "第四章 楞严神咒",
        "author": "",
        "date": "",
        "html": "<div class=\"B1_text\"><h2>第四章 楞严神咒</h2><p>　　为了加持修行人快快成就无上圣果，在这一章里，如来重新宣说了楞严神咒。摩登伽女本是淫女，在楞严咒的加持下，立刻就证得无学，何况发心决定成佛的行者。在楞严咒的加持下，能令行人无量功德，不求自得；一切罪业，悉皆消灭；一切所求，无不称遂；一切灾难，化为乌有。在在处处，都有无量天龙鬼神和金刚藏王菩萨保护行者。从此在修行的道路上，如顺风扬灰，再无艰险。</p><p>　　”如果有宿习不能灭除，你可以教这个人一心诵我佛顶光明摩诃萨怛哆般怛啰无上神咒。这是如来从无见佛顶上发出光辉，光中化出无为心佛，坐在宝莲华上，所说的神咒。</p><p>　　而且，你与摩登伽在因地中所结下的恩爱习气，不是一生及与一劫是事。我一宣扬楞严咒，她就永脱爱心，成为阿罗汉。她还是淫女呢，本来<a href=\"https://www.guang5.com/rmgjc/wuxin.html\" class=\"keylink\" target=\"_blank\">无心</a>修行，只是在楞严咒的神力冥冥中的加持下，立刻就证的了无学。何况你们这些想要求得最上乘，决定成佛的声闻。这就好像顺风扬灰一样，还会有什么艰险呢？</p><h3>　　楞严道场</h3><p>　　在末世的时候，要坐道场修行。首先要持比丘的清净禁戒。你要选择一个戒行清净的沙门，以他为师。如果遇不到真的清净僧人，你戒律的仪式就不能成就。</p><p>　　戒成已后，穿新的干净的衣服，燃上香，并且杜绝其他一切事情，诵此心佛所说的神咒一百零八遍，然后结界，建立道场。祈请十方现在住世的无上如来，放大悲光来为我灌其。</p><p>　　阿难！这个末世中的清净比丘，或者是比丘尼，或者是居士，心中灭除了贪淫，持佛净戒，在道场中发菩萨愿。“</p><p>　　菩萨愿就是四弘誓愿：”众生无边誓愿度，烦恼无尽誓愿断，法门无量誓愿学，佛道无上誓愿成。“</p><p>　　”出去后再入道场前，必须沐浴清净。六时行道，这样不睡觉地经过<a href=\"https://www.guang5.com/sushi/yaoshan/sanqi/\" class=\"keylink\" target=\"_blank\">三七</a>日的精进，我就会现身到这个人的面前，为他摩顶，以安慰他，令他开悟。“</p><p>　　阿难问佛：”世尊！我蒙如来慈悲地教诲，心已开悟。我自己知道，我已经可以成就无学道了，但是末法时期的众生修行，要建立道场，该怎样结界，才符合世尊清净的轨则呢？“</p><p>　　佛告诉阿难：”如果末法时期，有人建立道场，先用雪山大力白牛的粪便和上栴檀来涂地。这种牛吃山中肥腻的香草，喝雪山的清水，它的粪便微细，所以可用。如果不是雪山的牛，粪便臭秽，就不能用。这时，可以在平原挖地五尺以下，用那里的黄土，和上栴檀、沉水、苏合、薰陆、郁金、白胶、青木、零陵、甘松，及鸡舌香，把这十种细细地用箩筛成粉，跟黄土和成泥，用来涂场地。</p><p>　　场地方圆丈六，做成八角坛。坛心安置一个金银铜木所造的莲华。莲花中放一个钵。钵中事先盛好八月的露水，水中撒些花叶。</p><p>　　再用八面圆镜，安置在八角坛的八方，围绕在华钵的周围。 镜子外面建立十六朵莲花，与十六个香炉，交错铺设。香炉里面只烧沉水香，不要见到火光。取白牛乳，放在十六个容器里，牛乳要煎成饼，在配以砂糖、油饼、乳糜、苏合、蜜姜、纯酥、纯蜜，围绕在莲花外面。每朵莲花一个，一共也有十六个，用来供奉诸佛菩萨。</p><p>　　每次吃饭的时候，或者在中夜，在坛前另外安置一个小火炉，里面的炭要用兜楼婆香煎取的香水淋上，令炭能燃烧的更猛烈。取半升蜜和三合酥投入炉中，烧到烟尽为止，以供养佛菩萨。</p><p>　　坛的四外，悬挂幡华。坛的四壁敷设十方如来和菩萨的所有形象。在正位张挂卢舍那佛、释迦牟尼佛、弥勒佛、阿閦佛、阿弥陀佛和观音菩萨的变化像，还有金刚藏安置左右。帝释、梵王、乌刍瑟摩，蓝地迦，诸军茶利，与毗俱胝、四天王等，频那、夜迦，张挂在门的左右侧。</p><p>　　再取八面镜子，挂在空中，与坛场中所安放的镜子相对，使影像重重相涉。</p><p>　　在第一个七天之中，至诚顶礼十方如来、诸大菩萨、阿罗汉。在六时中，围绕坛场，至心行道。六时中的每个时段，都要诵一百零八遍楞严神咒。</p><p>　　第二个七天中，一向专心发菩萨愿，心无间断。在我的戒律中，以前就有过发愿的教法。</p><p>　　第三个七天，在十二时中，一向持佛般怛啰咒。到了第七天，十方如来一时出现在镜子的交光之处，为行者摩顶。在这个道场修三摩地正定，能令末世的修学者，身心明净，犹如琉璃。</p><p>　　阿难！如果这个比丘，他的授戒师及同会中的十位比丘等，其中有一个不清净，这样道场就多半不会成就。</p><p>　　这三个七天后，端坐一百天，不起于座，如果有利根，就能证得须陀洹。纵使他的身心没成就圣果，也能知道自己决定成佛。</p><p>　　你问的道场，就是这样建立的。</p><h3>　　楞严神咒</h3><p>　　阿难顶礼佛足，对佛说道：“自我出家以来，恃佛的骄爱，只求多闻，没有证得无为。所以，我在遭受梵天邪术所禁的时候，心里虽然虽明白，但是身体却不得自由。幸好遇到文殊，令我解脱。虽然冥冥中得到了如来佛顶神咒的加持，但是我还没有亲耳听到。惟愿世尊，大发慈悲，重新为我为宣说，以救度此会的修行者，和将来轮回中的众生，让他们承佛的密音，身心得到解脱。”此时，会上的一切大众，都顶礼如来，然后翘首期盼着如来的秘密章句。</p><p>　　这时，世尊从肉髻中涌出百宝光，光中涌出千叶宝莲。有化佛坐在宝华中，顶上放出十道百宝光明。每道光明，都示现到十恒河沙数的国土中去。金刚密迹擎着山，持着杵，遍满整个虚空界。</p><p>　　大众仰天观望，心中既是爱慕，又是畏惧，都一心听佛无见顶相放光如来宣说神咒。</p><p><strong>　　毗卢真法会</strong></p><p>　　南无萨怛他。苏伽多耶。阿啰诃帝。三藐三菩陀写。南无萨怛他。佛陀俱胝瑟尼钐。南无萨婆。勃陀勃地。萨跢鞞弊。南无萨多南。三藐三菩陀。俱知南。娑舍啰婆迦。<a href=\"https://www.guang5.com/rmgjc/sengqie.html\" class=\"keylink\" target=\"_blank\">僧伽</a>喃。南无卢鸡阿罗汉跢喃。南无苏卢多波那喃。南无娑羯唎陀伽弥喃。南无卢鸡三藐伽跢喃。三藐伽波啰。底波多那喃。南无提婆离瑟赧。南无悉陀耶。毗地耶。陀啰离瑟赧。舍波奴。揭啰诃。娑诃娑啰摩他喃。南无跋啰诃摩尼。 南无因陀啰耶。南无婆伽婆帝。 卢陀啰耶。乌摩般帝。娑醯夜耶。南无婆伽婆帝。那啰野。拏耶。槃遮摩诃三慕陀啰。南无悉羯唎多耶。南无婆伽婆帝。摩诃迦罗耶。地唎般剌那。伽啰毗陀啰。波拏迦啰耶。阿地目帝。尸摩舍那泥。婆悉泥。摩怛唎伽拏。南无悉羯唎多耶。南无婆伽婆帝。多他伽跢俱啰耶。南无般头摩俱啰耶。南无跋阇啰俱啰耶。南无摩尼俱啰耶。南无伽阇俱啰耶。南无婆伽婆帝。帝唎茶。输啰西那。波啰诃啰拏啰阇耶。跢他伽多耶。南无婆伽婆帝。南无阿弥多婆夜。跢他伽多耶。阿啰诃帝。三藐三菩陀耶。南无婆伽婆帝。阿刍鞞耶。跢他伽多耶。阿啰诃帝。三藐三菩陀耶。南无婆伽婆帝。鞞沙阇耶。俱卢吠柱唎耶。般啰婆啰阇耶。跢他伽多耶。南无婆伽婆帝。三补师毖多。萨怜捺啰剌阇耶。跢他伽多耶。阿啰诃帝。三藐三菩陀耶。南无婆伽婆帝。舍鸡野母那曳。跢他伽多耶。阿啰诃帝。三藐三菩陀耶。南无婆伽婆帝。剌怛那鸡都啰阇耶。跢他伽多耶。阿啰诃帝。三藐三菩陀耶。帝瓢。南无萨羯唎多。翳昙婆伽婆多。萨怛他伽都瑟尼钐。萨怛多般怛蓝 。南无阿婆啰视耽。般啰帝。扬岐啰。萨啰婆。部多揭啰诃。尼羯啰诃。揭迦啰诃尼。跋啰毖地耶。叱陀你。阿迦啰。密唎柱。般唎怛啰耶。儜揭唎。萨啰婆。槃陀那。目叉尼。萨啰婆。突瑟吒。突悉乏。般那你。伐啰尼。赭都啰。失帝南。羯啰诃。娑诃萨啰若阇。毗多崩娑那羯唎。阿瑟吒冰舍帝南。那叉刹怛啰若阇。波啰萨陀那羯唎。阿瑟吒南。摩诃羯啰诃若阇。毗多崩萨那羯唎。萨婆舍都嚧。你婆啰若阇。呼蓝突悉乏。难遮那舍尼。毖沙舍。悉怛啰。阿吉尼。乌陀迦啰若阇。阿般啰视多具啰。摩诃般啰战持。摩诃迭多。摩诃帝阇。摩诃税多阇婆啰。摩诃跋啰槃陀啰。婆悉你。阿唎耶多啰。毗唎俱知。誓婆毗阇耶。跋阇啰摩礼底。毗舍嚧多。勃腾罔迦。跋阇啰制喝那阿遮。摩啰制婆。般啰质多。跋阇啰擅持。毗舍啰遮。扇多舍。鞞提婆。补视多。苏摩嚧波。摩诃税多。阿唎耶多啰。摩诃婆啰阿般啰。跋阇啰商揭啰制婆。跋阇啰俱摩唎。俱蓝陀唎。跋阇啰喝萨多遮。毗地耶。乾遮那。摩唎迦。啒苏母。婆羯啰跢那。鞞嚧遮那。俱唎耶。夜啰菟。瑟尼钐。毗折蓝婆摩尼遮。跋阇啰迦那迦波啰婆。嚧阇那。跋阇啰顿稚遮。税多遮。迦摩啰。刹奢尸。波啰婆。翳帝夷帝。母陀啰。羯拏。娑鞞啰忏。掘梵都。印兔那么么写。</p><p><strong>　　释尊应化会</strong></p><p>　　乌【合牛】。唎瑟揭拏。般剌舍悉多。萨怛他。伽都瑟尼钐。虎合牛都嚧雍。瞻婆那。虎合牛都嚧雍。悉耽婆那。虎合牛都嚧雍。波罗瑟地耶。三般叉。拏羯啰。虎合牛都嚧雍。萨婆药叉。喝啰刹娑。揭啰诃若阇。毗腾崩萨那羯啰。虎合牛都嚧雍。者都啰。尸底南。揭啰诃。娑诃萨啰南。毗腾崩萨那啰。虎合牛都嚧雍。啰叉。婆伽梵。萨怛他。伽都瑟尼钐。波啰点。阇吉唎。摩诃娑诃萨啰。勃树娑诃萨啰。室唎沙。俱知娑诃萨泥。帝隶阿弊提视婆唎多。吒吒甖迦。摩诃跋阇嚧陀啰。帝唎菩婆那。曼茶啰。乌合牛。莎悉帝。薄婆都。么么。印兔那么么写。</p><p><strong>　　观音合同会</strong></p><p>　　啰阇婆夜。主啰跋夜。阿祇尼婆夜。乌陀迦婆夜。毗沙婆夜。舍萨多啰婆夜。婆啰斫羯啰婆夜。突瑟叉婆夜。阿舍你婆夜。阿迦啰。密唎柱婆夜。陀啰尼部弥剑。波伽波陀婆夜。乌啰迦婆多婆夜。剌阇坛茶婆夜。那伽婆夜。毗条怛婆夜。苏波啰拏婆夜。药叉揭啰诃。啰叉私揭啰诃。毕唎多揭啰诃。毗舍遮揭啰诃。部多揭啰诃。鸠槃茶揭啰诃。补丹那揭啰诃。迦吒补丹那揭啰诃。悉乾度揭啰诃。阿播悉摩啰揭啰诃。乌檀摩陀揭啰诃。车夜揭啰诃。醯唎婆帝揭啰诃。社多诃唎南。揭婆诃唎南。嚧地啰诃唎南。忙娑诃唎南。谜陀诃唎南。摩阇诃唎南。阇多诃唎女。视比多诃唎南。毗多诃唎南。婆多诃唎南。阿输遮诃唎女。质多诃唎女。帝钐萨鞞钐。萨婆揭啰诃南。毗陀夜阇。瞋陀夜弥。鸡啰夜弥。波唎跋啰者迦。讫唎担。毗陀夜阇。瞋陀夜弥。鸡啰夜弥。茶演尼。讫唎担。毗陀夜阇。瞋陀夜弥。鸡啰夜弥。摩诃般输般怛夜。嚧陀啰。讫唎担。毗陀夜阇。瞋陀夜弥。鸡啰夜弥。那啰夜拏。讫唎担。毗陀夜阇。瞋陀夜弥。鸡啰夜弥。怛埵伽嚧茶西。讫唎担。毗陀夜阇。瞋陀夜弥。鸡啰夜弥。摩诃迦啰。摩怛唎伽拏。讫唎担。毗陀夜阇。瞋陀夜弥。鸡啰夜弥。迦波唎迦。讫唎担。毗陀夜阇。瞋陀夜弥。鸡啰夜弥。阇耶羯啰。摩度羯啰。萨婆啰他娑达那。讫唎担。毗陀夜阇。瞋陀夜弥。鸡啰夜弥。赭咄啰。婆耆你。讫唎担。毗陀夜阇。瞋陀夜弥。鸡啰夜弥。毗唎羊讫唎知。难陀鸡沙啰。伽拏般帝。索醯夜。讫唎担。毗陀夜阇。瞋陀夜弥。鸡啰夜弥。那揭那舍啰婆拏。讫唎担。毗陀夜阇。瞋陀夜弥。鸡啰夜弥。阿罗汉。讫唎担。毗陀夜阇。瞋陀夜弥。鸡啰夜弥。毗多啰伽。讫唎担。毗陀夜阇。瞋陀夜弥。鸡啰夜弥。跋阇啰波你。具醯夜具醯夜。迦地般帝。讫唎担。毗陀夜阇。瞋陀夜弥。鸡啰夜弥。啰叉罔。婆伽梵。印兔那么么写。</p><p><strong>　　刚藏折摄会</strong></p><p>　　婆伽梵。萨怛多般怛啰。南无粹都帝。阿悉多那啰剌迦。波啰婆。悉普吒。毗迦萨怛多钵帝唎。什佛啰什佛啰。陀啰陀啰。频陀啰频陀啰。瞋陀瞋陀。虎合牛虎合牛。泮吒泮吒泮吒泮吒泮吒。娑诃。醯醯泮。阿牟迦耶泮。阿波啰提诃多泮。婆啰波啰陀泮。阿素啰。毗陀啰。波迦泮。萨婆提鞞弊泮。萨婆那伽弊泮。萨婆药叉弊泮。萨婆乾闼婆弊泮。萨婆补丹那弊泮。迦吒补丹那弊泮。萨婆突狼枳帝弊泮。萨婆突涩比口犁。讫瑟帝弊泮。萨婆什婆口犁弊泮。萨婆阿播悉摩口犁弊泮。萨婆舍啰婆拏弊泮。萨婆地帝鸡弊泮。萨婆怛摩陀继弊泮。萨婆毗陀耶。啰誓遮唎弊泮。阇夜羯啰。摩度羯啰。萨婆啰他娑陀鸡弊泮。毗地夜。遮唎弊泮。者都啰。缚耆你弊泮。跋阇啰。俱摩唎。毗陀夜。啰誓弊泮。摩诃波啰丁羊。乂耆唎弊泮。跋阇啰商羯啰夜。波啰丈耆啰阇耶泮。摩诃迦啰夜。摩诃末怛唎迦拏。南无娑羯唎多夜泮。毖瑟拏婢曳泮。勃啰诃牟尼曳泮。阿耆尼曳泮。摩诃羯唎曳泮。羯啰檀持曳泮。蔑怛唎曳泮。唠怛唎曳泮。遮文茶曳泮。羯逻啰怛唎曳泮。迦般唎曳泮。阿地目质多。迦尸摩舍那。婆私你曳泮。演吉质。萨埵婆写。么么印兔那么么写。</p><p><strong>　　文殊弘传会</strong></p><p>　　突瑟吒质多。阿末怛唎质多。乌阇诃啰。伽婆诃啰。嚧地啰诃啰。婆娑诃啰。摩阇诃啰。阇多诃啰。视毖多诃啰。跋略夜诃啰。乾陀诃啰。布史波诃啰。颇啰诃啰。婆写诃啰。般波质多。突瑟吒质多。唠陀啰质多。药叉揭啰诃。啰刹娑揭啰诃。闭隶多揭啰诃。毗舍遮揭啰诃。部多揭啰诃。鸠槃茶揭啰诃。悉乾陀揭啰诃。乌怛摩陀揭啰诃。车夜揭啰诃。阿播萨摩啰揭啰诃。宅祛革。茶耆尼揭啰诃。唎佛帝揭啰诃。阇弥迦揭啰诃。舍俱尼揭啰诃。姥陀啰。难地迦揭啰诃。阿蓝婆揭啰诃。乾度波尼揭啰诃。什伐啰。堙迦醯迦。坠帝药迦。怛隶帝药迦。者突托迦。昵提什伐啰。毖钐摩什伐啰。薄底迦。鼻底迦。室隶瑟密迦。娑你般帝迦。萨婆什伐啰。室嚧吉帝。末陀鞞达嚧制剑。阿绮嚧钳。目佉嚧钳。羯唎突嚧钳。揭啰诃。揭蓝羯拏输蓝。惮多输蓝。迄唎夜输蓝。末么输蓝。跋唎室婆输蓝。毖栗瑟吒输蓝。乌陀啰输蓝。羯知输蓝。跋悉帝输蓝。邬嚧输蓝。常伽输蓝。喝悉多输蓝。跋陀输蓝。娑房盎伽。般啰丈伽输蓝。部多毖跢茶。茶耆尼。什婆啰。陀突嚧迦。建咄嚧吉知。婆路多毗。萨般嚧。诃凌伽。输沙怛啰。娑那羯啰。毗沙喻迦。阿耆尼。乌陀迦。末啰鞞啰。建哆啰。阿迦啰。密唎咄。怛敛部迦。地栗剌吒。毖唎瑟质迦。萨婆那俱啰。肆引伽弊。揭啰唎药叉。怛啰刍。末啰视。吠帝钐。娑鞞钐。悉怛多钵怛啰。摩诃跋阇嚧。瑟尼钐。摩诃般赖丈耆蓝。夜波突陀。舍喻阇那。辫怛隶拏。毗陀耶。槃昙迦嚧弥。帝殊。槃昙迦嚧弥。般啰毗陀。槃昙迦嚧弥。跢侄他。唵。阿那隶。毗舍提。鞞啰。跋阇啰。陀唎。槃陀槃陀你。跋阇啰谤尼泮。虎合牛都嚧瓮泮。莎婆诃。</p><h3>　　神咒利益</h3><p>　　阿难！这个佛顶光聚悉怛多般怛啰秘密伽陀，微妙章句，能出生十方一切诸佛。</p><p>　　十方如来因此咒心，得成无上正遍知觉。</p><p>　　十方如来执此咒心，降伏诸魔，制诸外道。</p><p>　　十方如来乘此咒心，坐宝莲华，应化到微尘一样多的国土。</p><p>　　十方如来含此咒心，于微尘数国土中转大法轮。</p><p>　　十方如来持此咒心，能于十方为众生摩顶授记。如果自己的果位没成，也能于十方蒙佛授记。</p><p>　　十方如来依此咒心，能于十方拔济群苦。所谓地狱、饿鬼、畜生之苦，盲聋喑哑、冤憎会苦，爱别离苦，求不得苦，五阴炽盛苦、大小横事同时解脱，贼难、兵难、王难、狱难、风火水难、饥渴、贫穷，应念销散。</p><p>　　十方如来随此咒心，能于十方奉事善知识，在行、住、坐、卧四大威仪之中，遂心如意地完成供养。恒沙如来的法会中，能被推为大法王子。</p><p>　　十方如来行此咒心，能于十方摄受历劫中的六亲眷属，令诸小乘<a href=\"https://www.guang5.com/rmgjc/genqi.html\" class=\"keylink\" target=\"_blank\">根器</a>的众生，听到如来的秘密法藏，不生惊怖。</p><p>　　十方如来诵此咒心，成就无上正觉，坐在菩提树下入大涅槃。</p><p>　　十方如来传此咒心，在灭度后，托付法事，严净戒律。</p><p>　　如果我说这个佛顶光聚般怛啰咒，从朝至暮，音声相连，字字句句没有重迭，经恒沙劫，也说不尽。这个咒又叫如来顶。你们有学未尽轮回，发心求取阿罗汉果，如果不持此咒而坐在道场中修行，要想让身心远离魔事，这是不可能的！</p><p>　　阿难！所有世界，任何国土中的所有众生，取本国所生的桦皮、贝叶、白纸，书写此咒，放在香囊中。如果这个人昏昧，还不会诵持，只要戴在身上，或者放在宅中，此人终生不会被一切毒所侵害。</p><p>　　阿难！我又为你说了一遍这个<a href=\"https://www.guang5.com/rmgjc/zhouyu.html\" class=\"keylink\" target=\"_blank\">咒语</a>，以救护世间的众生，令他们得到大无畏，成就众生出世间的智慧。</p><p>　　我灭度后，末世的众生，有能自己诵或者教别人诵，要知道诵持的众生，火不能烧，水不能溺，大毒、小毒所不能害。乃至天龙鬼神，精怪鬼魅的所有恶咒，都不能为害。一切诅咒，厌蛊、毒药、金毒、银毒、草木虫蛇，万物的毒气，入此人口，都会变成成甘露美味。一切恶星、鬼神、恶人，对此人都不能生起恶念。频那、夜迦等鬼王和其眷属，都因为受过佛的深恩，而常守护此人。</p><p>　　阿难。要知道，这个咒常有八万四千万亿恒河沙数的金刚藏王菩萨，领着他们的眷属，昼夜随侍。如果有众生，以散乱心，忆念或诵持此咒，这些金刚王也会常常跟随这个人，何况是决定发菩提心的人呢！这些金刚菩萨藏王，以他们精湛的妙心，在冥冥中开发此人的神智，使这个人能记起八万四千恒河沙劫中的事情。从第一劫到成佛之前的最后身，生生不生到药叉、罗刹，富单那、迦吒富单那、鸠槃茶、毗舍遮、饿鬼等处，并诸有形、无形、有想、无想等恶处。“</p><p>　　这些鬼都是什么样子呢？宣化上人一一做了的讲解：</p><p>　　”药叉，又叫“夜叉”，中文就叫“捷疾鬼”。捷疾鬼，他跑得很快的。</p><p>　　罗刹，这也是一种吃人的鬼。他吃死人，人死了，身体烂了，他有一种咒，可以用这个咒一念，把这个人的肉又都变成新鲜的。他就吃这个东西。</p><p>　　富单那，就是个“恶臭鬼”。这鬼又恶又臭。若撞到这个鬼，就得热病。</p><p>　　迦吒富单那，就是“奇臭鬼”。前面那个是恶臭鬼，他这是奇臭鬼。他这种臭，很出奇的，你从来就没有闻过的臭味，臭得不得了，真是所谓“奇臭不可闻也”！你若一闻到这种臭味，那把你的肚子里边所吃的东西都会吐出来，就臭得这么样子！因为他这个臭味，把你身里边的臭味也都勾出来了，所以就全部和盘托出，就都吐出去了！他能有这种力量。这种病，又是一种热病，热得更厉害。热病，就是周身都发烧，甚至烧到一百、一百二十度、一百三十度，甚至于两百度，烧得把骨头都会变成灰。你看这厉害不厉害？所以这个就是发烧的鬼。</p><p>　　鸠槃茶，是“瓮形鬼”，他就像一个坛子那形状。这个鬼专门魇魅人，怎么魇魅人哪？你睡着了，他就来，搞得你魇住了，睁着眼睛，身体却不会动弹，也说不出话来。想要讲话，也讲不出来。想要动弹，这么抚摸一下，也不可能的。如果厉害了，就会把这个人魇魅死了。要是这个人有阳气的，他就魇魅不了；你若属阴，有阴气，就给魇魅住了。</p><p>　　什么叫“属阳的”呢？你常常生一种欢喜心，真正自性里边的欢喜，不是在表面上哈哈哈那么欢喜。自性里边非常快乐，这是属阳。你自性里边若常常愁闷，一天到晚忧愁烦恼，苦苦恼恼的，这就属阴。属阴，这鬼就会找来。你若属阳，那就是神；属阴，就是鬼。所以“重阳者神，重阴者鬼”。你阳气盛，就是神；阴气盛，就是鬼。你修佛道，你这个纯阳体就有光；你若是纯阴体，就有一股黑气。所以这人是好人、不是好人，一看就知道。好的人，他就有这股白气；坏的人，就有一股黑气。这股黑气，就是魔气。</p><p>　　毗舍遮，又叫“毗舍阇”。这毗舍遮是个什么鬼？是个吃精气的鬼。他吃五谷的精气，又吃人的精气。所以这种鬼，也是一个很坏的鬼。鬼都是很坏的，不过鬼里头也有菩萨，那是菩萨故意现一个鬼王身，来度这些鬼好发菩萨心。</p><p>　　饿鬼，这饿鬼也有很多种。有肚子大的饿鬼、有针喉，就是咽喉小的饿鬼。</p><p>　　有形、无形：有形有相的，就是有身体的；“无形”，就你看不见的。看不见的这种东西，你不要以为就是没有了。看不见的东西，他不过是无形，但是他都有个识的。你凡夫肉眼看不见，要是得到五眼六通，也可以看得见的。</p><p>　　有想、无想：“有想”，就是有思想的。“无想”，就是没有思想的。没有思想是什么呢？就是土、木、金、石。有想的，就有生命；没有想的，就没有生命的。“</p><p>　　这是对这几种鬼的讲解，接下来，如来继续说道：”如果有人读诵，或者书写，或者佩戴，或者供养，生生世世不会生在贫穷下贱等一切不好的地方。这些众生，即使自己不作福业，十方如来所有的功德都回向给此人。因此，在恒河沙般的无数劫中，常与诸佛生在一处，无量的功德并蒂连生，一同熏修，永不分散。</p><p>　　所以能令<a href=\"https://www.guang5.com/rmgjc/pojie.html\" class=\"keylink\" target=\"_blank\">破戒</a>的人，戒根清净；未得戒的，令其得戒；未精进的，令其精进；没智慧的，令得智慧；不清净的，速得清净；不持斋戒的，自然斋戒。</p><p>　　阿难！持此咒的时候，如果在没<a href=\"https://www.guang5.com/rmgjc/shoujie.html\" class=\"keylink\" target=\"_blank\">受戒</a>的时候犯了种种禁戒，持咒之后，那些罪业，无问轻重，一时销灭。纵使饮酒，食啖五辛，种种不净，一切诸佛、菩萨、金刚、天仙、鬼神，也不会以此为过。</p><p>　　如果穿着不干净的破衣服，因为持咒，行住之间，也都变得清净了。纵使不作坛，不入道场，也不行道，诵持此咒，也跟入坛行道的功德，没有差异。</p><p>　　如果犯了五逆这样堕入无间地狱的重罪，以及比丘、比丘尼的四弃、八弃，诵此咒之后，这样的重业犹如猛风吹沙一样，消散无余。 “</p><p>　　五逆之罪是最大的罪，指的是杀父亲。杀母亲。杀阿罗汉。破和合僧，就是破坏僧团的和睦。出佛身血，佛不在世的时候，破坏佛像也相当于出佛身血。</p><p>　　”阿难！若有众生，从无量无数劫来，所有一切轻重罪障，从前世以来，没有忏悔的，若能读诵书写此咒，或者戴在身上，或者安放在住处，这些积业，如热汤消雪，不久都能证得无生法忍。</p><p>　　阿难！如果有女人，还没生男育女，为了求孕而至心忆念此咒，或者在身上佩戴“悉怛多般怛啰”，就会生具足福德智慧的男女。求长命得长命，求什么得什么。身体和容貌，也是如此。命终之后，随愿往生十方国土，必定不会生在偏僻下贱的地方，何况异类。</p><p>　　阿难！如果遇到饥荒瘟疫，或者刀兵贼难等一切灾难，书写这个神咒，安置在城门上或者庙宇中，令其人民都奉迎礼拜，恭敬供养，或者佩戴在身上，或者安置在宅院。一切灾厄，都将销灭。</p><p>　　阿难！在在处处，只要有此咒在，天龙欢喜，风雨顺时，五谷丰登，人民安乐。又能镇压一切恶星，灾障不起，人无横事，杻械枷锁不着其身，昼夜安眠，常无恶梦。</p><p>　　阿难！在这个娑婆世界，有八万四千主灾变的恶星。二十八大恶星而为上首，还有八大恶星为主。他们会变成种种形象出现于世，生出种种灾异来。有楞严咒的地方，这些灾异都会销灭。方圆十二由旬之内的地方，成为结界，一切灾殃都不能进入。“</p><p>　　对于这些恶星，宣化上人讲道：”这些恶星可以变化种种的形相，很丑怪的也有，很美丽的也有。在中国，常常改朝换代的时候，就有一种荧惑星出世。这荧惑星是什么样子呢？就是变化成一个小孩子，他穿着一件红兜肚，就是中国做给小孩子穿的兜肚。他穿这红兜肚，到处教小孩子唱歌。这些小孩子一唱歌，这国家就要灭亡了。所以每逢国家改朝换代的时候，这种恶星就出世了。“</p><p>　　”所以，如来宣示此咒，保护将来的一切初学者，令他们身心安隐，进入三摩地正定，没有一切魔眷鬼神，冤债宿殃来恼害。你和与会的有学人，以及未来世的修行者，依我坛场，<a href=\"https://www.guang5.com/rmgjc/rufa.html\" class=\"keylink\" target=\"_blank\">如法</a>持戒。授戒的戒主，是清净僧。持此咒心，不生疑悔，此人用父母所生之身，如果心地不能得到开通，十方如来便为妄语。“</p><p>　　佛说到这里，会中无量百千金刚，都在佛前合掌顶礼，对佛说道：”正如佛说的那样，我会诚心地保护这样修行菩提道的人。“</p><p>　　这时，大梵天王，天帝释和四大天王也在佛前同时顶礼，对佛说：”如果有这样修学的善人，我也会尽心竭力，至诚地保护，令他一生，所作如愿。“</p><p>　　还有无量的药叉大将，诸罗刹王、富单那王、鸠槃茶王、毗舍遮王、频那、夜迦、诸大鬼王及诸鬼帅，也于佛前合掌顶礼道：”我也发誓要护持这样的人，令他的菩提心尽快圆满。“</p><p>　　又有无量的日月天子、风师、雨师、云师、雷师，并电伯等，年岁巡官，诸星眷属，也在会中顶礼佛足，对白佛说：”我也保护这样的修行人，令他安立在道场中，能无所畏惧。“</p><p>　　复有无量的山神、海神、一切土地、水行、陆行、空行的万物精灵，和风神王、无色界天，在如来前同时稽首，对佛说：”我也保护这样的修行人，令他得成菩提，永无魔事。“</p><p>　　这时，八万四千无量恒河沙数的金刚藏王菩萨，在大会中，即从座起，顶礼佛足，而对佛说：”世尊！我们所修的功业，早就可以成就菩提，但是我们不取涅槃，而常随此咒，救护末世修三摩地的正修行者。 世尊！这样修心求正定的人，如果在道场，或者经行，乃至以散乱心游戏人间，我们都会随从侍卫。纵使是魔王，或者大自在天想要伺机谋害，终不可得。那些小鬼小神，都要离此人十由旬开外，除非他也是发心修禅的。世尊！如果有恶魔或魔的眷属，要来侵扰这个善人，我会用宝杵，打碎他的头，令其碎如微尘。我们会常令此人所作如愿。“\t\t</p></div>"
    },
    {
        "title": "第五章 修行的渐次",
        "author": "",
        "date": "",
        "html": "<div class=\"B1_text\"><h2>第五章 修行的渐次</h2><p>　　尽管知道了道理和方法，但是从妄归真，却不是一挥而就的。于是，如来在这一章中，带我们领略了菩提之路的沿途风光--修行所要经历的五十五个阶段。在踏上菩提路之前，首先要知道，众生和世界颠倒的原因是十二种乱想。由这些乱想而产生了世间的十二类众生。要修证无上道，就要在这些乱想之中，确立三种渐次。哪三种渐次呢？首先，断除五辛。其次，断杀盗淫，严持净戒。然后，心不外求，旋归自性。这五十五位的菩提之路，都是因为这三种增进渐次而得以成就的。</p><p>　　阿难接着问佛：”我辈愚钝，喜好多闻，对于种种欲漏，不求出离。现在我听到佛的慈诲，得到正法的熏修，身心快然，获大利益。世尊！在通往涅槃的修行道路上，各个次第的名目都是什么呢？什么叫做干慧之地、四十四心？怎样算是进入地中？什么叫做等觉菩萨呢？“说罢，五体投地。</p><p>　　世尊称赞阿难道：”善哉阿难！你能为大众，及末世一切求正觉的众生，悬示从凡夫到大涅槃的正修行路。你仔细听好，我现在就为你解说！</p><p>　　阿难。要知道，自性圆明，本来没有名相，也没有世界和众生。有妄才会有生，有生才会有灭。所以，生灭就是妄，灭妄名为真，这是如来无上菩提及大涅槃的二转依号。</p><p>　　阿难！你要修行，直诣如来的大涅槃，先要知道众生和世界这两种颠倒的产生的原因，能不颠倒，就是如来。</p><h3>　　众生颠倒</h3><p>　　阿难！什么是众生颠倒呢！自性本来圆明。用这个本明去寻求一个明了的内容，于是，这个明了和内容就都是虚妄的了。在妄明与内容的相对中产生了见，这样，就从毕竟无变成了究竟有。</p><p>　　妄明与它所寻求的内容，并无因由。只是安住在妄相中，了无根本。本着这没有根由的妄相，而建立起了众生和世界。</p><p>　　迷失了本来的圆明，而产生虚妄。虚妄没有体性，因此无所依凭。想要真实，有了个想法，就已经不是真实了。明明不真，还要求真，于是产生了种种假象。虚假的生发、虚假的安住、虚假的心识、虚假的尘相，辗转相生，彼此促进，相互熏染，而形成业。相同的业就会彼此感应。因为业感的相灭相生，于是有了众生颠倒。“</p><h3>　　世界颠倒</h3><p> </p><p>　　”阿难。什么叫世界颠倒呢？妄明与它所寻求的内容，分段妄生，因此而有了’界‘。因为没有因由，所以住无所住，只能迁流不止，因此而成’世‘。</p><p>　　过去、现在、未来三世，东、西、南、北四方，相互交涉，于是演化出十二类众生。</p><p>　　所以世界，因动有声，因声有色，因色有香，因香有触，因触有味，因味知法。这六种杂乱的妄想，形成业性以后，可以分成十二类。所以世间的色声香味触法，每经历十二种变化，为一个周期。 在这颠倒的轮转中，就形成了卵生、胎生、湿生、化生，有色、无色、有想、无想，非有色、非无色、非有想、非无想这十二类众生。“</p><h3>　　十二类众生</h3><p>　　”因为世界在虚妄中轮回，妄动与气相合，就形成了八万四千的飞沉乱想。飞则成鸟雀，沉则成鱼鳖。于是，就有卵生的众生充塞国土。</p><p>　　因为世界在杂染中轮回。染欲一旦得到滋养，就会产生八万四千的横竖乱想。横则成龙畜，竖则成人仙。于是便有胎生的众生流转于世界。</p><p>　　因为世界在执着中轮回。执着所产生的趣向与暖结合，就会产生八万四千的翻覆乱想。翻覆之中，孕育出了蠢动含灵，于是便有了湿生的众生。</p><p>　　因为世界在变易中轮回。变易的假借与触和合，就产生了八万四千新故乱想。于是就有化生的众生，离蜕飞行，充塞世界。</p><p>　　因为世界在留碍中轮回。这个障碍与附着结合，就会产生八万四千的精耀乱想，于是产生了有色界的众生，休咎精明，流转国土。“</p><p>　　胎卵湿化这四类众生，都是我们所熟知的。哺乳动物，包括人都是胎生的众生；爬行动物，两栖动物还有鸟类都是卵生的；蚊蚋之类的小虫都属于湿生；而<a href=\"https://www.guang5.com/fjrw/hcrw/daozhengfashi/4659.html\" class=\"keylink\" target=\"_blank\">毛毛虫变蝴蝶</a>这类蜕变的昆虫就属于化生。但是休咎精明这类可以表征着吉祥或衰患的众生却很少见，我们听说过的，有凤凰，麒麟等。</p><p>　　位于山东省巨野县独山镇政府南4公里的麒麟山仅有2-3米高、面积约有3000多平方米。</p><p>　　据《左传》第十二卷记载：鲁哀公十四年春，哀公率领王宫贵族去西郊的大野（今天山东的巨野县）狩猎。叔孙氏的车夫鉏商捕获了一只奇兽，鹿身、牛尾、马蹄，头上有一肉角。他不知道是这何物，以为是不吉祥的征兆呢，于是就杀掉了。<a href=\"https://www.guang5.com/ctwh/mengxuejingdian/gudaigushi/19559.html\" class=\"keylink\" target=\"_blank\">孔子</a>看了后，叹道：”这是圣兽麒麟那！“并挥笔为麒麟写下了挽歌：”唐虞世兮麟凤游，今非其时来何求？麟兮麟兮我心忧。“随后使弟子埋葬了这只麒麟 。</p><p>　　人们为了纪念鲁哀公”西狩获麟“的事，在埋葬麒麟的地方建筑了麒麟台，亦名获麟台、麒麟冢。</p><p>　　2008年元月，中国民协命名山东省巨野县为”中国麒麟之乡“，并在该县建立国家级麒麟文化研究基地。6月7日，文化部确定的”麒麟传说“被国务院批准，列入第二批国家级非物质文化遗产名录。</p><p>　　”因为世界在消散中轮回。消散所带来的迷惑与隐暗结合，就会生出八万四千的阴微乱想。于是产生了无色界的众生。“</p><p>　　无色界的众生，如来在后面讲二十八层天的时候会具体说到。</p><p>　　”因为世界在虚无的罔像中轮回。这些幻影与思忆相结合，就形成了八万四千的潜结乱想。因此则有有想类的众生，诸如神鬼精灵，流转世界。“</p><p>　　神鬼精灵，我们的肉眼是看不到的，有天眼通的人才能看到。</p><p>　　”因为世界又在愚钝中轮回。这种愚痴与冥顽结合，就会生出八万四千的枯藁乱想。于是就会产生无想类的众生。精神化为土木金石，充塞国土。“</p><p>　　精神还能化为土木金石吗？对此，宣化上人是这样解释的：</p><p>　　”怎么说这个精神会化为土木金石呢？好像在香港有一座望夫山。据说有一个女人，她的丈夫去当兵，总也不回来，她就每一天都背着她的孩子，到那座山上去望。久而久之，她这种精灵所感，“精诚所感，金石为开”，这个女人就变成一块石头。那块石头永远好像女人背着个小孩子在那儿站着，总那么望似的。离着很远就看见了，那叫“望夫山”。这种精神化为土、木、金、石的情形，是很不容易令人相信的，可是这种情形还的确是有的。在中国，人化成石头，这个事情是很多的。</p><p>　　人的精神，可以变成种种东西。举一个例子来讲，譬如我们人火气大，火性大到极点，他这个精神就会变成什么呢？他这种火，就会变成在煤矿里挖出来的煤。为什么变成煤呢？就因为他火性大。他和火相合就化成煤炭了。所以那煤炭，你用火一点，它很快就着了，这都是由人的精神所化成的。</p><p>　　还有金、木、水、火、土这五种，你这个人和哪一类相近，如果太接近了，就会变成这种东西。这也是因为一种执着，因为一种枯藁乱想。那么将来会不会再变回来做人呢？可以的。不过不知道要多少时间，这个时间太久了！“</p><p>　　虽然太久了，也还是有变回来的。而且，这种由石头变回来的石头人，宣化上人碰巧还遇到过，下面我们再听上人讲讲这个石头人的故事：</p><p>　　”今天讲一件真实的事。大约在十年前，有个非黑非白的怪人，衣衫褴褛，十分邋遢，身长五尺多高，骨瘦如柴，面无表情，有一天，来金山禅寺大门的外边，倚墙而坐。这时，天降大雨，他仍然不动。有人叫他进来，他不理不睬，好像入定，不饮不食，不和任何人讲话。大约过了三天，我到门外看他。他虽然不跟旁人讲话，但是却和我讲话。</p><p>　　我问他姓什么？答：“姓石。”</p><p>　　问他叫什么名字？答：“叫人。”</p><p>　　又问他从什么地方来？答：“从山上来。”</p><p>　　又问他来做什么？答：“来求法。”</p><p>　　我说：“我们这里无法可求，会令你失望。”他说：“我不会失望。”</p><p>　　这样问答之后，他便跟我走进金山禅寺，随大众坐禅，睡觉，可是不吃饭，不饮水，不小便，也不大便，成为古怪的人。他天天坐在那里打坐，不讲话，也不行动。从外表看来，好像吸毒，又好像嬉皮。在他身上藏着一截木炭，问他做什么用？他说：“可以取暖。”他住了几天，随大众行动。大家在禅堂打坐，他也打坐。大家到楼上睡觉，他也到楼上睡觉。大家怕他偷东西，就派一个人监视他。他在屋内睡觉，监视的人在门外倚门而睡。如果他开门，监视的人一定能发觉。可是有一天，这个石头人忽然不见了。监守的人也感到莫名其妙，不知他是用什么法子溜走的。“</p><p>　　这是无想类众生的情形。佛接着说道：</p><p>　　”因为世界在相待中轮回。相待中的彼此依托一旦遇到染缘，就会形成八万四千的因依乱想。于是产生’非有色‘类的众生充塞于世。如水母与虾互相依存。“</p><p>　　水母依水沫为身，所以水母的身体像水一样透明。在水母的肩板和各条口腕周围，常栖息有小虾。每当敌害靠近时，小虾迅即躲进水母中去。水母受到触动，伞部马上收缩，把虾包在伞腔和口腕里面，刹那之间沉入深水。所以，虾成了水母的眼睛，而水母则是虾的保护伞。这就是因依乱想中的非有色类众生。</p><p>　　”世界又在相互牵引中轮回。这种颠倒性与咒合和，则产生八万四千的呼召乱想。因此形成非无色界的众生流转于世间。咒咀厌生，诸如此类。“</p><p>　　对这一类众生，大家大概都不太熟悉。宣化上人是这样解释的：</p><p>　　前几天不是说有”勾召法“吗？这勾召法，又叫”呼召法“。这”呼“就是呼它的名字，叫它来。本来平时你没有看见它，但是你一诵这个咒，它就现形了。或者有的时候就会看得见。这呼召，虽然说是鬼神之类的，但这是一种咒神，不是一种普通的鬼神。因为这个，所以就有”非无色相“的这一种鬼神、护法，或者也有这种邪神，流转国土。</p><p>　　下面我们再听宣化上人讲一个关于咒神的实例：</p><p>　　我家乡东北，有一个种田的农人，家里颇为富裕，平时喜欢持诵大悲咒。某年秋天，他把农作物装上车运到城市去卖，卖完之后带钱回家。在离家约有三里路的途中，遭遇很多土匪在打劫！财主看见前面有打劫的，心想该怎么办呢？逃吗？在土匪监视之下肯定逃不了。若不逃走，一定是被抢。于是他就念起大悲咒来，一边念一边照常往前去。</p><p>　　快接近土匪时，忽然看见土匪里走出来一个人，到他车前面说：”你把鞭子给我，我替你赶车！“财主只得让他执鞭赶马车。他们从土匪旁边走过去，土匪们好像不见不闻似的，并没有打劫他。等土匪看不见了，赶车人把鞭子还给他说：”你现在赶快走吧！没事了。“</p><p>　　财主曾看到这个人是从土匪中跑出来的，心想他一定也是土匪了，就说：”先生，你今天对我这么好，请问你贵姓？在什么地方住？将来我好到你府上拜谢！“这个人告诉他说：”我的名字叫’阿逝孕‘。“</p><p>　　大悲咒里面不是有一位护法名叫”阿逝孕“吗？就是护法图谱里，肩膀上长了两只翅膀的那位。当时财主想：”啊！这名字挺奇怪。“那时他忘记了”阿逝孕“就是大悲咒里的一句咒语。等这位”阿逝孕“走得看不见了，他才突然想起：”啊！大悲咒里面的一个护法不是叫阿逝孕吗？“于是赶上去找，却找不着了。”</p><p>　　“因为世界在妄相的合和中轮回。这种欺罔与其它个体合和，就形成八万四千的回互乱想。因此而有非有想类的众生，比如卢浦，异类相成，充塞国土。”</p><p>　　蒲卢就是蜾蠃，它取桑虫做它的儿子；桑虫又叫“螟蛉”。在中国的《<a href=\"https://www.guang5.com/ctwh/sishuwujing/shijing/\" class=\"keylink\" target=\"_blank\">诗经</a>》上，有这么句话：“螟蛉有子，蜾蠃孵之。”螟蛉生虫卵的时候，蜾蠃就给抢去了，抢到它泥造的巢穴里头，它就念一个咒。这个咒是怎么说呢？“像我！像我！”它这么念来念去，念到七天上，这个桑树虫子果然就变得和它一样了。要不怎么叫“非有想”呢？因为这桑树虫子，没想到它会变成一只蜾蠃。</p><p>　　“因为世界在怨害中轮回。这种杀与怪异合和，就形成八万四千食啖父母的怪异想法。于是而有非无想类的众生流转于世。如土枭等孕育出后代，幼子长大后，却把父母吃掉。</p><p>　　这就是十二类众生的情况。</p><p>　　阿难！这些众生，每一类中，又各有十二种颠倒。犹如用手捏目，而幻化出空中狂花一般。这十二类众生，也不过是因为颠倒了妙明真心，而幻化出虚妄的乱想而已。”</p><h3>　　三种渐次</h3><p>　　“你如今修证无上道，就要在这些乱想之中，确立三种渐次。如同除去净瓶中的毒蜜，就要用清水和上香灰来洗涤。洗净了瓶子然后才能用存贮甘露。</p><p>　　这三种渐次都是什么呢？第一、修习。通过修习除去乱想的助因。第二、真修。通过真修来刳掉乱想的正性。第三、增进。通过增进来违离乱想的现业。</p><p>　　什么是助因呢？阿难！世界这十二类众生，都要依赖饮食才能存活。而饮食分为四种：段食、触食、思食、识食。”</p><p>　　人畜和欲界天人，都是把一段段有形的食物吃到自己的身体里，所以叫段食；鬼神等只要接触到食物的气息就可以了，所以叫触食；色界天的天人，安住在禅定中，以禅思为食，所以叫思食；再往上，无色界天人，连形体都没有了，所以只以意识为食物，叫做识食。</p><p>　　“阿难！一切众生食入甘美的食物，所以能够生存；食入有毒的食物，所以会死亡。所以，众生求正定，应当断除五种辛菜。所谓葱、蒜、韭菜、洋葱、兴渠。这五种辛菜，熟食助长淫欲，生吃使人爱发脾气。世间吃五辛的人，纵使能宣说十二部经，十方天仙嫌他臭秽，也都远离。而饿鬼喜好这种浓重的气味，他刚吃完，饿鬼就去吸吮他的嘴唇。所以吃五辛的人，常与饿鬼为伴。福德日渐销损，道业难以增进。</p><p>　　因为吃五辛的人，菩萨、天仙、十方善神不会前来守护。大力魔王伺机做怪，变成佛的形象给他说法，毁掉他的戒行，称赞淫怒痴迷。此人命终，成为魔的眷属。魔福享尽，最终堕入无间地狱，长劫受苦。</p><p>　　阿难，永断五辛。这是第一修行渐次。</p><p>　　怎样正性呢？阿难！众生要想进入正定，就要先严持清净的戒律。永断淫欲心，不饮酒吃肉。用火把食物做熟再吃，不要生吃。</p><p>　　阿难！修行人，若不断淫和杀，要出三界，是不可能的。要把淫欲当成毒蛇一样畏惧，当成怨贼一样远离。先持声闻的四弃八弃，身无毁犯，然后持菩萨戒，使心中连这样的念头都不会生起。</p><p>　　这些禁戒成就了以后，在这个世间就永远没有相生相杀的业果。不偷不劫，就没有负债。人能这样清净，用父母给的肉身，不须要天眼，就能自然看见十方世界，见佛闻法，得大神通，畅游十方世界。得<a href=\"https://www.guang5.com/rmgjc/suming.html\" class=\"keylink\" target=\"_blank\">宿命</a>通，能清楚地知道自己过去生中的经历。他永远也不会遇到艰难和危险的事情。</p><p>　　这是第二增进修行渐次。</p><p>　　什么是现业呢？阿难！这个清净持禁戒的人，因为心中没有贪淫，所以对外界的色、声、香、味、触、法这六尘就不会太留意。因为不外求，心识就会旋归自性。不攀缘尘相，六根没有了内容，就会反过来汇流归一，不再生起功用。</p><p>　　这时，会觉得外面的世界如此清净皎洁，自己的身心好像琉璃中悬着一轮明月一样。愉悦而平等，安稳而平和。一切如来微妙圆满的法性境界，都在其中。此人因此而获得无生法忍。</p><p>　　从此开始逐渐前修，自然安立圣位。这是第三增进修行渐次。</p><h3>　　五十五位真菩提路</h3><p>　　阿难！这样的善男子，欲爱干枯，六根不再沾染六尘，遗留的残惑不再增生。心地如虚空一样明彻，其中纯是智慧。以智慧明照十方。因为干枯了欲河，纯是智慧，所以叫干慧地。此时，欲习初干，还没有与如来的法水接流。</p><p><strong>　　十心</strong></p><p>　　就用这个心，念念流入法性。微妙的智慧因此而得到显发，一切妄想都不复存在。道心越来越纯熟，所以叫做’<a href=\"https://www.guang5.com/rmgjc/xinxin.html\" class=\"keylink\" target=\"_blank\">信心</a>住‘。</p><p>　　真信才能真正明了。一切圆通，外界的五阴和自身的觉知，不再为碍。所以，过去未来无数劫的习气，都能够知晓，丝毫没有遗忘。这个境界叫’念心住‘。</p><p>　　微妙圆满的智慧越发纯真。纯真到了精明的程度。这时，无始劫来的习气，就都融化在这精明之中。以精明进趋真净。这就叫’精进心‘。</p><p>　　在真净中，心精现前，纯以智慧为用。所以叫’慧心住‘。</p><p>　　以智慧去明照一切，则一切都寂灭湛然。常常凝住在这份妙寂之中，就叫做’定心住‘。”</p><p>　　关于这个“定”，有个有趣的公案：</p><p>　　宋代的大才子苏东坡虔心事佛，号东坡居士。他与金山寺的佛印禅师相交甚笃。有一天，苏东坡自以为<a href=\"https://www.guang5.com/rmgjc/xuefo.html\" class=\"keylink\" target=\"_blank\">学佛</a>颇有心得了，于是写了一首诗：稽首天中天，毫光照大千。八风吹不动，端坐紫金莲。</p><p>　　天中天就是佛。这首诗的意思是说，自己顶礼如来，见佛光遍照。自己如今已经不为八风所动，端坐在紫金的莲花之中。八风分别为称、讥、苦、乐、利、衰、得、失，这八种境界像风一样吹得人心摇动，所以叫“八风”。苏东坡的意思是，自己现在，无论是称赞还是讥讽，吃苦还是享乐，利诱还是衰患，得到还是失去，都已经如如不动了。</p><p>　　他写完以后，觉得很是得意，就让人去送给佛印禅师看。他本想让佛印禅师赞扬他几句，没想到佛印禅师看完，挥笔批上了“狗屁！狗屁！”四个大字。苏东坡一看，顿时火冒三丈，寻思我这境界这么好，这和尚怎么敢骂我狗屁呢！于是二话不说，立马上金山寺找佛印理论去。</p><p>　　佛印禅师远远地迎出来，边走边笑道：“哈哈哈哈！好个八风吹不动的苏大居士，老衲两个狗屁，就把你给吹来了。”</p><p>　　苏东坡一听，就反映过来了。自己明明说了，自己是“八风吹不动”，怎么人家说两句狗屁，就发火了呢！顿时满面羞惭，从此再也不敢说大话了。</p><p>　　如来继续道：“在定中越发显明了智慧的真实，越明了越进趋，有进无退，所以叫做’不退心住‘。</p><p>　　虽然进趋，却并不辛苦，反而安然自适，所以这个进趋能保持不失。因为一直趋向如来，所以能与十方如来的气分交接，因此叫做’护法心‘。</p><p>　　保持住这份觉明，就能以妙力，回应佛性的慈光，向佛安住。犹如两面镜子相对而置，彼此的光影重重涉入。这就是’回向心‘。</p><p>　　心光回照，绵绵密密，时常凝住于佛性的无为中，再无遗失，这叫做’戒心住‘。</p><p>　　自在地安住于戒心，能游行十方，随心所愿，所以叫’愿心住‘。”</p><p><strong>　　十住</strong></p><p>　　“阿难，这个善男子，以真方便发起这十种心。心精诚到极点时，便在这精诚中，把这十种心合而为一。这就叫’发心住‘。</p><p>　　这时，心中明澈得犹如清净的玻璃之中闪耀着精金。把这种妙心履以成地，叫做’治地住‘。</p><p>　　心地中凡有所知，一切明了。游步十方，没有留碍。此时叫做’修行住‘。</p><p>　　行为与佛一样，时时能感受到佛的气氛。就好像中阴身自己就能直接找到父母一样，此时，在冥冥之中就能得到音信，投生为如来种。所以叫做’生贵住‘。</p><p>　　对于中阴身，宣化上人解释道：</p><p>　　中阴身就是我们投胎做人的这个灵魂。在前五阴已灭，后五阴未成，这个时候叫”中阴身“。</p><p>　　他看大地如墨，没有光明。虽然有日月，但是有日月的时候他不敢睁眼，所以他是看不见光明。没有日月星辰的时候，他看大地如墨，黑洞洞的。</p><p>　　他和某一个父母有缘，无论相隔千里万里，父母在行淫欲的时候，他就看见有一点萤光。他千里万里应念而至，很快就到达这个地方。就像吸铁石吸铁一样，有一种吸引力，一吸就吸上了。吸上了，这个中阴身就到这儿托生了。托生就成胎了。</p><p>　　所以现在，第四住这个菩萨生在佛家里，也就好像这个样子。但是，这都是比方，不是一定这样子。这是比喻好像这么样有吸引力，就生到法王家了。”</p><p>　　“既然游历到如来的’道胎‘中，就成为佛法的继承人。如同胎儿长成人形，具足了人的相貌，这就叫’方便具足住‘。</p><p>　　不但长相跟佛一样，心相也跟佛一样，所以叫’正心住‘。</p><p>　　身心相合，日益增长，这叫’不退住‘。</p><p>　　十身灵相，一时具足，这个境界叫’童真住‘。”</p><p>　　“这个时候，有十种有灵相的身形，能同时现十个身。这十身可以每一身又现十身，这就百身。百身的每个身又可以现十身，这就现千身、万身--具足这么大的神通。”</p><p>　　“佛身既已成就，如同胎儿从母腹中诞生，亲身成为佛子。这时叫’法王子住‘。</p><p>　　国王在太子成人后，把国事委托给太子处理时，要举行灌顶的仪式。法王子此时也可以代佛宣化，所以叫’灌顶住‘。”</p><p><strong>　　十行</strong></p><p>　　“阿难。这位善男子，成为佛子以后，具足如来的无量妙德，能于十方随顺众生，这叫’欢喜行‘。”</p><p>　　随顺众生，是佛法修行一个很重要的内容。文殊菩萨还曾就此专门在五台山显圣，点化过众生。《广清凉传》中记载：</p><p>　　始建于东汉，兴盛于后魏的大孚灵鹜寺，不知从什么时候开始，在每年正月都要举办万人斋大会。在斋会期间，无论贫富贵贱，任何人都可以来寺中用斋，以表佛法平等慈悲之意。</p><p>　　在大寺传至第七代主持的时候，一次斋会时，有一个贫穷的女子，她怀里抱着两个孩子，带着一条狗，从南方前来赶斋，凌晨的时候才赶到寺庙。因为身上没钱，她就把头发剪下来一撮，作为施资。</p><p>　　当时还没到用斋的时候，她找到寺主，说：“我想先吃，我急着赶路。”</p><p>　　寺主随顺众生，就答应了她，并且慈悲为怀，还特意嘱咐给她三个人的饭，意思是让两个孩子也能吃饱。</p><p>　　贫女却说：“狗也应该给啊！”寺主勉强地也答应了。</p><p>　　谁知贫女还不满意：“我肚子里还有孩子，他也要吃饭那！”</p><p>　　寺主终于忍不住发火了：“你吃出家人的饭还这么贪。孩子在肚子里没生出来，还吃什么东西！”说着就赶她走。</p><p>　　贫女被呵斥后，即时腾身，踊入虚空，现出文殊菩萨庄严的法相。狗化成狮子。两个孩子则变成了善财童子和于阗国王。五色祥云刹那间遍满虚空。</p><p>　　菩萨在空中说偈道：“<a href=\"https://www.guang5.com/sushi/shucai/kugua/\" class=\"keylink\" target=\"_blank\">苦瓜</a>连根苦，甜瓜彻蒂甜。是吾起三界，却被阿师嫌。”说罢，便不见了踪影。</p><p><strong>　　文殊发塔</strong></p><p>　　在场的人无不惊叹。寺主深恨自己有眼不识真圣，一时间就要用刀剜去自己的双眼，众人苦劝方才止住。从此以后，无论贫富贵贱，再不敢有所分别。又在菩萨乘云离去之处建塔，把菩萨留下来的一绺头发供奉其中。</p><p>　　万历初年，圆广法师接任主持，为了重修发塔，把菩萨留下的头发掘了出来。开始只见头发的颜色如金，一会又变成黑的了，变幻不定，每个人看到的都不一样。这座发塔，如今就在五台山塔院寺东侧，方丈院的后面。</p><p>　　这是“欢喜行”。如来接着说道：“能利益一切众生，这叫’<a href=\"https://www.guang5.com/rmgjc/raoyi.html\" class=\"keylink\" target=\"_blank\">饶益</a>行‘。</p><p>　　自身觉悟了，还能去觉悟他人。对任何境界，都没有违逆和抗拒。这叫’无瞋恨行‘。</p><p>　　在十二类众生中，随类化现。过去，现在，未来三世平等，十方通达，教化众生无穷无尽，这叫’无尽行‘。</p><p>　　对一切法门，融会贯通。随机说法，没有丝毫差错。这是’离痴乱行‘。</p><p>　　能在同中，显现群异。又能在异中，各各见同。这叫’善<a href=\"https://www.guang5.com/rmgjc/xianxing.html\" class=\"keylink\" target=\"_blank\">现行</a>‘。</p><p>　　十方虚空，能化为一粒微尘。又能在一粒微尘中，显现十方世界。微尘与世界，毫无留碍。这叫’无著行‘。</p><p>　　种种现前的境界，都是第一波罗蜜多。这叫’尊重行‘。</p><p>　　因为能圆融一切境界，所以他的行为自然符合十方诸佛的行为规则，因此叫’善法行‘。</p><p>　　这一切都是清净无为的，是真性自然而然的流露，所以叫’真实行‘。”</p><p><strong>　　十回向</strong></p><p>　　“阿难！这个善男子，具足了圆满的神通，能成就一切佛事。心地精诚而纯净，远离一切障碍。虽然普度众生，却没有众生相。回无为心，向涅槃路，这叫做’救护一切众生离众生相回向‘。</p><p>　　破一切相，同时没有破的概念，这叫’不坏回向‘。</p><p>　　本有的如来自性湛然清净，觉悟之心与诸佛无异，所以叫’等一切佛回向‘。</p><p>　　因精真而发明自性，如同诸佛的境地，这叫’至一切处回向‘。</p><p>　　外在的世界与自身的如来性相互涉入，毫无挂碍，这叫’无尽功德藏回向‘。</p><p>　　在与诸佛同等的境地中，生发出种种清净之因，依据清净之因所发出的光辉，直取如来涅槃之道，这叫’随顺平等善根回向‘。</p><p>　　真如的善根既成，此时，十方众生都是我的自性。所以自性圆满成就的同时，也不失普度众生，这叫’随顺等观一切众生回向‘。</p><p>　　符合一切法，同时离一切相，对合与离也无所执着，如此才契合真如，所以叫’真如相回向‘。</p><p>　　真如体性遍满十方。既已契合真如，自然任运十方，无缚无碍，所以叫’无缚解脱回向‘。</p><p>　　圆成自性本具的德能，法界的限量随之消灭，所以叫’法界无量回向‘。</p><p>　　阿难！这位是善男子，成就了这清净的四十一种心，接下来再成就四种妙圆加行。”</p><p><strong>　　四加行</strong></p><p>　　“以佛的觉悟为自己的心，将出未出。就如同钻木取火，刚刚把木头钻热，所以叫’暖地‘。</p><p>　　以自己的心为佛行的履践之处，好像有个依止，又好像没有。就如同登上山顶，仿佛置身于虚空之中，但脚下还有个依托之处。所以叫’顶地‘。</p><p>　　自心与佛无二无别，安住在中道上。此时，如同忍事的人，藏在心里也不是，一吐为快也不是，所以叫’忍地‘。</p><p>　　没有迷觉，也没有中道，这些数量全都消灭。此时名为’世第一地‘。”</p><p><strong>　　十地</strong></p><p>　　“阿难！这位善男子对于菩提大道真正通达。自心的觉悟与如来融通无二，穷尽诸佛的一切境界。这叫’欢喜地‘。</p><p>　　一切分别都导归如来自性的大平等之中。平等的概念也不复存在。这叫’离垢地‘。</p><p>　　清净到极点，自性本具的明觉，以光明的形式迸发出来。所以叫’发光地‘。</p><p>　　光明迸发到极点，觉性达到圆满，智慧之火炽燃。所以叫’焰慧地‘。</p><p>　　这时，已经泯灭了一切异同，是一切分别心所达不到的境地。所以叫’难胜地‘。</p><p>　　无为的自性清净无染，本有的明觉终于显露出来，所以叫’现前地‘。</p><p>　　接下来开始穷尽真如实际，所以叫’远行地‘。</p><p>　　圆证真如本心，名’不动地‘。</p><p>　　真如本心发起妙用，名’善慧地‘。阿难！到此境界，修行的过程就功德圆满了。所以，这个境地也叫’修习位‘。</p><p>　　慈意弥漫成荫，犹如妙云一般，覆盖涅槃之海，名’法云地‘。</p><p>　　如来逆流相迎，菩萨顺行而至，交汇之地，名为’等觉‘。</p><p>　　阿难！从最初的干慧心到等觉为止，这时才获得金刚心中的初干慧地。经历重重次第，才能穷尽如来妙觉，圆成无上道。</p><p>　　这种种位次，都要以金刚心，观察如幻十种深喻。在如来自性中，用本有的明觉去清净修证，渐次深入。阿难！都是因为三增进法的缘故，才能成就这五十五个位次的真菩提路。”</p><p>　　什么是如幻十种深喻呢？</p><p>　　（一）观一切业如幻。</p><p>　　（二）观一切法如焰。</p><p>　　（三）观一切身如水中的月影。</p><p>　　（四）观妙色如空中狂花。</p><p>　　（五）观妙音如空谷中的回响。</p><p>　　（六）观诸佛国土如乾闼婆城。</p><p>　　（七）观佛事如梦。</p><p>　　（八）观佛身如影。</p><p>　　（九）观报身如镜中像。</p><p>　　（十）观法身如幻化。</p><p>　　正所谓：“修行空华万行，宴坐水月道场，降服镜里魔军，大做梦中佛事。”</p><p>　　如来继续强调：“这样观照，才是正观；其他的观照，就是邪观。”</p><p>　　阿难及诸大众，得蒙如来开示首楞严妙法， 顿悟进修圣位的妙理，心中的思虑都化为乌有，凝结在虚无的境界中，断除了三界内最微细的烦恼。\t\t</p></div>"
    },
    {
        "title": "第六章 七趣升沉",
        "author": "",
        "date": "",
        "html": "<div class=\"B1_text\"><h2>第六章 七趣升沉</h2><p>　　出世间的道路既然已经明确了，这一章，世尊又揭露了世间的真相。世间的轮回，是因为众生由妄见产生了妄习，由妄习而造作妄业，由妄业而产生了七趣。什么妄习呢？就是杀盗淫，或者不杀、不盗、不淫。随顺杀盗淫的习气就是沉沦的鬼类，违逆杀盗淫的习气就是精微的天趣。要修证三摩地正定，就必须除此三惑，否则必落魔道。所以，众生在七趣之中生死轮回，说到底，都是在自己的妄想中，自心取自心。一旦觉悟，则顺逆皆无。连“无”都没有，又何来轮回！</p><p>　　阿难顶礼佛足，合掌恭敬，继续问佛：“世尊的慈音，使众生最微细迷惑都得到了开解。我现在觉得身心畅快，获大饶益。</p><p>　　世尊！如果这个妙明真心本来周遍。大地草木，蝡动含灵，都是如来实体。</p><p>　　佛体是真实的，那么地狱、饿鬼、畜生、修罗、人、天这六道又是怎么产生的呢？这六道是本来就存在，还是众生的<a href=\"https://www.guang5.com/rmgjc/wangnian.html\" class=\"keylink\" target=\"_blank\">妄念</a>所产生的？</p><p>　　世尊！如宝莲香比丘尼，持菩萨戒还私行淫欲，并且妄言行淫非杀非偷，没有业报，说罢女根就生起猛火，全身节节烧然，堕入无间地狱。善星比丘妄说一切法空，琉璃王诛灭释迦族，生身陷入阿鼻地狱。这些地狱是有个固定的场所呢，还是各人的业报所感召的呢？请世尊慈悲开释，令一切受戒的众生，都能心中明了，而欢喜地持戒，皎洁无犯。”</p><p>　　佛说：“阿难，问得好。一切众生本来清静。因为妄见，而产生妄习，因此而有了内分和外分。</p><p>　　因为爱染，而产生了情欲。情欲能滋生爱水，所以众生心想美食，口中就会流出口水；心想恋人，眼中就会泪水涟涟；心求<a href=\"https://www.guang5.com/rmgjc/caifu.html\" class=\"keylink\" target=\"_blank\">财富</a>，身体就会光滢润泽；心想行淫，身根就会渗出精液。阿难！爱欲的内容虽然有别，凝结流溢的现象却是相同的。水性不升，自然下坠。这就是内分。</p><p>　　因为渴望，而产生了虚想。虚想能产生胜气。所以众生严持禁戒，就通身轻盈；勤持咒印，则顾盼雄毅；渴望生天，就梦想飞升；心念佛国，则圣境冥现。阿难！虚想虽然有别，轻盈升腾的现象却是相同的。飞升不沉，自然超越。这就是外分。</p><p>　　阿难！一切世间，生死相续。生时顺着习气造种种业，死后则随着业报轮回六道。临到命终，身体尚未冷却的时候，一生的善恶一时俱现。一切众生 ，都好生恶死。所以，在此生死交接之际，随顺生机的习气和违逆死亡的习气相交。</p><p>　　此时，如果心中纯想无情，必生天上。如果愿生佛土，而且福慧具足，自然能见到十方佛和净土，随愿往生。”</p><p>　　讲到这里，想必人人都想见到十方佛和净土，随愿往生。下面，我们就来看一个“纯想无情，随愿往生”的实例。</p><p>　　《宋高僧传》记载了一位怀玉法师的事迹：</p><p>　　怀玉法师俗姓高，丹邱（今浙江宁海南九十里）人，一向严持戒律，名节孤高，超尘脱俗。每天只日中一食，整日长坐不卧，努力精进，从不休息，因此跳蚤、虱子任意滋生。曾经读诵《阿弥陀经》三十万遍，每天课诵佛号五万声，并时常忏悔，礼拜诸佛。</p><p>　　唐玄宗天宝元年（西元七四二年）六月九日，见到西方三圣像遍满虚空，如恒河沙那么多。有一个人举着银台前来迎接，怀玉说：“我一生精进念佛，誓愿要取上品金台，为什么不是金台呢？” 说完，所有的圣像都立刻隐去。</p><p>　　怀玉于是更加努力地精进用功。有一天忽然听到空中有声音说：“法师头上已经有光圈了，请趺坐结印，等待佛来接引。” 过了三天，有奇异的光明照耀整个室内，怀玉说：“如果闻到异香，就是我的业报尽了。”因此书写偈颂：“清净皎洁无尘垢，上品莲台为父母。我修道来经十劫，出示阎浮厌众苦。一生苦行超十劫，永离娑婆归净土。”</p><p>　　说完这个偈颂后，奇妙的香气充满虚空，无量佛菩萨圣众遍满十方，并见到阿弥陀佛、观世音菩萨、大势至菩萨全身具足光明的紫金色，一同驾着金刚台前来迎接。怀玉于是含笑往生。</p><p>　　郡太守段怀然，作诗赞道：“我师一念登初地，佛国笙歌两度来。唯有门前古槐树，枝低只为挂金台。”</p><p>　　这位怀玉法师，在精进的修行中，使心中只有往生净土的“想”，而没有五欲六尘的“情”。在持戒念佛和礼拜忏悔中，具足了福慧。所以，在坚固的求生西方极乐世界的愿力下，得以含笑往生。这就是佛说的：“纯想无情，愿生佛土，福慧具足。”所以，“自然能见十方佛和一切净土，随愿往生。”</p><p>　　如来继续说道：“若想中杂情，情少想多。即为飞仙、大力鬼王、飞行夜叉、地行罗刹，游行于四天王天，毫无阻碍。其中若有善愿善心，护持我法。或护持禁戒，保护持戒的人；或护持神咒，保护持咒的人；或护禅定，保护参禅的人。这些众生都可以亲近如来，亲身在佛前听经闻法，而种善根。</p><p>　　如果情想均等，则不飞不坠，生于人间。想多的人就聪明，情多的人就暗钝。</p><p>　　情多想少，则流入横生。情重的为披毛的畜生，情轻的做戴羽的鸟类。</p><p>　　七分情三分想，则身为饿鬼，无食无水，常被焚烧，长劫受苦。</p><p>　　九分情一分想，下堕地狱。轻的生在有间地狱，重的生在无间地狱。</p><p>　　纯情无想，则沉入阿鼻地狱。若沉心中，有毁谤大乘佛法，破坏佛制定的禁戒，诳妄说法，私贪信众的供养，滥膺恭敬，以及五逆十重的罪业，则要到十方世界的阿鼻地狱中去轮流受苦。</p><p>　　虽然随着所造的恶业，而自己感召恶报。但是众生造了相同的业，也就产生了共同的受报场所。</p><p>　　阿难！这些都是众生自己的业力所感召的。众生随着十种习气，造下十种业因，地狱中，就感得六种果报。”</p><h3>　　十习因</h3><p>　　“哪十种习气呢？阿难！”</p><p>　　一、淫习</p><p>　　“淫习始于接触。彼此相摩，研磨不休，于是就会有火光发动。这就好比两手摩擦，就会产生热量一样。所以，在生死交接之际，顺生逆死这两种习气，在淫习的火相中相燃，就会有地狱中女睡铁床、男报铜柱这样的事。所以十方一切如来，把淫欲都叫’欲火‘。菩萨回避淫欲，如同躲避火坑。”</p><p>　　中国的古代 ，就曾有过这样的刑罚，把铜柱烧红了，让罪人去抱。这叫做“炮烙之刑”。净空老法师在他的《无住生心集》里，曾讲过一个关于地狱中炮烙之刑的真实故事：</p><p>　　朱老居士是章太炎的女婿，章太炎是民国初年的国学大师，在文坛上很负盛名。那时袁世凯当权，他的岳丈因为得罪袁世凯而入狱。怎么得罪的？他说袁世凯不值得我骂，就是不肯骂袁世凯。这话传到袁世凯耳里，袁世凯很<a href=\"https://www.guang5.com/rmgjc/shengqi.html\" class=\"keylink\" target=\"_blank\">生气</a>，就把章太炎关进监牢里。总也没有什么大罪名，于是关了一个多月便放出来。</p><p>　　出狱未久，有一天晚上睡觉，梦见两个小鬼抬着一顶轿子，说东岳大帝请他，他就上了轿。这两个小鬼像飞行一样，没多久就到了东岳大帝那儿。中国大陆有五岳，东岳管五个省（江苏的都城隍只管一个省），可见这是大鬼王。东岳大帝聘请他作判官，地位好比现在的秘书长。但是他是活人，于是请他晚上上班，天亮时就送他回来。每天都去上班，所以他知道很多阴曹地府的事，没事就跟朋友们聊天，谈谈昨天晚上办了些什么事。他说中国、外国都有阴间，但是阴间的言语相通，没有隔阂，生活状况跟人间差不多。但是不见阳光，天永远是灰蒙蒙的，好像永远是阴天浓雾的样子。</p><p>　　他当东岳大帝的判官，地位很高，有待遇，也有饮食，但没有用处，因为他是活人。有一次他忽然想到，地狱里的炮烙刑法太残忍，可不可以废除？东岳大帝听了笑笑，就叫两个小鬼带他到刑场去看看。走了一段路，小鬼就指给他看，他却看不到。他是学佛的，于是恍然大悟，地狱乃变化所现，就如《<a href=\"https://www.guang5.com/fojing/dizangjing/\" class=\"keylink\" target=\"_blank\">地藏经</a>》所说的，如果不是受罪的人、不是菩萨，即使地狱在你面前也见不到。他才晓得这不是人力所能为的，不是残忍不残忍的问题，而是由自己业力变现出来的，阎罗王也无可奈何。一个多月以后，他用黄纸写一份辞呈，然后把它烧掉，果然从此以后那两个小鬼不再来接他了。</p><p>　　二、贪习</p><p>　　“贪习始于算计。吸纳利益，吸取不止，于是就会有寒冰之相。这就好比人用嘴猛吸风气，就会觉得口中寒冷。所以，生死交接之际，顺生逆死这两种习气，在贪习的寒相中相陵，就会有地狱中那些冷冻之事。所以十方一切如来，视’多求‘为贪水。菩萨见到贪心，犹如躲避瘴海。 ”</p><p>　　三、慢习</p><p>　　“慢习始于凌越。凌驾人上，自恃极高，于是则有贪水爱浪，奔腾流溢。好比品尝自己嘴里的滋味，就会有津液流出。所以，生死交接之际，顺逆二习在慢习的水相中相鼓，就会有地狱的血河灰河、融铜灌吞等事。所以十方一切如来，视’我慢‘如同饮痴水。菩萨躲避我慢，如同躲避淹溺。”</p><p>　　四、瞋习</p><p>　　“瞋习始于冲突。诋忤不休，心热发火，火把怒气铸成金，于是会有刀山、剑树、铁轮、枪锯。比如含冤的人，心中就会充满杀气。顺逆二习在瞋习的金相中相击，在地狱中，就会有刀斩人首，锉断人腰，刺穿人胸，槌击人背。所以十方一切如来，看’瞋恚‘如同利刀利剑。菩萨见瞋恚，如躲避诛戮。”</p><p>　　五、诈习</p><p>　　“诈习始于诱惑。调弄引诱，使人上当，于是就会有绳绞、木枷之相。如同把水引到田里，禾苗得以生长。顺逆二习在诈习困相中相延，在地狱中，就会有杻械枷锁，鞭挞杖挝。所以十方一切如来，视奸伪如同遇贼。菩萨见欺诈如同畏惧豺狼。”</p><p>　　六、诳习</p><p>　　“诳习始于欺骗。诬罔不止，飞心造奸，于是则有尘土屎尿，秽污不净之相。犹如尘土随风飞扬，令人各无所见。顺逆二习在诳习的污相中相加，所以死后，地狱中就有没溺腾掷，飞坠漂沦之事。所以十方一切如来，视欺诳如同劫杀。菩萨见欺诳如同畏惧毒蛇。”</p><p>　　七、怨习</p><p>　　“怨习始于衔恨。衔怨不舍，怀恨在心，因此有飞石投砾、匣贮车囚、瓮盛囊扑之相。好比阴毒的人，心中总是怀着恶意。顺逆二习在怨习的衔相中相吞，所以地狱中，则有投掷擒捉，击射抛撮之事。所以十方一切如来，视怨恨如同厉鬼。菩萨见怨如同剧毒的鸩（zhèn）酒。”</p><p>　　八、见习</p><p>　　“见习始于明辨。总想违逆别人的看法，自己提出一个相反的见解，所以会有王使主吏，考绩查证。就像路人一样，跟人来往相见。顺逆二习在见习的辨相中相交，在地狱中，则有审训查访，孼镜照明。冥官差役，手执文簿，当堂对质。所以十方一切如来，视恶见如同陷阱。菩萨见偏执如临毒壑。 ”</p><p>　　民国高僧倓虚法师，就曾经亲身经历过与阎罗王对质公堂的事情。他在《影尘回忆录》中，记载了这段经历：</p><p>　　在当时，闹时令症的人，最怕闹肚子，只要肚里一响，泻几回肚，不几天就要死！这种病在当时；好像有邪气一样！我在金同学家里回去之后，到了天黑，就觉肚子痛，内里咕噜咕噜的响。我心里想：坏了！恐怕我也要死，又怕母亲知道了担心，没敢言语。于是把小褂脱下来，将腰围上，就睡觉了。这时我心里又害怕，肚里又痛，不一会，就像做梦似的，把我痛过去了。其实，并不是做梦；而是自己死了还不知道呢！</p><p>　　虽然是死了，可是迷迷糊糊像做梦一样，见来了两个鬼把我架著，飘飘荡荡的，过了好些山，又过了很多的水，觉得在水面上，就飞过去了。后来，那两个鬼，把我架到一个庙门口，像一个衙门样子，里面有很多的房子，那两个鬼，把我往屋里一推，他说：“进去吧！”一副很凶恶的面孔，说话很愤愤的：“在这里等候过堂！”</p><p>　　这时，我才明白我已经是死到阴间来了，心里非常懊恼，非常难过！因忆起我母亲的话，说我不好养活，这时候才证明是不错。我在那里等候了一个时间，胡思乱想的想了半天，四周阴沉沉的没有一点儿声息。回头一看，屋子里有一个管账的先生，在那裹拿著笔不知写些什么东西，余外更无他人。我想：死了不要紧，在我母亲跟前，就我这么一个人，如果我真的从此死了的话，我母亲哭也哭坏了，这怎么办呢？于是我慢慢的走到写帐的跟前，想法子与他套交情，说近话：“先生！”我很和霭很客气的问：“我犯什么罪，叫我来过堂！”</p><p>　　“不知道哇！”他答。</p><p>　　“在什么地方过堂？”我又问。</p><p>　　“从这里往后去，就是过堂的地方！”</p><p>　　“是谁管著过堂？”我一句跟一句的往下问。</p><p>　　他很惊讶的说：“你以为你还在阳间吗？你现在已竟死了的鬼，过堂的时候要由阎王来问案，这点事情还不知道吗？”他一边说，一边连头也不回的继续往下写。</p><p>　　后来我沉思了半天，又问：“我能转生吗？”</p><p>　　那位先生，对于我问他的话，啰哩啰索地他已经听腻了，当我问他“能不能转生”时，他心里很不耐烦的就顺口答应了一句：“我不知道！过完堂你自然明白了。”说这话时，他依然低著头往下写。</p><p>　　在那里又呆了一会，我忽然忆起外道里，诵经招魂一回事，究竟这事是真是假？有用没用？就拿这话去问他。</p><p>　　他忽地停住笔，回过头来说：“这事不假，阴间确实有这回事。”同时他又指著墙上的木板说：“这些板上的位子，就是刚死过不久，提出来，等他的后人诵经<a href=\"https://www.guang5.com/rmgjc/chaodu.html\" class=\"keylink\" target=\"_blank\">超度</a>的，如果过的日子太多，就不容易往外提了。”</p><p>　　我看看他指的那些板子上，果然有很多名字，还有香纸经卷等，接著我又往下问：“什么时候过堂？”</p><p>　　他说：“你等著吧！阎王正在后面剃头呢！”</p><p>　　因此我又联想起小时候看戏，有胡迪骂阎，记得那位阎王是古衣古冠，前后冕旒（liú），为什么阴间的阎王也留辫子也剃头呢？</p><p>　　在那里待了一个很长的时间，那两个鬼，又来架著我从甬（yǒnɡ）路上走过去，到了一所殿堂里，那两个鬼用力把我往里一推，摔了一个跟头，我便进去了，里面黑漆漆的，什么也看不见，只听有人问：“你是王福庭吗？”</p><p>　　一种很陌生很粗暴的声音传到我的耳朵里，本来我的学名就叫王福庭，我知道这是阎王爷开始问案子，我便随口答应了声：“是！我是王福庭。”</p><p>　　“你知道吧！你已经死咧！现在该送你转生”，阎王继续往下说。</p><p>　　我想：“转生还不知转到哪里去，既转生，再想回家也回不去了，我母亲不挂念我吗？不哭坏了吗？”事急智生，我又反问他：“我有罪吗？”</p><p>　　“你无罪！”</p><p>　　“我既无罪，何必费这事令我转生呢？我母亲就我这么一个孩子，从小娇生惯养，恐怕我死，我要不回去，她不惦念我吗？她不哭坏了吗？况且人生学好不容易，我今生也没做坏事，刚刚知道要学好，如果让我去转生学坏了，还不如今辈子，这有多么冤枉啊？”我这样的辩驳著。</p><p>　　“寿限有定数，不能只依你！”阎王说。</p><p>　　“我在世的时候，听说诵经增寿，我的经白诵吗！”我又反问。</p><p>　　本来在原先我见到我舅父死过的时候，我怕死，曾经想过不死的法子。那时候有施送高王观世音经者，说诵一千遍可以免灾不死。我请了一本，那时候想：大概是一气诵完，就用两天一夜的工夫，把一千遍诵完了。自此以后，每天有工夫就诵几遍，然亦不知死不死。</p><p>　　阎王说：“诵经不白诵，你在十七岁就该死，给你增了五年寿，活到二十二，这不是诵经的功德吗？”</p><p>　　“既然诵经有好处，请你放回我去，我再继续去诵经”再延长我的生命，这不很好吗！“</p><p>　　”嗯-“他有点不赞成的样子说：”只诵这种经不成！“</p><p>　　我听了他这话以后，心里一沉思，大半还许能通融，既是诵这种经不成，必定诵别的经能成，我就应声的说：”如果放我回去的话，我每天念十遍<a href=\"https://www.guang5.com/fojing/jingangjing/\" class=\"keylink\" target=\"_blank\">金刚经</a>。“</p><p>　　本来在我们那个村里，有施送金刚经的，我只听说这个名字，究竟这部经有多少，内容怎么样，我也不知道。阎王听了我的话，就答应了，于是又命那两个鬼，把我送回来。在路上走的很快，过山涉水，还是去时所走那条路。</p><p>　　回来之后，我很清楚的看著我们家里的那座南屋，大门向东，进大门之后，听我母亲正在哭的很哀痛。我们家的三间堂屋，是一明两暗，我内人正在当中那一间屋里涮锅，我的尸首在炕上顺躺著，我母亲守著我的尸首哭的要死要活，那两个鬼，把我送到原来的尸首跟前，从后面一推，”你还阳吧！“</p><p>　　这时，我像做一个梦似的醒了，回头看看外面，已经红日三竿。</p><p>　　九、枉习</p><p>　　”枉习始于施加。诬陷毁谤，强加于人，因此则有山石磨硙的碾压之相。如同贼人，逼枉良善。顺逆二习在枉习的压相中相排，所以地狱中，则有押按、槌打、量度，挤磨之事。所以十方一切如来，视毁谤如同猛虎。菩萨见陷害如遭雷击。“</p><p>　　十、讼习</p><p>　　”讼习始于争辩。以此来隐藏过失，因此而有照明之相。如日中天，不能藏影。顺逆二习，在讼习的藏相中相陈，所以在地狱中，就会有恶友揭露罪过，有孽镜台回放罪人的一生。所以十方一切如来，视藏覆如同阴贼。菩萨观藏覆如顶高山，如涉水巨海。</p><h3>　　六交报</h3><p>　　“什么是六交报呢？阿难！一切众生，以六识造种种业，所感召的恶报，都从六根上表现出来。具体是怎么表现出来的呢？</p><p>　　一、见报招引的恶果。见属火。所以见业与六根相交，使罪人在临终的时候，先见到猛火遍满十方界。亡者的神识，乘着黑烟，飞坠入无间地狱。此时，或者见到种种恐怖的景象，使罪人心惊胆战；或者盲无所见，使罪人惶恐不安。</p><p>　　见火烧到听觉，成为镬汤、洋铜。烧到嗅觉，则为黑烟、紫焰。烧到味觉，成为炙热的铁球，熔化的铁水。烧到触觉，成为热灰、炉炭。烧到心识，则生出迸撒的火星和滚烫的热浪。</p><p>　　二、闻报招引的恶果。闻属水。所以闻业与六根相交，使罪人在临终时，先见到波涛淹没天地。亡者的神识，乘着波浪，流落到无间地狱。此时，亡者或者听到嘈杂喧闹的声音无休无止，搅的人神识昏聩；或者毫无声息，使罪人一缕幽魂，陷入沉默的深渊。</p><p>　　闻水浇到听觉，则化为诘责问难。流注见中，化为雷鸣怒吼，毒气流溢。注入鼻息，则为雨为雾，洒掷毒虫，爬满身体。注入味中，则化为脓血横流，种种杂秽。注入触觉，则成畜生饿鬼，屎尿粪秽。流注意根，则能为雷电冰雹，摧人心魄。</p><p>　　三、嗅报招引的恶果。嗅属气。所以嗅业与六根相交，使罪人临终时，先见毒气充塞虚空。亡者的神识，从地中涌出，进入无间地狱。此时，罪人或者闻到种种恶气，熏的头晕目眩。或者气塞不通，憋得死去活来。</p><p>　　嗅气冲入鼻息，则化为质问，指使。冲入见觉，则成火炬。冲入听觉，则成洋汤沸水。冲入味觉，则成臭鱼烂虾，酸汤馊饭。冲入触觉，则身体破烂，成大肉山。百千蛆虫，叮咬啃食。冲入思维，则为毒灰瘴气，飞砂走石，击碎身体。</p><p>　　四、味报招引的恶果。味属金。味业与六根相交，使罪人临终时，先见铁网燃着烈焰，笼罩世界。亡者倒挂在网上，坠入无间地狱。吸气时，气息结成寒冰，冻冽身骨。吐气时，气息化成猛火，烧焦骨髓。</p><p>　　味业经历味觉，就化作承受堪忍。经历见觉，则为溶金火石。经历听觉，则为锋利的兵刃。经历嗅觉，则为铁笼笼罩。经历触觉，则为弓箭弩矢。经历思维，化作热铁，凌空而泄。</p><p>　　五、触报招引的恶果。触属土。触业与六根相交，使罪人临终时，先见大山四面来合，没有出路。亡者的神识见大铁城，火蛇火狗，虎狼狮子，牛头狱卒、马头罗刹，手执枪矟（bǐnɡ），把亡者驱入城门。亡者于是堕入无间地狱。此时，罪人或者被大山挤压，血肉模糊；或者被刀剑穿身，心肝俱裂。</p><p>　　触业与触相合，则化为撞击穿刺。与见相合，则成烧煮熏烤。与听相合，则化为道观厅案。与嗅相合，则成为封袋装捆绑。与味觉相合，则成为耕犁钳夹，斩斫截断。与思维相合，则成为抛掷摔打，煎烤烧炙。</p><p>　　六、思报招引的恶果。思维属风。思业与六根相交，使罪人临终时，先见恶风吹坏国土。亡者的神识被吹上高空，乘着旋风，坠入无间地狱。此时，罪人或者迷茫慌乱，奔走不停；或者觉知众苦，煎熬难忍。</p><p>　　此邪思之业，与意相结，则成为受报的处所。与见相结，则能鉴别罪业，查实考证。与听相结，则化为山石夹合，冰霜尘雾。与嗅相结，则成火车火船火监。与味相结，则成懊悔悲泣，哭号无休，声震寰宇。与触相结，则身形或大或小，或仰或卧，一日之中，万生万死。</p><p>　　阿难！这就是地狱的十因六果，都是众生迷妄所造。</p><p>　　若诸众生，这些恶业同时遍造，则堕入阿鼻地狱，受无量苦，经无量劫。</p><p>　　如果六根各自造做十因。此人则入八无间地狱。</p><p>　　如果身口意作杀盗淫，此人则入<a href=\"https://www.guang5.com/fxrm/fxcs/349222.html\" class=\"keylink\" target=\"_blank\">十八层地狱</a>。</p><p>　　三业不是全犯，只单犯一个。此人则入三十六个大地狱。</p><p>　　如果见根单犯一种罪业，此人则入一百零八个中地狱。</p><p>　　众生各自造了什么罪业，就会堕入世界中相应的地狱去。这都是妄想所产生的，并不是本来就有。</p><h3>　　鬼趣</h3><p>　　阿难！若有众生，破坏律仪，犯菩萨戒，毁谤佛法，或者犯其他杂业，在地狱中长劫烧燃，地狱罪毕，就受鬼形。</p><p>　　如果是因为贪物而获罪，此人地狱的罪受完后，一缕幽魂，遇物成形，名为怪鬼。”</p><p>　　贪婪的习气，牵引着罪人，在寒冰地狱中受完酷刑后，又使罪人吸附在物体上，成为怪鬼。</p><p>　　“贪色获罪，罪毕以后，则遇风成形，名为魃鬼。”</p><p>　　淫欲使人心神飘荡，所以地狱中的炮烙之刑受完以后，淫欲的习气就会与同样飘荡的“风”结合，成为魃鬼。</p><p>　　魃鬼，也叫旱魃。对于这种鬼，历来都有广泛的记载。《诗经》中说：“旱魃为虐，如惔如焚。” 《神异经》记载：“南方有人，长二三尺，袒身，而目在顶上，走行如风，名曰魃，所见之国大旱，赤地千里，一名旱母。”连杜甫的诗中也提到过旱魃鬼。他在《七月三日亭午已后较热退晚加小凉稳睡》中有这样的诗句：“闭目逾十旬，大江不止渴。退藏恨雨师，健步闻旱魃。”</p><p>　　民间传说宋真宗时，旱魃作怪，盐池的水都枯竭了。真宗求助于张天师。天师就让关公去降伏旱魃。关公苦战七天，终于降伏了旱魃。真宗于是封关公为“义勇武安王”。这一天是农历五月十三日。后来民间便在这一天举办关帝庙会，祈求关帝显灵，逐魔消灾，普降甘霖。并把这天称为雨节，认为这一天必定下雨。所以民间一直有“大旱不过五月十三”的说法。</p><p>　　“贪惑为罪，罪毕以后，遇畜生成形，名为魅鬼。”</p><p>　　宣化上人说：“我见过一只猫，有个鬼附到这猫身上。喔，它的本事很大！在地下一跳，就可以跳起来十几尺高，跳到房顶上去；从房顶上又跳下，来回跳，也呱呱叫，这样子我都见过的。狐狸，它附到人身上。它本来是一只畜生，但是灵魂可以出来，跑到人身上去。藉着这个人身，它就会讲话的，这叫”狐狸精“。黄鼠狼也会这个样子，它把自己的灵魂出去了，附到那个人身上，也会讲话的。这种怪现象多得很，所以这叫”魅“。就是”迷昧“，把人迷住了。他一到人身体上，人的心就被他给迷住，什么也不知道了，好像睡着了。”</p><p>　　“贪恨为罪，罪毕以后，遇虫成形，名蛊毒鬼。”</p><p>　　“在中国的广东也有这种的蛊。这是一种虫子做的药品，放到茶里给你喝，你喝了之后，永远就要听他的招呼。如果不听他招呼，你就会死的。这叫”虫蛊“。若想解除这个蛊毒，一定要找给你放蛊的这个人才可以。但是你想叫他解除，他不会解除的。在南洋一带，新加坡、泰国、越南这些个地方都有这蛊毒。</p><p>　　这蛊毒，它也是有一种鬼，专门做这个蛊毒。它非常之灵，如果中了蛊，一定要他给念这种解蛊的咒。如果不念呢，那就不得了了，那你就永远都要服从他的。最好笑的，就是南洋那一些个女人，有一些个广东来的外乡人到那边去，她欢喜这个男子，就和他结婚。结婚之后，她就给这个男子下蛊。下了蛊，这个男子如果离开她，就会死的，所以这个男子永远也不会离开她的。在中国有很多会这些个法术的人，不过这都属于邪术。”</p><p>　　“贪忆为罪，常忆宿怨，罪毕以后，遇衰成形，名为疠鬼。”</p><p>　　“这个人没有运气，或者遇着无论任何的畜生老衰了，他就藉这个形象变成一个疠鬼。疠鬼藉衰成形，有的时候也是你这个人运败时衰，就遇着这种疠鬼。疠鬼非常厉害的，他要人的生命就好像探囊取物一样，随时都可以把人命害死的。”</p><p>　　“贪傲为罪，是人罪毕，遇气成形，名为饿鬼。 ”</p><p>　　饿鬼四肢瘦弱得如同枯枝，皮肉干燥，血脉枯竭，肚子大得象鼓一般，咽喉却细如针尖，不通气息。由于常被饥渴的猛火所焚烧。这些饿鬼整天只知道四处求索饮食，见到食物，刚一过去，因为悭贪的恶业，食物就会变成脓血，臭恶四散。如果找到水，刚要去喝，又会被水神用铁杖殴打。如果没有人守护，清凉的冷水因为他们的恶业的感召，也会变为火焰。又常被铁嘴的雕鹫啄眼睛，被虎狼铜狗等撕咬。身上的毛发中生满了叮咬的小虫。这些饿鬼因为饥渴的逼迫，而互相残害，打得脑浆迸裂，骨髓四溅，而互相啖食。这样的苦恼，说也说不完。所以僧人在用斋前，都先施食给饿鬼。寺院还经常举办蒙山焰口法会，来济度饿鬼道的众生。</p><p>　　“贪罔为罪，是人罪毕，遇幽为形，名为魇鬼。”</p><p>　　魇鬼就是前面说的鸠槃茶鬼，象个坛子一样的。它能在人睡觉的时候魇人。我的朋友果开居士，有一天出差回到家，晚上睡觉的时候就被魇着了，全身不能动。于是他马上开始念佛，念了也没用。又开始念大悲咒，念了半天也没用。他突然就想，我这个身体，本来就空的，哪有我啊！这样一想，马上就活动自如了（般若的力量是微妙不可思议的）。</p><p>　　“贪明为罪，邪知邪见，自作聪明，是人罪毕，遇精为形，名魍魉鬼。”</p><p>　　“魍魉鬼，他有的时候变成一个小孩子。小孩子都是两条腿，他是一条腿。有的时候变成一个大人。人的头都在顶上长着，他这个头长到腿中间。这就叫”魍魉“。他有不同的样子，就这么奇奇怪怪的！</p><p>　　他也可以为虎作伥。怎么叫”为虎作伥“呢？这是山上有老虎，人人都不敢到这山上去，怕被老虎吃了。这种鬼就变成一个人形，在前面走。你一看这有人走路，就不怕了，就跟着他走。一到山里头，老虎出来就把你吃了。这种鬼就是专门帮着老虎骗东西吃，这叫”为虎作伥“。这个魍魉，有的时候他也做这个事情。”</p><p>　　“贪成为罪，欺诈蒙骗，是人罪毕，遇咒为形，名役使鬼。 ”</p><p>　　“什么叫役使鬼呢？这鬼可以帮人做事的。好像中国有个纪晓堂，他有五个鬼帮他做事的。这五个鬼，一个就各处去探消息，搜罗情报。一个就帮他听东西，听什么地方有什么声音，谁讲什么话。鬼因为有五通，有天眼通、天耳通、他心通、宿命通、神足通，没有漏尽通。所以什么人讲什么话，很远他也知道，有什么事情，他也看得见。这种鬼有一点道行，所以就有这种神通。那么纪晓堂就仗着这五个鬼，给他来传达消息，上情报，所以什么地方有什么事情，他就各处去救人。譬如什么地方有什么妖怪想要害人，他即刻就去降妖捉怪。这役使鬼，就因为以前尽贪欺诈，现在做役使鬼。”</p><p>　　“贪党为罪，结党营私，诉讼攻讦，是人罪毕，遇人为形，名传送鬼。”</p><p>　　“这个传送鬼，就是方才所说，附到人身上讲话的那种鬼了。这个人一边这么哆哩哆嗦地，一边就讲话，说他又是这个神、那尊佛，这真是’满天神佛‘！</p><p>　　这种传送鬼，什么事情还没有发生，无论吉凶祸福，他都可以预先告诉你。有的时候说出来很应验的。所以在这个地方，你怎么就能分别出来是正是邪呢？那个正的，他是从修道得来的，不是藉着鬼，藉着神，藉着菩萨、藉着佛来告诉你的，不是假藉”怪、力、乱、神“这种的说法。所以这个地方，你要认清楚！这在中国叫”巫医“，他会给人<a href=\"https://www.guang5.com/rmgjc/zhibing.html\" class=\"keylink\" target=\"_blank\">治病</a>的，但不是他这个人治病，是有鬼神附到他身上了。就是以前我讲的，有的头上钉上刀子，肩臂上挂上铡刀，那一类的都是叫传送鬼。”</p><p>　　“阿难！因为众生的心中纯是情欲，因此堕落。地狱的业火烧干了他的罪业，终于能上升成鬼。这都是自己的妄业所招引的。如果觉悟了菩提自性，则一切清净圆明，本无所有。”</p><h3>　　畜生趣</h3><p>　　“阿难！鬼业了尽，鬼趣的情想都已成空，这时才能来到世间，与冤家债主相遇，投身为畜生，酬尝宿债。</p><p>　　贪物的怪鬼，所附着的物体消磨殆尽，投生于世间，多为枭类。</p><p>　　贪淫的风魃鬼，所附的风消散净尽，投生于世间，多为不吉祥的禽兽，称为咎类。</p><p>　　贪惑的魅鬼，依附的畜牲死后，生于世间，多为狐类。</p><p>　　贪恨的蛊毒鬼，蛊死后，它的业报也受尽了，生于世间，多为毒虫。</p><p>　　贪忆宿怨的疠鬼，所依附的衰患没了。投生世间，多为蛔虫。</p><p>　　遇气成形的饿鬼，气消散后，生于世间，多为供人食啖的家畜。</p><p>　　以幽成形的魇鬼，幽暗散尽，生于世间，多为供人役使的牲畜。</p><p>　　和精成形的魍魉鬼，精消报尽，生于世间，多为候鸟。</p><p>　　明灵的役使鬼，明灭报尽，生于世间，多为一些吉祥的禽兽。</p><p>　　贪党的传送鬼，附着的人死后，生于世间，多为供人驯养的宠物。</p><p>　　阿难！鬼道的业火烧干以后，为了酬偿宿债，而转生为畜牲。这都是虚幻的妄业所招引的，如果能了悟菩提自性，返本还原，则这些妄缘，本无所有。</p><p>　　你所说的宝莲香，善星比丘等，他们的恶业，都是他们的妄想所生发出来的，不是从天而降，不是从地涌出，也不是他人给的，都是自己的妄想所感招的，所以还得自己来承受。这一切，在菩提心中，都不过是浮尘幻影而已。”</p><h3>　　人趣</h3><p>　　“阿难！在<a href=\"https://www.guang5.com/rmgjc/chushengdao.html\" class=\"keylink\" target=\"_blank\">畜生道</a>酬偿宿债时，如果偿还得过多，此等众生则还生为人，讨回多余的部分。如果这个被讨债的人，他有善力，兼有福德，则在人中，不舍人身而偿还他以前多得的那部分。如果无福，则生为畜牲，酬偿余值。</p><p>　　阿难，要知道，如果是钱物或者劳力这样的债务，偿还够数，就自然停止。如果在这过程中，杀了对方的身命，或者吃了它的肉，如此一来，经微尘劫，相吃相杀，犹如转动的车轮，互为高下，强者凌弱，无休无止。除非得到楞严大定及佛出世，才能停止。</p><p>　　那些枭类的众生，还清了债务，生人道中，常与顽<a href=\"https://www.guang5.com/sushi/yaoshan/renshen/\" class=\"keylink\" target=\"_blank\">人参</a>合在一起。”</p><p>　　顽人就是不讲道理，顽固不化的人。例如土匪那类的人。</p><p>　　“那些不吉祥的禽兽，报尽投生人道中，常为异形。”</p><p>　　比如各种各样畸形的婴儿，就属于这类异形。</p><p>　　“狐类的众生，报尽还生人道中，常与庸人参合在一起。</p><p>　　那些毒虫，报尽生人，常与狠人为伍。</p><p>　　那些蛔虫，报尽成人，常为卑微的人。</p><p>　　那些食类的众生，酬足负债，生人道中，常为柔弱之人。</p><p>　　而服务于人的畜生，酬足负债，生人道中，常为劳役。</p><p>　　那些候鸟，报尽生人，多为文人。</p><p>　　那些吉祥的禽兽，报尽生人，常有聪明。</p><p>　　那些猫狗等类，报尽生人，常常通达人情世故。</p><p>　　阿难！这些众生，宿债酬偿完毕，投生为人。无始劫来，执着于妄业，为讨债而相生，为偿命而相杀。不遇如来，不闻正法，于尘劳中轮转，实在可怜。”</p><h3>　　仙趣</h3><p>　　“阿难！还有一类人，不依菩提正觉之道，修证真如本性。而是修行妄念，希望这个形体坚固长久。所以，山林之中，人迹罕至之处，有十种仙。</p><p>　　阿难！有的众生，长年累月，服食种种药饵，食道圆成，名地行仙。”</p><p>　　南怀瑾老居士，年轻的时候热衷于求仙访道，曾遇到过不少异人。这些异人，虽然不一定都是吃药饵，但也类似于地行仙。下面我们听南师来讲讲他的经历：</p><p>　　“四川名胜鹄鸣山，为东汉期间道教祖师张道陵隐居之地。山上住有一位名号王青风的道士，是四川境内传说的剑仙，我曾经上山寻访他，多次以后，终于见到面。他亦是一位奇人异士。他说，并无飞剑这种事，但剑仙却是有的。然而他的说法又与杭州城隍山老道所说稍有不同。他说剑为一种”气功“，所谓以神御气，以气御剑，百步之外可以御敌。又说剑有五类，大别之为有形、无形。他知道我羡慕”金光一道“的剑术时，告诉我需铸备一寸三分长金质小剑，再以道家方法习练。一如道家练丹之法，可将黄金炼化成液体，并可服饮，若中了毒，道家并有解此毒的药。当时私自想到，现在到了科学昌明，枪炮及炸弹等威力无比的利器皆已发明了的时代，还去苦练这种剑术干什么？如果是为了强身，则个人已经知道的许多方法，就足以保健，何必浪费时间在这方面。就因这样想法，意志始终未能专精坚持而放弃了。</p><p>　　后来请王青风老师表演，那时我们彼此之间的<a href=\"https://www.guang5.com/rmgjc/ganqing.html\" class=\"keylink\" target=\"_blank\">感情</a>已经很深厚，所以他就特允了我的请求。一次他站在山头上，用手一指，数丈外对峰上的一棵老松即应手而倒。我童心未泯，尚惊讶地问他何以无光。他说：”我早已经告诉过你并无此事，欲练至有光，另有一番道理。“</p><p>　　这时他的大弟子亦在旁边，这个人也是道士装束，我亦请他表演。但见他用鼻孔吼气，便看到他站立之处，周遭山土转即成尘飞扬。此二次表演都是我亲眼目睹的事实，由此而相信中国武术，的确可练至甚高甚妙境界。此其一。</p><p>　　第二位所遇到的异人，在四川自流井，是由以”厚黑学“闻名之李宗吾先生所引介。李公学问、见识广博，道德亦高，世所罕见，其所著作的”厚黑学“，如其所说：”拨开黑的，让人见到真正的。“旨在讽世。我在自流井遇到他的时候，就说在附近赵家仑乡下，有一位八十多岁的老先生，是得到武当内家武功的真传，轻功已经到了”踏雪无痕“的境界。如果随他学习，只须三年的时间便可有成就。因为这位老人的师父籍贯浙江，所以亦欲授一浙籍弟子，以报师恩。知道我是浙江人，故愿为引介。</p><p>　　于是我们坐”滑杆“下乡去拜访，相谈之下，连称”有缘“。老人见我对于飞檐走壁之事，心存怀疑，不大相信。他洒然一笑之后，即疾行一里多路，又快步走回来，这时刚好新雨初晴，地上泥泞，老人脚上穿的一双白底新靴，一趟回来后，鞋底一点也没有被泥染污。而且他在起步时，未见拿架作势，洒然来去自如。他又问欲见走壁的身手否？ 随即见他张臂贴壁，亦未有任何架势，人已离地拔高，笑说：”你现在相信吧！ 亦愿学否？“并称说学这些功夫只有七十二诀，归纳成七十二字，一字一诀，一字一姿势，循序渐进，无需广场，仅楼阁之上，即敷应用，若愿住三年，即可示教。我当时考虑再三，复因恐怕自己志趣不专，弄得百事无成，故只得婉辞。后一路代觅可传的人，却没有找到，至今心中仍挂念遗憾。”</p><p>　　“有的众生，直接吃种种草木，紫芝<a href=\"https://www.guang5.com/sushi/yaoshan/huangjing/\" class=\"keylink\" target=\"_blank\">黄精</a>、松枝柏叶等，经年累月，药道圆成，名飞行仙。</p><p>　　或有众生，吞服金石，金银铅汞，凝炼成丹。日复一日，丹道圆成，名游行仙。</p><p>　　或有众生，在动止上用功，久而久之，气精圆成，名空行仙。”</p><p>　　宣化上人解释道：“怎么’炼精化气‘呢？他就打坐，想自己这个精。他叫他这个精不走--不接近女人，这个精就不走了--不走，这个精回来，就变成气。这个气散到周身上，这叫”炼精化气“。他都做这么一种存想，就像鸡菢鸡蛋，菢小鸡子似的，总这么想。想自己这个精怎么样化成气，气散之于周身，然后又变成个神了。这么样子”炼神还虚“，炼神和虚空一样。”炼虚还无“，又到那个无了，什么也没有了。这时候他觉着很自在的，可以出玄入牝--这是道教讲的。</p><p>　　你没看见道教《无上玉皇心印妙经》上说：’上药三品，神与气精。恍恍惚惚，杳杳冥冥。存无守有，顷刻而成。回风混合，百日功灵。默朝上帝，一纪飞升。知者易悟，昧者难行。履践天光，呼吸育清。‘他这个空行仙就是到’履践天光，呼吸育清‘这种程度。我方才念这个经是道教的，这个他们认为是宝贝了。炼”炼精化气，炼气化神，炼神还虚，炼虚还无“这种的功夫，这就是空行仙。他们可以到空中去走去，可以出玄入牝。</p><p>　　所以，世间上很多奇奇怪怪的巧妙的东西，你没看现在道教有卖一本《五柳仙踪》？那画的图，这一个人头顶上出小人，小人又出小人，出了很多小人，这叫’千百亿万化身‘。实际上，这完全是着相的，千百亿万化身不需要这样麻烦去化的。那是随意变化的，不是有一定的。”</p><p>　　“在津液上用功，勤修不息，润德圆成，名天行仙。”</p><p>　　“怎么叫’津‘呢？由你舌头抬起来，舌尖顶上颚，这就有津在上边下来。这个’津‘，外道又叫”甘露水“，又叫’天河水‘，很多的名称。你把它咽到肚里去，这叫’液‘。这’津液‘其实是一个，津也就是液，液也就是津。这种津液，道教有很多的名称，就是叫长生不老药。说你吃这个，就可以长生不老的。’欲要长生不老，需要还精补脑。‘观想把这个精运到头上去，补自己的脑，道教有这种的功夫。”</p><p>　　“吸取天气之精华，以养色身，精粹圆成，名通行仙。”</p><p>　　“他怎么样吸取日精月华呢？他一早起对着太阳，要吸三百六十口气；晚间对着太阴，又吸三百六十口气。这么样专门炼这个臭皮囊的--这个身体叫臭皮囊，这是一个皮袋，里边是臭的。所以<a href=\"https://www.guang5.com/rmgjc/xuyun.html\" class=\"keylink\" target=\"_blank\">虚云</a>老和尚做一个’皮袋歌‘，就是说这个身体是臭皮囊。他专门在这个上用功夫，不晓得在自性上用功夫。</p><p>　　所以道教和佛教相差就是这一点，一个在有形上用功夫，一个在无形上用功夫，所以就一个有执着，一个没有执着。本来仙道和佛教相通着的，他这些功夫，修行也都可以用的，但是他执着了，就专门执着到相上。因为着相，他就有了挂碍：’你一定要怎么样子，怎么样子……‘有所挂碍，所以就不能脱出这个究竟的轮回，不能彻底了脱。”</p><p>　　“通过修习种种咒术禁戒，精勤不止，术法圆成，名道行仙。”</p><p>　　“他用坚固心来念这个咒。这个好像什么呢？好像西藏那些个喇嘛，就都有这种的情形，修成功的，他们都可以叫”道行仙“。那么念一种咒，又持这个禁戒，而不休息，也是久而久之，他修炼这个法术也成就了，这个名字就叫”道行仙“。”</p><p>　　“修行思念，勤行不息，经年累月，思忆圆成，名照行仙。”</p><p>　　“他坚固一种思念，就是有一种存想，也不休息。他成就了，就有一种光明。他思想自己总化成一种金光，久而久之，也就像那个鸡菢鸡蛋，猫在那儿捕鼠似的，都这么等着等着的。他成就了，这叫照行仙，他也有光的。”</p><p>　　“修行交遘，感应圆成，名精行仙。 ”</p><p>　　“普通是男女有一种性行为，这叫’交遘（ɡòu）‘。可是在这儿，并不是有男女的性行为，这是自己本身的，他们叫”婴儿姹女“，不是向外边去找的。每一人自己本身上有婴儿姹女。这是说这个”坎、离“--这讲到中国的卦爻上，”离中虚，坎中满“。坎卦就是”姹（chà）女“，离卦就是”婴儿“。</p><p>　　八卦--”乾、坎、艮（ɡěn）、震、巽（xùn）、离、坤、兑（duì）“，最初是乾卦。乾卦是”乾三连“，三横是连着的。乾为大父，坤为大母。坤卦是”坤六断“，三连就变成了六断。男子到十六岁的时候，这乾卦满了。满了就会损，损了变什么呢？乾三连就变了离中虚。那乾卦中间这一点阳，到什么地方去了呢？就到坤六断那个中间去了。所以乾卦一变，就变成一个离中虚；坤卦一变，就变成坎中满。这个”离中虚“，就叫它”婴儿“，”坎中满“就叫它”姹女“。</p><p>　　离中虚属于心，坎中满属于肾。这个”交遘“是自己本身心肾交遘，也就拿它比方男女性行为一样的，所以叫交遘。离是属阳的，但是阳中有阴；坎是属阴的，但是阴中有阳。</p><p>　　离卦，怎么说它阳中有阴？因为它离中虚了，阳中有阴。坎卦，怎么说阴中有阳呢？就是它坎中满，中间那一横连上了，那叫属阳的。所以这也就比方婴儿姹女。</p><p>　　道教讲”婴儿姹女“，说：”婴儿并姹女，相逢在黄庭。“黄庭是什么呢？就是意，就是第六意识。意，就是属于脾经，脾藏意的。所以这个道理，若往详细了讲，那多得不得了。我的时间太不够了，所以我没有法子讲那么多。道教，就是修这个交遘的法门。而一般邪知邪见的人，看见《楞严经》上说是”交遘“，就以为男女在一起胡混也可以修道呢！就乱来了，所以就一点戒律也不守了！就因为这个。唉，不要讲太多了！”</p><p>　　“参悟变化，觉悟圆成，名绝行仙。”</p><p>　　“这种功夫成就了，他就觉悟一切造化的道理了。什么造化的道理呢？这种仙，他能够’移山倒海‘，可以把北边的山搬到南边去，南边的山又搬到北边去；把东海搬到西海，西海搬到东海。可以互相调换位置，他有这种变化的能力。又有’变易四时‘的能力。怎么样变易四时呢？冬天，冷的地方本来没有东西生，他随时可以叫所种的东西生出来，在这冷的地方而冻不死。最冷的地方，他可以把它变成最热的地方；最热的地方，又可以把它变成最冷的地方。也就是春天，他可以把它变成冬天；夏天最热了，他可以把它变成冬天。春天，是万物发生的时候，他可以把这个春天变成秋天，变成万物枯藁的一个时候。他能够把这四时都给变化了。他为什么能这样呢？因为他觉悟了造化的道理，他能以夺天地造化的功用，把造化的这种功能做为自己的本能。这叫’绝行仙‘。”</p><p>　　提到神仙，大家最熟悉的，莫过于那位“狗咬吕洞宾，不识好人心”中的吕洞斌了。这个吕洞宾，应该就属于绝行仙这类的。下面，我们来讲讲这位“好人”的故事。</p><p>　　吕洞宾本名吕绍先，唐太宗贞观二十年（公元646）四月十四日巳时，出生于河中府永乐县。今山西芮城。他自幼勤奋好学，却屡试不第。武则天天授二年（公元691），年已四十六岁的吕洞斌又去长安应考。在酒肆中，他看见一个道士在墙壁上题了三首诗。因为唐朝诗风盛行，文人们经常在酒肆中饮酒赋诗，得意之做顺手就题在墙壁上。吕洞宾走过去观看。</p><p>　　只见道士写道：“坐卧长携酒一壶，不教双眼识皇都。乾坤许大无名姓，疏散人间一丈夫。”</p><p>　　第二首写道：“得道真仙不易逢，几时归去愿相从。古言住处连沧海，别是蓬莱第一峰。”</p><p>　　第三首写道：“莫厌追欢笑语频，寻思离乱可伤神。闲来屈指从头数，待到清平有凡人。”</p><p>　　洞斌读后，啧啧称叹。道士让洞斌也赋一首。洞斌随手写道：“生自儒家遇太平，悬缨垂带布衣轻。谁能世上争名利，臣事玉皇归上清。”道士读罢，也连连叫好。两人交谈甚欢，于是同在这家酒肆中住下。</p><p>　　这道士自称钟离权，住在终南山。道士见洞宾旅途劳累，就让洞宾先休息，自己亲自为洞宾煮饭。洞宾躺在床上，恍惚间，觉得自己此次应试，一举中了状元。骑马游街，赴琼林宴，十分得意。然后开始做官，先是做地方官，后来又调入朝中，做了翰林。还娶了两房夫人，都是有钱有势的千金小姐。后来子孙满堂，而且个个出息。最后官做到宰相，一人之下，万人之上。宰相一做做了十年，势炎熏天。但是伴君如伴虎，忽然触犯天颜，被撤职抄家。一家大小充军的军充，流放的流放，只剩自己一个孤零零的老人，一时间悲不自已，一头撞了墙。头才一碰壁，突然醒了过来。这才知道，原来是一场梦。惊恐之余，四下里一看，见道士钟离权还在煮饭。</p><p>　　道士看着他笑笑，然后吟了两句诗：“黄粱犹未熟，一梦到华胥。”意思是说我的<a href=\"https://www.guang5.com/sushi/wgzl/huangmi/\" class=\"keylink\" target=\"_blank\">黄米</a>饭还没煮熟呢，你都梦到华胥国去了。接着说道：“你一生极尽荣华富贵，升降沉浮，但只不过像做了一场梦一样。”吕洞宾大惊：“道长连我做梦也知，真是神仙下凡了！”</p><p>　　经历了这场大梦，吕洞宾终于大彻大悟，不再贪恋世间的功名利禄，决心要跟钟离权学道。钟离权却推托道：“你仙骨没长全，志行未能坚定，想要超越俗世，还须重新投生再过几辈子。”吕洞宾却坚持一定要今生成仙。钟离权只是笑而不语，于是开始了“十试吕洞宾”。</p><p>　　一天，吕洞宾外出回家后，见全家人突然全都病逝。吕洞宾看破尘世，所以也不悲悼，只是买来棺木准备收殓尸体，家人却一下都活了过来。原来，这是钟离权对他的第一次考验。</p><p>　　又有一次，吕洞宾弄些东西到市集上去卖。讲好了价钱，对方收下货物却突然反悔，只愿付给一半的货价。他也不加计较。这是第二次考验。</p><p>　　大年初一那天，他家来了个乞丐，靠在大门上讨钱。吕洞宾给了他钱。谁知，那乞丐贪心不足，讨了这件讨那件，给得慢一点，便破口大骂。吕洞宾不但不生气，反而一再作揖陪好话，那乞丐这才笑着走了。这是第三次考验。</p><p>　　第四次，洞宾在山中放羊，突然跑出一只老虎来。吕洞宾忙将身体挡在羊群前面，情愿自己喂虎，也要救这群羊。老虎见了这架势，却扭头走了。</p><p>　　第五次，洞宾独自在山中的茅草棚中读书，突然来了-位女子，大约十七八岁的年纪，长得羞花闭月，倾国倾城。她自称是回娘家去，错过了路头，要借宿一晚。洞宾便让她进屋休息。谁知半夜里，这女子百般勾引，洞宾心如止水，丝毫不为所动。</p><p>　　第六次，洞宾家中遭窃，所有的财产都被席卷一空。洞宾不气不恼，操起药锄，开始靠采药度日。谁知一锄下去，竟然挖出几十块金子。他急忙将土掩上，一无所取。</p><p>　　第七次，洞宾在街上买了几件铜器，拿回家一看，却是金器。他急忙找到原来的店家，将金器如数退回。</p><p>　　有一天，集市上来了一个疯疯癫癫的道士，他说：“我有神药，吃了以后，立即就会死，但下一辈子就能得道成仙。”洞宾深信不疑，马上买回药吃了下去，竟然安然无恙。这是第八次考验。</p><p>　　开春后，春水暴涨，洞宾乘船渡河。船到中流，突然刮起大风，小船眼看就要倾覆，洞斌一心求仙，早已将生死置之度外，所以端坐船头，毫无惧色。转眼间风平浪静。这是第九次考验了。</p><p>　　这一日，吕洞宾独坐家中，忽然见无数奇形怪状的鬼魅跑出来，有想抓他的，有想杀他的，洞宾毫不畏惧。过了一会儿，只见几十个夜叉，押着个血肉淋漓的囚犯，那人口中大叫道：“我是被你上辈子杀害的人，快点偿我命来！”洞宾答道：“杀人偿命，又有什么好推辞的？”说罢便去拿刀子、绳索，准备<a href=\"https://www.guang5.com/rmgjc/zisha.html\" class=\"keylink\" target=\"_blank\">自杀</a>抵偿命债。忽听空中大喝一声，鬼魅顿时不见。一人鼓掌而下，原来是钟离权。他对吕洞宾说道：“尘心难灭，仙才难得”，我寻求徒弟的迫切，更过于别人求我。现在十次考验，你都能经受得住，以后得道，是必定无疑了。只是你功德善行都没能完满，现在且传授你个点石成金的黄白之术，你可以用它来救济世人。待三千功德完满，我再来度你成仙。“洞宾问道：”用黄白之术做成的黄金，以后还会有变回去吗？“钟离答道：”三千年后，仍要变回原样。“洞宾道：”这样，此物会贻误三千年后的人，我不愿学。“钟离权呵呵笑道：”凭你这善心，三千功德就已圆满了。“于是，钟离权收洞宾为徒，教他法术，降妖伏魔，济世救人，最后终于得道成仙。</p><p>　　接下来的事情，我听<a href=\"https://www.guang5.com/fjrw/jsrw/yuanyinlaoren/\" class=\"keylink\" target=\"_blank\">元音老人</a>来给我们讲：</p><p>　　”吕纯阳祖师修道有成后，四方云游。一次，走到了黄龙山，看见山顶上有紫云结盖。这是瑞光，一般人是看不到的，只有修道人才能看得见。他知道山上有得道高人，于是上山参访。到了山上，看见一座寺院。这时，维那师正拈香请黄龙祖师出来说法。吕纯阳赶忙进入殿内。黄龙祖师上了法座之后，厉声说：’座旁有窃法者！‘吕纯阳一听，心想：哎呀，这是说我呢，你们都是和尚，只有我是道士，本来想听听你说些什么，既然说我窃法，那我也就不客气了，不妨和你较量较量。因为吕纯阳已证得阳神了，以道教来看，这是最高境界了。艺高人胆大，吕纯阳毅然从僧群中站出来，问道：’一粒粟中藏世界，半升铛内煮山川。且道此意如何？‘</p><p>　　粟是米，一粒米这么小，而世界这么大，如何能藏进去呢？铛是锅，只能煮半升米的锅，一升米都煮不下，怎么能把大山大河放在里面煮呢？因为道教注重神通变化，他可以把一粒米放大笼罩著这个世界，也可以把山水缩小，把锅放大，在锅内煮山川。吕纯阳就拿这个偈子来试探黄龙祖师。</p><p>　　祖师一听，知道吕纯阳还没有证到根本，却落到枝末神通上了，至此还痴迷不悟。于是，指著吕纯阳说：’这守尸鬼！‘吕纯阳一听，哈哈大笑说：’争奈囊中有长生不死药！‘</p><p>　　这句话含有两种意思。一是道家炼外丹（采药，采丹砂，即朱砂这类东西。立炉鼎，炼出外丹），吃下去，可长生不老，肉身不坏。所谓囊中就是口袋里面。另一种是内丹成就，炼精气神，采大药炼成大丹，即所谓金丹，化成婴儿，为金刚不坏的阳神。这个囊就是臭皮囊，即我们的肉身。</p><p>　　吕纯阳认为自己已阳神成就，是金刚不坏身，已不是守尸鬼了。岂不知阳神并不究竟。阳神是什么？阳神就是佛教里所说的意生身，即第七识（末那识）所生起之身，还是虚幻的识神。我们凡夫的眼耳鼻舌身意六根，总要对外面环境的色声香味触法六尘，生起色受想行识<a href=\"https://www.guang5.com/rmgjc/wuyun.html\" class=\"keylink\" target=\"_blank\">五蕴</a>。这五蕴烦恼就把第七识盖覆住，不得自由，出不来。烦恼越多，压得越深，封得越死。这个第七识，它是染净依。意思是你染它跟著你染，你净它跟著你净。前面六根受外面六尘所染，著相了，五蕴烦恼纷纷扬扬，分别作用，第七识就不得自由，不得清净。倘若我们能明悟一切事物皆如空花水月，虚幻而不可得，一放一切放，空净无染，将覆盖在第七识上面的污染销光，第七识就获得自由了。你不要它出来，它也自然而然地出来了。</p><p>　　而道教不明白这个根本原理，用强制的观想功夫，在定中生出这个意造的阳神，所以它并不究竟。《金刚经》说：’凡所有相，皆是虚妄。‘凡有相者，有生必有灭，有成必有坏，决不会永远不坏，这是最辩证的。</p><p>　　所以，黄龙祖师指著吕纯阳祖师说：’饶经八万劫，终是落空亡。‘</p><p>　　意思是，你纵然活得比世人长寿得多，能活八万个大劫，最后还是要毁灭，不可能永远不坏。因为你还没有见到阳神的本体--佛性，还在弄识神啊！玄沙大师说过：’修道之人不识真，只为从来认识神。无始劫来生死本，痴人唤作本来人！‘这个’真‘就是指佛性。意思是修道之人没见到自己的根本，没见到性这个万能体，而著相于些小神通上，玩弄识神，误以为已得根本，以致步入歧途，生死不了。前面我们讲过，性喻水，识神喻水起的波浪。水是根本，波浪是枝末。修道人没有认清水的湿性，而只认得波浪的动态，即只知波浪而不识生起波浪之水，所以错了。</p><p>　　纯阳祖师一听，怎么终是落空亡啊？心里很不痛快，我明明阳神已成就了，已成金刚不坏身了，怎么还说我落空亡呢？纯阳祖师身后背著一把宝剑，他突然拔出宝剑，飞剑斩黄龙。黄龙祖师哈哈大笑，顺手拿起佛台上的拂尘，轻轻一扬，’啪！‘剑落地了。</p><p>　　这是什么含义呢？’剑‘、’见‘谐音，表示见堕。意思是纯阳祖师的知见落于下风，打了败仗。纯阳祖师赶忙退下来，给黄龙祖师顶礼，并请开示。</p><p>　　黄龙祖师看他趾高气扬的神气终于变了，能虚心下气，能放下来了。于是，拿他的问题反问道：’“半升铛内煮山川”即不问，如何是“一粒粟中藏世界”？‘经此一点，纯阳祖师当下就开悟了。</p><p>　　纯阳祖师过去修道执著追求的是神通、出阳神。现在’见堕‘心空之后，听黄龙祖师一开示，啊！他悟到了一切法都不可得，一切都是无相的性的显现，都是性的作用，唯有性是真，其他皆假。纯阳祖师到这里才真悟道，所以他作偈云：’弃却瓢囊摵碎琴，如今不恋汞中金。自从一见黄龙后，始觉从前错用心。‘“</p><p>　　这就是绝行仙吕洞宾从成仙到得度的过程。</p><p>　　如来继续说道：”阿难！这些都是在人道中炼心的人。他们居住在深山海岛中，远绝人寰，寿命动辄千万岁。然而，由于不知道真如本心的所在，始终随着妄想流转，终究免不了轮回。仙报享尽，还要散落到其他诸趣中去。“</p><h3>　　佛陀的世界</h3><p>　　在介绍天道之前，我们先了解一下佛陀眼中，世界的结构。</p><p>　　世界的中心是须弥山。日月围绕着须弥山的山腰运行。</p><p>　　日月之下，是交错分部的七重金山和七重香水海。第七重金山之外，是咸海。在咸海中，有四大部洲。这四大部洲，就是人道的居所。它们分别为东胜神洲、西牛贺洲、南赡部洲、北俱卢洲。我们就是处在南赡部洲。咸海之外是大铁围山。</p><p>　　日月之上则是天道。四天王天在须弥山的半山腰。忉利天则在须弥山的山顶。再往上是欲界的其他四天--夜摩天、兜率天、化乐天和他化自在天。</p><p>　　这样一个结构，再在上面加上初禅的三层天，是一个单元世界。一千个单元世界，再在上面加上二禅的三层天是一个小千世界。一千个小千世界，再加上三禅的三层天是一个中千世界。一千个中千世界，再加上四禅的三层天是一个大千世界。</p><p>　　而像这样的大千世界，有恒河沙数那么多，这是一尊佛的教化范围，也就是一方佛土。</p><p>　　这样的世界结构，跟我们所熟知的科学所描述的宇宙截然不同。毕竟科学对宇宙的探索，才几百年的时间，而且又仅限于三维空间中，所以对宇宙的认识还十分有限的。而佛陀眼中的世界，则是一切空间同时存在，所有的一切尽收眼底，所以看到的跟科学目前的发现当然不同。</p><p>　　那么，空间的维度到底是怎么回事呢？不搞清楚这个问题，对佛陀说的这些，我们看不见摸不着的事情，总是觉得难以相信。下面，我们就来了解一下多维空间的概念。</p><p>　　一维空间就是一条直线；二维空间则是由长和宽确定的平面；三维空间就是在平面的基础上，再加一个高，形成一个就是立体。我们所能看到的，仅限于三维以下，再多的我们就看不到了，而只能通过思维，用复杂的数学演算去把握。</p><p>　　二维平面中的世界，只是三维物体在平面上的投影。所以，设想一下，如果二维的平面中也有生命，他们恐怕怎么也理解不了，四个桌角为什么不论怎样移动，都能保持相同的距离；断断续续的脚印，为什么自己就移动。直到有一天，有个聪明的二维人提出，或许在平面世界之外，还有一个向上的第三维--高，这一切才迎刃而解。原来，四个桌角还支撑着一个方桌；断断续续的脚印外，还有一个人在走动。</p><p>　　我们理解不了的许多问题，也许就如同二维人看三维世界一样，只是因为缺乏了必要的第四维乃至更多维。</p><p>　　广义相对论说，引力是空间的几何形变所引起的结果。当没有任何物质或能量存在时，空间应该是平直光滑的。当一个大质量物体进入空间后，空间就发生了弯曲，就像一条很平的床单上，放进一个保龄球时，床单就凹下去一样，引力就是这样的空间弯曲所导致的。地球在绕着太阳的轨道上运行，是因为地球滚入了太阳周边弯曲的空间，这就是我们通常所说的太阳对地球的引力。两个人、两块大石头之间的引力几乎不存在，是因为这么小的质量使空间的弯曲几乎为零。</p><p>　　但是空间的几何形变却解释不了其它三种力，电磁力、强力和弱力。在微观世界里，空间根本就不是平滑的，而是有无数的粒子在剧烈且永不停息地喧嚣。广义相对论的核心原理--光滑的空间几何概念，在这里被破坏殆尽。</p><p>　　对另外三种力的解释，需要量子理论来完成。在这个理论体系中，宇宙中所有的物质最终由数百种不同的基本粒子组成。在这里，力是由粒子的交换而来的。电磁力是由光子交换而来，弱力是由弱规范玻色子交换而来，强力是由胶子交换而来。例如，两个带电粒子间的相互作用实际上是光子在两个粒子间往来”出没“的结果，两个带电粒子通过交换小小的光子而相互影响。这个过程有点儿像两个溜冰的人在传球，通过传球，两个人的运动状态都在受到影响。其它两种力的相互作用也是如此。</p><p>　　但是，因空间弯曲所导致的引力是， 无法通过粒子交换而来的。而且，在微观世界里，粒子的自身质量不仅小到几乎没有，还总是在杂乱无章地运动，它们之间的引力从何谈起？因此，量子理论无法涵盖引力。</p><p>　　人们很难相信，在宇宙的微观层面和宏观层面，居然不是一个统一连贯的整体。我们对宇宙的认识，居然是由两个分裂的理论拼凑起来的。广义相对论与量子理论不能统一，成为现代物理学最核心的灾难。</p><p>　　于是，就像聪明的二维人发现了向上的第三维一样，聪明的科学家，这时提出了囊括十维空间的超弦理论。</p><p>　　弦本身很简单，就是一段弧，它可以闭合成圈，也可以打开成线。　　它可以分解成更小的弦，还可以跟其他弦碰撞，形成更大的弦。但是当它在时空中移动时，它就没那么简单了。弦的运动是如此的复杂，以至于三维空间已经无法容纳它的运动轨迹，必须有高达十维的空间才能满足它的运动。就像人的运动复杂到无法在二维平面中完成，而必须有三维空间一样。</p><p>　　与琴弦一样，不同的琴弦通过振动能产生不同的声音，而构成粒子的弦，通过不同的振动，产生的却是不同的粒子。每个基本粒子都由一根弦形成，而所有的弦都是绝对相同的。不同的基本粒子实际上是在相同的弦上弹奏着的不同的”音调“。由无数这样振动着的弦组成的宇宙，就像一支伟大的交响曲。</p><p>　　弦的振动模式与粒子的引力作用之间存在着直接的联系。同样的关联也存于其它性质的力之间。一根弦所携带的电磁力、弱力和强力也完全由它的振动模式决定。这样，广义相对论和量子力学，就在十维空间中，得到了完美的统一。</p><p>　　在超弦理论中，振动着的弦构成了世界。也许大家还记得，”全像式模型理论“恰好也把整个世界解释为”波动“，这正好与弦的振动不谋而合。不难想象，弦恰恰就是构成这个”波动“的基本单位。而”全像式模型理论“却正是佛法的科学表达。这样，佛法就通过”全像式模型理论“，经由弦的振动，与量子力学和广义相对论所代表的现代物理学，达成了伟大的统一。</p><p>　　科学对世界的描述，离我们的感知越来越远，却离真理越来越近。我们看不到原子分子，而科学却证实，一切正由它们构成；我们看不到地球的全貌，而科学却证实，我们就生活在其中；我们看不到宇宙空间，而科学却证实，地球就是宇宙的一份子；我们看不到须弥山，二十八层天，梵王帝释，鬼神精灵，但是随着科学的发展，迟早有一天，这些也会像地球宇宙和原子分子一样被我们所熟知，而成为我们生活的一部分。</p><p>　　下面，我们还是借助佛陀的描述，去游历二十八层天吧！</p><h3>　　天趣之六欲天</h3><p>　　1四王天</p><p>　　如来继续说道：”阿难！尘世间的人，不想常住在人世间，但又不能割舍夫妻之事的。他的心中因为从无邪淫的念头，所以心不流逸，澄莹光洁。命终之后，生到与日月相邻的地方。这一类众生，叫四天王天。“</p><p>　　四天王天在须弥山的半山腰，离人间四万二千由旬。从科学的角度来看，这应该说的是另一个空间的事情。由旬是古印度的长度单位，一由旬约为十六公里。这个天有四位天王，东方的天王叫持国天王，南方是<a href=\"https://www.guang5.com/fjrw/zhufopusa/hufatianwang/67062.html\" class=\"keylink\" target=\"_blank\">增长天王</a>，西方是广目天王，北方是多闻天王。这里人的寿命是五百岁。人间的五十年是四王天的一昼夜。四王天和我们这个世界最接近。人世间的善恶，都由四大王天来管。</p><p>　　2忉利天</p><p>　　”对自己的妻子，欲望也很淡薄。但是一个人独居的时候，偶尔还是有淫欲生起，还没有真正清净。这样的人，命终之后，超越日月的光明，居住在人间之巅。这一类，名忉利天。“</p><p>　　忉利天是梵语，翻到中文叫”三十三天“。 此天离地八万四千由旬。 对此，宣化上人解释道：</p><p>　　”我们人为什么淫欲心那么重？情爱的心那么重？就因为业障重。你若业障轻，就不会有这种心了。这个业障重，它赘着你，就叫你一天到晚都想这个事情，没有停止的时候。在业障重的时候，你就应该生出一种觉悟心：“啊，业障这么重！”就应该要减低这业障。如果你跟着业障跑，越造越深，越堕落越深，将来一定变牛、变马、变猪、变狗去。为什么？你情欲心太重了，一定会堕落的！所以这很危险的。我们无论任何人，如果情欲心重，赶快要把它放下来。情欲心重的人，将来一定做畜生的，这一点疑问都没有！</p><p>　　怎么叫三十三天呢？因为东有八天、南有八天、北有八天、西有八天，这四八三十二天。忉利天在三十二天的中间，所以它叫三十三天。这个三十三天的天主怎么样做呢？</p><p>　　最初，这三十三天的天主是一个穷女人，很穷很穷的。她看见有一座塔毁坏了，她说：“这个佛塔毁坏了，我发心把它重修起来！”于是她就各处去乞讨连带做工，做了很多年工，赚了很多钱。她又有三十二个朋友，大家就开一个会，一齐商量，说：“我们一人出一点钱把这座塔造起来。”于是集三十三个人的力量，把这座塔造成功了。等她们死后，那三十二个人做三十二天的天主，这个为首的人就做三十三天的天主了。所以这是三十三天天主的来历。“</p><p>　　这忉利天的天人，身高一百五十丈。他们以人间的一百年做为一昼夜，寿命是一千岁。</p><p>　　3焰摩天</p><p>　　”夫妻之间，虽然有短暂的交合，但是过去以后，心中毫无留碍。对人间的尘事，沾染的少，清净的时候多。这样的人，命终之后，在虚空中朗然安住。日月的光明都照不到这里，他们本身自然就有光明。这一层天，叫须焰摩天。“</p><p>　　这是六欲天的第三天，又叫”夜摩天“。 此天离地十六万由旬，约一百六十万公里。</p><p>　　”夜摩天又叫’须焰摩天‘，翻译成中文叫’善时分‘。说那个地方那个时候非常好。为什么？它没有昼，没有夜，总是光明的。那么它以什么为昼夜呢？以莲花开合，作为它的昼夜。莲花开的时候，这就是昼；莲花合上了，这就是夜。没有黑暗，没有白天，没有昼夜的分别，都是光明的。每个人的身体也都有光明的。这儿所住的人，他的身长有二百二十五尺，寿命就是两千岁了，比忉利天又加上一倍。所以天高一层，寿命就长一点；低一层，寿命就短一点。“</p><p>　　4兜率天</p><p>　　”心中一直都非常清净，但是夫妻之事来了，也不能拒绝，这样的人，命终之后，升到此天的外院。如果能得入内院，就能远离人间，上升到精微之处，不接下界的人天境，乃至坏劫的时候，三灾不及。如是一类，名兜率天。“</p><p>　　”这个“率”字，一般人读“帅”，应该读“律”。兜率陀天有外院、内院之分。外院就是一般凡夫所住的，内院是<a href=\"https://www.guang5.com/rmgjc/shengren.html\" class=\"keylink\" target=\"_blank\">圣人</a>所住的地方。现在弥勒菩萨就在兜率天内院那儿讲’唯心识定‘。</p><p>　　兜率天是梵语，翻译成中文叫’知足天‘，少欲知足。所以你要想做天人，就要少欲知足，这样你将来就能生到天上去。你若情欲太重，一天到晚尽想男女的性行为，时时刻刻的，甚至于一分一秒也放不下这个事情，那是很危险很危险的！人最危险的，就是这一件事，这是堕落的一个源头。你若不怕堕落，就想多一点；怕堕落，赶快就停止这种的情欲心。“</p><p>　　谈到这个情欲心，我们不妨听宣化上人讲一讲最爱太太的孙陀罗难陀的故事：</p><p>　　孙陀罗，是难陀太太的名字，翻译为好爱。她所爱着的是哪一个呢？就是难陀。又译为端正，言其相貌非常美丽。这孙陀罗长得非常美丽，可以说是印度国里边最美丽的一个女人，所以孙陀罗难陀就被她迷住了，行住坐卧，寸步不离，如胶似漆，黏到一块了。用现在的话讲，叫”出双入对“。</p><p>　　难陀是佛陀同父异母的亲弟弟。释迦牟尼佛看他的因缘成熟了，想要度他这个弟弟出家。可是他舍不得这个老婆，不肯出家。佛就设了一个方便法，选择了一天，这孙陀罗难陀夫妇正吃饭时，佛就到王宫里去化斋。难陀看见他哥哥来化缘了，一定要给他添钵。</p><p>　　佛说：”你给我送到祇桓精舍去！“他说：”那怎么可以呢？孙陀罗在家里头呢！我怎么可以出去？“但是佛说了，他又不敢违背哥哥的命令，于是就问孙陀罗：”佛叫我把这个饭送到祇桓精舍去，可以不可以呢？“孙陀罗说：”可以是可以，但是我吐一口吐沫在地上，你要在这口吐沫还没乾以前就回来。如果等我这吐沫乾了，你就不要进门了！“孙陀罗难陀就答应她说：”好！我送饭到祇桓精舍，来回也不需要多少时间，大约你这口吐沫还不会乾的。“所以就放心地去祇桓精舍了。</p><p>　　你说，到了祇桓精舍后怎么样呢？佛就不准他回去了，就叫他出家，硬把他的头给剃了。虽然已经出家，孙陀罗难陀一天到晚找机会，想偷着跑回去。为什么要跑回去呢？就舍不得这个孙陀罗。</p><p>　　有一天，所有的比丘都到街上去化缘了，释迦牟尼佛就吩附孙陀罗难陀说：”你今天要看好门，哪里也不可以去！你在精舍里边打扫，把所有的地方都收拾干净了，我们去化斋回来给你吃！“孙陀罗难陀高兴得不得了，哈！这回你们可都走了，我有机会逃跑了！等一等我就一定跑了！于是等人都走了，他就在家里收拾地方。你说奇怪不奇怪？他把这个地方扫干净了，那个地方又有尘土了；把那个地方扫干净了，这个地方又有风刮来一些叶子什么的。他扫了一上午，扫来扫去，累出一身汗，也没把这个地扫干净。甚至去关窗门，这个窗刚关好，那个窗又开了；那个窗刚关上，另一个窗又开了，总有很多麻烦。所以这一上午也没有跑成。</p><p>　　他一看时间不早了，现在应该跑了，如果现在不跑，就没有机会了。于是他就从祇桓精舍往皇宫的方向跑出来。跑的时候，他就想：”不要碰到佛，碰到佛呢，就跑不了了。“他又想：”佛都是走大路，不走小路。今天我就走小路，从小路逃回王宫去！“殊不知，他走小路，佛也从小路回来了。他一看佛来了，就躲在一棵大树后边，躲着不叫佛看见。他往这边躲，佛就往这边走；往那边躲，佛就往那边走。最后还是给佛看见他了。佛就问他：”你干什么呢？“他说：”我等佛呢。你总也不回来，我现在来迎接佛回祇桓精舍。“佛说：”好，那好！跟着我一起回去啦！“</p><p>　　本来要跑，这回又没有法子跑，又跟着佛回来了。吃过饭，佛说：”你愿不愿意出去各处去看一看啊？我带你出去玩一玩！“难陀心里想：”我哪有心情出去玩？我一天到晚要跑回家，我怎么有闲心各处去玩呢？“不过佛叫到了，他是弟弟，佛是哥哥，他也不敢违抗命令，于是就勉强跟着佛走。</p><p>　　他们走到了一座山上，见着很多马猴子，佛就问：”你来比较一下，是孙陀罗美丽，还是猴子美丽？“难陀说：”当然是孙陀罗美丽了！猴子长得那么丑怪，怎么可以比得了孙陀罗呢？那简直就等于侮辱孙陀罗一样嘛！“佛说：”啊！你真的很聪明！你知道哪个是好，哪个是不好。好！回去啦！“于是就带他回来。</p><p>　　又过了几天，佛跟他说：”我看你天天这么闷闷不乐的，也不知道你想什么？我带你到天上去看看怎么样？“孙陀罗想：天上？天上又是个什么样子？好啦！又跟着佛去到天上。到了天上一看，这天宫可太美丽、太好了。又看见有一个天宫里边，有很多的天女。这些天女，啊！那可美丽得不得了。</p><p>　　佛又问他：”你说是天女美丽呀？还是孙陀罗美丽呢？“孙陀罗难陀说：”当然是这天女美丽啦！孙陀罗比较天女，那就等于马猴子比孙陀罗一样的。孙陀罗怎么可以和天女来比呢？“佛说：”喔！“他看这些天女这么美丽，佛在前面走，他在后边，偷偷地问这些个天女：”你们这儿，谁是你们的主人啊？“天女说：”我们的主人是佛的弟弟，叫孙陀罗难陀。他现在跟着佛出家修行，等到这一生完了之后，就生到这个里。我们这一些天女，都是陪伴孙陀罗难陀的。“</p><p>　　孙陀罗难陀这一回高兴了。啊！有这么多天上的美女来陪伴自己，这一定要发心修行！这回他把孙陀罗给忘了，不想孙陀罗，只想这一些个天女了。</p><p>　　他用功修行，修了很多时候，佛一看他，哦！现在不想孙陀罗了，就挂念着天女了。好！我再教你看一看奇怪的事情！有一天，佛又说：”孙陀罗难陀！天上你去过了，地狱你没有去过，我带你到地狱里去看一看，好不好？“孙陀罗难陀一听说到地狱去看，平时佛常常讲地狱是不好的地方，他知道是很不好的。”这地狱有什么好看的？“佛说：”你去看一看、参观参观！你没有见过！“他就跟着佛到地狱去了。</p><p>　　到了地狱一看，到处是刀山、剑树、油锅、火汤……，什么地狱都看见了。但是看见一个地狱里，有一个锅油。这一锅油很满的，有两个鬼在这地方看着这个油锅。这油锅底下的火，又好像着、又好像要灭的样子。两个鬼，一个坐在那个地方打瞌睡，要睡着的样子；另一个鬼，简直就躺在那地方睡觉了。”这两个鬼真是懒鬼！这烧油锅都不把它烧滚了，就光想睡觉！“于是他就问这个要睡着的鬼，说：”鬼大哥！你做这个工作，有人管着你，还是没有人管着你啊？怎么你这么自由，在这儿睡觉都可以呢？“这个鬼打了一个哈欠：”啊──“揉揉眼睛，说：”你说什么？“”我问你，你在这个地方做工，怎么不好好做，尽睡觉呢？你烧油锅，应该把它烧滚了才对的。“ 这个鬼说：”你知道什么！到这油锅受罪的这个人，离他到这里来受罪的时间，还很远呢！“”怎么很远呢？“他说：”因为佛有一个弟弟叫孙陀罗难陀，他现在已经跟着佛出家了。他修天福，将来生天。等天福享尽的时候，他就要堕地狱，就下到这个油锅里。因为他不正经修道，就要到这个油锅里来，用油来炸他！因为距现在还有几百年的时间，我们现在何必忙着把这油锅烧滚它？所以我们的工作很清闲的，天天都可以睡觉。“</p><p>　　孙陀罗难陀一听，骇得周身都飙冷汗：”哦！这个油锅，原来就是给我预备的！“于是佛把他带回来，就给他说苦、空、无常、无我的法门。他就修这个佛法，而证得罗汉果。</p><p>　　5化乐天</p><p>　　”本身没有欲心，只是为了应付尘缘而行房事。在行事的时候，味如嚼蜡。这样的人，命终之后，生到化乐无穷的地方，这一类众生，叫乐变化天。“</p><p>　　这个地方，所有的一切一切都是变化出来的。而且非常之快乐。这种乐，不是男女行为的那种乐，这是天然的一种快乐。此天离地六十四万由旬，那里的地面就像云一样，天人在上面安住。他们身长三百七十五丈。以人间八百年，为一昼夜，寿八千岁。</p><p>　　6他化天</p><p>　　”根本没有尘世的淫欲心，只是随顺世间行事而已。在行欲事的时候，了然超越。命终之后，就能超越一切化境。如是一类，名他化自在天。“</p><p>　　”怎么叫’他化自在天‘呢？他一切的东西，都不是他自己本天所变化出来的，都是其他的天变化而供养他的。在那个地方，非常自在、非常快乐，什么工也不要做。那个地方没有人用工人，工人在那地方都要饿死的。那里什么都是自自在在的，自然快乐无边，比人间可好得多了。可是虽然那么好，将来天福享尽，寿命终了，还会堕落到人间或者地狱里去，这没有一定的。他身的高度有多少高呢？有四百五十丈那么高。以人间一千六百年，做为他化自在天的一昼夜，他的寿命有一万六千岁。</p><p>　　这是’六欲天‘，所以虽然生到天上，他们还都有淫欲心。我写那个偈诵说：</p><p>　　四王忉利欲交抱　夜摩执手兜率笑</p><p>　　化乐熟视他暂视　此是六天之欲乐</p><p>　　’四王忉利欲交抱‘，四天王和忉利天这天人行淫欲，和我们人间是一样的，男女抱到一起。’夜摩执手兜率笑‘，夜摩天男女行淫欲的时候，心交形不交。怎么心交呢？就是握一握手，这就做为一种男女的淫欲了。兜率天呢？就笑一笑，男女对面那么一笑，这就算行淫欲了，这所谓’神交身不交‘了。化乐天呢？这男女就是对着这么望一望，笑都不笑了。熟视，望了大约或者三分钟或者五分钟，这就算行淫欲了。他化自在天，就这么一看就得了。不是看五分钟，就这么一秒钟，一看，这就算了。因为他淫欲的念头轻了，所以一层天比一层天就少。</p><p>　　这是一个真正的道理，我们研究佛法，一定要把这些个道理弄清楚了，然后你才能真正了解佛法，真正知道：’喔，这个淫欲，原来是这么大的害处！‘所以前边不讲，菩萨看男女的淫欲行为，就像看见毒蛇了一样，一定会被咬死的。你凡夫的肉眼不知道这么厉害，所以就这么样子昼夜求之，白天晚间都想这个坏事情，那么放不下。你若真正知道了以后，就恐怕不会那么颠倒了。“</p><p>　　这时，如来总结道：”阿难！这六天的天人，虽然身体上逐渐没有欲行，但是心中还有淫欲的念头。所以统称为’欲界‘。“</p><h3>　　在天愿作比翼鸟，在地愿为连理枝</h3><p>　　一九八二年十月下旬，从新加坡、马来西亚、台湾、香港赶来的数百善信组团<a href=\"https://www.guang5.com/rmgjc/chaosheng.html\" class=\"keylink\" target=\"_blank\">朝圣</a>，参加万佛圣城开幕典礼。先举行一周观音七，继而展开一为期十周的精进禅七。十一月十二日晚 ，宣化上人于万佛殿向四众开示：</p><p>　　大家看看这块木头，两棵树干，却长在一起，上下枝节连着，这是什么呢？就是无量劫以前，有一对男女，彼此相爱的很深。他们发愿：”在天愿作比翼鸟，在地愿为连理枝。“这对男女一见钟情，结为夫妇。他们共同有一个嗜好，就是”钱“！男的拼命赚钱，女的拼命花钱。一个来，一个往，非常热闹。</p><p>　　可是，爱得太深，罪造的太重，生生辗转沉溺，堕落到畜生、饿鬼、地狱道。今已成草木，这两棵树干本来应是两棵，可是依然长在一起，缠绵不相舍离。你看！左根伸出一枝来交抱右根，右根又伸出一枝来拥揽左根。这就如同男女各自伸出胳臂，互相交抱。可见夙世痴爱之劣习，至今形成草木，犹不能舍！并且，这两干之中，有一块石头。他们视若珍宝，究竟这是什么呢？原来是他们往昔银行存款的簿子！</p><p>　　这棵树干，早在几年前，某次我们到城内河边说法，我就把它捡回来，你看：头也割断了，根也被刨破了，只露出赤裸枯藁的枝干，但仍然如胶似漆地纠缠在一起，这不是太可怜了吗？</p><p>　　由此可见，爱得太深，是多么的危险，这绝对不是开玩笑的！有人心想：”法师，您说这个法，我是不可能相信的，既没有根据，又不合乎逻辑。大概是您哄孩子，说梦话！“信不信由你，我也没有办法一定要你相信。因为这个法是很难说的。人迷恋到情爱上，不论你如何点醒他，他还是不能接受。</p><p>　　天下最害人的就是爱重情深。最高尚就是修清净道。人不是不知，是明知故犯，不能出离旷劫的习气。中国有句俗话：”手拿着干屎橛，你给他麻花他也不换。“这就好比人揽执情爱，你告诉他：”舍弃这个邋遢东西，修道可贵！“可是他仍会固执不肯回头，所以说：”天雨虽宽，难润无根之草；佛门虽广，难度不信之人。“</p><p>　　这块木头，我保存很久，多少人来我也不让他们看，因为说这个法他们也不相信，还要等待时机成熟。十月二十四日，诸位从远方来朝圣，我把这块木头带到万佛殿，搁了差不多三个星期犹未开口，可是若再不讲恐怕就没有时间了，所以不管诸位相信与否？我也要说出这块木头的因缘。</p><h3>　　天趣之初禅天</h3><p>　　7、梵众天</p><p>　　”阿难！世间的一切修行人，不修无漏的禅定，没有真正的智慧，只能保持自己的身体不行淫欲，在行住坐卧中，都没有染污的心，所以欲界留不住他，一念之间，上升为梵众。这一类众生，名叫梵众天。“</p><p>　　他们寿命十小劫，身长半由旬。</p><p>　　8、梵辅天</p><p>　　”欲习既然已经除去，无染的清净心现前。对于律仪，欣然顺从。是人此时，能行梵德。这类众生，名梵辅天。“</p><p>　　寿命四十小劫，身长一由旬。</p><p>　　9、大梵天</p><p>　　”身心妙圆，清净禁戒，威仪不缺，在加上内心的明悟。此人应时，就能统领梵众，为大梵王。这类众生，名大梵天。“</p><p>　　这一天的众生，寿六十小劫，身长一由旬半。</p><p>　　”阿难！这三天胜流，一切苦恼都不能逼迫。虽然不是修行正定，但他们的清净心中，对一切欲漏，都能如如不动，所以这三天，统称为’初禅‘。“</p><p>　　宣化上人讲了初禅的境界：”你修道，要是到初禅的这种境界，这个脉会停住不动弹的。所以说你有没有功夫，就看看你这个脉还有没有动。若得到初禅的境界，你的脉就停止了。身上的血脉停止了，就等于死人一样，这就是初禅。你修道要是到初禅，这还不是果位，初禅只是修行的第一步，并不是很高深的。 “</p><h3>　　天趣之二禅天</h3><p>　　10、少光天</p><p>　　”阿难！再往上的一层梵天，能统摄下面的梵人，圆满其梵行。心澄清而不动，静极而生光。这一类名少光天。“</p><p>　　11、无量光天</p><p>　　”光光相映，照耀无尽，把十方界都映得如琉璃一样透明。这类众生名无量光天。“</p><p>　　12、光音天</p><p>　　”以自身所放的光明为语言，宣布梵行。清净的光明，应用无尽。这类众生，名光音天。“</p><p>　　”阿难！这三天胜流，一切忧愁牵挂，都不能逼迫。虽然不是修行楞严大定的正行，但是清净的心中，粗漏的五欲已经降服，名为二禅。“</p><p>　　”参禅到了二禅，不但脉搏停止，连呼吸也会断了。前一个是脉断了，脉停住了。我前边不讲过，在这里边有’婴儿姹女‘？本来道教所修的功夫和佛教多少有些相同的地方，大同小异。为什么他这个脉停止了？脉若停止，这个人不就死了吗？不是的。因为他里边的自性，那个脉络行动了，所以表面上这个脉是停止了。他自性里边那真呼吸，真正的脉搏让它行起来了，所以身体这个脉停止了。禅定、禅定，这是二禅的定。得到这种清净的快乐。但是他这儿不是’诸漏已尽‘，这是“粗漏已伏”。“粗漏”就是你能觉察得到的这一些个漏。’伏‘就是降伏了。“</p><h3>　　天趣之三禅天</h3><p>　　13、少净天</p><p>　　”阿难！光明转化为声音，以这种声音，引发出微妙的精行，直通寂灭之乐。这一类众生，名少净天。“</p><p>　　14、无量净天</p><p>　　”清净的空相现前，引发无际，身心轻安，成就了寂灭之乐。这一类众生，名无量净天。“</p><p>　　对这种寂灭之乐，宣化上人解释道：”我们一般人都贪外边的色，向外边去流。’性流为情，情流为欲‘，就有这种淫欲的心生出来，一定要找一个对象，然后发泄自己这种的欲火，这是向外驰求去了！那么这个色，是不是单单要有色，才有这种境界呢？不是的。就在这个真空里边，也有这个真色。真色里边，你若明白了，也就是真空。真空妙有，也在这个地方能体验到。《<a href=\"https://www.guang5.com/fojing/xinjing/\" class=\"keylink\" target=\"_blank\">心经</a>》上说：’色不异空，空不异色；色即是空，空即是色。‘你要是得到这种寂灭乐--寂灭乐就是一个空理--得到空理这种真正的寂灭乐，那比你外边去找寻那个色，不知加几千万倍的快乐！你想要得到这种的境界，首先要停止外边这个色。你外边这个色如果不停止，你自己真空里边那种色是不会发现的。所以现在说’引发无际，身心轻安‘，这就是’色不异空，空不异色；色即是空，空即是色。‘这不能假藉的，不能说：’我也得到这个境界了！‘你得到，不是口头上讲的，真得着那才算呢！这种境界说不出来的，所以’如人饮水，冷暖自知‘。“</p><p>　　15、遍净天</p><p>　　”身心世界，圆融而清净。清净的<a href=\"https://www.guang5.com/rmgjc/dexing.html\" class=\"keylink\" target=\"_blank\">德行</a>，一切无碍，都导归寂灭之乐。这类众生，名遍净天。</p><p>　　阿难！这三天胜流，身心安隐，具有无量的快乐。虽然没有证得正定，然而安隐心中，具足了究竟的欢喜，所以叫三禅。“</p><p>　　”到这个时候，你坐到三禅的境界上，你这个念就不起了，得到一种寂灭乐。所谓“一念不生全体现，六根忽动被云遮”，你在这一念不生的时候，那就是佛的本体’全体现了‘。’六根忽动‘，可是你或者眼睛看一看，耳朵听一听，这一动，’被云遮‘，这就又生了云彩，把你自性遮上了。那么用功用到这个时候，前边身心还生心动念，譬如脉停止了：“哦，我的脉怎么停止了呢？”你这么一想，脉搏又动了。你到呼吸气停止的时候，你生了一念：“哦，我这怎么没有吸气了呢？”这么一想的时候，这个呼吸气又有了，这就叫“念没住”呢！现在到这个三禅上，脉搏、呼吸气什么也没有了，也不管它了，不再生这个念了，自己连自己这个念都没有了，都找不着了，这叫’一念不生‘。一念不生就全体现，这是三禅的境界。“</p><h3>　　天趣之四禅天</h3><p>　　16、福生天</p><p>　　”阿难！烦恼忧悬不在逼迫身心，苦的成因已经消除。然而乐也不是长住不坏的，时间久了也要变灭。苦与乐全部抛弃，这些粗重的感受都已经消灭，清净的福德性油然而生。如是一类，叫福生天。</p><p>　　17、福爱天</p><p>　　舍弃苦乐的心已经圆融无碍，清净的福德朗然无遮。得大自在，无穷无尽。这一类叫福爱天。</p><p>　　18、广果天</p><p>　　阿难！从这一层天中有二条歧路。一条是继续修证先前的无量净光，福德圆明，而安住在这个境界中。这一类名广果天。</p><p>　　19、无想天</p><p>　　一条是继续厌离苦乐，精修这个舍心，相续不断。在’舍‘道上，身心俱灭，心虑凝滞，经五百劫。因为是以生灭为因，不能发明不生灭性。所以初半劫灭，后半劫生。这一类，名无想天。</p><p>　　阿难！这四天胜流，一切世间苦乐境界都不为所动。虽然不是无为的真不动，但是那种有所得的心，已经功用纯熟，这是四禅。“</p><h3>　　天趣之五不还天</h3><p>　　”阿难！在四禅天中，还有五不还天，这里的众生把下界的一切习气，全部灭尽。苦乐双忘。所以他在下界没有可居之处，于是这些安住在同一舍心的众生，就都在这里进修圣道。</p><p>　　20、无烦天</p><p>　　阿难！苦乐两灭，心中再没有欣喜和厌离的争斗。这一类是无烦天。</p><p>　　21、无热天</p><p>　　心与境脱离，犹如箭不搭弦，再无相交之地。这一类是无热天。</p><p>　　22、善见天</p><p>　　见十方世界，澄清明朗，没有一切尘相污垢。这一类是善见天。</p><p>　　23、善现天</p><p>　　所见精微，任运自在，变现无碍。这一类是善现天。</p><p>　　24、色究竟天</p><p>　　对一切变化，究竟明了。观一切色相，本性是空。心如虚空，无边无际。这一类是色究竟天。</p><p>　　阿难！这五不还天，四禅天的四位天王，只是听说而已，也不能亲眼见到。就如同世间的旷野深山，有圣人道场，阿罗汉们在那里住持。世间的俗人不能见到一样。“</p><p>　　人间的深山中，真有圣人的道场吗？有人见过吗？真有，法照大师见到过。</p><p>　　法照大师是唐朝人，他在衡州的云峰寺时，有一天，正在斋堂用饭，忽然看见钵中有五色祥云，云中有一寺院。寺院东北有座大山，山中有一沟涧，涧北有石门。石门过去五六里，又有一寺，金匾上写着”大圣竹林寺“五个大字。过了几天，在用斋时，又在钵中看见五色云。云中有几座寺院，寺中有上万菩萨。所有池台楼观，纯是金色。大师就其所见，请教善知识。嘉延、昙晖对他说：”圣人神通变化，不能以凡情测度。但从山川形势看，象是五台山。“</p><p>　　大历四年，结夏安居时，大师在湖东寺开办<a href=\"https://www.guang5.com/fxrm/rmbd/136638.html\" class=\"keylink\" target=\"_blank\">五会念佛</a>道场。至六月二日未时，感祥云弥覆。云端中现出楼阁，阁上有几位梵僧，身高一丈有余，手执锡杖，经行修道。又见阿弥陀佛与二菩萨，身形高大，等如虚空。衡山全城，没有人看不到的，人人焚香礼拜。直到酉时圣像才隐去。六月底，大师在道场外，遇到一位老人，对他说：”你曾发愿要去金色世界，礼拜文殊大圣，为什么还不去？“大师说：”时事动荡，道路艰难，无法上路。“老人说：”只管早去，路上决不会有困难。“说完，就不见了。大师非常惊异，于是进入道场，诚心发愿：愿以此身，奉献于瞻礼文殊大圣，夏天结束就起身，任凭火烧冰冻，决不退转。</p><p>　　八月十三日，大师和几位同道从南岳出发，一路上果然毫无阻碍。大历五年四月五日，大师一行到达五台县，远远望见佛光寺南边有几道白光。六日，他们抵达佛光寺，所见的景色果然与钵中一样。这夜四更，又有异光从北山下来，直射大师身上。大师连忙进入<a href=\"https://www.guang5.com/nf/index.html\" class=\"keylink\" target=\"_blank\">念佛堂</a>，请问此事？一个僧人回答说：”这是文殊大圣的不思议光，常常照注有缘众生。“大师听说后，随即身披袈裟，手持锡杖，威仪无缺地朝发光的地方走去。向东北走了五十里，见一座山，山下有一沟涧，涧北有一石门。门边有二位童子，年约八九岁，面貌端正，一人自称善财，一人自称难陀。二人引导大师进入石门，向北走了约五里，见一金色的门楼。走到门楼下，才看见是一座寺院，金匾题字”大圣竹林寺“，与钵中所看见的完全一样。寺院方圆有二十里，共计一百二十处院落。每处院落都有庄严的宝塔，都是黄金为地，金渠流水，华台玉树，充满其中。</p><p>　　法照进入寺中，在讲堂内，见文殊菩萨在西，普贤菩萨在东，坐于师子座上，万众围绕，正在说法，法音历历分明。大师在二位菩萨面前，至诚顶礼之后，问：”末法时代，凡夫与圣人相距遥远，知识狭劣，障垢深重，众生本具的佛性无法显现出来。虽然修学佛法，可是佛法浩瀚，不知，修习哪种法门最为其要？“</p><p>　　文殊菩萨回答说：”你现在念佛，正是时候。一切修行法中，无过于念佛。供养三宝，福慧双修。这两种法门，最为善要。我于过去劫中，因观佛故，因念佛故，因供养故，得一切种智。所以一切诸法，般若波罗密多，甚深禅定，乃至诸佛，皆从念佛而生。故知念佛，是诸法之王。“法照问：”应当怎样念佛？“文殊菩萨说：”此世界的西方，有阿弥陀佛，彼佛愿力，不可思议。你当继念，不令间断，命终决定往生，永不退转。“</p><p>　　说完，文殊、普贤二位大圣，同时伸出金色手臂，为大师摩顶授记：”你以念佛故，不久当证无上正等菩提。若善男女等，愿疾成佛者，无过念佛，则能速证无上菩提。“法照听罢，欢喜作礼，疑网尽除。文殊菩萨又说：”你可以到诸菩萨院巡礼，以承教授。“大师于是一处处依次巡礼，然后到七宝华园，见花开果满，大小如碗，摘取而食，顿觉身心舒畅。从园中出来，大师到二圣前作礼辞别，二位童子将大师送出寺门。大师低头作礼，抬头时，寺院菩萨就都不见了。大师心中怅然，立了一块石头作为标记。</p><p>　　四月八日，大师到五台山华严寺般若院西楼下安居。十三日，与五十余位僧人，一同前往金刚窟巡礼。法照来到无著大师拜见文殊大圣的地方，虔诚礼敬三十五佛，刚礼十遍，就见严广清净的琉璃宫殿中，文殊、普贤二位大圣与上万菩萨，俱在一处。这夜三更，在华严院西楼上，大师忽然看见寺院东面悬崖沟壑边上，有五盏灯，大小一尺。大师心中暗暗祝愿，愿圣灯分为百盏，住立一面。圣灯果然如大师所愿。大师又祝愿，愿化为千炬。圣灯也如大师所愿，分化排列，行行相对，漫山遍野。大师于是独自一人，在深夜中再往金刚窟，心中<a href=\"https://www.guang5.com/rmgjc/qiyuan.html\" class=\"keylink\" target=\"_blank\">祈愿</a>，愿见文殊大圣。走到半路，天已大亮，圣灯隐去。大师深自苛责，举身扑地。忽见一位梵僧，身高七尺多，自称佛陀波利。</p><p>　　佛陀波利，是北印度宾国人。唐高宗仪凤元年，他来<a href=\"https://www.guang5.com/rmgjc/chaobai.html\" class=\"keylink\" target=\"_blank\">朝拜</a>五台山，感应文殊菩萨示化成老人，让他回印度取《佛顶尊胜陀罗尼》，来中国翻译流通。永淳元年，他取经回到长安，后来就隐居于五台山的金刚窟。如今永兴的龙首岗，还有波利尊者的<a href=\"https://www.guang5.com/fgsl/slt/\" class=\"keylink\" target=\"_blank\">舍利塔</a>。</p><p>　　当时佛陀波利尊者对大师说：”师父如此不辞劳苦，有什么愿望吗？“法照回答说：”愿见文殊菩萨。“尊者说：”若是志愿坚定真实，就把鞋脱下，我让你在咫尺之间得见大圣。“法照于是脱下鞋子，顷刻间进入金刚窟内。只见一座寺院，黄金匾额上题着”金刚般若寺“五个大字。寺内建筑，异宝庄严，光明闪烁。楼观重迭，连绵不断。屏风精致，铃铎交鸣，院落大约有二百余所。有的地方还有藏珍楼，里面供着《金刚般若》等经法。寺院中的人物，身形魁伟，不是人间的模样。文殊菩萨在众人的拥簇之中，分外庄严。大圣慰劳法照后，赐予饮食，然后佛陀波利尊者将大师引出寺院。大师乞求留在寺内，尊者说不行，并嘱咐他说，努力精进，再来就能留下了。</p><p>　　十二月初一，法照在华严寺绝食念佛，发誓就此往生净土。到第七天初夜分，<a href=\"https://www.guang5.com/rmgjc/zhengnian.html\" class=\"keylink\" target=\"_blank\">正念</a>佛时，忽见一位梵僧对他说：”你所看见的五台山圣境，为什么不传给世人呢！“说完就不见了。第二天申时，大师正在念佛诵经时，又见一梵僧，约有八十多岁，神色严峻地对法照说：”你所见五台圣境，应该普示众生，使他们发菩提心，获得大利益。为什么不说呢！“法照说：”我不敢隐瞒圣道，只是怕人听后会怀疑诽谤。“梵僧说：”大圣文殊菩萨，现在在五台，尚且招人诽谤，你有什么好吝惜的。把你所见的境界普告众生，使见闻者发菩提心，做个善缘而已。“法照于是记录所见所闻，流传于世。</p><p>　　大历六年正月，江东僧人慧从，与五台山华严寺的僧人崇晖、明谦等三十余人，随大师到金刚窟及立石标记的地方，瞻仰圣人的踪迹。众人悲欣交集，忽然听钟声，清雅嘹亮，历历分明。众人竦然起敬，于是知道法照所见不虚，因而在屋壁记录下来，使见闻的众生同发胜心。后来，在大师所见的”大圣竹林寺“的地方，建造了一座寺院，取名”竹林寺“。</p><p>　　大师于是至心念佛，昼夜不懈。一天夜里，忽然见佛陀波利尊者对他说：”你的莲华已成就，三年后就开。“三年后，法照大师对众人说：”我走了。“于是端坐而逝。法照大师圆寂后，被尊为净土法门的第四代祖师。</p><p>　　这就是法照大师亲身经历人间的圣人道场的事迹。</p><p>　　如来继续道：”阿难！这十八层天，都没有男女的交合，独来独往。虽然没有欲望，但是还有形体的拖累。从此以下，名为色界。“</p><h3>　　天趣之四空天</h3><p>　　”阿难，从色界的最顶端，又有二条歧路。</p><p>　　如果在舍心中发明了智慧。慧光圆通，便出离尘界，而成阿罗汉，入菩萨乘。这一类，名为回心大阿罗汉。</p><p>　　25、空处天</p><p>　　如果在舍心中，觉得身体也是障碍，便销除这个障碍，归入虚空。这一类，名为空处。</p><p>　　26、识处天</p><p>　　一切障碍都销灭了，再没有可灭的了。只剩下一点阿赖耶识意识和半分微细的末那识。这一类，名为识处。“</p><p>　　佛法把人的”识“分为<a href=\"https://www.guang5.com/rmgjc/bashi.html\" class=\"keylink\" target=\"_blank\">八识</a>：眼、耳、鼻、舌、身、意这六识，再加上末那识和阿赖耶识。</p><p>　　”’阿赖耶‘是梵语，翻到中文就叫’藏识‘。这个’藏识‘，就是’如来藏性‘那个’藏‘。不过现在它没有完全归到如来藏性上，所以只叫一个’藏识‘。无论你一举一动、一言一行，你一天所遭所遇，这所有一切，都收到这藏识里边来。</p><p>　　’末那‘是第七识，叫’末那识‘，又叫染污识。这个染污，就由它这个地方生了变化。本来这第八识虽然说是生出一种无明，可是这儿很接近如来藏性，还没有什么染污。到了这第七识上，就染污了。这个末那识，有’半分‘的’微细‘，还有那么一点点微细微细的染污。“</p><p>　　27、无所有处</p><p>　　”没有一切色相和虚空，识心的起灭也没有了。一切的一切，都归于空寂，无来无往。这一类名无所有处。“</p><p>　　”像这一类的天上的人，这个地方就叫“无所有处”，就是什么都没有了。但是什么都没有了，可是他这性还是存在的，因为性和虚空是一样的，所以在这无所有处的天人，他还有寿命。有多少寿命呢？六万大劫。在那个地方虽然说有寿命，他那只是一个定，在那定里头有六万大劫。等到六万大劫满的时候，他那定也破了。破了，又会有了。有了，又转去哪一道里轮回，又不一定了。“</p><p>　　28、非想非非想处</p><p>　　”识性不动，以灭的心去参究它，在无尽的识性中，发宣尽的性质。使一点识性，若存若亡，似尽非尽。这一类名为非想非非想处。“</p><p>　　”’非想‘，没有想的；’非非想‘，又不是没有想，所以还有一点点。有一点点在那个地方，它不发生作用，在那个地方定着。定多久呢？定八万大劫。这天人的寿命，最长的是八万大劫的天福。</p><p>　　修道的人，在修行的时候，最要紧的，不要生念头，不要起心动念的。你一起心动念，将来就会招果报。以前有一个老修行，他在海边修道，就修这个’非非想处定‘。正想要入这非非想处定，水里这鱼就来打他闲岔了。</p><p>　　打闲岔，这是禅堂的口头语’你真打闲岔！‘’你这个哩啦腔！‘这好讲话的人，叫’哩啦腔‘。你尽好说话、好和人家去搭搭咯咯谈话的，这叫’打闲岔‘，英文叫give me trouble，你若给人家 trouble，这就叫’打闲岔‘。</p><p>　　那么这个老修行在这儿修行，这鱼来打他闲岔。他一要入定，这鱼在水里，“噗通”这么一跳，他就入不了定了。入不了定，他就生了一种瞋恨心，他说：’你这鱼真是讨厌！啊，我现在没有神通，等我有神通的时候，我变成一只飞狸，专门吃你这个鱼！把你都吃了‘他生这一念的瞋恨心，这鱼也害怕了，不敢和他开玩笑了，以后再也不敢来麻烦他了，所以他修这无想定就修成了。他生到非想非非想处天，把这八万大劫的天福享完了。享完了之后，你说怎么样？他这一念瞋恨心的果报也成熟了，他堕落到人间来，果然就变了一只飞狸--吃鱼的那种雀鸟--天天在那海上吃鱼。吃来吃去，等释迦牟尼佛出世，到那儿给它说法，他这才把飞狸的身脱了，又去做人，后来又出家修行，才证阿罗汉果。</p><p>　　所以修道千万不要生瞋恨心，不论谁对你好不好，你都要生一种爱惜人的心、慈悲爱护人的心。对任何人都不要有一种瞋恨，有一种不满意。你若不满意，你修成了，固然是没有问题了；如果不超出三界去，将来都是要受果报的。中国又有一句话说：’宁动千江水，不动道人心。‘那千江水是很多了，我把它摇动起来没关系，但我不动修道人的心。修道人这心，你一动他，他若一生瞋恨心，那不得了，将来就有因果了。 “</p><p>　　”那穷空却不尽空理，到了不还天就止步不前的一类，叫’不回心钝阿罗汉‘。若这些无想天的天人，不知道回归真如本性，迷失在无思无闻的外道境界中，终究免不了轮回之苦。</p><p>　　阿难！这每一层的天人，都是凡夫。他们都不过是在酬答的业果。果报受尽，再入轮回。但每一层天的天王，却都是菩萨的化身。菩萨安住在正定之中，示现天王而利益众生，以增进他们的圣果，趋向佛道。</p><p>　　阿难！这四空天的天人，身心灭尽，安住在定中，没有业果色，至此叫’无色界‘。</p><p>　　这都是因为不明了妙明真心，妄想沉积，而幻化出三界。在幻妄的七趣中，各从其类，生死沉浮。“</p><h3>　　修罗趣</h3><p>　　”阿难，在这三界中，还有四种阿修罗类。</p><p>　　在鬼道中，因为护持佛法，以护法之力，能乘神通而升空。这类阿修罗从卵而生，为鬼趣所摄。“</p><p>　　”有一种鬼，他是善的鬼，身为护法，好像关帝公，这都叫“大力鬼”。他做护法，能护持三宝，藉着他这种神通能到空中去。“</p><p>　　关帝公就是大家所熟悉的，三国时期的关羽关云长。</p><p>　　关羽在麦城战败后，被孙权砍头。时间又过了数百年，到了隋朝初年，有位高僧号”智凯“，人称”智者大师“。隋开皇十二年十二月，大师回到家乡荆州，欲在此地建立道场。大师登上金龙池，见池北百余步有一颗大树，在婆娑枝叶的偃盖下，粗大的树干中间有一个大树洞，就像个小屋一样。于是大师便在其中趺坐入定。</p><p>　　这一天，天昏地暗，阴风怒号。有一条巨蟒，长十余丈，张着血盆大口冲过来。周围阴魔陈列，炮矢如雨。如此异象一连经过七天，大师了无惧色。最后，大师悲悯地对他们开示道：”你们所做的，都是生死的幻业，贪着余福，不知道悔改，真是可悲啊！“大师说罢，妖象顿时消失。当天晚上，云开月明，大师见到两个人，威仪就如同帝王一般。年长的美髯丰厚，年少的秀发披肩。年长的向前致敬道：”我就是关羽。汉末纷乱，九州瓜裂。曹操不仁，孙权自保。我义臣蜀汉，期恢复帝室。怎奈时事相违，有志不遂。死有余烈，故在此山为王。大德圣师，神足至此，不知有何贵干。“大师道：”我欲在此地建立道场，以报生身之德。“神道：”愿师哀闵我辈愚钝，垂慈摄受。离此一舍之地，山如覆船，其土深厚。弟子当与子平建寺化供，护持佛法。师只在此安禅，七日内，寺可成。“智者大师出定后，见千丈的湫潭，已化为平地。寺庙殿宇，焕然夺目。神运鬼工，其速如此。</p><p>　　大师于是率领众僧，入寺演法。一天，神对大师道：”弟子今日获闻出世间法，愿洗心易念，求受戒，永为菩提之本。“大师随即焚香，为其授五戒。于是神之威德，昭布千里。远近瞻祷，莫不肃敬。</p><p>　　如来继续道：”本来在天道中，因为德行不够而被贬下凡尘，居住在日月之畔。这类修罗因为情欲重而感得从胎而出，所以属于人道。</p><p>　　还有修罗王，他能执持世界，力大无穷，无所畏惧，能与梵王及天帝释、四大天王争权。这类阿修罗王因为能变化，所以属于天道。“</p><p>　　宣化上人讲：”阿修罗，他相貌长得最丑陋不过，最不端正。嘴巴长得像猪那么长，鼻子长得像象的鼻子，猪嘴、牛牙、象鼻子、牛眼睛、老鼠耳，这很难看的。或者他是个人身，却长个猪头；或者是个人身，又长个牛头；或者是个人身，又长个马头；或者是个人身，又长个虎头，非常凶恶的。虽然男阿修罗的相貌很丑陋，可是女阿修罗却生得最美貌不过，那真可以说是人见人爱。</p><p>　　有一次，玉帝看见这修罗女生得这么美貌，于是就向修罗王去求婚；因为玉帝在六欲天，他还没有离欲，所以在欲界里都还有这种夫妇的行为。这修罗王也就答应了，把女儿嫁给帝释。有一天，帝释很欢喜地请他的岳父来吃饭，预备很多天上最好的饮食，请修罗王来赴宴。修罗王来到这儿就喝酒、吃饭，吃饱了要回去的时候，玉帝为了表示恭敬他这岳父，就把所有的天兵天将都召来列成队伍，站成两行这么来恭候送行。可是修罗王一看，心里就不高兴了：“你用你的天兵天将来骇我？你想向我来示威？好东西！”心里很不高兴，但是玉帝还不知道。</p><p>　　天上有个仙人时常说法，玉帝因为欢喜研究道理，他就每天到仙人那儿去听法。每次玉帝去听法时，这修罗女就生出一种怀疑：“你天天不在家里，跑出去干什么？大概又出去胡混，找其他的女人吧？”她等到帝释回来就审问他：“你天天干什么来着？你是不是移情别恋，另外又有意中人了？所以你也不在家里陪着我了？”帝释听她这么样讲，说：“不是。我到某某地方，去那儿听仙人说法。”修罗女不相信：“我不相信你去听法，你一定是另外找女人去了！”她就要跟帝释去，帝释不准她去。这修罗女也有神通，等帝释上他的宝车，她就把身体用法术隐起来，也随着上车。帝释也没看见她，她就跟着去了。</p><p>　　到了说法的地方，等帝释下车的时候，她也跟着下车了。帝释说：“你做什么也来了？”她说：“我来调查看看你倒是不是来听法？你光这么样讲，我不相信的。”帝释听她这样讲，也就发脾气了，摆起丈夫的架子，拿着<a href=\"https://www.guang5.com/sushi/yaoshan/hehua/\" class=\"keylink\" target=\"_blank\">荷花</a>的茎，就打这修罗女。一打，这修罗女就呱呱大叫。这一叫怎么样啊？因为这个仙人从来也没有听过女人的声音，这回听这修罗女一叫，那么娇美的声音，他就淫欲心动了，就把道业失落了，所以也就不能再讲法了。这样一来，玉帝更怒起来了，一再责怪这修罗女。</p><p>　　修罗女一发脾气，回去就对她父亲讲，说玉帝不守规矩，现在又另外有女人了！就造了很多谣言。这一造谣言，她的父亲修罗王就大发脾气：“这还得了！难怪上次他这样向我示威，原来他不把我们父女看在眼里！”于是发起修罗兵将去和帝释作战。</p><p>　　这一作战怎么样？帝释虽然有天兵天将，但是屡战屡败，战不过修罗王，于是就去求释迦牟尼佛给想法子。佛就教他念“摩诃般若波罗蜜多”这几个字，然后又说：“你叫你天兵天将，统统都念这几个字。”帝释回去之后，吩咐他的天兵天将，在和修罗作战的时候，都念“摩诃般若波罗蜜多、摩诃般若波罗蜜多……”。这一念，也不知怎么样的，把所有的修罗兵就都打败了！于是帝释又保持住他的这种权力。“</p><p>　　”阿难！还有一类下劣的修罗，生在大海中心，海水汇集的尾闾之处。他们白天在虚空漂游，晚上回到海中休息。这类阿修罗是湿气所生，所以属于畜生趣。</p><p>　　阿难！地狱、饿鬼、畜生、人，及神仙、天，阿修罗，这七趣众生，仔细研究，都是昏沉的有为相。随着妄想的业报，受着妄想的生死。在妙明无为的真如本心中，这一切都如空中狂花，本无所著。只是一个虚妄，没有根源，没有头绪。</p><p>　　阿难！这些众生，不认识自己的真如本心，遭受轮回，无量劫来，得不到真正的清净，都是因为随顺杀盗淫。反过来，又生出不杀不盗不淫。有杀盗淫就是鬼伦，没有杀盗淫就是天道。有无相倾，发起轮回。若能显发三摩地妙定，则微妙寂然。有和无都没有，连’没有‘也灭掉。不杀不偷不淫尚且没有，又怎么会随顺杀盗淫这些事情呢？</p><p>　　阿难！不断这三业，众生各自造作，因为各有各的私业，众生的私业交织到一起，就形成了同分，所以也不是没有定处。七趣从妄想发生，而妄想的产生并没有一个原因，所以也无可寻究。“</p><p>　　”由虚妄而生，所以就虚妄而灭，你一定要找，追究它的根，找不着的。本来这来源是没有的，就好像人这影子，只是一个影子。你说影子从什么地方来的？不错，从身那儿来的。但是它并不是长到身上的，它只一个虚妄的影子而已。“</p><p>　　”你们勤勉修行，要想证得无上菩提，必须断除杀盗淫这三惑。不除尽三惑，纵然得到神通，也都是世间有为的功用，习气不灭，终究落于魔道，本来想除去幻妄，反而倍加虚伪。如来说，真是可哀怜者。这都是你们的妄心自己造成的，并不是真如本心的过错。</p><p>　　这样的说法，才是正确的说法；其他的说法，都是魔王所说。“\t\t</p></div>"
    },
    {
        "title": "第七章 五十阴魔",
        "author": "",
        "date": "",
        "html": "<div class=\"B1_text\"><h2>第七章 五十阴魔</h2><p>　　修行的道路虽然精彩，但也不是一帆风顺的。在破除五阴的过程中，往往会遇到各种魔境。它们有的是来自自心，有的是来自外界。这时，如果不能识别，以为这就是证得圣果了，就会功亏一篑。所以，这一章里，世尊把这些魔境一一罗列出来，加以分析，逐个道破。五阴除尽后，在六根互用中，直超五十五位，流入如来性海。圆满菩提，归无所得。</p><p>　　法会进行到这里，即将结束。如来本来是端坐在狮子座上的，这时双手扶着座前的七宝法台，紫金山般光明的身体向前倾斜，一字一句，郑重地对阿难和在场的大众开释道：</p><p>　　”你们这些缘觉和声闻，今日已经回心趣向无上妙觉。我虽然已经向你们讲明了修行的正道，但是你们不知道，在修行正定，趋向真如的过程中，还可能会遇到微细的魔事。魔境现前你们却不能辨别，这时，如果洗心非正，就会落入邪见之中。</p><p>　　或者被自己心中所现的阴魔所扰，或者被天魔神鬼，魑魅魍魉所诱，因为心中不明白，所以认贼为子；又或者得少为足，就像四禅天那些孤陋寡闻的比丘，认为自己已经证得阿罗汉圣果，结果天福享尽，衰相现前，就以为阿罗汉也不能免轮回呢，因此犯下谤法的大罪，堕入阿鼻狱。“</p><p>　　宣化上人解释道：”这个’洗心‘哪，不是真的洗心。 ’洗心‘就是你心里收拾得不干净，心性里还有邪见，是你心里的邪见没洗干净。’非正‘是没有洗干净，就是你想要不生不灭，可是你里头还要生灭。这个意思就是，譬如女的说：’啊，我不要男朋友了！‘可是里边还要；男的说：’啊，我不要女朋友了！不要，不要。‘可是还不是真的不要。</p><p>　　上人：果某！你在金山寺，那个人有病到那儿的样子，你看见没有？</p><p>　　果某：我看见了。好可怕！</p><p>　　上人：那是一条恐龙，那就是飞精附人，着魔了，着魔他还冒充他是什么菩萨、什么菩萨！</p><p>　　果某：这一次，我们在金山寺看见一个很特别的现象，就是有一个四十岁左右的女人，她从台湾来的。后来爱茉丽告诉我们，她的丈夫不要她了。因为她晚上随时都能听见声音，叫她做这做那，要去这个庙、那个庙，所以她就半夜十一点、十二点都冲出门去的。她的丈夫觉得她是神经病，就不要她了。</p><p>　　她到处找庙，星期六那天来金山寺，不知道她干什么，就是和师父对着坐，是用打坐的姿势来坐的。我看她表情好凶好凶的，那个瞋恨的样子，当时我想那个瞋心真的要不得，那从无量劫积下来的话，真是一颗原子弹。她目露凶光，双手合掌对着师父，在场每个人都看见的。她忽然间就“呜”的一声，声音好厉害。后来嘴巴好像吐什么出来，手就一直弄得好快好快，好奇怪。</p><p>　　上人：她那是在用法术和我斗法，你不知道，她在显她的神通呢！</p><p>　　果某：又念咒，等一下她就泪流满面。师父就问她：’你到底干什么？‘</p><p>　　上人：她哭的时候，就跪下来。那个恐龙在那儿趴着跪下了，跪着叩头呢！她显得不行了，就投降了。</p><p>　　果某：她投降了，就请示师父，她到底要怎么样修行？师父就告诉她：’因为你乘急戒缓，以前你就是一直用功拼命地修行，可是不守戒律，现在堕落龙身。虽然有神通，可是很痛苦的，你为什么还不好好修行？‘叫她<a href=\"https://www.guang5.com/fxrm/fxkb/xgfjlhh/1086.html\" class=\"keylink\" target=\"_blank\">皈依三宝</a>，那个女人就说：’我不晓得怎么样去修行？‘她说她每次打开《地藏经》就好像有一股力量不让她看。后来她又请示师父，她要先看那一部经，怎么样去修行？“</p><p>　　”五蕴本来是空的，没有体性的，你自己没有五蕴的。’阴魔‘是你那个境界来了，自己执着它，不是真是你的，你根本没有阴魔。或者你自己这个阴魔境界现前，你就认为它是真的了，根本不是的。色即是空，空即是色，照见五蕴皆空嘛！五蕴不是自己的，自己没有这个，这是一种虚妄的境界。’认贼作子‘你认为他是真的了，根本都是假的。修行要不着境界，破除一切的执着。什么也不着，也不着于空，也不着于有，着到空上，也错了；着到有上，那个’有‘就是个色法。“</p><p>　　弟子：，这个’天魔‘是执着引来天魔，还是天魔自己过来的呢？</p><p>　　上人：这个’天魔‘和那个’阴魔‘，意思是不一样的。天魔是有的，是从天上来的，是遭遇到天魔的意思。天魔、鬼神这都真有的，那些个魔是外边来的。唯独色、受、想、行、识这五阴是唯心所现的，是你自己心里现出来的。</p><p>　　弟子：那个天魔不是从想阴来的吗？</p><p>　　上人：是从想阴来的，你里边有阴气才招外边的魔。他这个都是里边有这个影子，外边他就来了。就像你有个茅厕的话，苍蝇就来了一样的，因为里边没有扫干净，没有收拾干净。五阴也是虚妄而生，虚妄而灭。这个五阴和天魔都是相因相循的。你也不用一定说他是在里边、在外边。这里头都是变化无穷的，不可思议的。一定说这样了，他又不是了；你一定说那样，他又不是了。这就是举出这么个例子来做大家的参考，并不是一定就这样的，这都是一个假设之词。就说那些个境界，也都是大大概概有这么多的问题会在这个里头，这都不是一定的。</p><p>　　因为这些人’洗心非正‘，不认识，所以这些个魔的境界都来了，这叫阴境，就是属阴的境界，不是属阳的。不要想去掉，也不要想不去掉，这个就是心里无动于衷，就是正。你不为这个境界所转，而能转这个境界，而能对一切境界都处之泰然，如如不动，了了常明。你不动呢，就是智慧！你一动啊，就是愚痴！你一追究它是：’啊，这是好境界！‘也是愚痴。’这是坏境界啊！‘也是愚痴。好境界，你生出欢喜心，那也被境界转了；坏境界，你生出忧愁想，那也是被境界转了，你就是阵脚大乱了。就像军队作战，你能稳住阵脚，一定打胜仗的。</p><p>　　你做了个梦，’啊，我不知道这是个好境界，还是个不好境界？‘根本就是做梦，你管它好不好干什么？为什么要那么紧张？好，是个梦；不好，也是个梦，这没有事嘛！你一紧张，欢喜得饭也不能吃了，瘦三十磅；或者忧愁得也不能喝水了，又瘦了二十磅。你不执着梦，就你醒的时候做的梦，也都不执着，你看，多自在！就像永嘉大师说的：’纵遇锋刀常坦坦，假饶毒药也闲闲。‘什么问题都没有了。”</p><p>　　接下来，如来继续说道：“你们要仔细听好，我现在就为你们讲解这些事情！”</p><p>　　阿难和大众都欢喜地顶礼如来，然后跪在地上，认真地聆听如来的教诲。</p><p>　　世尊说道：“阿难！要知道，有漏世界的十二类众生，他们本有的妙明心体，与十方诸佛无二无别。只因深陷妄想之中，迷失真理，而产生痴爱。在痴爱的蒙蔽下，进而迷失了一切，只能看见到晦昧的虚空。迷闷之下，欲寻求明了，因此产生了世界。所以，十方微尘一样众多的国土，并不是真实的，而是因为迷惘，在妄想中安立的。</p><p>　　要知道，虚空在你的心中，渺小得就像一片浮云点在天空中一样，更何况安立在虚空中的世界。你们一个人显明了真心，返本还源，十方虚空就会销殒。安立在虚空中的国土能不震裂吗！你们修禅，得到三摩地正定，与十方菩萨和大阿罗汉心精通吻，当处湛然。一切魔王鬼神和凡夫天人，见其宫殿无故崩裂，大地震塌，水陆飞腾，无不惊慑。只有凡夫昏暗感觉不到。 那些魔王鬼神和凡夫天人，都有神通。他们贪恋尘劳，见自己的宫殿无故崩裂，怎能坐视不理呢！所以，在入定的时候，这些鬼神、天魔、魍魉、妖邪都会来恼害你。</p><p>　　说到魔王的宫殿，宣化上人讲过这么一个事情：</p><p>　　我有没有对你们讲过？以前我在东北，有一个小徒弟，这个小徒弟大约十四岁的样子。虽然是个小徒弟，他的神通可不小，他可以上天入地。他得到五眼，但是没有得到六通--他得到五通，没有得漏尽通；若是得漏尽通，那就证阿罗汉果了。</p><p>　　有一天，他就跑到天上去玩。到了天上，这个魔王很欢喜他，就把他圈到宫殿里头了。魔王的宫殿都是玲珑透体的，都像琉璃造的，非常地美丽，他就留在那里。因为他有五眼，他看到他自己的法身到那个地方，魔王就不叫他回来了。他就告诉我：</p><p>　　”师父啊，我到天上去，现在回不来了！“</p><p>　　”你到天上去回不来，谁叫你去来着？“</p><p>　　”我以为那个地方好好玩的，我到那个地方去看看。啊，天上那个人就不叫我回来了！“</p><p>　　”你玩，不要到那个地方去玩嘛！那六欲天的天魔，他专门就想要破坏修行人的定力。“于是乎我说：”你不要害怕，我叫你回来。“</p><p>　　我叫他回来，这魔王就在那儿圈着他不叫他回来。这个时候他就很恐惧了，他说：”他不叫我回来，那怎么办呢？“</p><p>　　我说：”你不要怕，我现在叫你回来。“于是乎我就用〈楞严咒〉，我已经告诉过你们了--那个破魔咒术的五大心咒。喔，魔王宫殿即刻就粉碎了！这次他回来了，这是真实的事情。”</p><p>　　“魔王虽然大怒，但是他们在尘劳内，你在妙觉中。犹如狂风吹光，抽刀断水，根本两不相触。你如同滚烫的沸水，他好比坚硬的寒冰，热气一熏，很快就把他溶化了。他虽然拥有神力，但毕竟只是你的客人，根本无法给你做主。</p><p>　　真正能破坏你的，只有你自己心中的五阴主人。主人迷了，客人才能得便。你若能觉悟，这些魔事还能拿你怎样呢？阴境消散，光明自然现前。而恼乱你的邪魔都是幽气所成，光明能破幽暗，所以他们如果靠近你，就会自然消殒，所以怎么还敢留下来捣乱呢！</p><p>　　但是，如果你自己不悟，被阴境所迷，你阿难就会成为魔子，成为魔人。</p><p>　　阿难。摩登伽女之难，跟这些五阴中的魔境相比，根本微不足道。摩登伽女只是用先梵天咒破坏你的律仪。沙门的三千威仪、八万细行中，只毁一戒而已。因为你内心清净，所以尚未沦溺。而这些邪魔，却是要毁却你的全身。如同宰官被国王抄家后，注定零落，根本无可挽回。</p><p>　　下面，我就为你详细地解说这五阴中的五十种魔境。”</p><p>　　“这种阴魔，其实不止五十种，五百种、五千种、五万种、五十万种都有。每一种又可以分出来十种。若细分析起来，千千万万种都有。归纳起来，什么叫阴魔呢？本来是没有什么东西的，它就是一股阴气。这股阴气从什么地方来的呢？也就是从我们每一个人的阴念来的。这股阴的念就是属于贪、瞋、痴之类的念，所以就生出来色、受、想、行、识，那每一个蕴里头就生出来这种种的阴相。这种阴相，是功夫到了，它必然现出的一个情况。你若功夫不到，想有这个阴魔也没有的。</p><p>　　现出来那也不要紧的，不用怕着魔。那该怎么办呢？阴相现出来的时候，你能处之泰然，好像没有那么回事似的--见如不见，闻如不闻，都要视而不见，听而不闻，嗅之无味。你能不入色、声、香、味、触、法，这个阴魔它一点办法也没有。你若能没有贪、瞋、痴，也就把这阴魔都降伏了。没有自私、自利、求、贪、争这五种毛病，什么魔也拿你没办法。</p><p>　　所以我们各位现在研究，不要说研究这阴魔就怕魔了。不需要怕，它这一股气就像什么呢，这也是用一个粗的比喻，就好像我们烧热水一样。水烧滚了，它会有热气出来。那热气一出来了，就是水开了。你修行有魔现出了，那个魔的现出，也正是因为你自性里头那个阴念、阴气所幻化出来的。虽幻化出来，你能不为它所摇动，也就没有事了。好像你烧开水，那热气出来了，这没有什么奇怪，等它出过去了，那水就可以喝了。</p><p>　　人有这一股魔气现出来了，就好像锻炼金，精金剩下了，那金里头的渣滓都锻炼出去了。修道也就像锻炼真金一样的，所以说：’真金不怕洪炉火。‘你要炼出精金来，炼出金刚不坏身来。所以金刚不坏身就是要时时刻刻、念兹在兹地用功修行。用功修行，你无论修到什么程度上，也不要生欢喜，也不要生恐惧心。这是修道人最要紧的一个根本解决魔障的办法。”</p><h3>　　色阴魔境</h3><p>　　“阿难。要知道，你在修定的时候，销落一切妄念，心中精纯而明澈。动静不移，忆忘如一。应当在这种境界中，进入正定。此时，好像有眼睛的人，在幽暗的房间里。心虽然清静，但自性的智慧却没有显发出来。这叫做’色阴区宇‘。</p><p>　　如果目光明朗，十方洞开，再无幽黯，色阴就破除了。这时就能超越劫浊。回过头来再看色阴的由来，原来是由坚固的妄想所产生的。”</p><p>　　对于“坚固的妄想”，宣化上人解释道：</p><p>　　上人：他还有妄想。“坚”就是他在那里执着得太厉害了。</p><p>　　弟子：是不是坚固妄想做为色阴由来的根本？</p><p>　　上人：他到那境界就是这样子，不管它由来不由来，这没有法子追根穷底的，这都是虚妄的；色、受、想、行、识亦复如是，“五蕴浮云空去来，三毒水泡虚出没”，这都是假的嘛，无论什么境界都是假的。</p><p>　　弟子：就好像做梦一样，梦里没有道理可以讲的。</p><p>　　上人：嗯，“梦里明明有六趣，觉后空空无大千”。</p><p>　　“这个’十方洞开‘，果某说是用眼睛看十方。不是的，”十方洞开“，是他自己坐着，就觉得自己和虚空合而为一了，十方都大放光明。这不是他眼睛看，但是他见着这光了。这个是境界，并不是像我们人所想像的。这是一种不可思议的境界，不是用眼睛看的，这是有一种feeling（感觉）。</p><p>　　五十种阴魔都是一种境界，并不是真的，不要把它看真了。这是幻化的，自有化无，化来化去，这都是境界，并不是实在的。所以很多人一遇到这样境界，就觉得自己了不起。</p><p>　　你们看五十种阴魔，我告诉你们一个根本的idea（概念），你就根本拿它当太空小说看，要想入非非，要那么想，这都是一种不是人所有的事情。所以你以为凡夫这么样子看啊、听啊，那是不行的。这都是隐伏的。太空小说它不一定有的；用功的人，这些境界都有的。我这是举一个例子，来以此类推。再给你举一个例子，好像抽大麻烟之后见到的那些境界是一样的，那你们就懂了。”</p><p>　　1精明流溢</p><p>　　“阿难！在色阴区宇当中，精研妙明本心。由于心滤专精，四大无碍。顷刻间，身体就能超越一切障碍。这是内心的精明，即将开始流溢所导致的。所以叫做’精明流溢前境‘。这只是一种功夫而已，并不是证得圣果。不以此为证果，这就是一个很好的境界；如果以为这就是证果，就要受到邪魔的侵害了。”</p><p>　　2内彻拾虫</p><p>　　“阿难！以这种心境，继续参究妙明本心。身体变得通透明澈，忽然能从体内抽出蛔虫来，身体却毫无损伤。这是因为内心的精明，流溢于形体。同样只是因为你精进修行，而暂时得到的一种境界，并不是证得圣果。如果这样就以为自己证果了，就会遭到邪魔的扰乱而堕入魔道。”</p><p>　　3精魄离合</p><p>　　“继续内外精研。这时，魂魄、意志、精神，除了执持身体的部分，其余的都相互涉入，互为宾主。忽然会听到空中有说法声，或者听到十方虚空都在说法。这是因为精魄之间互相离合，使你往昔的善根得到发挥而产生的现象。这也只是一个暂时的境界，并不是证得圣果。”</p><p>　　“三魂七魄，像小孩子的样子。但是它六根中单有一根，没有多根。因为有它在人身上，所以人能言行动作。言行动作都是这个支使的。魂魄聚到一起，然后修成了，在佛教就是”佛“，在道教他们就是修”仙“。有的单单有眼睛，有的单单有耳朵，互相帮助的。能听的小孩子，就帮助能看的小孩子，互相可以互通的。所以你修成了，就可以六根互用，耳朵也可以吃饭，也可以说话，这个有很多你想不到的境界。</p><p>　　弟子：上人，您以前提到您有一个小徒弟到天上去玩，被魔王圈着，然后他就对您说：”怎么办？我不能回来！“这是不是他的魂魄有一些到那里去了？</p><p>　　上人：那是三魂七魄中，或者去一个，或者去两个，或者去三个、四个，都不一定。出去的，它又聚到一起了，出去就合成一个。这个就是这么妙的，它是一股灵气嘛！</p><p>　　弟子：这个是不是修行的程度不一样，有的可以出去少，有的可以出去多？</p><p>　　上人：不出去好一点。尽出去游玩的也有危险，有时遇到魔，就给抓去了。把魂魄抓去了，这个人就傻了。白痴，人像个vegetable（植物），都是没有魂魄的，魂魄被魔抓去了。魂就是鬼，修成了，属阳就是属神，再修好了就是仙，再修好了就是佛，都是这一个成的。</p><p>　　弟子：譬如一个植物人，或者有一个人，他的三魂七魄去了一些，虽然他的身体还在，那么这出去的魂魄，是不是又变成另外一个？</p><p>　　上人：不是变成另外一个，就是跟着魔走了。所以这个人有时候就明白一点，有的时候就很糊涂的。</p><p>　　弟子：一个修行人，他的三魂七魄去了一些，如果遇到佛菩萨… …</p><p>　　上人：你若真修行，默默中都有护法。我遇到奇奇怪怪的人太多了，好像能出玄入牝的人，我遇到很多。你们没有遇到这种境界，都不认识，不知道。好像台湾那个跳童的，都是”五十种阴魔“的作用嘛！</p><p>　　弟子：他们是修到那个程度了吗？</p><p>　　上人：他们也往前修，也在立功嘛！也就像人似的，有的学好，有的不学好。不学好就做魔王的眷属。”</p><p>　　4境变佛现</p><p>　　“如果此心澄清皎洁，内光发明，十方世界，一时间全部变成金色。一切种类，都化为如来。这时，忽然见到毗卢遮那佛坐在天光台上，周围千佛围绕，百亿国土和莲华同时出现。这不过是因为你的心光经过研磨，照亮了世界，暂时得到的境界，并不是证得圣果。”</p><p>　　5空成宝色</p><p>　　“又以此心，继续参究，观察不停。对起伏的妄念或者抑按，或者降伏，或者制止，或者超越。这时，忽然十方虚空成七宝色，或百宝色，周遍圆满，没有空隙。这是因为抑按得过分了，而暂时显现的一种境界。并不是证得圣果。”</p><p>　　6暗中见物</p><p>　　“如果参究得内心澄澈，精光不乱。忽然能在夜中视物，就如同白天一样。这是心细密到了极点，使见的功能也得到了澄清，所以能洞穿幽暗。并不是证得圣果。”</p><p>　　“有的修道人，他清净到极点了，净极光通达，啊！忽然间他就见一切物！这见一切物，是什么所见的呢？就是他开了佛眼所看见的。这个佛眼，并不是人人都可以开的，也不是你开了就永远开了。这种境界是暂时开的佛眼，所以在暗室里边，他也能看到光明，也能看到房子里边一切物体、一切东西。可是，方才我说从外边来的东西也可以看得见。从外边来的什么东西呢？好像在这一个房里头是黑暗的，你可以看到从外边来个神，或者是来个鬼，或者来个菩萨，或者来个佛，这都没有一定的。以上所讲的这种境界也不是一定的，也不是人人都一定有的，也不是人人都一定没有的。这不必经之路，不过是修道有时会有这种境界。所以你不要以为个个修道人都是一样的境界，不是的。”</p><p>　　7身同草木</p><p>　　“如果内心清虚而融通。四肢忽然如同草木一般，火烧刀斫都没有感觉。火烧也烤不热，刀割也砍不坏。这是由于尘相合并，排除了四大的特性，而归入唯一的精纯。暂时如此，并不是证得圣果。”</p><p>　　8遍见无碍</p><p>　　“如果内心清净，净极功深。忽然十方山河大地都变成佛国，七宝庄严，光明遍满。又见无量无边的诸佛遍满虚空。宫殿楼阁，华丽无比。下见地狱，上观天宫，毫无障碍。这是因为平时就有这些好恶，日久念深，而化现出这样的境界。并不是证得圣果。”</p><p>　　9遥见遥闻</p><p>　　“又以此心，研究深远。忽然在中夜，看见远方市井街巷中的亲友，或者还能听见他们的说话声。这是因为心被压抑到极点，而心光飞出，所以能有这样的境界。并不是证得圣果。”</p><p>　　10 妄见妄说</p><p>　　“又以此心，研究精极之处。忽然见到善知识，相貌无端地变来边去，忽男忽女，时老时少。这是因为心中有邪念，而感召魑魅作祟，或者是天魔入其心腹，胡乱说法，并不是证到圣果了。</p><p>　　阿难！以上十种，都是色阴在我们用心参究的时候，所出现的境界。众生顽迷，不自量力。遇到这些因缘的时候，迷惑无知，以为自己证得了圣果。因此犯下大妄语的罪业，死后堕入无间地狱。你们要在如来灭度后的末法之中，宣示这个道理，不令天魔得便。保护修行人，都成就无上道。”</p><h3>　　受阴魔相</h3><p>　　“阿难！色阴除尽的时候，看如来本心，就像看镜中的影像一样。虽然有个形象，但却并不能使用。又好比梦魇中的人，手足完好，心中也是明明白白的，却因为被魇魅鬼压着而无法行动。这种状态叫受阴区宇。</p><p>　　如果这种梦魇一样的状态得到消除，受阴除尽，心就可以离开身体，反观其面，去留自在，无复为碍。见浊便得以超越。这时，再回过头来看受阴的根源，不过是由虚明妄想所产生的。”</p><p>　　“’虚明妄想‘，虚就是虚假的，那个明白也是个假明白，不是真明白。妄想本来就是假的，他自己也不知道他是妄想。</p><p>　　这就好像镜子里头能现出像，你虽知道了，但是你见着镜子里的东西，这有什么旁的用处呢？没有什么用的，那就叫虚明。</p><p>　　就像那个小孩子很聪明，往往我问他：’你几岁了？‘’我八岁。‘我再问他：’你为什么不九岁？‘他就不知道为什么不九岁了？你看他虽然很聪明，他不会说：’我再过一年就九岁了。‘他不懂。我又问他：’你为什么不常常是七岁呢？‘他也不知道怎么讲。这就叫虚明。很简单的事情，就不明白了。如果是大人，你这样问他，他一定会答覆的。因为他是小孩子，他就不懂，这就是虚明。</p><p>　　好像这受阴，他明白这是妄想，又不明白这是妄想，就在这个时期，这就叫”虚明妄想“，很简单，这没有什么。</p><p>　　”虚明妄想“，可以用glass（玻璃）来形容，不透明的玻璃，里边看不见外边，外边看不见里边，那个可以说是妄想虚明；因为妄想还是很多，他看不见，看不清楚。</p><p>　　玻璃有的是不透明又打不烂的，这可以用来比喻坚固妄想──有铁线网，又不透明，打不烂，这是坚固妄想。有一点透明了，可是里边还是不能看见外面，叫虚明妄想。融通妄想就是可以看得见外边的玻璃，可以知道他自己的妄想了。第四个幽隐妄想是不但能看见，而且能够看见很微细的。到第五个颠倒妄想（识阴）是玻璃啊，什么都没有了，都看得见，可是那里头还有妄想。头一个坚固妄想你就拿他当有铁线的，甚至于用铁锤也打不烂的玻璃，用枪打也打不烂，这坚固妄想。这都是比喻，很平常的嘛！就拿那个玻璃就形容出这么多的妄想。”</p><p>　　1抑己悲生</p><p>　　“阿难！色阴除尽，自心发明，因而得大光耀。忽然心中涌起无穷的悲悯。乃至视蚊虻蝼蚁，都如同自己亲生的孩子一样，心生怜愍，遽然泪下。这是因为用功的时候，过分压抑自己所导致的，并不是证了圣果。 如果以为这就是证果了，则有悲魔入心，见人就哭，无休无止。”</p><p>　　2扬己齐佛</p><p>　　“阿难！在定中见色阴消散，受阴现前。此人见到胜相，由于过分激动，忽然心中生起无限的勇猛，誓要与诸佛齐等。认为三大阿僧祇劫，我一念就能超越。这是因为用功的时候，陵率过越，并不是证得圣果。明白以后，躁进之心自然就会停歇。如果认为这就是证果，就会有狂魔入心。令其见人就自夸，傲慢无比，乃至上不见佛，下不见人，从此偏离正道，而滑入堕落的深渊。”</p><p>　　“’谓三僧祇一念能越‘，本来我告诉你们，有这个境界──顿超，可以的。可是这个顿超的人，就是得到这种境界，也不会对人宣传的。不会各处卖广告，自己说：’我已经怎么样了！你已经怎么样了！‘不会这样自满的。《永嘉大师证道歌》也说：”刹那灭却三祇劫。“这都是一念之间的。可是他得到这种境界，不会各处去招摇撞骗的。这个人为什么对人说呢？对人说就是他想要招摇撞骗，想要叫人对他生信心。你若真得到这个境界，还怕什么人对你不生信心？你这还在那儿贪呢，还在那儿求呢！因为这个贪求啊，就是一种邪了，就不对了，这是一种魔了，魔的境界就是这样的！魔啊，就是要自我宣传；佛呢，就不自我宣传。他（魔）为什么要对人说呢？就是要叫人<a href=\"https://www.guang5.com/rmgjc/xinyang.html\" class=\"keylink\" target=\"_blank\">信仰</a>他，就差在这个地方。</p><p>　　’陵率过越‘，你知道这是怎么样子呢？这就是用功总想争第一，很躁进的，很’不列等而进‘，就想’我怎么样能用功用得超过一切‘人，他心里总有这个争第一的思想，这就叫’陵率过越‘。这个’陵‘，好像皇帝那个坟墓叫陵，就想自己争第一，自己坐的比谁都高。所以就得这种狂魔，见人就自己赞叹自己，总是自己称扬自己的功夫。好像某某之类的，他是不用功陵率过越；那么这一类的呢，只是用功陵率过越，觉得自己不可一世，发狂了，这叫狂魔。你要拿它不当一回事，候久了，它就没有了，见怪不怪，其怪自败。你们觉得是不是这样的道理？”</p><p>　　“陵率过越”即使没有招摇撞骗，没有争第一的思想，对修行也是非常不利的。</p><p>　　佛的弟子中，有一个叫闻二百亿的比丘，亦名二十亿耳。他的耳朵特别灵，善于辨别种种音律。他本来是一个有名的音乐家，出生在富贵的家庭中。父母对他爱如珍宝，幼年的时候都不肯让他踏在有土的地面上，所以， 闻二百亿的足下生有很多黑毛。</p><p>　　有一天，闻二百亿听到佛陀说法，很受感动，发愿披剃出家，行头陀行，日中一食，树下一宿，急于求证阿罗汉果。由于平日养尊处优惯了，在刻苦的修行中，身体渐渐感不支。于是，他就想<a href=\"https://www.guang5.com/rmgjc/haisu.html\" class=\"keylink\" target=\"_blank\">还俗</a>做佛陀的护法，以布施来求悟。</p><p>　　这时，佛陀走过来，对他说：“我听说你善于弹琴。你说弹琴的时候，如果琴弦太松会怎么样呢？”</p><p>　　闻二百亿说：“世尊，琴弦太松是弹不出声音的。”，</p><p>　　“那太紧了呢？”</p><p>　　“太紧了，一弹就会断的。”</p><p>　　“修行也像调琴弦一样，不宜太松，也不宜太紧。心地放平，自然有进！”</p><p>　　闻二百亿于是遵从佛陀的教诲，调整了心态，继续修行，不久就证得了阿罗汉果。</p><p>　　3定偏多忆</p><p>　　“又在定中，见色阴消失，受阴明白。向前没有新的境界，向后没有安住之处，此人由于智力衰微，茫无所见，忽然生起枯燥干渴之心。并无时无刻不沉浸在这个状态之中，以为这就是精进。 其实这是因为缺乏智慧，不明咎理所致。如果以为这就是证得圣果，就会有忆魔入心。令其人心悬一处，不得安稳。”</p><p>　　4慧偏多狂</p><p>　　“如果慧力超过定力，心怀种种胜解，疑心自己就是卢舍那佛，本来具足，不需要靠修行来证得。这是因为用心的时候，亡失恒审，溺于知见，明白过来也就没事了。如果以此为证果，就会有下劣的易知足魔入心，见人就说：’我得无上第一义谛。‘从而偏离正道。”</p><p>　　“’忘失恒审‘是解释这个用心。就是参禅的人在那儿参悟话头。失于恒审，就是他把念头丢了──参话头的那个话头丢了。丢了，他就落到知见上。’溺于知见‘，就是分门别类地讲这些个名相，落到名相上了，所以他就说他得到第一义谛了，这就是溺于知见了。</p><p>　　参禅是不立文字的，没有说我得第一义谛、第二义谛，凡有言说都无实义的。他把参悟话头又跑到知见上去了，譬如说你参这个”念佛是谁“，这个念头他丢了，他就想名相：”哦，这个第一义谛，大约是我是已经得到了！“他生这种骄傲自满的心，那种下劣知足的魔就来了。他这种思想就已经是下劣，下劣的行为就是不择手段，用种种卑鄙下流的手段去骗人。但是修行不应该搞名搞利，在那个地方尽打锣打鼓的招摇过市，处处吹，讲大话。”</p><p>　　修行中的这种我慢心，是最要不得的。狂妄惹来的麻烦 ，不仅仅是“知足魔”，有时候还有更麻烦的事。下面我们来看看悟达国师的公案。</p><p>　　悟达国师，生于唐朝，四川湄洲人，俗姓陈。他天资聪颖，五岁时随祖父赏花，数步吟成花落诗：“</p><p>　　花开满树红，花落万枝空。</p><p>　　唯余一朵在，明日定随风。</p><p>　　祖父惊叹到：”我这孙儿，本来指望他登甲科，今天看来，这孩子的志向，恐怕是要落入空门啊！“</p><p>　　七岁时，法泰禅师在离他家不远的宁夷寺讲《<a href=\"https://www.guang5.com/rmgjc/niepan.html\" class=\"keylink\" target=\"_blank\">涅盘</a>经》，他一听经就有似曾相识之感，当晚梦见寺中的佛像手摩其顶。从此他每天都去听讲经，并有所领悟，于是请求祖父许其出家。十一岁时，家人见他矢志不移，只得任他削发为僧，法名知玄。十三岁时，镇守西蜀的西川剑南节度使的杜元颖请他到大慈寺的普贤阁开坛讲经，听经的僧俗达万余人。自此知玄名震蜀中，被尊称为”陈菩萨“。李商隐曾作诗赞道：”</p><p>　　十四孩提解讲经，如师年纪只携瓶。</p><p>　　沙弥说法沙门听，不在年高在性灵。“</p><p>　　知玄法师一次参访<a href=\"https://www.guang5.com/rmgjc/conglin.html\" class=\"keylink\" target=\"_blank\">丛林</a>，在长安京都某寺挂单时，遇到了一位僧人。这位僧人生了一种怪病，全身生疮，臭气熏天，谁见了都躲得远远的。知玄住在他隔壁的寮房，天天过来照顾他，送饭洗疮，毫无难色。不知不觉，夏去秋来，气候转凉，病僧的恶疮渐渐好了，在临别的时候，病僧对知玄说：”谢谢你的照顾，今后你如有难解之事，可以到四川的九陇山找我，山上有两棵大松树为标志，我叫迦诺迦。“</p><p>　　会昌五年，唐武宗李炎崇信道教，下诏灭佛，拆毁全国佛寺四千六百多所，强迫僧尼二十六万人还俗，并召知玄在麟德殿与道教高士辩论。知玄 ”辞河下倾，辩海横注“之间，常常忤逆上意。左护军仇士良，内枢密杨钦义等爱惜知玄，恐怕他遭遇不测，示意他作祝尧诗。知玄立即做了五首韵含讽喻的祝尧诗，最后一首道：”</p><p>　　生天本自生天业，未必求仙便得仙。</p><p>　　鹤背倾危龙背滑，君王且住一千年。</p><p>　　武宗虽未接受知玄的劝告，但喜爱知玄的见识和辩才，并未予以追究。至唐懿宗登基时，知玄因为德才兼备而赢得唐懿宗的尊崇。咸通十年，懿宗皇帝亲临安国寺求教佛法，并赐给知玄讲经宝座。座高二丈，以坛香为材，用金丝镶成龙凤花纹，旁设磴道，封其为“悟达国师”。</p><p>　　国师升座讲经时，因为生起骄慢心，忽然看见一个珠子一样的东西飞入左膝，旋即生出一个疮来。有眉有眼，有口有齿，与人面一样，每天需要喂它饮食，疮像人一样开口啖食。</p><p>　　知玄痛苦万状，虽然遍请名医，但百药罔效。这时，知玄突然记起当年京都那位病僧的话，于是前往西蜀，入九陇山去寻找。</p><p>　　一天傍晚，山路难行，知玄正不知如何是好时，忽然遥见山腰处两课松树并立，高耸入云，心中大喜，于是快步走上前去。只见广阔的殿堂，金碧辉煌，那位僧人已经含笑站在寺门前迎接知玄了。两人相见甚欢。国师顶礼毕，述说其苦。僧人告诉他无妨，明日用岩下的泉水洗濯，即能痊愈。</p><p>　　第二天清晨，僧人命一孩童引领国师来到岩下的清泉，刚要洗的时候，不料人面疮竟忽然说话了：“不要洗！我们之间有一段仇怨未了。你是高僧，博览群书，一定读过西汉史。你可知袁盎腰斩晁错的事吗？袁盎就是你，晁错就是我。你十世为僧，认真修行，我找不着报仇的机会。现在你生傲慢心，使我有机可乘，今蒙迦诺迦尊者的悲，调解我们之间的仇怨，用三昧法水洗我，自此以后，我不再与你为怨了。”</p><p>　　国师听了吓得魂飞魄散，连忙掬水洗疮，不觉痛入骨髓，晕绝在地，不省人事。苏醒后，国师觉得左腿已安然无恙，人面疮也消失了，于是醒悟到，那位僧人一定是位圣僧，于是欲回寺礼谢，但回身一看，金碧辉煌的崇楼宝殿已杳无踪影了。悟达国师便就地结庐，朝夕礼诵，所作的忏法，即今之慈悲三昧水忏。</p><p>　　5历险生忧</p><p>　　如来继续说道：“或者因为色阴消散，受阴了了，真正的圣果没有证到，以前的境界又已经消亡，心没个着落，忽然生起无尽的忧愁。如坐针毡，如饮毒药，常求别人害我性命，好早得解脱。这是因为修行失去了方向，明白过来也就好了。如果一味地执着于此，就会有忧愁魔入心。或者令人手执刀剑，割自身的肉，一味地只想寻死；或者令人常常忧愁，循入山林，不愿见人。”</p><p>　　宣化上人解释道：“讲到这儿，我再给你们讲，自尽的人都有个鬼，那个鬼怎么样呢？那个鬼就向这个人叩头。他叩头怎么说呢？他就念个咒。不过这个要死的人，他听不见。这个咒也就是说：”你死了好，死了好，你快死了，死得越早越好。啊，你快一点死了就好了！“那么要自杀的这个人呢，他耳朵虽然听不见，但是他们心灵上是通着的。因为鬼有他心通，可以用那一种鬼的魔气到他心里，令他心里就想：’哦，是死了好！‘心里能听到，就相信鬼讲的话了。于是乎就或者吃毒药，或者去悬梁，或者去跳海，跳金门桥了。哦，就死了！”</p><p>　　“这个虽然说有鬼那么说：’死了好，死了好，死了一了百了。‘他还是自己心里想：’死了比活着好。‘他自己就随着这个境界转。他没有把握，做不得主了。他为什么要死呢？就因为太忧愁了。他自己觉得活着没有意思，所以叫人害他命，他好早点去解脱。”</p><p>　　6觉安生喜</p><p>　　“或者在清净中，心得安隐。忽然生起无限的欢喜，欢喜得难以自已。 这是因为缺乏智慧，不能控制自己。明白过来也就没事了。如果以此为证果，就会有’好喜乐魔‘入心。或者见人就笑，或者在路傍载歌载舞，自称已经解脱无碍。”</p><p>　　7见胜成慢</p><p>　　“在受阴中，心生满足。忽然无端生起大我慢心。目空一切。十方如来都要轻视，何况下面的声闻缘觉。这是因为缺乏智慧，明白过来也就没事了。如果以此为证果，则有大我慢魔入其心腹。令人不礼塔庙，摧毁经像，逢人便说：’佛像都是些金铜土木，经书都是些树叶丝绸。肉身是真的，你不去恭敬，却去拜土木，实在颠倒。‘由此而疑误众生，造下无边罪业，死后堕入无间地狱。”</p><p>　　8慧安自足</p><p>　　“或者在自心的精明之中，悟到了佛性之理。此时心生无量轻安，以为自己己经成就了圣果，这其实是因为智慧力而获得了轻清的境界。 如果以此为证果，就会有好轻清魔入其心腑，令其骄傲自满，不求进步。这样的人，多数会成为无闻比丘，遗误众生。”</p><p>　　“’入其心腑‘，这个不是说把他的灵魂撵跑了，并没有撵跑，只是把他迷住了，不能当权了。魔在他那儿取而代之了。就好像总统有了政变，又来一个人当了总统，他在旁边那儿被软禁，不能发号施令了。”</p><p>　　9着空毁戒</p><p>　　“或者在明悟之中，心得虚明。忽然归向永恒的寂灭。开始无视因果，一切皆空。如果以此为证果，就会有空魔入心，宣扬：’持戒只是小乘，菩萨悟明空理，有何持犯？‘于是常在佛弟子前饮酒食肉，广行淫秽。因为魔力的摄受，还能使人不生怀疑。入魔时间久了，他吃屎喝尿，感觉会跟喝酒吃肉一样，都是空的。以此来破坏佛制定的律仪，误导众生。”</p><p>　　10着有恣淫</p><p>　　“如果品味定中的虚明境界，乃至深入心骨。就会忽然生起无限的爱心。爱极而发狂，成为贪欲，这叫做’定境安顺入心‘。因为缺乏智慧把握自己，而误入欲壑，明白过来也就没事了。若以此为证果，则有欲魔入心，宣说欲望就是菩提，诱使信众纵欲妄为，说行淫的人就是持法的法子。用神鬼的魔力，在末世中，勾引成百上千的信众。魔一旦日久生厌，离他而去，此人威德荡然无存，终被王法制裁，死后堕入无间地狱。</p><p>　　阿难！以上十种，都是受阴在参究的时候所显现的境界。众生顽迷，不自量力，遇到境界，不能明辨。自以为证果，不知道已经犯下大妄语罪，死后堕入无间地狱。你们要在我灭度之后，为众生宣示正法，保护众生，成就无上道。”</p><h3>　　想阴魔相</h3><p>　　“阿难！受阴消尽时，心就可以离开形体，犹如鸟儿飞出牢笼。游离于体外的这个身，就叫’意生身‘。这时，已经能用这个凡夫之身，向上去亲历菩萨六十个圣位的境界。这就好比是熟睡的人说梦话，他本人虽然不知道，但是他的话音却已经清清楚楚了，清醒的人都能听明白。这叫做’想阴区宇‘。”</p><p>　　“’上历菩萨六十圣位‘，他这也没有成菩萨，也没有一定正式开悟，都是一个虚妄的境界。他以为他那样子，并不是那样子，不是真的，他还在五阴里头转呢！这’上历菩萨六十圣位‘都是他自己的幻想，并不是真证得了，这个都是在那儿打妄想。他神通是有了，可是他没有真正证得这个果位。修行，在这个地方你一定要有真正的智慧，要有择法眼，否则很容易认贼作子，以为自己了不起了。</p><p>　　’得意生身，随往无碍‘，这个”意生身“，是他用功在那儿观想他这个身体外另有一个身。那个身不是像这个身体，它也是这个形象，但是是有影无形的，一般人看不见的。这是那个神识、魂魄，成佛也是这个，做鬼也是这个，转畜生也是这个。若属阳，正的，就是成菩萨、成佛；邪的，就堕饿鬼、地狱。那个’意‘就是他作观有这么一种境界出现，他在作意观想有个小人儿出来了，出玄入牝，就叫意生身。也就像鸡菢窝似的，它那也是作意观想，观想出小鸡子来了。不过他这个意生身是无形的，一般人看不见的，要开五眼的人才能看得见。不过这地方，你不能讲开五眼看见意生身。有很多用功的人，觉得自己身体出去了，到了虚空中飘飘渺渺，这都叫意生身。这是一个很平常的事情，有位老修行，他这么想他自己变成千百万亿化身，同时有很多家庭请他，供养他斋，他都去应供，每一个家庭都看见他了，这都叫意生身。不过这都是一时的，就像耍戏法似的，一时可以的，不是长久的。”</p><p>　　“若能不再动念，浮想消除。觉明的本心，犹如除去了尘垢一般，十二类众生，从头至尾，前因后果，都能明了，想阴则清除净尽。这时，就可以超越烦恼浊。回过头来，再看想阴的由来，原来是把’融通妄想‘当做了根本。”</p><p>　　1贪求善巧</p><p>　　“阿难！受阴虚妙，不遭邪虑，因而能成就圆满的定力。在定中贪爱这种圆明的境界，用定中精妙的思维，贪求种种善巧方便。这时，天魔就会得便，而飞精附人，口说经法。</p><p>　　这个修行人，也不知道自己着魔。于是，在魔力的驱使下，自称已经证得无上涅槃。一会变成比丘，一会变成帝释，一会变成妇女，一会变成比丘尼。或者在暗室中，能让身体放光。如果这个修行人相信了魔的话，真的以为自己成了菩萨，就会在魔的摆布下，不再持戒，暗中恣意妄为。它好预言灾难，哪里会有火灾，哪里会有战争、瘟疫等等，或者说如来要在某处出世，以此来骗人钱财。</p><p>　　这是怪鬼年老成魔，闹乱修行人。一旦魔厌离此人，弟子与师父都难逃王法。如果事先知道了，就不会被它迷惑。否则，一旦失去正念，将来难免堕入无间地狱。”</p><p>　　“’受阴虚妙，不遭邪虑‘，这个地方是受阴过去了，在想阴里。它本来是很微细的、很妙的。这种妙是如果你没有毛病，就不会遭到这个邪虑。’邪虑‘，这个虑就是有一种忧愁恐惧感。什么忧愁恐惧感呢？他就是杞人忧天。好像有个杞人，他说这个天不知什么时候塌下来，这就是邪虑了。那么”受阴虚妙“，就是他没有这个境界了，不遭这种境界，就是他自己没有了。可是虽然自己没有了，但他防备的力量不够，所以外边的麻烦又来了。</p><p>　　为什么外边的麻烦来？就因为他里面有所爱，有所贪，有所求，还是有一种自私心，也有自利的心在里头藏着，所以外面就有这种的境界来了。他自己没有这种的念了，可是等到外边的麻烦来了，他又被境界转了。所以这个’邪虑‘不单单是念，也就是你这忧愁恐惧感。好像我们人，这个也怕，那个也怕，这就是邪虑了。被人压迫得也怕，不敢公开，这就是怕，这就是邪虑，受不了这个压力。</p><p>　　现在研究这五十种阴魔，我们恐怕五百种阴魔都会来的，所以各位把你们门开开，欢迎魔来捣乱。那么虽然说是魔，他是帮助修道的，不过是在反面上来帮助，就看你到底志愿坚不坚固。你若真坚固，千魔不改，万魔不退，什么也不怕的，因为你无所求嘛！你在修行无所求，’到无求处便无忧‘。你无所求，什么也不怕，怕什么？有的人怕鬼，为什么？觉得鬼很丑陋、很难看的，因为人人都知道鬼是人死了变成鬼，所以他就怕。可是没有人怕神，金甲神人也是很厉害的，可是人都不怕。孔子曾说：’敬鬼神而远之。‘这是说你应该对他们恭敬，但不要接近他们，所以不要怕鬼，也不要怕神。</p><p>　　魔是我们修道人的一种考试，也是来试验试验，所以各位不要有一种恐惧心。你若有恐惧心，你就不想叫这魔来，他也会来了；你若没有恐惧心，他要来也来不了了--这是最要紧的秘诀，就是不怕。你若不怕，无所恐惧，这就是个正。正，什么都可以降伏的，邪不胜正，所以魔所怕的就是’正大光明‘这四个字。你若能正大光明，魔也就循规蹈矩，也就向你叩头顶礼了。”</p><p>　　弟子：在想阴里，他是没有知觉，自己还不知道，是不是这个意思？</p><p>　　上人：分别得出来啊！就那个飞精附人附到他身上，演说经法。他也认为他自己是开悟了，这是一种好像现在美国这一些个说是有什么神附他的身了，讲什么灾难，说什么的，都是这一类的。</p><p>　　这不要太执着，这个经文怎么说，这都是说一个样子给人听，不一定是这样子的。你要知道这里边不只是五十种，五百种、五千种、五万种都有的，说不完那么多的，这都是一个总括。总括，你们也不要拿它当怎么样高深奥妙那么想，就把它当很平常的人在说话那样，不是尽钻牛角尖。</p><p>　　我讲经都叫浅释，我不深释。我讲经只要人能听得懂，我的意思和人的意思大家互相都懂了，不要往太深了想；往深了想，谁也讲不完。不要钻窟窿，这一定是怎么回事。尤其这是翻译的，不一定都是一字不可去，一字不可添的，它和梵文都有出入的，所以你把总的意思得到了，就都没有问题了。这不要细追究它，不要在文字上用功夫。</p><p>　　弟子：到了想阴，天魔就不能直接扰乱他的心性，而要附到他人的身上来扰乱这修定人的定力。</p><p>　　上人：这就是好像你这修道的人，常常遇到那鬼上身的人，就来或者和你讲法啊，或者和你较量高低啊！</p><p>　　你们知不知道万佛城有一个人，他是普吉利（柏克莱）大学的一个学生，很多条蛇跟着他。你们没有看见，果真在金山寺看见他那个蛇和我斗法。噢，那个威风不得了的！他在这儿，那帮蛇就来这个地方和我斗、斗，大约有十多年了。他到了万佛城，病就逐渐好；回到普吉利去读书，病就发作。他自己知道身上有很多条蛇，这些蛇是被他杀的，都来和他要命的。我现在就是用善法来和它们讲和，给他们调和。它听，我也这么讲；不听，我也这么讲，慢慢来。这十多年了，他这些蛇跑了很多，现在还有几条在身上，以前是一大帮。这就是这一类的嘛！</p><p>　　弟子：如果住到万佛城来，那些东西就不敢来找。</p><p>　　上人：不是不敢啊！一样来的。你看它和我斗法，那个神气很厉害的，先跪着，跪跪就站起来，瞪着眼睛和我来比画。喘大气，呼叱呼叱的，噢，那比猫叫还厉害，比猫呼吸气还厉害！</p><p>　　弟子：那师父怎样？骂他一顿？</p><p>　　上人：我也不骂，我像没有那么回事似的。他们看着我没有那么回事，其实我就是把它度了嘛！它对我敌对，我对它不敌对。不像以前我用降伏法，现在不用这个，我现在用息灾法。</p><p>　　弟子：受阴尽的时候，邪魔不能附到修行人身上，要附到另外一个人身上。可是也有一种讲法，说他可以直接附到修行人身上？</p><p>　　上人：这千变万化的，他或者附到一只猫身上都有的。这个就看你认不认识他，他附到其他动物身上也不一定的。</p><p>　　弟子：修行人本人身上呢？</p><p>　　上人：他进不去了。</p><p>　　弟子：可是以前上人讲五十阴魔时，说他也可以附到修行人本人身上？</p><p>　　上人：No（不），我方才没有说吗？这个都不是一定的，这只是举出一个例子，不是仅仅这样子，这千变万化，他一个可以分成很多的。</p><p>　　弟子：可是，刚才上人又说，他进不到那个修行人本身？</p><p>　　上人：那个修行人真若修行，他到不了的，那因为有护法保护着。</p><p>　　弟子：如果那修行人打起妄想来，那就？</p><p>　　上人：那就来啦！</p><p>　　弟子：就好像我们住在万佛圣城，守师父的规矩，他们就来不了；如果我们不守规矩，他们就来了。</p><p>　　上人：外面有很多人来到这儿，身上已经带着很多邪魔外道、妖魔鬼怪，那护法菩萨也不挡着他，说你不要进来。我们这是慈悲嘛！所以我们这儿不是那么戒备森严的，我也不防备。</p><p>　　弟子：所以如果这个人真修行的时候，就进不来；如果不修行，又开始打妄想，就来了。</p><p>　　上人：嗯，这就是以邪引邪嘛！</p><p>　　弟子：不是说进不了，就永远进不了。好像悟达国师，他起了一念贡高心？</p><p>　　上人：嗯，就是这个。这说得很清楚嘛！</p><p>　　弟子：本来十世都进不了，结果一念差了，就进来了？</p><p>　　上人：就来找他来了，要命来了嘛！</p><p>　　弟子：所以你说进得了，还是进不了，这没有一定的。真修行，就进不了；不修行，就进得了。</p><p>　　上人：嗯，这没有一定的。但有言说，都无实义，你把这个道理懂了，不要太追究它。这里边都是有千变万化的，我方才没说吗！这五十种，五百种、五千种、五万种都可以变化出来的。不要在这例子上用功夫，这是举一隅，你要知道其他的、变化的。总而言之，但有言说，都无实义。所以你可以说一切经都是假的，但是要在这个假的里边找真理。哪部经说得有道理，都可以信的；它没有道理、不正确的，都不要信的。“</p><p>　　2贪求经历</p><p>　　”阿难！如果在定中，喜爱游荡，心神飞驰，贪求种种经历。这时，天魔见有隙可乘，就会飞精附人。令修行人以为自己已经证得无上涅槃。</p><p>　　它能使这个修行人，不起于座，而令听法者忽然坐在宝莲华中，忽然全体化成紫金光。</p><p>　　这是’魃鬼‘年老成魔。它好说些诸佛应世的事情。或者某处某人是某佛的化身，或者某人是某菩萨化生人间。听众一时间信服了它，则邪见与日俱增，正见逐渐消灭。“</p><p>　　”魔很聪明的，他看这人有什么贪心，魔就用什么方法来诱惑你。所以我们修行人也不用念什么咒，也不必用什么法，就老老实实的，不争、不贪、不求、不自私、不自利，埋头苦干，好好修行，什么魔也没有办法你。你一有了贪心，一有了侥幸心，想要占便宜，找捷径，就容易着魔的。因为魔的智慧很高，他看你这个修行人到什么程度了，用什么方法来可以引诱你，他就用什么方法。至于他选什么人，这个对象不是什么问题。这个人只是给他做一个假招牌在那里，他就利用这个人，用种种的法来诱惑你。我们修道的人，如果没有自私自利的心，什么魔也不怕的。“</p><p>　　”昨天有人说，某某人念念佛就跳起来了，好像跳舞一样，这都叫飞精附人。这个人自己不知道，还以为这是入三昧了，这么样天真活泼，蹦蹦跳跳的，像只兔子似的。他念佛念得手舞足蹈，那是他自己变猴子了嘛，这没有什么旁的可说了。说菩萨和他一起？像大圣公，好像一些无知无识的人说大圣公来了，齐天大圣来了，所以就手舞足蹈的。菩萨不会手舞足蹈的，菩萨不是那么贱的，那么样哆哩哆嗦的。现在他每个周末给人看病，用透视，因为他眼睛能看病，看人身体里有什么毛病，就给人看。“哦，很多人去求他！”这就是招摇过市，这就是锋芒外露，总在那个地方大炫示。虽然他暂时还没有露出什么大贪心，或者什么问题，那么慢慢地都有一些不可说不可说的地方。所以各位要特别特别小心，这一点不要贪，以为：’哦，某某人能看见东西，某某人有什么灵感啊！‘妖魔鬼怪都有灵感，连老鼠都有灵感的，不要说其他的东西，老鼠只要有人在外边一走，它就不出来了，那都是灵感。 “</p><p>　　”飞精附人“，这个就是魔的那种精，那个魔的魂魄，他那魔性，也就是那个灵鬼，就是那个天魔。他不是本体来的，他也有神通，他坐那个地方，那个灵魂就来附到人身上，就讲：’我是齐天大圣啊！我是如来啊！我是观世音哪！‘就这一类的。为什么他冒充旁人呢？就因为他自己的招牌不亮。不像那个某某，说他师父是三山九侯，三山九侯是个什么东西？没有人知道。就是他给取出那么个名字，所以招牌不亮。就像你若提出布希总统，谁都知道。他说一句也都很灵的，你这个人犯死罪了，他说赦免你，哦，这个人就活了！就这么样，因为他有势力。那个灵鬼因为他本身没有势力，所以就冒充旁人，这也是个假冒的。因为他本身就是个假的，所以就尽做假的，这个很容易懂的嘛！”</p><p>　　3贪求契合</p><p>　　“如果在定中，喜爱绵吻，澄其精思，贪求契合。这时，天魔乘机飞精附人，也使修行者自以为证得无上涅槃。</p><p>　　它能令这个修行者，或者前来听法的人开悟，或者得到宿命通，或者得他心通，或者能见到地狱，或者能知道人间的吉凶祸福之事。它随口就能诵出经文。令在场的人，个个欢喜。</p><p>　　这都魅鬼年老成魔。它好说佛有大小。某佛是先佛，某佛是后佛。或者真佛假佛，男佛女佛等。菩萨也是这样。”</p><p>　　“’心爱绵吻‘，那个’爱‘就是有贪在里头，’绵吻‘的意思，也可以说是贪神通，也可以说是贪智慧，也可以说是他贪开悟了大开眼界，也可以说是他贪着成佛，上契诸佛之理，下契众生之机。他贪这种的境界，这都是那个爱，有贪在里头包括了，就’澄其精思‘了嘛！就为的是’贪求契合‘，他贪感应道交，贪这种殊胜的境界。</p><p>　　这种东西啊，你没有法子把它弄清楚的，他是乱七八糟在那儿乱贪、乱想，什么都没有一个系统的。你一定要说是怎么样怎么样，未免估计太高了。他那儿七扯八拉的贪一大堆，你若问他贪什么，他也不知道贪什么，说不出来一个子午卯酉。他这没有一个次第的，一个着魔的境界怎么会有那么清楚的？”</p><p>　　“’贪求契合‘这个契合，就是他贪求开悟，贪求神通，贪求想得到什么。’澄其精思‘，就在那儿打坐用功。想要怎么样呢？想要得到神通，所以贪求契合，贪求神通，贪求开大智慧。总而言之，贪种种好的东西，贪种种不劳而获的。像抽鸦片烟过瘾了，他那儿没有过瘾，想要过瘾，不知道用一个什么东西来过瘾好，所以就在这个歧路亡羊的时候，哦，就让天魔候得其便。你要得神通？好，我来帮助你，叫你得神通！就这个嘛！现在懂了吗？很简单的嘛！</p><p>　　好像有一个地方打禅七，打、打，大家都哭起来了。这个抱头痛哭，那个又怎么样，其实这都是着魔了，都是尔时天魔候得其便。完了，那个不懂得的善知识还说：”啊，这有境界了，你看我们这儿这么多开悟的！“就这个嘛！这没有什么。就是这个，就觉得这真了不起了，还把它写出来，谁怎么样哭，哭得怎么样，说的什么，谁又如何如何。哦，这一般无知的人还觉得那个地方打禅七那么多人开悟！原来开悟是开哭的悟、笑的悟，这叫开的什么悟？你说这真令人啼笑皆非。”澄其精思“，就是这个，这没有什么的。那个被狐狸精附体了，中邪了。有一班天上的狐狸在那儿等着，啊，你参禅了！好了，我帮着你开悟；所以，搅得大家都糊里糊涂的。”</p><p>　　4贪求辨析</p><p>　　“又在定中，如果想要推求万物造化的道理，精推细求，思辨解析。天魔的便而飞精附人，令修行者自以为已经得到无上涅槃。</p><p>　　这种魔有威神之力，能让听者心中自然折服。这是蛊毒鬼和魇胜恶鬼，年老成魔。它们好说佛的涅槃就是现前我的肉身。父父子子递代相生，就是法身常住不绝的意思。现在的国土就是佛国，没有另外的净土。也没有金色的佛身，眼耳鼻舌都是净土。男女二根处，就是菩提涅槃之处。”</p><p>　　“’飞精附人‘，这精就是精神，无所谓阴，也无所谓阳。因为这个’精‘，在里头他阴阳精神还没有分开。他这种东西是一种怪物，所以你也不能说他是阴，也不能说他是阳。那么他那个精神就是魔的分灵，魔的一部分，不是魔的全体。因为魔有很大力量，他也有化身的。这也就是他的一个化身，不过是精灵。</p><p>　　精灵很灵的，所以他也辩才无碍，也说偈颂，他的道理也井井有条的。如果你没有择法眼，没有智慧眼，你听起来就不认识了。那么这个人是被魔的力量来加持他，来帮助他，所以他本事也大了。大概你们都听过某某怕那个女人，爬到一根柱子上去了。因为他就是那长虫（蛇）的力量。还有某某摇头晃脑的，这个也叫飞精附人。为什么他那样？也就是因为当初修行不小心，生一种不正当染污的念头，所以这种魔也就来了，得便了。</p><p>　　所以修道啊，我们切记念力要正，无论是哪一位，若尽有这个淫欲的念头，这就很容易着魔。你要是没有淫欲的念头，那就是佛菩萨会支持你。魔和佛的分野，就是一个邪，一个正；一个染污，一个清净。那魔的力量也是和佛差不多，尤其现在这个时代是魔强法弱的时代，魔力是很强的，法好像很软弱的，所以好像自说功德、标异现奇、现奇特相，这都有一点魔的境界。”</p><p>　　弟子：既然他公开说是对的，为什么还要潜行？那公开就行了。</p><p>　　上人：他还是不敢，他那个邪不胜正，他见不得天嘛！现在公开的也很多。</p><p>　　弟子：他也不相信他自己说的。</p><p>　　上人：他自己？根本就没有他自己了，这魔附体的嘛！这是飞精附人在那儿支配他讲嘛！某某名教授赞叹高丽那个发狂的人，说他开悟了，又怎么样子，都是讲这个嘛！他们都这么样讲，就都说眼、耳、鼻、舌都是净土，男女二根就是菩提涅槃真处，都这么讲嘛！说他开悟了嘛，他那是公开了，他不怕的，所以某某名教授都写文章来赞叹他，那就是这一类的。“</p><p>　　5贪求冥感</p><p>　　”如果在定中，心爱悬应，周遍精研，贪求冥感。这时，天魔得便，飞精附人。令修行者以为自己证得无上涅槃。</p><p>　　它能令听众暂时地见到它的身形，好像一个千百岁的老翁。信众于是以为：“这就是我过去生中的师父。”于是，生起法爱，如胶似漆地，片刻不能舍离。一切供养，倾心尽力。甚至甘心在其座下，身为奴仆。</p><p>　　这是疠鬼，年老成魔。它好说些：“我于前世，某生中先度某人。当时他是我的妻妾兄弟，今生特来相度。我要带你去某世界，供养某佛。或者说有大光明天，是一切如来所居住的地方。”</p><p>　　“’心爱悬应‘，这个’悬应‘就是凡事能预料，明年、后年的事情他都知道，也就是未卜先知了。’贪求冥感‘这个’冥感‘是对着上面的’悬应‘说的。那个’悬应‘是预先就知道了，这个’冥感‘也是默默中就知道了。这个冥感，没有法子说得清楚的，或者有形的，或者无形的，或者在默默中知道了，或者他一睁眼睛看见什么，就知道了这是什么事情，不须预兆，这个不必那么费功夫研究。或者他自己身上那个地方一动，动他几下，他也觉得这是怎么回事，这都是这一类的，只可意会不可言传的。他自己觉得是这样子，也不一定是这样子，这都是一种揣测。他冥感，就是在冥冥之中，一般人所看不见的，他就知道了。或者睁了眼睛，看见灯了，”哦，这是有光了，这个位置一定是有什么境界了！“一闭着眼睛，”哦，黑暗了！“这都是冥感。他就这么想，贪求，本来没有事情，他就要找个事情来干。</p><p>　　这都不是真的，你们不要在这个地方用功。冥感有什么凭据？没有什么凭据的，也拿不出来一个什么证据。这叫冥感--空洞的。就好像那三步一拜，在路上，本来是一个贼来偷你们东西，左偷一趟，右偷一趟，把你们毯也偷去了，有的东西都偷去了。你们是想什么呢？”噢，这是菩萨来试验我们！“这就以为是冥感了，就是这个。原来他是个贼，你就拿他当菩萨了，也不敢惹他，这都叫冥感。所以冥感也可以说是在那儿瞎猜，瞎打妄想，贪求这个嘛！他有贪求两个字，你就知道这一切一切都是假的了。”</p><p>　　“’飞精附人‘，你们都没有懂得这个道理。这个飞精，是那个邪的怪物，譬如狐狸或者黄鼠狼、或者是长虫（蛇）、或者是乌龟，他在那个地方就像入定似的，用他的神通入定，也就是他那个魂魄，他那个精灵，他所修的那个灵从他身上飞出来，就到另外那个人的身上，入到那个人身的窍，这叫’飞精附人‘。他的精飞出来了，在他这个精灵本身就不会动了，好像入定似的。他在那儿入定，但在这儿他又可以作怪，就像他本身到这儿一样，也会说话，也会显神通，什么他都会的，这叫飞精附人。你们懂这个意思了吧！</p><p>　　弟子：请问有神通的动物和天魔有什么关系？</p><p>　　上人：这个动物是个比喻，那个天魔也是这样子。那个天魔多数都是人间的精跑到天上去的，都是人间这些动物修行时间久了，到天上去做天魔了，就是这些个东西。他在天上又和人间的样子不一样了，他也会千变万化。你想要真正知道，这没有法子知道的。天地间那些个秘密的事没有法子了解的。你不要用我们人的思想来揣测天魔是什么样子。你若能知道他，你就和他是一样了，或者你若超越他了，也可以知道。这要和他一样，可以知道；不和他一样，也没有超越他，谁也不会知道的。</p><p>　　在西方，很多这些个事情西方人都不相信的，这也没有法子完全写在书上，叫人怎么样真了解。可是我知道西方人也有很多鬼上身的，西方人都说这是发神经，不承认他是有什么魔呀、鬼呀、邪呀！中国在表面上也多不承认，可是在骨子里边，就那些个做官的也都怕这个，也多承认的。在大体上他们不承认有这个，可是那些个做大官的都要去扶鸾问卜。好像陈济堂要造反的时候，就问那个扶鸾，那个扶鸾出四个字，说：”机不可失“。结果他就以为这现在就是个机会了，不可以把这个机会失了，就造反了。一造反，三十多架飞机一起飞起来，跑到对方去投降了。原来这个’机不可失‘，就是这个飞机不可失去，飞机若失去就没有用了，结果你看看！飞精附人，他只要一念之间就可以到了，这个’飞‘也就是形容其快。”</p><p>　　“’别生法爱‘，不一定是爱那个法，他爱那个人和那个法。他若单爱法，没有什么淫欲的行为，没有关系。他这个法爱包括也爱那个老师了，也爱那个来说法的那个人，他能叫人看见他变成百千岁，那就生了法爱了嘛！你若单爱法是没有问题的，那这里是也爱那个人了。法里头是包括那个人。你们各位想一想是不是这样子？如果单要爱那个法，法是没有形象的，没有什么问题的。</p><p>　　这是心理变态，被他这个把戏迷住了。教她做什么，她就做什么，不是单单四事供养，不是饮食、衣服、卧具、汤药这么简单，她都要以这个身心性命来供养他，都要和他行淫欲。所差的地方就在行淫欲这个地方，有淫欲，这都是邪的；没有淫欲，那才是正的。你什么时候也不可以听那个人说：’开悟了，什么都可以干了，也可以行淫欲了。‘这简直地是大魔王说的话。你不开悟，不守规矩，那是你不懂；你开悟，你懂了，却明知故犯，再不守规矩，不守戒律，那你开悟，开个什么悟？变成开倒车，往回走了。</p><p>　　所以现在的人不研究那个真理，只知道人家说开悟了，不需要守什么规矩，也就跟着这样说：’噢，不需要守规矩了！‘他开悟的了，抽烟、喝酒、玩女人，什么都干了。所以最要紧的地方，就是有一个淫欲，他有淫欲心，尽行不净行，这就是魔；他不贪钱，没有淫欲，那就是真的。</p><p>　　他专门公开对大家这么讲：’哦，你前生是我的什么太太啊！是我的娘娘啊！你是我的什么啊！我做过皇帝啊！你怎么样怎么样子。‘公开对大家这么讲，就引诱人生这种淫欲的心。他公开讲就变成去骗人，去攀缘。”</p><p>　　6贪求静谧</p><p>　　“或者在定中，心爱深入地修行。于是在阴暗幽寂的地方，贪求静谧。这时，天魔得便，飞精附人，令这个修行者觉得自己已经证得无上涅槃。</p><p>　　它能令与会的人都知道自己的宿命。或者对某人说：’你虽然没死，但现在已经是畜生了。‘接着，就令人在后面蹋住他的尾巴，那人顿时站不起来了。于是在场的人都倾心拜服。甚至有人刚起一个念头，它就已经知道了。</p><p>　　这都是大力鬼，年老成魔。它常在佛制定的律仪外，另加些更清苦的约束。并且时常诽谤比丘，骂詈徒众，揭露人的隐私，不避讥嫌，还常预言些吉凶祸福，往往丝毫不差。”</p><p>　　7贪求宿命</p><p>　　“如果在定中，喜爱知见。于是勤苦研寻，想要了知宿命。这时，天魔得便，飞精附人，令修行者认为自己得到了无上涅槃。</p><p>　　是人无端于说法处得大宝珠，或化为畜生，口衔珠宝符牌这样的奇珍异物，先送给人，后着其体。或者引诱人藏身地下，忽然在藏身之处发现了夜明珠。</p><p>　　这其实都是山神、土地、城隍等，年老成魔。这种魔或者只吃药草。或者每餐只吃一麻一麦，却能膘肥体壮。它常诽谤比丘，骂詈徒众，不避讥嫌。还好谈说哪里埋着宝藏，哪里有圣贤隐居。你到那里一看，往往真会见到异人。或有宣淫，破佛戒律，与承事者潜行五欲。或纯食草木，种种行为，无定行事。厌足心生时，弟子与师都要受到王法的制裁。”</p><p>　　弟子：“于说法处得大宝珠，其魔或时化为畜生。”是另外一个魔吗？</p><p>　　上人：不，就是那个魔。</p><p>　　弟子：这个魔附着的人，又化成畜生了？</p><p>　　上人：嗯！大家就看见他像畜生，就是现古里古怪的样子嘛！“先授彼人，后着其体”，“彼人”，就是求宿命的人。</p><p>　　弟子：求宿命的人已被魔附身，化成畜生了，口里又衔着宝珠及杂珍宝？</p><p>　　上人：给当时那些听法的人。这不是一个人，或者他选择其中的一个人，这都是假设之辞，一定有这个事情吗？没有的。你不要认为佛说这样，就认为是一定的。这只是举出一个例子，要大家触类旁通，不是就这样死板板的，凿死卯子，要灵活运用，再有这种事情，你就会知道，“哦，这和那是相同的！”你说他变畜生，或者他变一个佛也不一定的。或者他什么都可以变的。不是单单指定你就可以变畜生。他这里说是有珠宝，这都不一定的。你喜爱什么，他就会变什么。你心里所执着的什么东西，嗳！他就有了！所以这个都不是真的，都是个比喻。</p><p>　　弟子：“后着其体”呢？那个魔又着到谁的体上呢？</p><p>　　上人：又着到每一个人身上。</p><p>　　弟子：另有魔来着到每一个人身上吗？</p><p>　　上人：就那个魔，魔可以分身无数的，可以着到那一个人的身上，又可着到旁人身上。</p><p>　　弟子：哦，跳来跳去！</p><p>　　上人：不是跳，他不是一个，可以变很多的。</p><p>　　弟子：哦，着到你身上，又可以着在他身上！魔的力量那么大的？</p><p>　　上人：嗯，那个魔和佛的力量差不多的！不过就是一个邪，一个正。魔所做的事情是邪的，佛所做的事情是正的，所差别的就在这里。台湾有一个居士，他经过很多，有这个经验，现在可以叫他再讲。（对居士说）你要和盘托出，把魔传给你的心法讲出来。</p><p>　　居士：上人、各位法师、各位善知识，我现在所讲的，是我在台湾跑过的外道所显现的，跟我所了解的。或许我了解的，跟佛所说的天魔不大一样，因为天魔是千变万化的。我看到的，只是他们显现的方法之一而已，不是全部的境界，只是供作参考，不一定是全部事实。因为天魔的显现方式有好几种，一种要经过灵媒，一种不经过灵媒。普通学习外道，如果你的心不太正的时候，他不经过灵媒，在你禅坐时，天魔就直接可以显化，化做一个人的样子。</p><p>　　在这段经文“是人无端于说法处，得大宝珠。”因为有“于说法处”，依我所看到的，我想是有灵媒、说法者、听法者三种人存在的情形。“是人”，上人的翻译说是着魔的人，这也是一种的翻法。但是我看过其他的翻译，和我所了解的，“是人”也可以说是还没有着魔的人。为什么这么讲？因为佛讲《楞严经》，是为了警惕还没有着魔，但是心已经稍微偏的人，你要警觉，如果不警觉就会着魔。用意是要警诫人：在色、受、想阴已经尽的时候要特别注意，或许有这些事情会显现，如果显现，你们要怎么样预防。</p><p>　　两年前，我到一个在家人那里，他也是剃了光头，好像一个沙门的样子，他在家里禅坐的时候，天魔附在他的身上，说：“某某人，我送你一本《无字天书》，送你一部什么经。”开始的时候，因为你的心不正，想得到一个迅速得证的方法，所以去那个道场，他会化做各种的方法。“五十阴魔”前面这三十阴魔的境界，每一天、每一个地方，像这一切一切，大概我都看过，也听他们说过。</p><p>　　好像那些简册、珍宝和藏什么东西，我都看过。或是一餐一麻一麦，还是一餐可以吃很多东西的情形都有。就好像授大宝珠，你打坐的时候，他说：“某某人，我授你宝珠好不好？”如果你心一动，想得到这个东西--这是指透过灵媒--你把手伸过去接下来，接下来之后，就产生问题了。</p><p>　　我以亲身的体验来讲，二年前我到一个地方，他说：“我授你一部《无字天书》，让你练三年，三年练完以后，你可以得到很大的神通。”那天我因为心有点动，就想：“你送我一部《无字天书》，好啊！”我就接下来了。他又说：“你要接受的话，就双手往上提，我授给你。”授完以后，回家第二天，我整天就念，我自己都听不懂，好像在说日文，又好像泰国文。又唱日本明治天皇那时候的军歌，我以前根本没有唱过，其实我的声音很差的，但是一唱起那个军歌来，声音可以很高，可以很低，比电视、电台里歌星的声音还要好。我想这《无字天书》就是经文说的“简册”。</p><p>　　这里“说法处”有二种情形，一种是你本身没有着魔的人，没有办法看得到；受阴没有尽，也没有办法看到。一种是你本身在<a href=\"https://www.guang5.com/rmgjc/jingzuo.html\" class=\"keylink\" target=\"_blank\">静坐</a>时，被天魔附的那个人看得到，你也看得到。</p><p>　　所以这一段有二种情形：一种是被天魔附的人和你都在定中的时候，他授你什么东西，你本身也可以看得到外界的景象，其实这只是个幻境，是“是人”所变的。一种是你本身没有看到，只心动而已，他说：“我授给你什么东西，好不好？”你讲“好”，那时候就不一样了。天魔其实也有天魔的规矩，你如果说我不要，他也着你不上的。据我所知道，整个台湾的外道都在前面这三十阴魔的境界之内，这是想、识还没有尽的境界。“</p><p>　　宣化上人继续说道：” 最要紧就是’或有宣淫，破佛戒律，与承事者潜行五欲。‘他若那样子，就是正的也邪了；要不是那样子，邪也是正了。要紧的就在这个地方，你要认识真正的意义在什么地方！他见到奇奇怪怪的，假如他要是正的，不宣淫，这也都不足为奇的，没有什么，都很平常的事情。就在宣淫不宣淫的地方，那是要紧的！</p><p>　　’或有宣淫‘，他是尽提倡淫欲，说双修法，说淫欲就是菩提。他说一定要那么修行才能成佛，这就是邪见。他有这种毛病，却掩护他的罪过，掩护他犯戒的行为，叫人不知道，说这才是真正佛法。像某某这一套，一天到晚带着一帮女人吃吃喝喝的，各处乱七八糟的，他公开宣淫，修双身法。</p><p>　　好像加拿大有个叫某某的，又说他是喇嘛，又说他是神父，又说他是牧师，又说他是比丘，结果带了一帮女人二十多个，小孩子也有二十多个都跟着他。一大帮人都是他的，他说他们都是在一起cultivation（修行）。你们都没有见过，这就是那个奇奇怪怪的。他到那儿，他说他知道海里来一艘船，看船去，那个地方就来了一艘船，跟着他的那一帮人说：“这真灵验，真有感应！”</p><p>　　我头一次去加拿大，他就带了一帮女人手上不知拿着什么东西，好像他的法宝似的，总是这么举着，弄那个怪样子，跪在我面前要来受戒。以后他们又不敢来受戒，都不敢来。他求我印证他是班禅喇嘛，他说班禅喇嘛也不知道死了，也不知活着，可是现在就对跟着他学习的人说他就是班禅喇嘛。就是某弟子以前也是跟着他学的，某弟子那时候在那儿，没有米吃了，某某就叫他用一部truck（货车）到各处去偷东西卖了来吃饭。你们想一想，这是多么不可思议，他跟着这么一个人去学佛法！在蒙特利奥，我还去看他们，还买了两百磅米送给他们，怕他们偷东西吃。</p><p>　　他到加拿大我这儿，对我恭恭敬敬的；等我到他那儿，就摆起个架子，穿得很威风的，带着他那一帮女人都出来给我叩头，可是他不叩头。在加拿大他对我叩头，到他那儿他不叩头。他说和他那些女人生孩子是cultivation（修行），就这个嘛！公开生孩子，都跟着他，他也很大的本事，那些个女人互相不妒忌障碍的，都是很大方的。</p><p>　　弟子：为什么土地城隍、川岳鬼神会年老成魔呢？</p><p>　　上人：他们尽受人们鸡啊、鸭啊、猪啊的供养，他就成魔了嘛！就学习不正了嘛！好像有的人就学抽鸦片烟了，有的人就往正路上走，有的人就往邪路上走。这个你都不懂吗？鬼神尽贪人的供养，贪多了觉得这是不错，所以就什么都干了，就成魔了，将来也就堕落啊！你懂吗？很简单的。</p><p>　　佛所说的法都在世间摆着呢，你可以以此类推，没有什么不明白的。乃至小孩子调皮，不听话，都是在那里演说妙法嘛！你认识了，样样都是妙法；你不认识，样样都是末法。“</p><p>　　8贪求神力</p><p>　　”如果在定中，心爱种种神通变化，研究变化的本元，贪取神力。天魔得便而飞精附人，也是令修行者，自以为证得无上道。</p><p>　　或者一只手拿着火光，另一只手把火分开，放到众人的头上，听众却不会被烧到，也不会感到热；或者在水上行走，如履平地；或者在空中安坐不动；或者能钻到瓶子里，口袋里，穿墙越壁，毫无障碍。唯独惧怕刀兵。</p><p>　　这都是天地间，有大力的山精、海精、风精、河精、土精，一切草木所成的精。或者是龙所成的妖魅，或者是寿终的仙人转成鬼魅。或者是仙人已死，身形不灭，被鬼怪附着而成的魔。这些精怪，年老成魔，恼乱世人。这种魔常谈论神通，它能让人见到十方佛土，但这并不是真的佛土，而是它的魔力幻化的。它自称是佛，诽谤参禅和戒律，谩骂自己的信众，揭露人的隐私，不避讥嫌。又赞叹行淫，以种种污秽的事情，作为他传法的途径。“</p><p>　　”’天地大力‘，他这种是邪力，不是权力。就像土匪杀人，这只是他一种强权的力量，不能说他有权力杀人的。</p><p>　　’山精、海精… …年老成魔，恼乱世人‘，我再给你们说一个比喻，他又说是山精、海精、草木年多了，久了成精，又说河精、土精这一类的。这就譬如一个人，年轻的时候很正经、很守规矩的，等子孙满堂老了，他不守规矩了。不守规矩就怎么样呢？在这个国家，你看报纸常常见年老的八、九十岁了，那么老的人还常常有把他的孙女给强奸了，强奸一次、两次还不够。他老奸巨猾，乱七八糟，所以就成魔了。他若还守规矩，还像年轻的时候那么正真无私的，还是神。可是现在就不能叫他神，叫他妖怪了。他就是妖怪！在中国，这个“精”就是老的意思，他变成老奸巨猾，谁也看不透他，认识不清楚他。所以单翻一个“精”字是省事，如果说全了，应该说是个“老妖精”，人人都恐惧他。</p><p>　　在’楞严咒‘上就有一段是专门呼召山妖水怪的。这我试过，看见那个妖精有几百个头的，有几百只手的，有几百条腿的，有腿上长了很多头的，古古怪怪什么样儿都有的。我见过的。“</p><p>　　9贪求深空</p><p>　　”又在定中，心爱寂灭，参究化性，贪求存灭自在的空理。这时，天魔得便，飞精附人。</p><p>　　也令这个修行人，自以为证到无上涅槃。它能使它附着的人，在众人面前忽然消失，又从虚空中突然而出现；或者身体犹如玻璃一样透明；或者手足向下一垂，就能冒出檀香味；或者大小便犹如<a href=\"https://www.guang5.com/sushi/yaoshan/fengmi/\" class=\"keylink\" target=\"_blank\">蜂蜜</a>一样甘甜。</p><p>　　这其实是在日蚀月蚀中，吸收了日月精气的金芝玉草，麟凤龟鹤，经千万年不死而成精，惑乱人间。这种魔毁谤戒律，轻贱出家人。常说没有因果，死后就永远消失。没有来世，也没有圣贤。虽然得到空寂，但还是偷偷地恣淫纵欲。跟它行淫的人，也会因为着魔而得到空心，不承认因果。“</p><p>　　上人：你要用择法眼来观察，也用妙观察智来观察这种境界的问题。你观察，不要执着到这个上，说我观察观察。这种妙观察智就像个镜子，和大圆镜智差不多的。不过大圆镜智是不动不摇地就现出来一切诸法实相，妙观察智是用一种观察的力量才能够知道清楚。那么你能用客观的态度，就不落这一种偏见。你认识这种境界，就不被它转。</p><p>　　弟子：我有一个问题，孙悟空是从石头里头生出来的。为什么那石头会生出这只猴子？是因为这石头经过几万年的日月精华以后，就会有这种现象发生？像孙悟空这种情形，是不是跟经文上讲的是一样？就是日月薄蚀精气，然后这些什么金玉芝草、麟凤龟鹤吸取这些精气，变成这些魔。像孙悟空这种情形，从书本上看，他好像还有一点善根，知道生死轮回是很痛苦，所以他经过八百年之后，就跑去求道，学各种法术，后来又变成佛教的护法。</p><p>　　像孙悟空这还是好的例子，可是这里说，这些什么精灵鬼怪年老的时候就变成魔。那是什么情形之下，他们老了会变成魔？因为在这种情形下，魔好像是流氓似的，就做不好的事。我想是不是有的不会变成魔，有的会变成魔？因为有的是好的，有的不是好的。</p><p>　　上人：孙悟空这只是魔的一分子，类似这个情形是很多的。孙悟空也就是大约在想阴上修行有问题了，所以就变成一只猴子，钻天入地。这正是《楞严经》说的魔的一个代表者。那么至于其余的魔，当然他做魔做够了，也就会皈依三宝。在什么时候他能一念回光返照，觉悟了，他还不失为一个佛的弟子。他若不觉悟，就是魔。这魔就是他越老，年头越多，神通越大，他若年轻，就没有那么大的力量，没有那么大的神通。越老那力量、神通都不可思议了，所以叫魔。这个魔比鬼更厉害，魔鬼、魔鬼，这鬼是会变魔的。</p><p>　　你们听没听过以前那个如意魔女？那是周朝的一个鬼，她不守规矩，就被雷给劈了。雷劈了她，但是没有完全把她消灭了，所以她聚精会神地又聚会到一起，就修行成一个魔，各处去要人的命。</p><p>　　为什么魔要人的命呢？就是因为要增加自己的势力和眷属的势力。每逢这个魔魔死一个人，其余的魔就来恭贺他说：”你真有本事！“就像我们做官的，升官似的，就那样子。因为魔多杀一个人，就增加一种势力，这个鬼的势力也听魔招呼的。如意魔女以后遇到我，也皈依三宝了，这也是魔皈依佛的一个例证。</p><p>　　这个世间一切的事情都很微妙不可思议的。在这部经上只是说一少部分，要是详细说，每一阴的魔就有千千万万那么多，有种种的不同。所以举出这一样，大家也可以触类旁通，就不要生那种贪求爱心了。没有欲念了，什么魔也不怕；你要是没有贪欲了，什么魔没有办法你。魔就是看见你门开了，他就会进来；你总是门不开，他就不会进来。</p><p>　　为什么魔生到天上去，因为他修了很多福报。经上说天魔，不要以为那个天魔就是在天上，他可以到天上去，但他不一定常常在天上。那么人间这一切的有神通的魔，都可以做为天魔。天上的魔如果需要他们去呐喊助威，随时他们都可以去的。他们生到天上，不单有欲念，而且根本这个脾气是最大，刚强得不得了，就是因为有一种好勇斗狠，所以就做魔了。他若没有好勇斗狠，没有脾气了，那就是佛的眷属了；有脾气，这个无明很重的，这都是魔的眷属。</p><p>　　至于他们将来受什么果报，那是很远很远的一个事情，这不可以考究的。他们有的遇到这个神通大的，如果他们太不听教化，可以把他们摧毁，没有了，化为和虚空一样。那么有的没有经过摧碎，他做的恶多了不改过，还是那么背觉合尘，还是那么迷，当然将来也有他的果报。他那果报也是很辛苦的，或者去做狐狸啊，做黄鼠狼啊，都堕落到畜生道去。这都是魔的精灵。他做这一种东西。或者变蛇啊，或者变老鼠啊，或者做种种奇奇怪怪的畜生。这都是那种魔里魔气的东西变的。所以你们若看见很恶的众生，好像老虎啊，这都有一点魔的力量在那儿帮助它，因此它才有那么大本事。”</p><p>　　10贪求永岁</p><p>　　“如果在定中，心爱长寿，辛苦研究，贪求永年。因此天魔得便，飞精附人，也使修行者，自以为证得了无上道。</p><p>　　它能万里之遥，瞬间往还，还能取来远方的物件做证。或者一间屋子，几步远的距离，它能令人走几年也走不到。因此使人生信。这种魔自称，十方众生都我的孩子，是我生出的诸佛，是我生出的世界。我是最本元的佛，我一出世，自然就是佛，不用修行。</p><p>　　这是’住世自在天魔‘，令它的眷属遮文茶鬼，四天王的毗舍童子等没有发善心的鬼，利其虚明，食人精气。或者这个修行人，亲眼见到魔，自称是执金刚神，能赐他长命，于是就变成美女，与他行淫。日复一日，纵欲无止。没过几年，便肝脑枯竭，卧床不起。口中语无伦次，如同妖魅。如果不能及时醒悟，则难免油尽灯枯，死后堕入无间地狱。”</p><p>　　“我遇着一个人，天天晚间就有一个女人来找他，白天没有。这个女人一来的时候，他家里所有的人，都听得见这个女人走路的声音，好像穿着高跟鞋似的，一走’喀登喀登‘的，踩得楼板响。但是旁人只听见这个响，看不见这个人。那么他呢，这个女人一来了，他也不管有人没人，把衣服脱了，就上床乱来一顿，这就是这种鬼。</p><p>　　以后，我那边有一个古大神，就是巫医。这个巫医就去到他家里，给他治这种魔病。一治这魔病，这个魔鬼就来了，告诉古大神说：’好了！你现在不是来给他治病吗？这里这个病人从今天开始就好了。可是，我现在就到你家里去，就要和你来斗斗法！‘果然，从此之后，就到古大神，这古巫医的家里去了。他的哥哥也一天到晚有这个魔鬼来，和他有这种不正当的行为。啊，这个魔，你说怎么样啊？喔，厉害啰！这个魔真厉害！”</p><p>　　“本来’毗舍、遮文茶‘这都是护法，’楞严咒‘里都有的，但是他这个不是’楞严咒‘里头那个，他是还没有护持正法的这些个。利其虚明’，‘利’就是趁这个机会。在那个破无明还没有破的时候，就在这一念天堂、一念地狱的时候，在这里趁虚而入。这时候你一念正，就可以证佛果；一念邪，就可以做魔王，这就叫虚明。虚明就是不是很正确的明白。所以就‘食彼精气’，毗舍、遮文茶就来吃这个精气。”</p><p>　　“在我年轻的时候，专门欢喜和魔来斗法，斗得三千大千世界的魔军都想来对付我，所以有很多次几乎把生命都没有了。因为这个，我就再有这种和魔斗法的心，也不敢再用什么法来和魔斗了。因此现在很多的魔来欺负我，我都修忍辱的功夫不和他们起对待，我只用一种慈悲心来摄受、来感化他们，而不用降伏法来降伏他们。</p><p>　　我记得在东北有过一次，是在道德会上，有个讲习班主任叫徐某某。这道德会有五、六十个学生，其中就有一个着魔，中邪了；所谓着魔就是邪魔来附体了。这讲习班主任徐某某，自以为讲习班的主任，是有地位的、有权力的，就来为这女孩子治魔。她用一口凉水，照着中魔这个女孩子就喷一口。这一口喷上了，这魔还没有走，魔就说：”好，你来治我，我现在就到你那儿去，我要附在你身上，看你怎么样？“于是乎，这中魔的女孩子病就好了，而徐某某自己就中魔了，中邪了。</p><p>　　方才张果鸿说他也用过这个方法，念咒来喷这个人，这个魔就跑了；这个魔大约法术还不够，所以就跑了。但附在徐某某身上这个魔不怕凉水喷，他不跑，于是乎徐某某自己就发魔气。她发了魔气，在道德会也不能住了，就回到家里。回到家里，这个魔天天都来扰乱她，扰得她家里不平安。这个魔是什么魔呢？是个马猴子精，很大的马猴子精。这马猴子精一来了，就和徐某某有性行为。它附到她身上就来折磨她，有时候就把徐某某迷得又讲怎么样爱她，又怎么样，就有性行为。性行为完了，徐某某本人就七孔流血，眼睛也流血，耳朵也流血，鼻孔、嘴巴都流血。就这个样子，被这个马猴子精，把她的精气都给吸去了，吸得瘫痪要死了的样子。</p><p>　　道德会就派人去找我们庙上的方丈和尚，我们方丈和尚是很有名的，在东北叫王孝子。因为听说三缘寺这庙上方丈和尚有道德，可以降伏这个魔，于是乎就找他去了。但方丈和尚什么事情都叫我去，在外面有一些个什么问题，并不是他自己本人解决的，都是我去帮他解决的。好像大南沟高德福这家里的问题，还有很多很多的，外面人都也知道的。</p><p>　　这次方丈又叫我去，叫我去我就去了。去到这儿，他们就说把谁请来了。这马猴子，你猜它怎样说？”唉，你请他是白费功夫，没有用的！你不要说请他呀，你把济公请来，我也不怕的。“就这么在那儿讲，什么也不怕。等我到了呢，它真的来。，这马猴子来了，然后真是又斗上法啦，斗、斗、斗！斗了两天才把它降伏。降伏住了，从此病就好了，那么这个人也没有死。像这些个问题，我经过很多很多的。</p><p>　　现在我也不愿意管人家的闲事。为什么要这样呢？我就是修忍辱的功夫嘛！有人在我头上疴屎呀，我也不发脾气，也忍着；所以现在我的宗旨是这样子，和任何人也不斗争。果鸿你以后切记，不要再惹麻烦了，这还算你有点善根，要不然的话，嘿，这个魔很容易就跑到你身上去。所以这不是很好玩的一件事情。”</p><p>　　“阿难，要知道，这十种魔，在末法时期，或者投生做人，在我的佛法里面出家，或者附到别人身上，或者亲自现形，自称已经成正遍知觉。赞叹淫欲，破坏律仪。魔师与魔弟子，邪淫的恶行，代代相传。近则九生，远则百世。邪魔深入心腹，而使修行人，终成魔眷属。命终之后，成为魔民。福报享尽，终堕无间地狱。</p><p>　　阿难。你先不要入灭，纵使你已经得到了无学的果位，也要留下来，在末法之中发起大慈悲心，救度深信佛法，正心修行的众生，令他们不要着魔，始终保持正知正见。我现在已经度你出离生死苦海，你遵从我的教诲，就是报佛恩。</p><p>　　阿难！以上这十种禅修的境界，都是从想阴中交互变化出来的。众生顽迷，不自量力，逢此因缘，不能认识，自以为证得圣果，犯大妄语，堕无间地狱。</p><p>　　你们必须在末法时期，把我的话传达给众生，让众生明白这个道理。不让天魔有机可乘，使众生都能成就成无上道。”</p><h3>　　行阴魔相</h3><p>　　“阿难！想阴除尽的时候，平时就不会再胡思乱想，睡着的时候也没有梦。无论清醒还是睡寐，一直都是清清楚楚的状态。心中犹如晴朗的天空，再没有粗重的前尘影事所遮盖。这时再来看山河大地，就如同镜子呈像一样，来无所黏，过无留痕。心中只剩下一个照应，而没有任何习气所带来的起伏。全体只是唯一的精真。</p><p>　　生死的根本，从此显露出来。十方世界十二类众生，虽然没能通达他们的来龙去脉，却已经见到了产生的根元。这个根元，犹如春日中地气蒸腾所产生的‘阳焰’一样，若有若无。这也正是浮根六尘的根本所在。这叫做‘行阴区宇’。</p><p>　　如果这个熠熠扰动的生灭根元，终于湛然不动。犹如波澜平伏，化为澄静的水，这就是行阴除尽了。这时，就能够超越众生浊。回过头来，再看行阴产生的根源，原来是把幽隐妄想当做了根本。</p><p>　　阿难，要知道。在正定中保持正心，十类天魔不能得便。这样，才能不受干扰地精研十二类众生的生死根本。在观察那个清幽扰动的生死根源时，如果用心不当，就会堕入十种外道中。”</p><p>　　1二无因论</p><p>　　如果对十二类众生产生的根源，生起了分别计度之心，就会坠入二种‘无因论’之中。</p><p>　　第一种是‘见本无因’，就是认为众生的产生没有原因。在生死的根元显露出来时，此人用眼根所具有的八百功德，能够见到八万劫内所有众生，在生死海中，随着业流，头出头末。八万劫外，他就盲无所见了。 于是便认为，这世间的众生，都是没有什么因由，自己产生的。这是第一种无因论。</p><p>　　第二种是‘见末无因’，就是认为没有如来自性作为众生的归宿。这人见到了产生众生的根源，只见人生人，鸟生鸟。乌鸦从来就是黑的，天鹅从来就是白的；人永远都是站着走，畜生一直都是横着爬；白的不是洗成的，黑的也不是染就的。所有的一切，八万劫内，从无更改。而我自身也是如此。从来就见不到什么如来自性，怎么会有成就菩提道这样的事呢？这是第二种无因论。</p><p>　　这是第一种外道，立的是无因论。“</p><p>　　弟子：这个人既然可以看到八万劫，为什么看不到人在六道中轮回呢？</p><p>　　上人：你要知道他所看的，虽说是二万大劫，其实只是一个虚妄在那儿管着。一念为无量劫，无量劫为一念。他觉得是二万劫，其实这都不一定的，因为他这还是在虚妄的境界里头转。是一种妄想在那儿支配他，才有这种妄境现出来，所以他看见猪，也是二万大劫做猪；看见牛，也是二万大劫都做牛来的。他觉得是这样，其实这都不是正确的。要是正确的，真是二万大劫，当然猪在<a href=\"https://www.guang5.com/rmgjc/liudaolunhui.html\" class=\"keylink\" target=\"_blank\">六道轮回</a>里头，不是单单做猪呀！那么他说都是这样的，这已经证明他所有一切都是假的了。</p><p>　　好像台湾来的那个人就说：”啊，我觉得我和某某人在唐朝六祖的时候，就一起在那个法会里！“这其实就是这种境界了。他觉得，觉得就表示那一切事情不是真的。真的，那要有证据的，也不是到处那么自我宣传的。如果是这样，这么长的时间又遇到一起，他怎么会舍得那么快就走了呢？他真是放得下吗？不是的。他为什么要再回台湾去干什么呢？就是为的这么样一说，好鱼目混珠来颠倒是非，令人认不清楚了，”哦，他真不得了了！他真是啊，这个人真如何如何，你看，他知道在唐朝就和某某人在一起如何了、怎么样了！</p><p>　　怎么样？你不修行一样堕落做鬼的。所以各位要有真知灼见，要有真正的智慧，看这个人说这个话，究竟他什么意思要这么讲话？那么他看见某某人在万佛城、金山寺也有点影响力，他如果把那个人一拉上，你说这对他有多大的帮助。那么那个人也就默认了，说是：“哦，是的，我和他是在六祖大师会下就一起<a href=\"https://www.guang5.com/rmgjc/xuefa.html\" class=\"keylink\" target=\"_blank\">学法</a>的！”你看，这无形中，他这个身价就高起来了！就好像有个人跑到万佛城来，说我们怎么样护持他，就是一个样的道理，这个都是大同小异的，不过骗人的方法不同而已。</p><p>　　所以各位对于这一点，要特别注意的，我方才没有说吗？这个假的是给真的预备的。先有假的，那个假的到这儿来，他把人都弄得迷迷糊糊，以后有真正要找真法的，他就要找正法去了，也就可以说是无路可走了，他就要追求正法了。</p><p>　　所以“反者道之动，弱者道之用，清者浊之源，动者静之基。”这个道是相反的，所以我们人学佛法，要有真正的择法眼，就认识是法、非法、黑法、白法、正法、邪法，要认识。不怕他是邪、是正、是黑、是白、是善法、是恶法，就是你若认识了，就好了；你若不认识，在那地方糊糊涂涂的，真的你也不认识，假的你也不了解，一天到晚在那儿囫囵吞个枣，也食而不知其味，那就糟了。“</p><p>　　”我们也讲道理的，不论他是假的、真的，他讲得有道理，我们就相信；讲得没有道理，讲得不合乎正法，不合乎戒律，他就是真的，我们也拿他当假的。所以这个真假从什么地方分别？就从黑法、白法来分别。哦，你也糊里糊涂的，那些个邪知邪见，你说它是对的！那个正知正见呢，你说它是不对了。这真是颠倒黑白，颠倒是非！我们有这种思想，那将来就是主于没有眼睛的，没有眼目的，因为黑白不分嘛！这种邪知邪见的人，将来受果报，也受没有眼睛的果报，因为他都是瞎人的眼目，令人找不着正路。所以这一点各位要特别特别注意的，这因果是特别厉害，丝毫都不爽的。就由我这一生的经验，我就知道不能做错一点事情，稍微做错一点事情，那个果报就来了。“</p><p>　　以上是宣化上人对法的真假正邪做的开示。上人说，这个立无因论的人，他看到的其实都是虚妄的假象别。说他看到的不是真的，即使是真的，八万大劫，也看不到事情的真相的。</p><p>　　在佛住世的时候，有一个老人名叫尸利毖提，他想：”我一生穷苦，今生又没有做过什么功德，来世一定还会很苦。不如出家修道去，将来好得个好去处。“于是，老人来到世尊的道场，想要跟佛出家。</p><p>　　那时，偏巧世尊不在。凡是来出家的人，证果的大阿罗汉都要查一查他的前因后果。他们一看，这老人在八万大劫以内，没有种过一点善根。于是对老人说：”你不能出家的，因为你没有种过善根。你还是走吧。“</p><p>　　老人一听，顿时万念俱灰，就想去跳河去自杀。如来见他的因缘已经成熟，于是出现在他的面前，问道：”老人家，你哭什么啊？“</p><p>　　”我想跟释迦牟尼佛出家，佛没有在。佛的弟子说，我在八万大劫以内，都没有种过善根，一点好事都没做过，所以就不收我出家。我活着也没意思，不如死了的好。我很伤心啊！“</p><p>　　佛说：”哦！你不要哭了。我就是释迦牟尼。我准许你出家。你回来吧！“</p><p>　　老人悲欣交集，马上跟佛回去剃度。由于生死都已经放下，所以他很快证得了阿罗汉果。那些弟子就产生了怀疑：”奇怪啊，世尊！佛收的弟子都要有善根的。尸利毖提老比丘根本就没有善根，怎么还能出家证果呢？“</p><p>　　佛就告诉这些阿罗汉说：”你们这些阿罗汉，只能看八万大劫以内的事情，八万大劫以外，你们就不知道了。这个老年人在八万大劫以外，是一个靠砍柴为生的人。有一天他在山上遇到一只老虎。慌乱之中，他趴到树上去。然而老虎不肯放过他，就在下面啃树干。正在树要被啃断的时候，他情急之下，喊了一声‘南无佛’。老虎被吓跑了，他因此得救。他现在出家成道，就是八万大劫以外，他念‘南无佛’的这个善根成熟了。“</p><p>　　2四圆常论</p><p>　　”阿难！如果有人，对于周圆遍常生起分别计度，就会堕入四遍常论。</p><p>　　第一种、是人穷心境性，见心、境二处都没有因由。在修习中，他看到二万劫中，十方众生所有的生灭，都是在心、境中循还往复的。内心和外境，没有丝毫散失，所以他把心境计为恒常。</p><p>　　第二种、参究四大的根源。见四大常住不灭。在修习中，他看到四万劫中，十方众生的所有生灭，都是在四大中完成的。四大在此过程中，并没有丝毫的散失，所以他就把四大计恒常。</p><p>　　第三种、参究六根八识的本源，见六根八识恒常不变。在修习中，他看到八万劫中，一切众生的八识，循环不失，常住不灭。于是，他就把这八识计为恒常。</p><p>　　第四种、想阴灭尽，生死的根源显露出来。他就认为，生灭的想心既然永远消灭了，理所当然，剩下的就是不生不灭了。于是，就把行阴计为恒常。</p><p>　　这是第二种外道。立的是圆常论。“</p><p>　　3一分常论</p><p>　　”又在定中，坚凝正心，魔不得便，穷究十二类众生的根本，观那幽清扰动的根元，如果这时，对于自他生起分别计度时，就会坠入四种颠倒的知见中。一分无常，一分常论。</p><p>　　第一种、是人见妙明心遍满十方，以为这就是神我。然后就以为，我遍十方，凝然不动，一切众生在我心中自生自灭。我的心性，就应该是常；那些生灭，就是无常。</p><p>　　二者、是人不去观察自心，而是遍观十方国土。见哪个世界毁坏了，认为这就是究竟的无常；哪个世界没坏，认为这就是究竟的恒常。</p><p>　　三者、是人观察自己这个心，精细微密，犹如微尘一般流转十方。它没有迁移，没有改变，却能令身体即生即灭。于是就把心这个不坏的性质，当做常性；把从我心流出的一切生死，当做无常性。</p><p>　　四者、是人知道想阴已经除尽，只见行阴在迁流。于是把行阴的常流，当做常性；把色阴、受阴、想阴等已经除灭的，当做无常性。</p><p>　　这样去分别计度，一边是无常，一边是恒常。这是第三种外道。立的是一分常论。“</p><p>　　4四有边论</p><p>　　”如果在行阴的分位中生起计度，就坠入四种有边论。</p><p>　　第一种、是人见十二类众生的生死根源，流用不息，于是在其中产生了份别计度。他认为过去的已经过去了，这是一个边际；未来的还没有发生，这也是一个边际；只有现前这个相续的心是无边的。</p><p>　　二者、是人能看到八万劫以内的事情。但八万劫以外，他就看不到了。于是，他就把看不到的，当做是无边；有众生处，当作是有边。</p><p>　　三者、是人见到了一切众生的生死根本，于是认为我能遍知一切，所以我得到了无边性。其他一切人，都在我的知性之中。而我不能知道他们的知性，他们就是没有得到无边之心，所以就是有边性。</p><p>　　四者、是人参究行阴，直到把行阴参空。这时，以他所见的境界，在心中筹度。一切众生一身之中，一半生一半灭；世界中所有的一切，都是一半有边，一半无边。</p><p>　　就这样计度有边和无边，这就是第四种外道，所立的是有边论。“</p><p>　　5遍计虚论</p><p>　　”如果在观察生死根本的微细动相时，在知见中生起计度，就会坠入四种颠矫乱的遍计虚论。</p><p>　　第一种、是人观察变化的根元。看到迁流的地方，就认为是变；看到相续的地方，就认为是恒。能看到的，就认为是生；看不到的，就认为是灭。处在不断的相续之中，就认为是增；相续之中有所断裂，就认为是减。有所产生，就认为是有；有所消亡，就认为是无。虽然是以正理观察，却因为分别计度而产生了偏见。有人向他求法，他就回答：“我现在是亦生亦灭，亦有亦无，亦增亦减。”总是这样说些胡乱的话，令人无所适从。</p><p>　　第二种、是人观察自己的心，见处处迁流，没个定所。自以为得到证悟。有人来问，就只回答一个‘无’字。除了这个无，别的什么也不说。</p><p>　　第三种、是人观察十二类众生，或生或死，都有定所。自已为得到证悟。有人来问，就只回答一个‘有’字。</p><p>　　第四种、是人有和无都看到了。但因为所观察的境界有有和无的分歧，所以心也就跟着乱了。有人来问，他就回答说：‘亦有即是亦无，亦无之中不是亦有。’一切都混乱了，没法跟他讲道理。“</p><p>　　就这样胡乱推究，得到一些虚无的结论。这就是第五种外道，立的是遍计虚论。”</p><p>　　6死后有相</p><p>　　“对行阴的迁流无尽生起分别计度，就会堕入死后有相，发心颠倒论中。</p><p>　　或者执着于身形，认为色相就是我；或者见我的心包含一切国土，认为我拥有一切色相；或者见一切色相，随着我回环往复，就认为色相从属于我；或者见到我在这微细动相中相续，而认为我在色相中。因为行阴无尽，所以认为死后仍然有相。就这样执着在色相上，甚至认为烦恼就是烦恼，菩提就是菩提。两者并驾齐驱，各不相干。这是第六种外道。”</p><p>　　7死后无相</p><p>　　“观察生死根本的微细动相时，对先前已经除灭的色阴、受阴、想阴生起计度，是人就会坠入死后无相，发心颠倒论中。</p><p>　　色阴已经灭尽，身形无所寄托；想阴也已灭尽，心念无所依附；受阴已经断灭，色与心之间，从此再无连缀。纵使还有行阴这个生发之理，没有受想，也如同草木一般。生前尚且了不可得，死后还能有什么呢？就这样认为生前没有可种的因，死后没有可成的果。从此陷入因果、涅槃皆空的境地。认为一切都不过是个名字而已。 这是第七种外道。立死后无相，心颠倒论。”</p><p>　　8死后俱非</p><p>　　“观察生死根本的微细动相时，看到行阴存在，受阴、想阴已经除灭，此人就既认为是有，又认为是无。于是坠入死后俱非，起颠倒论中。</p><p>　　色阴、受阴、想阴，以前虽然有，但是现在已经除去了，所以见有又不是有；行阴虽然无住，却相续不断，所以见无又不是无。如此循环，对色阴、受阴、想阴、行阴反复推究，都是非有非无。于是就认为，死后既有相又无相。又见一切都在迁流变化中，因而觉得自己大彻大悟，认为一切都是非有非无，不虚不实的。这是第八种外道，立五阴中死后俱非，心颠倒论。”</p><p>　　9死后断灭</p><p>　　“观察生死根本的微细动相时，对色、受、想、行阴断灭后的无相境界生起计度之心。于是坠入七断灭论。</p><p>　　或者身体灭尽，或者欲望尽灭，或者一切苦尽灭，或者一切乐尽灭，或者舍心也灭尽。如此循环，反复推究。他觉得，该灭的都已经灭尽了，灭完就再也没有了。由此推断，死后则一切断灭。这是第九种外道，立五阴中死后断灭，心颠倒论。”</p><p>　　10五现涅槃</p><p>　　“观察生死根本的微细动相时，对诸阴断灭后的有相境界生起计度之心。于是坠入五涅槃论。此人把欲界的爱慕，初禅的无忧，二禅的无苦，三禅的极乐，四禅的苦乐双亡，当作安稳的胜境。如此反复地推究，认为这就是涅槃。这是第十种外道，立五阴中五现涅槃，心颠倒论。</p><p>　　阿难！这十种禅那狂解，都是修行者，在参究时，心与行阴交互所产生的境界。众生迷顽，不自量力。遇到这些境界，就自以为得证圣果。犯下大妄语戒，堕无间地狱。”</p><h3>　　识阴魔相</h3><p>　　“阿难！修行者在行阴灭尽的时候，世间十二类众生，那熠熠扰动的本源生机，深沉微细的生死枢纽，轰然倒塌。有情众生酬尝业感那深沉的脉络，凭空断绝。</p><p>　　涅槃的天空，行将放亮。如雄鸡报晓，曙光乍现。六根虚静，再没有奔驰放逸。内外明湛，没有能入和所入。深达十方十二类众生轮回的本元，不再被十二类众生所牵引。十方世界，同归于识性。幽暗隐秘之处，尽皆显现。这叫做‘识阴区宇’。</p><p>　　能把十二类众生的感召，全部销归到识性当中。销磨六根，令其开合自如。开则一根能成六根，合则六根同为一根。眼能彻听，耳能明视，互相为用，清净无碍。十方世界和自己的身心，犹如玻璃一样内外明彻。这种境界，就表明识阴已经除尽了。这时就能够超越命浊。然后，回过头来看识阴的由来，不过是误把罔象虚无的颠倒妄想当作了根本。”</p><p>　　1因所因执</p><p>　　“阿难。要知道，行阴成空，还入识阴。生灭的迁流，已经消亡。然而对于寂灭的精妙，还没有圆满证得。能令自身的六根，根隔开合，也能与十方众生的觉知相通，能入万类之本源。如果把他所归入的这个境界当做真常，认为这就是圣境界，就会堕入‘因所因执’当中。从此，便与那些宣扬冥谛的黄发外道成为伴侣。 这是第一种外道。立一个有所得的心，作为他归依的处。因此而违背了圆通的初衷，错失了涅槃路。”</p><p>　　“‘娑毗迦罗’就是那个黄发外道。以前讲过，就是摩登伽女她妈妈跟着学的那个师父。他用”娑毗迦罗先梵天咒“，这个就叫黄发外道。这种黄发外道所归的冥谛--‘冥’就是什么也没有了，就是第八识在现在这个境界上变化出来的。他说，一切万物都是从冥谛上生出来的。”</p><p>　　2能非能执</p><p>　　“穷尽行阴，已灭生灭。对于寂灭的精妙之处，还没有圆满证得。如果把这个识性当做自己，认为尽虚空界的十二类众生，都是从我的身体中流出来的。并以此作为圣境界，是人则堕入能非能执当中。现无边身的摩醯首罗天王成为他伴侣。 这是第二种外道，立一个能生的心，成一个成事的果。由此而违背了圆通之道，偏离了涅槃之路。生到大我慢天，以为自己遍满一切。”</p><p>　　“自在天就是色界天的最顶上的一层天，叫摩醯首罗天。‘摩醯首罗’就是大自在天王。他有三个眼睛，这三个眼睛都是肉眼。他也有个佛眼，是在中间这儿长着。这个眼睛，也是他生来就有的。</p><p>　　那有多少只手呢？他有八臂，有八只手。前边四只、后边四只。前边他可以拿东西，后边又可以偷东西。他嫌一只手不够用，两只手偷东西也没有那么得力，生了八只手。这只也可以拿一点东西，那只也可以拿一点东西。到了百货公司，相信稽查员也看不住他，因为他手太多了。他骑着一头大白牛，手里拿着一个白拂，到处悠游自在的，这是大自在天。他说：”我最自在了！嘿，你看我，你比不了我，我最自在了！“所以叫大自在。</p><p>　　这个大自在天，执着他可以现无边身。他说，一切众生都是他现出来的。那么现在这个人修的也是这个法门，也有这种执着了，他也说一切众生是他现出来的。你看，他还没成佛呢，怎么能现出众生来了？这就是一种妄执--能非能执。”</p><p>　　3常非常执</p><p>　　“如果把这个识性，当做自己的归属，认为自己的身心，都是从识性中流出来的。甚至十方虚都是由此而生，于是就把识性当做真常。在生灭中，就以为自己已经永恒了。这样既背离了无生之理，也错失了生灭之道。在沉迷之中，就自以为已经证得圣果。这叫做‘常非常执’，自在天的天人成为他的伴侣。迷佛菩提，亡失正见。 这是第三种外道，立一个有所依托的心，成就一个虚妄计度的果。”</p><p>　　4知无知执</p><p>　　“又在行阴成空，生灭已灭，寂灭的精妙还没圆满的时候，如果以此时的所知，认为识性周遍圆满，十方草木，也在识性之中，所以草木也是有识的。因为有识，所以草木也属于有情众生，与人无异。草木死后可以做人，人死后还生成十方草木。如果把这种无拣择的一概而论作为胜解，就会堕入‘知无知执’。婆吒、霰尼这样执一切觉的外道，成为他的伴侣。这是第四种外道，以自以为是的周遍之心，成就一个虚谬的果。”</p><p>　　“‘婆吒、霰尼’这是两个人。‘婆吒’是梵语，中文的意思就是‘避去’。他怎么叫这么个名字呢？他以前是个牧童。毗舍离王还没有做皇帝的时候，也在外边玩，玩的时候呢，就拿婆吒当床铺，在他身上睡觉。婆吒就很不高兴，回去对他母亲讲：‘这个毗舍离他拿我当床，睡在我的身上。’他母亲知道这是个未来的皇帝，也不敢怎么样，因为他有势力，所以就说：‘那你以后不要和他在一起，你离他远一点，避开他。’于是他的名字就叫‘避去’。‘霰尼’也是梵语，翻成中文叫‘有军’。大约他就欢喜去当军人，他有军人的气概，所以叫这个名字。这两个外道”‘一切觉’，他们自以为什么都知道。这个修行人就成为他们的伴侣。“</p><p>　　5生无生执</p><p>　　”如果对六根互用，已达到了运用自如的程度。于是在这圆融无碍的化境中，追求火的光明，爱慕水的清净，喜欢风的吹拂，崇尚地的生发。对这四大，各各崇事，把这些尘相当做真常。因此堕入‘生无生执’当中，诸迦叶尊者当年所奉的事火外道成为他的伴侣。这是第五种外道，崇尚外事，而迷失了本心。立一个虚妄的因，求一个虚妄的果。“</p><p>　　这里说的诸的迦叶尊者，指的是优娄频螺迦叶、伽耶螺髻迦叶和那提迦叶。</p><p>　　这迦叶三兄弟在皈依佛陀前，是很有名望梵志。他们每人座下，都有几百名弟子。尤其是优娄频螺迦叶，他的声名遍满摩揭陀国。大家都认为他已经证得了阿罗汉果。</p><p>　　为了度化迦叶三兄弟和他们座下的弟子。这天傍晚，佛陀来到摩揭陀国优娄频螺迦叶的道场。佛施展神通，把自己变成苦行者，并化出五百名弟子围绕在周围。优娄频螺迦叶的弟子们一见这么大的排场，连忙出来招呼，为这些化人，铺床的铺床，洗脚的洗脚，一个个忙的不亦乐乎。优娄频螺迦叶一向最尊重苦行者，又听说有这么多弟子跟随，于是亲自前来迎接佛陀。</p><p>　　佛陀见到优娄频螺迦叶，便收回神通，恢复本形。优娄频螺迦叶心想：”这大沙门竟然有这么大的神通，可惜他还不能了脱生死。跟我比，还有差距啊！“于是对佛陀说：”仁者远道而来，天色以晚，就住在我这里吧！喜欢住哪个房间，您随便挑选。“，</p><p>　　佛陀说：”多谢大德的盛情！如果方便，我想住您祭拜火神的那个草堂。“</p><p>　　优娄频螺迦叶面露难色，对佛陀说：”那个草堂里有一条毒龙，非常凶猛，不管人畜，只要被它撞见，就会没命。还是请仁者换个房间吧！“</p><p>　　原来优娄频螺迦叶以前有个弟子，得了痢疾。病重之时，他把草堂里弄得污秽秽不堪。其他弟子嫌他臭，就把他赶了出去。这个弟子一个人，孤苦伶仃地躺在外面，含恨而死。死后，由于嗔恨心，他化成一条毒龙，生在了那个生前不让他进的草堂里。只要有人进来，毒龙就一定会放毒把他螫死。优娄频螺迦叶在草堂里供奉火神，想用火神之力来降服毒龙。他每天祭司，非常虔诚，但是毒龙猖狂依旧。</p><p>　　佛陀听罢，若无其事地说：”大德。您不要担心，即使全世界的毒龙，都集中在那个草堂里，也奈何不了我的！“</p><p>　　优娄频螺迦叶虽然不放心，但耐不住佛陀的一再坚持，最后只好嘱咐佛陀千万小心，就让弟子把佛陀引到草堂去了。</p><p>　　佛陀进入草堂后，端坐在蒲团上，进入禅定。不多时，毒龙觅食回来，远远地望见佛陀坐在他的房间里，生大嗔恨。毒龙冲到佛前，先放出毒烟想熏死佛陀。佛陀也同样放烟。接着，毒龙又吐出猛火想烧死佛陀，佛陀又同样出火。</p><p>　　草堂内一时火光四射。优娄频螺迦叶的弟子们见了，担心佛陀被毒龙烧死，都提着水瓶水桶，赶来救火。没想到这火是世尊的火光三昧所化，水浇上去，火势反而更猛。这些梵志们见此情景，都认为佛陀必死无疑。他们回想起佛陀美好的容貌，庄严的举止，慈祥的神情，优雅的谈吐，不免都感到十分惋惜。</p><p>　　这时，优娄频螺迦叶也闻讯赶来，在草堂不远的地方围观。一个弟子就问优娄频螺迦叶：”师父，我看这个大沙门的生宿中，没有被恶星侵犯的迹象啊！“优娄频螺迦叶仰望星空，对弟子说：”这大沙门是鬼宿日生。鬼宿不能被其他星宿所侵。我看这大沙门的星相非常明快，所以今天跟毒龙的斗法，应该是大沙门获胜。决不会错！“</p><p>　　果然，第二天清晨，佛陀安然无恙地出现在优娄频螺迦叶面前，说：”仁者，这就是那条毒龙，我已经用威火将它降服了。“说着，佛陀把钵递到优娄频螺迦叶面前。只见钵中，一条毒龙生着九个头，张牙舞爪地就要向优娄频螺迦叶扑来。吓得优娄频螺迦叶连忙倒退，心道：”这大沙门的法力竟然如此高强。只可惜他还没证得阿罗汉果，跟我比还是有一定差距的！“</p><p>　　优娄频螺迦叶见佛陀有这么大的法力，便邀请佛陀在这里常住下来。于是，佛陀便住在了优娄频螺迦叶旁边的树林中。</p><p>　　当天夜晚，四位天人从天而降，来到佛陀的面前，长跪顶礼，向佛请法。他们身上的光明，照得整个树林如同白昼，老迦叶看得一清二楚。第二天清晨，迦叶便来拜访佛陀，问昨晚来的是什么人。佛陀告诉他，是四王天的四大天王。优娄频螺迦叶大吃一惊，心道：”这大沙门竟然有如此威德，连四大天王都拜在他的座下。不过他还没有证得阿罗汉果，不能了脱生死。嗯，应该还是不如我的。“</p><p>　　接下来的每天夜里，从夜摩天到兜率天，一直到大梵天的大梵天王，都来向佛陀请法。优娄频螺迦叶看在眼里，每次都拿佛陀还没征得阿罗汉果来安慰自己。</p><p>　　转眼间，祭司的节日就要到了。局时，摩揭陀国所有的人都要拿着精心置办的美食，到修行者那里去祭司。优娄频螺迦叶心想：”明天，这个大沙门最好不要出现。不然，他一显神通，所有的人就都会去供养他，我的供养就会少了。“佛知道优娄频螺迦叶的心念，果然在祭祀期间，佛陀一直没有出现。祭祀结束后，迦叶拿了一些美食，来到佛的住所，问佛陀：”仁者，怎么祭祀期间一直没见到你呢，你到哪儿去了？“”你昨晚担心我会在信众面前施展神通，使你的供养减少，所以我今天就独自一人，去郁单越乞食了。“迦叶听罢，羞愧得无地自容。又对佛陀的德行，佩服得五体投地。</p><p>　　接下来的日子里，佛陀又展现了许多神通，终于折服了老迦叶的心。于是，迦叶率领座下的五百名弟子，都皈依了佛陀。他的两个弟弟，听说哥哥皈依了佛陀，便也都率领弟子，来到佛陀的座前，剃度成为沙门。</p><p>　　6归无归执</p><p>　　”或者在圆明中，认为这个明应该是个虚无的，于是灭掉一切造化，把永远的断灭作为唯一的真实，以此作为圣境界。因此堕入‘归无归执’当中，非非想天的那些虚空神成为他的伴侣。这是第六种外道。以虚无为心，结成了一个空亡之果。“</p><p>　　7贪非贪执</p><p>　　”或者在圆常中，想要坚固身形，常住不衰，以此为圣境界。此人则堕入‘贪非贪执’，那些长命仙人成为他的伴侣。这是第七种外道，执着于身命。立一个虚妄坚固的形因，得一个长久辛劳的尘果。“</p><p>　　一切众生，终究难逃一死。即使再想方设法地延长寿命，在无生无灭的如来眼中，也不过如我们看朝生暮死的蜉蝣一样可怜。而我们却还执着在这一点少得可怜的寿命中，去追求那一点少得可怜可怜的快乐。对此，佛曾做过一个形象的譬喻：</p><p>　　一切众生，贪着世乐，不顾无常，不以大患为苦。譬如有人被判了死刑，越狱逃跑。按着国法，越狱者应该放狂象踏死。于是，国王放出狂象追逐死囚。</p><p>　　死囚见狂象就要追来，便躲入一口枯井。井下有一条大毒龙，张着血盆大口要吃掉死囚。井的四边还有四条毒蛇，伺机袭击死囚。惶恐之间，死囚抓住了一个草根赖以维持。这时，却来了两只白鼠，不停地啃噬着草根。</p><p>　　井上有一棵大树，树上有蜜，每天都会有一滴蜜落入死囚的口中。死囚于是日日等待着这滴蜜，而忘却了忧患，不再求出枯井。</p><p>　　三界就好比牢狱，囚禁着众生；狂象好比无常，无时无刻不在追逐着众生；枯井好比人间；毒龙好比地狱，一失人身，难免堕落--佛曾比喻说，失人身者，如大地土，得人身者，如指甲土；四条毒蛇就好比四大，时时威胁着众生--在外为种种天灾，水灾火灾，地震飓风，在身则为种种疾病，呼吸血液，脏腑发热等；草根就好比人的命根，脆弱地把人悬在人间；两只白鼠就好比日月，日复一日地减损着寿命。</p><p>　　然而众生却贪着那一点一滴的世乐，而不顾大患。所以修行者要时时观照无常，以摆脱众苦。</p><p>　　8真无真执</p><p>　　”又穷尽行阴，灭尽生灭，对于寂灭的精妙还没有圆满时，看到一切生命本来相通。于是留住尘劳，恐怕它消失殆尽。自己端坐在莲华宫中，变化出奇珍异宝，宫娥彩女，纵情娱乐。并以此作为圣境界，于是堕入‘真无真执’， 吒枳、迦罗成为他的伴侣。这是第八种外道。以邪思之因，结成一个炽心于尘事的果。“</p><p>　　”这个‘吒枳、迦罗’，怎么叫吒枳呢？‘吒枳’翻译成‘结缚’。结，就是用一条绳把它拴个结子；缚，就是用一条绳把它绑上了。这就言其用绳子把众生绑住了。‘迦罗’，这是印度话，翻译成中文叫‘我所作’，就是我所作的，什么是我所作的呢？言其一切众生的这个结缚，这个不自由，都是我所作出来的，我教他不自由的。这两个外道天，他们这样的思想。那么这个修定的人，就成他们的眷属。“</p><p>　　一切尘劳，最终都将归于幻灭。就像水泡一样，再美好也只是转瞬即逝，如何值得我们去贪恋呢？佛陀曾讲过这样一个故事：</p><p>　　从前有个国王，他十分溺爱自己的女儿，一天到晚都陪在她身边。女儿有什么要求，国王都会千方百计地满足她。</p><p>　　有一天下起了大雨。雨点落在地面的积水上，溅起了许多水泡。水泡在宫灯映照下，闪着七彩的光环，公主见了，十分喜爱。于是他对父求说：”父王，我要用那些水泡成做花鬘，戴在头上。“国王笑着说：”傻孩子，水泡这东西用手是抓不起来，怎么能穿成花鬘呢？“公主听后，撒起娇来，说：”我才不管呢！要是不给我做出来，那我就干脆自杀好了。“</p><p>　　国王一听女儿要自杀，心中害怕起来，赶忙召集全国的能工巧匠，吩咐道：”你们都是有心思灵巧，技艺精湛的人，应该没有做不出来的东西吧！快给我取水泡，做成花鬘。做不出来我就处死你们！“</p><p>　　工匠们听了，面面相觑，没听说水泡还能做成花环的。有一位老工匠却说他能做到。国王很高兴，连忙告诉女儿：”现在有个人，他会用水泡做花鬘。你快跟他去看看吧！“公主十分高兴，连忙跑到老匠身边。那老匠对公主说：”公主殿下！我不知道哪个水泡好看，请您自己捞好看的水泡，我来给您做花鬘。“</p><p>　　公主于是蹲下身来，伸手到水中去捞水泡。可是手一碰到水泡，水泡就消失了。捞来捞去，忙活了半天，一个水泡也捞到，公主终于厌烦了，于是转身跑回王宫，跟国王说：”父王，水泡虚幻不实，不能长久，我不要了。父王给我做个紫磨真金的花鬘吧！真金的花鬘才永远都不会枯萎。“</p><p>　　所以，在识阴中留却尘劳的行者，就如同捞水泡的公主一样，终究是要白忙一场的。因为尘劳中的一切，就像这水泡一样，用瑰丽的色彩，诱惑众生去辛苦地追求，然后却无情幻灭。纵使能寿如非想非非想天人，达到八万大劫，在无尽的如来性海中，那也只不过是转瞬即逝而已。只有如来藏妙真如性，才是那真金的花鬘，才是永恒而美好的，唯一真实的存在。</p><p>　　9定性声闻</p><p>　　”又穷尽行阴，灭尽生灭，对于寂灭的精妙还没有圆满时，专注于分别识阴的真伪、粗细和前因后果，只求感应，从而背离了清净之道。见到世间之苦，便求索苦的成因。断绝苦因，修证而入有余涅槃，到此就停止不前。以此当做圣境界。于是堕入定性声闻之中，那些无闻的增上慢比丘成为他的伴侣。这是第九种外道。以圆精感应的心，成就趣向寂灭之果。从而背离了圆通，缠缚在空中。“</p><p>　　10定性辟支佛</p><p>　　”如果在圆融的清净妙觉中，发挥深性，研究妙义，在这里立成涅槃，停滞不前，以此为圣境界。于是堕入定性辟支佛。这是第十中外道，以圆明觉悟的心，成就湛然明了之果。“</p><p>　　阿难！以上十种境界，都是中途成狂。因为迷惑，在未成就的时候，就心满意足，自以为得证。这都是识阴在用心交互的时候，所产生的境界。”</p><p>　　“众生顽迷，不自量力，境界现前，就随顺了自己的贪爱之心，而迷失了本性。把现前的境界，当做了究竟的归属。自称已经证得无上菩提，犯大妄语，终堕无间地狱。或者别成声闻缘觉，无法进步。</p><p>　　你们要继承如来的正道，将我所说的法，在我灭度之后，传示给末法众生知道。不要让众生误入歧途，错失了菩提路。</p><p>　　这个法门，过去恒河沙数的劫中，像微尘那么多的如来，因此而开悟，成就无上道。</p><p>　　识阴除尽，六根互用。在互用中，能入菩萨的金刚干慧地。圆明的精心，在其中发化。如同洁净的琉璃中，镶嵌着一轮明月。这样就超过了十信、十住、十行、十回向、四加行心、菩萨所行的金刚十地，直至等觉圆明，流入如来微妙庄严的菩提性海。圆满的菩提，终归于无所得。</p><p>　　这是过去先佛世尊在楞严大定中，用智慧观照而发现的微细魔事。魔境现前，你能辨别。洗除心垢，不落入邪见。这样阴魔自然销灭，天魔摧碎无余，大力鬼神逃之夭夭，魑魅魍魉无法出生。直至菩提，一帆风顺。下劣的心得到增进，对于诸佛如来的大涅槃，不再迷闷。</p><p>　　如果末世愚钝的众生，不知道禅定中的魔事，也无缘亲身聆听如来说法，只是自己修习禅定，你就劝他们一心诵持楞严神咒。如果不能诵持，就写在禅堂里，或者佩带在身上。这样，一切诸魔就都不能动他。”</p><p>　　“至于说着魔的人，若能念‘楞严咒’，魔会不会走？你能念‘楞严咒’，什么魔都会走的，但是要专一其心来念。你若专一其心念，不打旁的妄想，没有什么贪心，什么魔都会远避的。只怕你一边念咒，还一边打妄想，这杀生的念也不断，偷盗的念也不断，邪淫的念也不断，打妄语也不停止，喝酒呢，更是心里总想着喝酒；这样子，你就念什么咒也都不会灵的。”</p><p>　　“阿难。你要奉持如来的教诲。这是十方如来最究竟，最彻底的修行法门，也如来最后的垂范。”</p><h3>　　五阴的本质</h3><p>　　阿难听罢，立即从座而起。对佛的垂示，恭敬受持，不敢忘失。然后接着问佛：“世尊，这五阴都是以虚妄为本，我等平常从未听过如来这么微细的开示。那么这五阴，是一起销除的，还是依次销除的呢？这五重阴境以什么为界呢？惟愿如来，慈悲垂教。”</p><p>　　佛告诉阿难：“真如本性，妙明圆净，容不下生死和尘垢。乃至整个虚空，都是因妄想而起。这本觉妙明的精真，因为妄想而发生了有形世间。就如同演若达多，以镜子中的幻影为真，而迷失了自己的头。</p><p>　　妄想原本就没有什么原由。在妄想中，安立一个因缘法，然后迷失在因缘之中，称其为自然。即使虚空，都是幻妄所生。所以，因缘、自然都不过是众生的妄想计度。</p><p>　　阿难。如果知道妄想的由来，可以说妄想是因缘所生。如果妄想根本就没有来由，又怎么能说妄想是因缘所生呢！更何况连因缘都不知道，只推说是一切是自然而然，那就更一无是处了。</p><p>　　所以，阿难。我现在告诉你。五阴的本质，都是妄想。”</p><p>　　色阴</p><p>　　“就你这个身体而言。先是因为父母有爱欲的妄想，而产生你这个身体。你自己的心中，如果没有爱憎妄念，你也不能投身其中。所以是妄想延续了你的生命。</p><p>　　正如我先前说过的，心中想起醋的味道，口中就有津液流出；心中想起登高，足心就开始发酸。然而，悬崖根本就没有，醋也并没端来，所以可见，你的身体跟妄想都是一类的。否则，口水怎么能因为妄想的醋味而产生呢！</p><p>　　所以，你现前的色身，是坚固性的第一妄想。”</p><p>　　受阴</p><p>　　“站在高处的这个妄想，能令你的身体，真的感受到酸涩。所以，妄想为因，扰动你的形体，而产生感受。顺从它就觉得快乐，违逆它就觉得痛苦。这往来驱驰，或苦或乐的种种感受，是虚明的第二种妄想。”</p><p>　　想阴</p><p>　　“色身是被种种心念所驱使的。如果色身与心念不相干，怎么能被心念所驱使呢？种种行为，都是心生，身形总是与心念相应的。清醒的时候，心念产生行为，睡着时心念就化成梦境。这摇动妄情的心念，就是融通性的第三种妄想。”</p><p>　　行阴</p><p>　　“万物的运动，没有片刻停息。指甲渐生，头发渐长，气力渐衰，容颜衰老，这些变化，日夜迁流，谁曾觉察得到！阿难！如果这些变化不是你，为什么能迁动你的身体呢？如果这些变化真是你，为什么你察觉不到呢？这念念不停的迁变，就是幽隐的第四种妄想。”</p><p>　　识阴</p><p>　　“如果似乎湛然不动的识性，是恒常不变的。这个识性，在身体上表现为见、闻、觉、知。既然是恒常不变的，就应该不会被沾染。那么为什么你在目睹一件奇珍异宝，日久岁深，逐渐淡忘后，忽然再见到时，以前的情景，还会记忆犹新呢！ 由此可见，这个识性是念念受熏的。它被沾染的次数，多得根本无法计算。</p><p>　　阿难。要知道。这个湛然不动，并不是真的不动。好比湍急的流水，看起来好像恬静。那只是因为水流太急，急得根本无法看到它在流动，并不是它不动。如果这个识性不是妄想，又怎么会被沾染呢。除非六根能够开合互用，否则这个妄想没有消灭的时候。这串在你见闻觉知中微细的习气，就是罔象虚无的第五种妄想。</p><p>　　阿难！五阴是五种妄想所成。要知道这五阴的边界。色与空，是色的边际。触与离，是受的边际。记与忘，是想的边际。灭与生，是行的边际。入与不入，是识的边际。”</p><p>　　完美的统一</p><p>　　佛法对世界的探讨，是通过对生命自身的体悟而实现，而科学却是从外在的物质入手，所以导致二者在描述世界时，所用的语言有所不同。所以，五阴的本质，如果结合科学来描述，可以解释为：在那个最深层的现实--如来藏中，由于背离了自性的本明，去追求明了的内容，所以产生了“波动”。在明了对内容无尽的追求中，波动演化成了种种振动形态，于是由细到粗，分别产生了识阴、行阴、想阴、受阴、色阴。可见，这个“波动”，对应的就是如来所说的“妄想”。</p><p>　　不难想象，最初，形成识阴的波动是极其细微的，细微得几乎难以察觉。在明了对内容贪婪地追求中，这个微细的波动逐渐成形，并且构成了十二类众生的根源，这就是行阴。在明了贪得无厌地追求中，波动越来越复杂，从而形成了心理世界，这就是想阴。波动不但越来越复杂，而且频率也越来越快，最后成为“振动”，这就是构成一切物质的“弦”，色阴世界由此诞生。介于波动和振动之间的频率，对应的就是介于物质世界和心理世界之间的受阴。这就是身心世界，乃至整个宇宙的形成过程。佛法与科学，至此，终于实现了完美的统一。</p><p>　　理虽顿悟，事须渐修</p><p>　　接下来，如来继续给阿难解释道：“这五阴是重迭生起的。生的时候，从识阴开始。灭的时候，从色阴入手。道理可以一下明白，但事相上却还得次第消除。我已经用纶巾做结，给你讲过这个道理了。你还有什么不明白的吗？”</p><p>　　这个过程，用“波动”来解释，则更加明了。修行的过程，也就是使波动恢复平静的过程。波动是不能一下恢复平静的。好像水波一样，总是在振动幅度越来越小的过程中，逐渐恢复平静的。</p><p>　　《宝镜疏》中，又对顿悟和渐修有过非常形象的比喻：“譬如大海，猛风顿息，这是顿悟；波浪渐停，就是渐除。譬如婴儿，诸根齐备，这是顿悟；力量渐生，这是渐除。又如太阳，当空遍照，这是顿悟；霜露渐消，就是渐除。又如<a href=\"https://www.guang5.com/sushi/shucai/chunsun/\" class=\"keylink\" target=\"_blank\">春笋</a>，拔节顿长，即与母齐，这是顿悟；枝叶分放，节节而上，则是渐除。若只顿悟，而不渐除，则有解无行，执理迷事。若只渐除，而不顿悟，则有行无解，执事迷理。这都不是正修真三摩地。</p><p>　　嘱咐弘扬</p><p>　　接着，如来嘱咐道：”你要把这妄想的根元，明心见性的道理，传示给将来末法之中的修行者。令他们知道一切都是虚妄的，而深深地生起厌离之心。让他们知道有真实的涅槃，而不再贪恋三界。</p><p>　　阿难！如果有人，用遍满十方所有虚空这么多的七宝，来供养微尘一样众多的诸佛，你说这个人得到的福报多不？“</p><p>　　阿难回答：”虚空无尽，珍宝无边。有人曾供养如来七枚铜钱，死后都获得转轮圣王之位。何况现在虚空都已经充满。这些珍宝，就是数一劫也数不过来。所得的福报，怎么能有边际呢？“</p><p>　　佛告诉阿难：”诸佛如来的话，没有虚妄。如果有人，身具杀、盗、淫、妄四种根本重罪，并且犯尽十恶，瞬息之间，经历此方他方的阿鼻地狱。乃至十方无穷无尽的无间地狱，无不经历。</p><p>　　如果能在一念之间，将此法门在末劫中，开示给未学之人，此人的罪障，应念消灭。他所受的地狱苦因，则转变成极乐佛国。他所得到的福报，超越那个供佛之人百倍千倍，千万亿倍。乃至无法计数之倍。\"</p><p style=\"text-align: right;\">作者：鸾</p><p style=\"text-align: right;\">2012-10-30</p></div>"
    }
]