[{
    "title": "1.造论的因缘",
    "author": "净莲上师",
    "date": "",
    "html": "<div class=\"B1_text\"><div id=\"fontsize\">\n<p style=\"text-align: center;\">最尊贵的净莲上师讲授<br/></p><p>今天开讲《成唯识论》。</p><p>要学习唯识的次第是：先要了解《百法》、《八识规矩颂》，这两个有基础之后，看唯识就比较容易。因为唯识的名相了解以后，再看《成唯识论》就不会觉得这么困难，所以我们必须要有《百法》跟《八识规矩颂》的基础。《百法》我们前面已经讲过了，那我们现在上《成唯识论》的课。</p><p>那《成唯识论》是怎么来的呢？这本论它是怎么来的？那就要谈到世亲菩萨：世亲菩萨他首先造了《唯识三十颂》、三十个偈颂。那古时候都是先造短颂，有了偈颂之后，然后他再慢慢解释，解释这个偈颂；可是世亲菩萨造了这个《唯识三十颂》之后，就往生去了。所以来不及解释他这个《唯识三十颂》的内容，他就已经离开人世。</p><p>那所以就有很多这个唯识学家，研究唯识的这些论师，就试图想要来解释世亲菩萨所造的这个《唯识三十颂》它到底是什么意思。因为偈颂很简单嘛；可是它内容包含得非常的广泛。所以有很多唯识学家就想要来解释，所以就有各家各派不同的解释方法，非常的混乱。</p><p>那一直到玄奘法师他回中国之后，他就想说：“唉呀！这么多不同的言论，要把它整合一下。”所以他就取了当时十大论师各别有注解《唯识三十颂》的这个论注。每一位论师都写了十卷，十位论师就是一百卷。所以玄奘法师就把这一百卷十大论师解释《唯识三十颂》的这些内容呢，把它整理，可是以护法论师为主，然后把另外九家的言说呢，把它揉合在里面，而造了现在我们要念的《成唯识论》，它的来源是这样来的。所以它不是一位论师造的，是十大论师，经过玄奘法师的整理，然后才有这个著作、这一部著作。所以要说作者的话，就是十大论师是作者，那玄奘法师他只是把它整理。这就说到《成唯识论》这一部论它是怎么来源、它的来源。</p><p>那为什么叫“成唯识论”呢？这个“成唯识”是什么意思？“论”就是详细的解释，详细解释世亲的《唯识三十颂》嘛。那个“成”就是成就的意思，能成，有能成、所成。那能成、能成就这一部论的，就是十大论师的论注嘛，所以这个“成”，第一个“成唯识论”的“成”字，就是能成的意思，就是十大论师的著作来成就这一部唯识。那“唯识”呢就是所成，所以是能成、所成：能成的是十大论师的著作，所成的是唯识的道理。那唯识的道理的来源是什么呢？就是世亲菩萨所造的《唯识三十颂》是所成的唯识，所以叫做“成唯识”。“成”是能成的十大论师，唯识是《唯识三十颂》，世亲菩萨所造的——这就是“成唯识”它的名词解释。那玄奘法师负责整理的，世亲菩萨原来造的《唯识三十颂》，经过玄奘法师整理，这就是这一部论它的来源。</p><p>那我们看这个…；我们现在已经讲到第六页了，第六页。所以它接下来就解释说，为什么是叫“唯识”这个名称。我们刚才讲的内容都在前面，你们有空自己复习。</p><p>那为什么叫“唯识”呢？就是唯有心识的意思。这个“唯”，“唯”就是唯一嘛，只有一个；“唯识”就是唯有心识，除了心识之外，没有一法是真实存在的，全部都是我们八识所变现的。所以这个“唯”就是要破除什么的执著呢？以为我们的心识之外有法真实存在的这样一个错误的知见，所以它用“唯”这个字，就是说除了心识以外，没有一法是真实存在的。离开了心识之外，无一法可立。心外无法，法外无心，所以就是唯有心识，所以唯识破除执实有的颠倒执著。</p><p>那“识”呢，“识”又破除另外一派的说法。另外一派说法是什么？毕竟空嘛，一切法无所有，毕竟空，连心识也了不可得，那就很容易落在偏空的这一边。所以这个“识”呢，就是要破除主张毕竟空。好像龟毛兔角，毕竟无、毕竟空这样的一个空执。</p><p>所以“唯”呢，是破执实有，“识”是破执空，所以是非有非空。非有非空是什么？就是中道，所以唯识其实它是在讲中道的道理，“唯识”这两个字就在说明破空、破有。</p><p>所以我们要了解中道的话，我们一般会以为说：要去看什么《中论》啊。你直接看《中论》并没有办法完全的了解中观的道理，或者是《中论》的道理，你要从唯识下手，因为你明白唯识的道理，你就会很容易契入中观，因为它就在讲中观。所以一般会把唯识跟中观，把它分成两个不同的看法或者是说法；其实不是这样子，它是可以圆融的，唯识跟中观可以圆融。那你从唯识下手，你就很容易契入中观的道理，你再看中观就没有问题。</p><p>那你直接看中观，就很容易落入刚才讲的毕竟空这样执空的偏执里面。因为毕竟空里面就是连心识也没有，才叫做“毕竟空”嘛，毕竟空里面空无一物，了不可得。所以连心识的存在他也否认，因为了不可得，所以就很容易落在毕竟无、毕竟空这样的执著里面，那也是偏在空边。</p><p>那认为一切法可以离开心识单独存在，那个就落在有边。所以一个是落在有边、一个是落在空边。我们就用唯识的道理去破除这两种妄执，一个著有——心识之外实有。像这个房子，你们看这个房子是真的还是假的？真的嘛，就是心外有房子、心外有车子、心外有金子、心外有儿子，都是离开我们心识之外真实存在的嘛；可见我们凡夫或者是一直到小乘为止，他都是认为这一切法是离开心识之外可以单独存在的。像我们没有开悟、没有明心见性，我们都认为它是真的，不然怎么会这么多烦恼？就是我们把它当作是真实存在的，然后执著得不得了：要去争取、要去获得、要去拥有、要去控制，所以烦恼就生起。</p><p>原来它并没有离开我们的心识，它都是我们心识所变现出来，它是假有、如幻、依他起的，依他起就是说明因缘所生法是空无自性的。所以你说房子是有还是没有？有还是没有？（有师兄答：没有）没有？可是它在啊！不然你现在住在哪里？你不是住在房子里面吗？所以你说它没有，可是它又好像宛然存在、如幻的现起，是不是？你说它有，可是它百年之后它又没有了，所以是什么？非空非有，你不能说它有，也不能说它没有。你说它有，落在有边；你说它无，落在空边，都不是中道。非空非有、即空即有，对不对？所以它的有是如幻假有、因缘有。“因缘所生法，我说即是空”嘛，自性是无；可是因缘如幻现起的时候，你不能说它没有，对不对？只是因缘假合的泥土啊、什么水泥啊、沙啊，那就是因缘所生的。所以你不能说它没有，没有就落入我们刚才讲的毕竟空，都没有。可是明明有六道、明明有轮回、明明有一切的现象界，只是它是因缘所生的、无自性的。所以我们说它不是真实存在的，是如幻、依他、假有的。</p><p>这样我们明白这个唯识的道理，就不会落在空有两边的执著，落在边见。这就是“唯识”它这两个字，其实就已经说明是中道，不落入两边，非空非有、即空即有的道理，这两个字就解释了。这就是为什么叫做“唯识”，就是第六页讲的“唯识”。</p><p>好，那我们就看它卷一开始就是归敬三宝。一般造论的话一定有归敬颂。一般我们造论，一定要先皈依礼敬三宝。那为什么要皈依礼敬三宝？我就直接写、直接造论就好，为什么还要皈依礼敬三宝？它一定有目的嘛，那它的目的是什么呢？就是祈请三宝的加持，希望我造论的过程不要有障碍，然后希望我所造论的所有内容，都能够符合佛所说正法的内容、清净的正法的内容，没有错误的知见在里面，希望能够完全没有任何的错误来表达佛的本怀。所以他一面是希望能够清净造论过程当中的障碍，所以要祈请三宝的加持，希望能够顺利地把这一部论圆满；另外呢，也希望能够契合佛的本意，这就是为什么要皈依礼敬的目的。</p><p>所以从第七页最后两行开始，这个比较黑的字呢，就是皈依礼敬，它是归敬三宝。“稽首唯识性，满分清净者，我今释彼说，利乐诸有情”——这个是原来《唯识三十颂》没有的，就是造论的时候才加上去的。那《唯识三十颂》在哪里呢？就是在第一页，第一页就是《唯识三十颂》的本文，这是世亲菩萨所造的：“由假说我法，有种种相转，彼依识所变，此能变为三。”从这边开始，所以它一共是三十个颂，所以叫做《唯识三十颂》。</p><p>那我们就可以很明显的看出来，它原来的这个偈颂没有皈依礼敬这四句话，所以它就是后来造论的时候才加上去的。它说明什么呢？就是要皈依礼敬三宝。所以第一句就是皈依礼敬法宝，稽首唯识性，因为我们现在造的是唯识的道理，说明唯识的道理，《成唯识论》嘛，唯识的道理。所以我们皈依的法宝是什么呢？唯识性，说明整个唯识的内容、唯识的道理，分析得非常清楚，这个就是皈依法宝、皈依礼敬法宝。</p><p>“满分清净者”，“满”就是圆满清净，“分”就是部分的清净。所以“满分清净者”这两个就包含了什么？佛宝跟僧宝。“满分清净”就是“满清净”、“分清净”，“圆满清净”、“部分清净”的意思。所以偈颂都很简单。如果没有教理的基础，就什么“满分”？是不是考试考满分？还是什么？“满”是圆满，圆满清净当然是佛嘛，那就表示说我们皈依礼敬佛宝；那“部分清净”就是菩萨，菩萨还没有到…，他四十一品的无明还没有完全破尽，他只有部分清净，所知障还没有完全的清净，所以叫做“部分的清净”，是菩萨，那就是僧宝。所以前面两句就是皈依礼敬佛法僧三宝，先法宝，然后佛宝、僧宝。</p><p>后面两句呢，“我今释彼说”，那我现在要造这本《成唯识论》，解释谁的三十颂啊？世亲菩萨的三十颂。所以这个“彼”，“释”就是解释嘛，“彼”就是《唯识三十颂》。我现在造这个论是要解释什么呢？就是要解释世亲菩萨所造的这个《唯识三十颂》。“彼说”就是指世亲菩萨所造的《唯识三十颂》。那为什么要这样子造《唯识三十颂》的目的是什么呢？不是为了显扬自己的教理很通达，有实证的功夫，不是；是为了什么？“利乐诸有情”，造论的目的是希望能够利益一切的有情众生，希望他们早一点破迷开悟，不再著空著有，偏在两边，能够了悟中道实相的道理，就能够成佛。所以利益一切有情是他造论的目的。</p><p>所以这四句话就包含了皈依礼敬三宝，还有说明他是依据什么来造这个论，还有他造论的目的是什么。</p><p>那造论也要有因缘，法不孤起嘛，有缘才说。所以他造论的目的是为了要利益一切有情。可是，一切的有情他到底有哪一些迷执？哪些错误颠倒的知见？所以他才要用这个唯识的道理来破除他们所有的迷执。所以接下来这一大段就说明他造论的因缘，就是说为了要破除四种迷执：</p><p>那我们刚才讲了偏空、偏有是两种的迷执。我们凡夫到小乘，认为心外有实法的存在，这是偏在有边、实有，一切法是实有，而且它是离开心意识单独存在的——这是他第一个要破除的这样一个有情的迷执，所以他要造这一部论。</p><p>那第二个就是我们刚才讲的偏在毕竟空嘛，连心识他也否认掉了，那就是落在空执这一边，这是第二个他要度化的有情，要利益的有情的第二个对象。</p><p>那这个就是在大乘里面，有一些的见解是这样的见解。偏在实有，凡夫跟小乘是有这样的迷执。但是大乘里面还有所谓的了义、不了义。那个不了义的部分，它还有一些错误的知见，所以还是要用唯识的道理去破除。譬如说毕竟空的这样一个错误颠倒的知见。所以它第二个就是要破除著空的这样一个错误的知见。</p><p>那第三个要破除的呢，就是有一派大乘他的说法是认为八识一体。虽然是分为八个识，但是它是一体的。就好像大海一样，大海是一体的，但是它会生什么？“境风吹识浪”，它会生起种种的浪花，那是八个识的显现，可是它的本体只有一个。这样是对的吗？不是正确的。所以，唯识第三个要破的就是有这样一个大乘的见解，它是错误的。八个识虽然有它个别的作用，可是种子每一个…，像色法有色法的种子；心、心所法有心所法的种子，全部含藏在八识里面；所以你不能说它的本体是只有一个，因为它个别还有不同的种子含藏在第八识。所以就是要破除把这个本体当作是一，然后八个识有分别的作用，但是它的体是一的这样一个错误的知见。这是第三个要破除有关于八识的作用（有它个别的作用），而且它的体呢，是有它自体的存在，“自体的存在”的意思，就是说个别有它的不同的种子，含藏在第八识里面——这是第三个要破的。</p><p>那第四个要破的呢，就是认为心所是附属在心王里面。我们念过《百法》知道嘛，有八个识，对不对？八识心王，然后有五十一个心所。所以有一派的说法是说心所呢它不能单独作用，所以它是附属在心王里面。可是我们念过《百法》，我们知道五十一个心所都有它的体相用，对不对？对不对？所以就不能够说它是属于心王，然后它不能够单独来生起它的作用。这就是他第四个要破除的这个错误知见，就是否认了心所可以单独来起用的这样一个错误的知见。</p><p>我们现在讲到十八页讲完了。那详细的内容呢，我们就是把大意讲完，剩下的那个课文，你们自己看就可以了。那重点的话我们刚才已经提过了。那最主要就是说，我们想要开悟成佛就是证到什么果？所谓菩提果跟涅槃果。但是这个果，我们现在为什么没有办法证得菩提果跟涅槃果？是因为我们有两种很严重的障碍，哪两种障碍？所知障跟烦恼障。因为我们有烦恼障，所以没有办法证得涅槃；因为我们有所知障，所以没有办法证得菩提果。</p><p>可是烦恼障跟所知障是怎么生起的呢？是怎么来的呢？是因为我们有我执跟法执嘛！因为有我执，所以会生烦恼，有“我”，“我”就有贪、瞋、痴，就有烦恼贪、瞋、痴，我就会造业，那有业力就会轮回。所以我执呢就是属于烦恼障，就是烦恼障它是怎么来的？是因为我们以为有一个“我”的存在，那有“我”，它就会起贪、瞋、痴，有贪、瞋、痴就会造业，有业力就会轮回，因为轮回是善恶业所造成的嘛：三善道、三恶道，就是我们造善业就是三善道，恶业就是三恶道。可是它造业是怎么来的？就是因为我们有烦恼才会造业，有业力就会轮回，所以整个轮回它是因缘所生、是依他起、它不是真实存在的。轮回的自性是空的，但是它是怎么现起的呢？我们追溯到整个轮回现象生起的原因，就是我执。无明，所以以为有一个“我”的存在，所以就有后面的烦恼造业，然后整个轮回的现象就这样生起了。所以烦恼障变成说是障碍我们没有办法证得涅槃最主要的原因，就所谓的我执。</p><p>那所知障呢？法执，对！以为一切法是真实存在的，这就是法执的原因。因为法执，所以有所知障，所以不能够证得菩提果。所以我们就是，你想要成就佛的这两种果，你就必需要破除所知障跟烦恼障。</p><p>那所知障跟烦恼障怎么样破除呢？就是要了解一切法本来无我，没有我、也没有法。所以你就可以证到二空，就是我空跟法空。证到二空，就可以破除两种——所知障跟烦恼障两种障碍；两种障碍破除，就可以证得佛的两种果位。</p><p>所以整个唯识，他为什么要造这个《成唯识论》？主要就是告诉我们怎么样证得二空的道理，分解我执跟法执所有的内容，什么是分别我执？什么是俱生我执？什么是分别法执？什么是俱生法执？全部都详细地分析、了解了之后，我们就能够破除我执跟法执，就可以证到二空，二空就可以破二障，就可以证二果，就可以成佛。</p><p>这就是唯识他为什么要造论的因缘，大概的重点就是这样子。</p> </div></div>"
},{
    "title": "2.假立法,我",
    "author": "净莲上师",
    "date": "",
    "html": "<div class=\"B1_text\"><div id=\"fontsize\">\n<p style=\"text-align: center;\">最尊贵的净莲上师讲授</p><p>今天从十八页这个黑体字这边开始讲：“若唯有识，云何世间，及诸圣教，说有我法。”这边开始。</p><p>昨天谈到唯有识，“唯识”唯有心识，心外无法，离开了心识之外，没有一法真实的存在。原本是没有我、也没有法的，就是二空，无我、也无法，原来是这样子的，这是唯识的道理。</p><p>可是为什么我们凡夫世间，世间的凡夫或者是外道，甚至佛法里面都有提到“我”跟“法”？本来无我的嘛，也无法的；可是为什么会有这样的名称呢？那我们凡夫都有“我”嘛，有你、有他，所以有我。有法，有“法”，就是这个是桌子、椅子、胡姬花、房子，这个都是“法”。既然是一切法本来无我，无我也无法；但是为什么我们以为有“我”？以为有一切法，都以为它是真实存在的呢？那外道也有它的我执跟法执。</p><p>那佛法里面谈不谈我跟法呢？谈不谈？谈啊！为什么不谈？释迦牟尼佛出生的时候，祂就说了一句名言，是什么？“天上天下，唯我独尊”有我啊！祂有讲我啊！对不对？如果我们断见惑的话，就可以证什么？初果罗汉，这个是我啊，有一个初果罗汉、二果、三果。断了见思二惑，有一个叫做阿罗汉（四果阿罗汉）。破尘沙惑、破一品无明开始登地，菩萨有初地、二地、三地，一直到十地，有等觉、妙觉，甚至成佛，这个也都是有我啊！是不是？</p><p>那有没有法？有啊！法才多咧，八万四千法还不多？我们讲过《百法》，有一百个法，它也谈法，佛法也谈法。可是明明是无我、也无法，为什么他也谈我、谈法呢？有色法嘛，十一个色法，有五十一个心所法，这个都是法。还有不相应行法，有心法、有八识心法。他也谈色法、谈心法、心所有法、色法、不相应行法二十四个、还有无为法六个，他也谈法。</p><p>这到底是有我、有法？还是无我、无法？那就要说到世间以为有我、有法，是因为迷惑颠倒，事实上是没有。可是佛法会讲有我、有法就很奇怪了。那我们就要知道，为什么佛法它也要这样子来谈呢？那是因为什么？世间的众生以为有我、有法。因为有我执、法执，有这种种的名称跟言说，所以为了要顺应世间凡夫的我执跟法执，因此就假立种种的我的名称跟法的名称。所以，在佛法里面假立的这些我的名称跟法的名称，跟凡夫以为有真实的我跟法的迷执是不相同的，对不对？</p><p>世间凡夫是迷惑颠倒，因为无明的关系，以为有一个我，以为有一切法是真实存在的，是因为不明白这个宇宙的真理、事实的真相，不明白中道实相的道理，所以才会有这样的迷执。可是，佛法里面为什么要谈这种种的假设的名称跟言说呢？就是恒顺众生以为有我跟有法的执著，而说的方便假立种种的名称跟言说，是这样子来的。</p><p>那他设种种的假立的名称跟言说，是依据什么样的道理呢？所谓的我跟法它到底是怎么生起的呢？那我们就要了解佛祂所说的道理。所谓的“我”就是……，我们凡夫的“我”是什么？我可以主宰，对不对？我可以决定我今天要做什么？我要交什么朋友？然后喜欢什么？不喜欢什么？我觉得我可以主宰、可以控制、可以掌控。有主宰的这个意思，我们就假设一个名称叫做“我”。因为凡夫他以为有“我”，所以我可以主宰所谓我的生活啦、我的工作啦、我的事业、我的家庭、我的子女，我觉得我可以主宰一切，这就是“我”的第一个定义：主宰。</p><p>第二个定义呢，我一定是全世界独一无二的、没有第二个跟我一样的，所以我最厉害、我最了不起。没有第二个阿顺，对不对？没有第二个文富。所以唯一的、独一无二的这个“一”也是一个“我”的一个定义，定义“我”的第二个就是唯一的意思。</p><p>所以，一般人他都会强调他的独特性。像建筑家，我们说建筑家他会设计，像贝律铭很有名，我们中国人嘛，要举就要举我们中国人。他设计的风格、他建筑的风格，那就是唯一他的风格。像艺术家，他画画的风格有他独特的，那我们都强调那个独特性。每一个人他的独特性，那就是在强调唯一的、我的，跟别人不同的特质，每个人有每个人的个性，每个人有每个人的根性，各方面跟别人不同的这种特质，我们特别去强调，那就是我们都试图做种种的努力要跟别人不一样。</p><p>所以什么样的服装最贵？就是全世界只有那一件的名牌、名设计家设计的那个名牌的，全世界只有那一件的，那一件衣服最贵。那他为什么要做这样的标榜呢？那就说明所谓“我”的，它有一个特性，就是它要标榜它是唯一的，世界上没有另外一个跟它相同，或者可以跟它比美的。所以就定义“我”的第二个特性就是唯一的。</p><p>还有另外一个特性很重要就是：它是永恒的。我们没有开悟之前，那凡夫当然他也一定是认为“我”是真实存在，而且它是一直都是嘛，从出生的我、到现在的我、到死亡的我，他都不觉得他是什么？生灭、生灭、生灭的相续，无常的，凡夫不这样认为。所以他都认为说：出生的那个就是我，十岁的我、二十岁的我、一直到现在、一直到死亡，那个都是我，而且它是恒常不变的，有一个“我”它是恒常不变的。即使我们会生、老、病、死，但是那个“我”它是不会改变的。</p><p>可是今天我们学佛修行，如果还认为有一个“我”它可以一下生三善趣，一下堕三恶道，我们如果还以为有一个主体的“我”在轮回的话，也是同样的迷惑颠倒。所以我们现在为什么要修行？我们为什么要断恶修善？因为怕受不好的果报，因为怕堕三恶道，因为有一个“我”一直在六道当中不断不断地轮回。这个主体的“我”就是我们错误的颠倒，以为有一个“我”它是永恒存在的，只是它有时候在阿修罗道、有时候在天道、有时候在地狱、有时候在饿鬼，可是都有一个“我”在轮回啊！</p><p>所以就变成说，“我”的第三个特性，它是永恒存在、永恒不变的、永恒不灭的。任何情况之下，“我”都是存在的。所以，佛法就依据这三个世俗认定的“我”的这个特质，假设有一个“我”，所以它说“我”。那凡夫这个以为有一个不变主体的“我”，那要透过修行，就是要从断见思二惑，从证初果、二果、三果、四果，到破尘沙惑、到无明惑，一品一品的无明，四十一品的无明全部断完就叫做成佛。</p><p>这全部都是依据这个“我”的定义来设出的我执的范围。从凡夫修行到成佛，有这样、这样、这样的阶位。这就是依据“我”而说种种不同的，你要修证到什么样的阶位，你就要断什么样的烦恼的一个过程；或者是怎样破烦恼障、怎么破所知障的一个过程，一个修证的过程，这个全部都是名言假立的。</p><p>所以我们学佛修行到现在，还认为说：“我是菩萨！”“菩萨”这个名称是假立的，我们刚才讲的种种的名称跟言说，种种的方便假立；可是如果我们还认为“我现在是菩萨，我在行菩萨道！”就通通错了。有“我”，就有“我”，对不对？“我是菩萨嘛！”有“我”，然后有“菩萨”这个假名，所以我们就忘记“菩萨”是假名、“佛”也是假名，没有一个真实的佛可以成的，都是名言假立，恒顺众生以为有我的执著而做种种的名称言说的假立、分位假立，只是这样而已。</p><p>那什么叫“法”呢？刚才我们在解释“我”它是怎么定义的。那“法”是怎么定义的？就是万法的轨则。那这个轨则它是在任何情况之下都不会坏失的，就是说它的自体是不会坏失的。那什么叫“自体不会坏失”？什么叫做“万法的轨则”呢？就是任何一个东西，我们一看就知道它是什么？这就是“法”的名称，是这样来的。那这个名称一旦建立了，或者是我们已经了解这个“法”，它是什么样的一个相貌之后呢，我们就很快可以认识它。所以它的轨则就是帮我们去认识这个“法”的一个内容。</p><p>譬如说：这个叫胡姬花、这个叫白兰花、茉莉花，所以你不会把胡姬花当作白兰，你不会把白兰当作茉莉花。因为每个都有它的什么？相貌。“万法的轨则”那就是指你认识它的那个，我们凭什么认识它？就是它有它的轨则。“轨则”就是它所有的，我们可以形容出来的，或者我们认识它的那个所有的内容叫做“轨则”。那它任何情状之下都不会改变，所以今天的胡姬花明天不会变成白兰的样子，或者是明天它就变一个样子了，就变成茉莉花的样子，它是永远都是这个样子。所以我们一看到它，就可以马上认识它就是胡姬花，这个就是它的“自体不会坏失”的意思，它不会改变的。</p><p>所以我们一看到这个，就知道它叫做桌子；看到这个就知道它叫做椅子；看到这个就知道它叫做水晶灯。所以每一个“法”都有它的轨则，然后它任何情况之下不会改变的。因为它会改变，它今天是水晶灯，明天就变成灯泡，那就表示说它的自体会坏失。可是它是永远都是那个样子，所以我们可以透过它的相貌马上就认识它，就是因为它任何情况之下都是这个样子。那我们看到它就可以说出这个“法”的种种不同的名称，所以这个就是给“法”一个定义，是这样定义出来的。</p><p>所以佛说“法”是恒顺众生的我执、法执，为了要让众生能够解脱、开悟、成佛，所以就恒顺众生的我执跟法执呢，假设出种种的“我”的名称跟“法”的名称，那我们才能够修行啊！所以“法”的名称，就是祂告诉我们色法有十一种，心法有八种，这是佛说的，这就是“法”的内容。</p><p>那什么叫色法？我们也念过《百法》，有质碍的叫色法，那就是它的轨则，任何情况之下都不会坏失的，它的自体都不会坏失、都不会改变的；所以我们就知道它叫色法，这就是佛所说的“法”的定义。那说这些的目的是什么？就是希望我们都能够开显佛性，都能够了悟成佛。这就是佛说一切法是恒顺众生，然后作种种的名称言说，都是假立的、都不是真实存在的。</p><p>那好，进一步我们要了解说：“诶！这个“我”跟“法”它是怎么显现的？”要说到重点了。这个“我”跟“法”是作这样的假立，种种的名称言说；但是它是怎么变现出来的？能变现的是什么？所变现的是什么？这个我们都很熟了嘛，都是心意识的显现，对不对？所以心意识就是能变现，心意识有哪些内容呢？有异熟识嘛，所以异熟识是第一能变。异熟识第几识？异熟识是第几识？第八识；思量识是第几识？恒审思量是第几识？第七识；分别了知第几识？第六识，对！所以这就是三能变，能变现的是八个识：是异熟识第一能变，思量识第二能变，分别识第三能变——这是能变现的八识。</p><p>那它所变现出来的是什么？就是宇宙万有，我们刚才讲的“我”跟“法”都是我们八识，这个能变所现的、所变现的内容。那这个所变现的内容是什么呢？就是我们刚才讲的“我”跟“法”嘛，都是我们心意识所变现的。所以离开了我们的心意识，没有真实的“我”跟“法”的存在，那你就证到二空，然后断二障。这是我们昨天说的，对不对？</p><p>那我们怎么样断二障？断这个我执跟法执，怎样破烦恼障跟所知障？怎么样证到二空的这个道理呢？我们就要知道它是怎么变现出来的？然后回归到它的什么？能变的主体，然后再进一步去追究八识是怎么显现的？八识是能变，变现出一切的“我”跟“法”；可是八识从哪边出来的？八识是怎么来的？八识是怎么来的？又被问倒了！我们先说能变的是三能变嘛，是八识它所变现的“我”跟“法”是什么呢？就是见分跟相分。所以佛祂名称言说，假立“我”跟“法”，我们刚才已经讲的那个定义是这样定出来的。可是“我”是所变现的什么呢？是所变现的见分，所变现的见分叫做“我”，所变现的相分叫做“法”。所以我们就知道能变现的是八个识，所变现的是见分跟相分。那我们凡夫就执著这个八识所变现的见分为“我”，八识所变现的相分为“法”——这就是凡夫之所以生起我执跟法执的来源，因为他不明白是八识所变现，都是假的。因为离开了能变现的心意识，就没有所变现的“我”跟“法”的存在。凡夫不了解，所以他会有我执、有法执。</p><p>那佛说“法”怎么样来假立这个我执跟法执的内容，也是这样来假立的，就是能变现的心是所变现的见分，称为“我”；然后所变现的相分，称为“法”。所以这个见分跟相分它是怎么生起的呢？它是从八识的自证分生起的。</p><p>所以我们这两天静坐所问的问题，第一个问题：我知道念头生起了。这个是什么？“我知道”是什么分？见分，“念头生起了”，“念头”是什么分？它是一个、还两个？你们现在就应该知道答案了，它是一个、还两个？我们八识的自证分变现出见分跟相分，它是一个还两个？“我看到胡姬花”，“我”是见分，“胡姬花”是相分。“我看到胡姬花”是先有我，然后胡姬花才出来，还是我看的同时，就是我跟胡姬花，见分跟相分同时显现啊？同时，对不对？所以我看到妄念的时候，是不是同时？不然是谁看到妄念？你妄念起来跑掉，然后才有一个“我”去追妄念？来得及追吗？因为如果念头先生起，然后才有一个见分，去发现有念头生起来了，有这个前后是两个念头的话，请问你怎么追前面那个念头？因为它起来已经消失了，是不是这样子？</p><p>所以一定是念头起来你就看到了，念头起来的同时你就看到了。看到念头那个是见分，念头本身是相分，它都是我们八识的自证分所显现的。所以能现、所现：见分跟相分是所现，能现的是八识的自证分。</p><p>那我们每天六根面对六尘，就在玩这种游戏啊。“我看到什么”就是见分跟相分，我们的八识就变现出了见分跟相分。所以我们就误认为、误以为说“诶！我在看、我在听、我在闻、我在尝、我在感受！”身触嘛，然后“我在知觉，我有种种的思想，我有种种的见解”，以为都是“我”。不明白它是八识所变现的见分跟相分的作用而已，它并不是真实存在的。</p><p>所以我们的我执跟法执就是这样产生了，就是八识变现出来的。所以我们就以为有一个“我”，那个见分就出来了。那我在见闻觉知，每天六根面对六尘，诶！这个六尘在外面，我在里面，六尘在外面。见分为“我”，有一个“我”在看、在听、在尝、在触，“我”在见闻觉知，六尘境界在外面（这个相分），以为它是真实存在的。所以我们面对种种的境界、六尘境界，我们都是以为它是真实存在，所以才会被境界所转。因为我们没有办法回归到我们的自证分的本体——它没有变现之前的那个本体，我们没有办法安住；因此它就变现出六根面对六尘的种种的境界，见分跟相分就是这样生起；我们的我执跟法执就是这样变现出来了。</p><p>那我们每天就这样生活：有一个“我”，每天面对六尘境界，迷惑、颠倒、妄想、分别、执著，就在做这样的事情。所以我们现在为什么要来了解佛法这种种的理论？然后还要透过止观去实证，去见到的原因，就是除非你明白这个道理，除非你透过止观实证，真正的见到你的那个还没有变现出见分跟相分之前的那个，你先看到，看到的背后，我们说还有一个主人翁叫做证自证分。就是说：诶！你可以能所双亡，就是我们说，你能够安住就安住。那就是还没有能所，对不对？见分跟相分还没有生起，对不对？</p><p>我们静坐的时候，不是说你能够安住的时候，都没有念头的时候，你安住，诶！你那个安住就好像主人翁在家。那个意思比喻就是说：你的八识还没有变现出见分跟相分，对不对？那你可以安住在你的八识的自体的当下，你可以安住。可是它等一下就念头生起，你马上就看见。那我就知道这个念头生起，它是从哪里生起？这是我们刚才问的第二个问题：妄念从哪里来？它是怎么生起的？现在是不是有答案了。好清楚，现在好清楚了，它是从哪里来？从三能变来，从八识的自体所显现的。所以，当我们安住在无分别的现量境的时候，就等于说回归到我们八识的自证分上。一个念头起来了，我们就看到了，这时候就是自证分变现出了见分跟相分。所以，我们会以为有一个“我”，因为见分就是“我”嘛，相分就是什么？“法”嘛。</p><p>所以它变现出来的时候，我们就马上有一个观念说：“诶！我看到了妄念。”我执、法执就生起了。所以“我”跟“法”是不是真实存在的？它是不是实有的？不是。我们明白这个道理，要断我执、法执就很容易了。因为我们知道，它是我们心识所变现出来的，离开了我们的心识，根本没有“我”、“法”的存在，它不是真实的。</p><p>所以我们要断我执、法执，怎么办呢？就除非你了解这个理论之后，还要透过修证，你真正的看到了，诶！它就是这样变现出来的，你就不会再被它变现出来的见分跟相分所迷惑颠倒，你就不会再因为这样而生起我执跟法执。因为你很明白，它就是我们八识所变现的、变现出来的。</p><p>那我们以为它是“我”、它是“法”，因此才生起了我执跟法执。所以要破我执跟法执，那你就要透过止观，回归到它没有变现之前的那个自证分的状态。</p><p>那我现在清清楚楚、明明白白的安住在无分别的现量境当中，都没有妄念了，这个当下是不是呢？是不是呢？是第六意识暂时没有生起分别的现量，那个是什么境界？那个是法尘境界哦！明白吗？所以第六意识的清净现量面，不要把它当作是自证分，不是！那个是法尘。眼、耳、鼻、舌、身、意，面对什么？色、声、香、味、触、法，还在六尘境界当中，所以那个不是开悟，所以不要以为说：“我坐在那边没有念头，啊！好清净”，那个正是法尘境界，它不是自证分。</p><p>所以要弄清楚、要弄明白，那个是法尘境界，是你第六意识暂时没有起分别的现量境界，它不是自证分，不要把它当作是开悟了。哦！那就真的是耽误了。</p><p>所以还有另外一个去检查说：诶！你是开悟的“悟”呢？还是耽误的“误”呢？那个就叫做“证自证分”。所以你是不是已经自证分显现了？去检查的那个，后面还有一个叫做证自证分，就是它能够再检查、再确认：这个是耽误的“误”，一头雾水的“雾”，还是开悟的“悟”，还要再确认，那个就是证自证分。</p><p>所以我们要怎么让我们的自证分现前呢？就是除非能所双亡，就是除非见分跟相分怎么样？不起了，我们是不是自证分就现前了，我们修止观的目的就是要让自证分现前，我们要让它现证，当下现前的什么？你就很清楚地了解它就是自证分。所以我们如果不明白唯识的道理，我们很难去弄清楚：我们那个是第六意识的现量面、清净的现量境，还是能所双亡所显现的那个自证分？你就很难弄清楚明白。所以，唯识一定要很清楚的去把它的道理弄明白之后，我们才好修止观，才不会错误的认知，以为是开悟了，结果是耽误了，就不会有这样的错误。</p><p>所以什么时候自证分可以现前？就是我们什么时候修止观的功夫，可以让见分跟相分不从我们的自证分变现出来，对不对？就是说回归到我们的自证分，当下你可以安住。所以这两天让你们体会什么？就是体会这个，你能够安住的时候，它就有机会现前。那你念头一生起来，你就知道：诶！我们的八识那个自证分变现出见分跟相分。那你就不要再管它了，因为它就过去了嘛。那个念头起来，它就过去了。因为它是生灭的，它不会一直停留在那边。所以我们也不用担心，我们只要安住，然后它一起来，你就看见，它就消失了。</p><p>那我要很清楚，它就是见分跟相分，是我们自证分所变现的。所以我们很快就回归到我们的八识的自证分那个当下，很快就回归到这边。然后再进一步去体悟它背后那个，就是再确认的那个证自证分，要更深的禅定，你才能够体会出来。</p><p>因为我们现在不是散乱，就昏沉嘛，所以我们大部分都是在见分跟相分当中转，对不对？坐在那边散乱、昏沉就是在见分跟相分，根本自证分没有办法现前，没有机会现前。然后我们再迷惑颠倒，就是我们刚才讲的六根面对六尘境界，每天就是跟着这个境界在转，不明白它是见分跟相分，因此才会生起我执跟法执。</p><p>所以我们要怎么练习？就是在定中修止观，明白了这个道理，能够安住在自证分的当下之后，保持在日常的生活当中，行、住、坐、卧当中。所以你六根面对六尘的时候，你就不会认为说“哦！我在看、我在听，喜欢、不喜欢，执不执著”，种种的分别就不会产生了，就不会迷惑颠倒。那你慢慢的自性就能够现前，就会越来越清楚明白。</p><p>在没有明白这个道理之前，我们就是都是它变现出了见分跟相分，然后每天就是忙着见分跟相分当中，我执跟法执当中打转，对不对？所以那你说怎么开悟呢？不可能开悟，也不可能明心见性，也不可能说修证到什么样的境界，因为你还是在见分跟相分上面打转。</p><p>所以即使你修定、修止观有种种的境界，那个也是相分。即使你就是修定有神通，那个还是相分，还是没有离开我们八识所变现的，种种的神通境界也是相分。你以为“我有神通”，“我”是见分，我有神通那个“神通”叫相分，所以还是一样的迷惑颠倒。所以在修止观当中，还是一样在见分跟相分里面，我执跟法执里面当中打转，你说他怎么可能坐出什么样的结果来？因为都没有离开见分跟相分能所对立的境界当中，从来没有离开过。</p><p>“我今天坐的不错！”明天又丢掉了，境界又丢掉了，那就是都在见分跟相分，从来没有离开过。所以我们从学习止观到现在，也都在见分跟相分里面打转，从来没有自证分现前过。所以明白唯识的道理非常重要，因为它可以帮助我们修止观，非常快速的就证到自证分，让它现前。只要我们不在见分跟相分当中转，很明白它是我们心识的变现，不再受它的影响，我们很快就可以回归到我们八识的本体。</p><p>再进一步去追溯，就是我们刚才的问题，追溯八识从哪里来？我们刚才分析是说：见相二分都是八识所变现的，可是八识从哪里来？对不对？那我们要把见相二分这个问题解决了，回归到自证分，才能够再继续的往前推啊，往前去找出那个根源，那八识从哪边来的？是不是？</p><p>所以前面的没有解决，我们后面的就慢一点吧！所以我们这几天静坐，就好好努力的把这个理参透之后，你要现证，要一直安住在自证分的当下，你才可以再进一步去推：诶！那个能变现的八识从哪里来？你才可以进一步去推，我们现在还在这个迷惑颠倒的我执法执里面，见分相分从来没有忘失过，那我们很难去找到那个是什么？那个真正的根源是什么？</p><p>所以从明天开始，我们今天听明白这个道理，明天开始静坐呢，也是同样的方法，你能够安住的时候就安住。安住有什么好处呢？就是让自证分有机会现前，那你那么一直妄念不断，就表示说，诶！它八识不断不断地变现出见分跟相分嘛，然后你就有一个“我”。你刚才讲的那个“我”，有没有？有一个“我”在数息嘛，那个就是见分啊，数字是相分，就一直在那边见分相分里面转嘛，转不出来，都有一个“我”：“哎呀！我又打妄想了。”“哎呀！我又怎样了。”那就是你见分不断一直冒出来、一直冒出来。</p><p>所以我们前面从看石头到现在，那个训练什么？就是要训练你基本的止的功夫。你有那个定力之后，你才可以在定中怎么样？起观，定中起观才能够回答我一连串的问题，都可以答得出来。</p><p>所以为什么它的训练的过程是前面先修止？就是说你要有基本的定的功夫，要不然你妄念不断你没有办法修观。就是你的心意识不断不断地变现出什么？见分跟相分来嘛，那你能不能在这个当中去看清楚那个自证分是什么？因为从来没有现前过，因为一直再打妄想。要不然就昏沉嘛，不是散乱就是昏沉，所以很难让我们的自证分现前，所以基本的修止的功夫非常重要。</p><p>我们前面经过这么长训练的目的，也无非就是希望能够明白这个道理，而且在定中呢，真正去现证它。要不然八识或者是唯识的道理，我们看书就是：哦！了解见分、相分、自证分、证自证分，跟我有什么关系？没有关系，我能不能开悟？不能开悟，因为你没有在止观当中去现证它的理论。</p><p>所以我们念书不是要背理论，而是你功夫要实证到，书上所讲的所有的内容都是要实证的，那个才算数。不然说“空”，境界来了，你为什么空不了？都是空的啊，我们都知道是空的、都假的，对呀！可是为什么问题来的时候，你就是假不了？你就空不了？对不对？生病的时候还是痛啊！挨刀痛不痛？痛！那你为什么当下空不了？对不对？境界来的时候，跟我们利益冲突的时候，诶！你那时候“空”的理论都没有办法现前，通通不管用。那问题出在哪里？就没有实证的功夫，你所有了解的，你都没有落实在你的修行上、你实证的功夫上。</p><p>所以，道理了解多少它都不算数的，它只是理论，因为都做不到；除非我们实证，那才是真正的能够落实。所以我们了解理论非常重要，因为它可以帮助我们修证；要不然我们坐在那边盲修瞎练，你到底是能够坐出一个什么结果来？也不清不楚，自己坐到什么样的境界？也不清不楚，那已经到什么样的阶位？也不清不楚，那你就是坐在那边呢，你是在等什么？等开悟来找你，还是初果、二果、三果、四果来找你，还是佛来找你，还是怎么样？所以理论非常重要。</p><p>可是光知道理论又不够，一定要实证的功夫。所以我们就是双管齐下，前面为什么要…，这几年来为什么一定要先修止观？然后还要同时来上课的原因，就是这两个要配合、要配合。</p><p>数息？不是…，我们要知道，数息，对！那是因为我们很散乱，所以我们不是一连串的法门吗？从看石头到现在，已经很多个阶段了。为什么要数息？是因为我们心很散乱，所以我们要借着数息来让我们的心收摄、专一。因为胡思乱想嘛，天马行空、胡思乱想，所以我们现在要把这些所有的妄念收摄在一个数字上，让我们的心念非常专注在一、二。如果会数过头、还是数丢了，表示我们非常的散乱。</p><p>没有数丢，就一到十，非常清清楚楚、明明白白，那就是我们讲《六妙门》，你已经数到非常清楚，不会数丢，没有散乱也没有昏沉，你就要进入随息。随息，我们上次讲，你有上到吗？《六妙门》有上吗？没有上，以后有机会再讲。就是不是数一辈子啊！你数息数一辈子，又不是学会计，你数那个数字干嘛！最先数数字，是要让我们的心念非常的专注，当我们心非常专注的时候，数字就不要再数了，我们就要进入随息，就是知道呼吸的进出。</p><p>好！那随息又有很多法门，很多不同的方法。那它的原则就是要明白、很清楚明白你呼吸的状态，从进出到知道它冷、暖。冷、暖，就是说你吸进来的空气是比较冰凉，吐出去比较热。所以它有所谓的〈十六特胜〉，在那本《小止观》里面有，〈十六特胜〉它是属于随息的范围，就是十六个步骤，从进入随息的阶段到证果的这过程，分为十六个阶段：怎么样证到欲界定、未到地定、初禅、二禅、三禅、四禅、到四空地、到九次第定的过程，〈十六特胜〉的一个过程，请参考《六妙门》随息〈十六特胜〉的部分，那就是进入随息的阶段。</p><p>那随息就是你感觉呼吸的进出，呼吸的状态都很清楚了之后，你的呼吸自然慢慢的就越来越微细，一直到好像停住了，那个就进入“止”。所以一数、二随、三止、四观、五还、六净，它就是《六妙门》的一个过程。所以不是数息数一辈子，不是，数到不想数的时候，已经好像快要得定了，就是非常的宁静，你就要进入随息。</p><p>那随息一段时间之后就得止了，那就是得定、所谓的“得定”。然后在定中再起观，那就是我们所谓的“先修止再修观”。你在定中起观，你要有定的基础，在定中才能够起观，要不然很散乱没有办法观，所以就是这样的一个过程。</p><p>那详细要讲很久，以后有机会我们再详细讲《六妙门》，对，我们有准备要讲，但是那不知道什么时候？看因缘。不净观也是看因缘，详细的来共修这样子。那我们现在讲唯识，然后配合我们现在止观的方法，就是要好好地去练习。</p><p>那讲到现在应该清楚明白了吧？还有没有其他的问题？</p><p>（有师兄问：师父，我要达到真正的止……）达到真正的止？看功夫，看功夫，对！看你修定的功夫。如果你的功夫已经非常纯熟，你从数息下手修的话，也很快就到止了。因为你数一下，很快就没有妄念了嘛，也没有昏沉、没有妄念，你就进入随息，那又很快就得止了。所以这可能是几秒钟，也可能是一座都没有办法达到，那就是看你修定的功夫。所以每个人的情况不一样，不是说我从数息，然后到止，一定要多少的时间，不一定啊！你功夫纯熟就很快啊，你就一数、二随、就三止了，很快，因为什么？没有妄想、也没有昏沉，所以很快就能够得止。</p><p>所以它没有一定的时间，要数多久它才得止，没有一定的时间，每个人的功夫不一样，对，看我们纯熟的功夫，平常训练的情况来决定，对，功夫纯熟的情况。所以，快慢每个人不同。功夫都是练出来的，有练才有，没有练就没有啊！是啊，没错，对！叫做“功夫”，就是练出来的才叫做“功夫”。那就看我们理论通达了多少，然后功夫到达什么样的程度，来决定在红尘滚滚当中是度众生，还是被众生度。</p><p>那我们今天就到这里。</p> </div></div>"
},{
    "title": "3.俱生我执",
    "author": "净莲上师",
    "date": "",
    "html": "<div class=\"B1_text\"><div id=\"fontsize\">\n<p style=\"text-align: center;\">最尊贵的净莲上师讲授</p><p>昨天从十八页开始讲，讲到哪里了？有人知道我们昨天讲到哪里吗？什么？二十啊？</p><p>我们昨天讲到三十一页，就是三十二页的第一行，我们昨天讲到这边，刚好是一个段落。那我们今天就要跳过来讲“俱生我执”跟“分别我执”，它是在五十三页：昨天讲到由八识的自体、自证变现了见分跟相分，我们凡夫不明白这个道理，把见分执为是“我”；相分执为是“法”。</p><p>那我们今天要进一步讨论，为什么八识所变现的见分跟相分，为什么它一变现我们就生起了二执呢？我们为什么马上就把见分当作是我；相分当作是法？为什么会有这样的结果呢？为什么？</p><p>跳到五十三页，中间pass过去，直接讲我执生起的原因，它是怎么形成的？我执是怎么形成的？我们刚刚讲到，我们为什么马上、立刻就把八识所变现的见分当作是我，相分当作是法呢？为什么一直会有这样错误的见解？是因为我们从无始以来就是这样的熏习。在我们没有见到无我，没有见到空性之前，我们无量劫以来都是这样子的熏习。这种习气的种子含藏在我们的第八识，因此现在八识所变现的这个见分跟相分，我们很快地就认为它是“我”跟“法”，有它真实的存在性。</p><p>所以我们修行到现在为止，如果还是这样认为的话，也是念念回熏到第八识成为未来的种子，我们永远都会这样误认为见分为我，相分为法。所以想想我们今天过的日子有没有这样的觉悟？昨天分析的那一大套的道理，今天可不可以在日常生活用得上？有没有起这样的警觉性？有没有？有啊？早晨醒来是“我”从床上爬起来吗？我在刷牙、洗脸，我准备上班，我是怎样去上班的过程？那我今天遇到所有的人、事、物，我是不是还是跟过去一样，跟昨天以前一样，马上就认为它是真实存在的，有我、有法？今天发生的每一件事情，我是不是都可以马上了知它是我们八识所变现？它是虚妄分别来的，根本都不是真实存在的。我今天见到的一切的景物，我是不是有这样的觉照？知道它是我八识变现的相分，山河大地硬梆梆（闽南语），好像是真实存在的。你说我要把它看成不是真实存在，它是八识的变现，我实在是有点困难，是不是？</p><p>那我们怎么样在日常生活当中练习呢？我们现在理论上知道它是八识的变现。我们认为它是在心外，我们心识之外单独存在的法。我们是这样认为：我们觉得有一个我在内，然后一切的法在外。众生，他、你都在外，我在内，有一个内在的我，然后外在的法，有这个内外的分别、有能所的分别，就是活在这种二元对立的生活当中。</p><p>那我们在这个当中怎么来觉悟呢？怎么把这间房子看空？它是心识的显现，它不是真实存在的？可是你怎么样把它参透？或者是你怎么把它看破？认为我们看的一切的色尘、所听的一切音声：色、声、香、味、触、法——都是八识的变现，没有它真实的存在。我们怎么把它看破？怎么练习？</p><p>《金刚经》说：“一切有为法，如梦幻泡影，如露亦如电，应做如是观。”这个就教我们观修，怎么把这一切认为实有的宇宙万有，练习在日常生活当中，练习把它观空。</p><p>“梦里明明有六趣，觉后空空无大千。”有没有听过这句话？那就是说，我们在无明的大梦当中，明明有六趣，就是六道的轮回好像是真实存在，有六道。所以我每天很怕造业，为什么怕造业？因为怕堕恶道嘛，怕受苦。所以六道对我们来讲变成它是真实存在的。那为什么会有这样的执著？就是我们昨天分析的，我们不知道它是八识所变现的，所以我们才把它很认真的来断恶修善。那你修善累积功德干嘛？希望得很好的果报嘛，从人天果报到成佛嘛。那你也把人天果报跟成佛当作是真实存在的，实有的法，实有的我。</p><p>所以怎么样破除这样的迷执呢？就是练习、练习，像如梦幻泡影嘛。梦，我们举一个梦就好了，其他以此类推：</p><p>就好像梦境一样，大家都做过梦，对不对？梦境里面有没有山河大地？有没有我？众生？有没有喜、怒、哀、乐？会哭到醒吗？那也有笑到醒的，对不对？对！那我们轮回的无明大梦，其实就是跟我们的梦境是完全一样的。那我们什么时候才知道梦境是假的呢？除非醒过来嘛，所以除非我们破迷开悟，所以除非我们见空性，除非我们证到无我；要不然这个无明的大梦很难醒过来，我们就会一直认为它是实有的我跟法。</p><p>那我们只能比喻好像梦境一样。那梦境是怎么形成的呢？你晚上睡着，它就自己来找你？它是怎么形成的？也是我们心的作用，对不对？我们心识把它变现出种种的梦境嘛。那就好像我们心意识怎么样？变现出一切的我、法是同样的意思。所以我们知道梦境是假的，我们也同样可以知道：我们在无明当中，八识所变现一切的人我、法我呢，都不是真实存在的，就好像梦境它不是真实存在的。那梦境是怎么产生的？是我们心的作用，我们心意识的显现，我们心意识有种种的种子，所以它起了现行，变现出种种不同的梦境。</p><p>那这个道理就跟我们在无明的睡梦当中，八识所变现出来的一切色法、心法、心所有法、不相应行法、有为法、无为法，通通都是同样的道理。所以我们只能常常去体会：那个梦境它是怎么形成的？然后我们在梦中是多么的执著、多么的认真，那个认真的程度就跟我们醒过来在日常生活当中是一样的。你在梦里的贪，醒过来也是同样的贪，所有都是习气的显现，我们烦恼坚固地执持的执著，所显现的种种梦境。</p><p>那我们整个轮回现象其实也是同样的道理。所以我们只能做这样的一个比喻，我们只要能体会梦境它是假的，那同样的，无明所形成的轮回它也是假的。所以就说“一切有为法如梦幻泡影，如露亦如电，应做如是观”。常常要这样在日常生活中体会，提醒自己都没有离开我们心意识的变现。那我们认为是真的，就好像我们在梦境里面认为一切境界都是实有的，是同样的颠倒错误的。</p><p>那我们现在知道我执跟法执是怎么形成的，那我们就要进一步详细去讨论：我执到底有哪一些内容？它是怎么形成的？我执它到底是怎么形成的？那我们要断的话，就比较容易。因为我们已经找出它为什么会生起的原因了。所以首先讨论有关于我执的部分，我执分为俱生的还有分别来的我执。</p><p>首先是俱生的我执，那为什么叫“俱生”呢？那就是与生俱来，就一定有我的。从小baby（婴儿）开始他就有我。你不用教他的，你不用常常提醒他说“你有一个‘我’哦，别忘记哦！”所以它不是后天的教育或者是教导，听了谁的介绍，或者怎么样，突然认为说、认知说：“哦！原来我有一个‘我’”，不用的，不用人家教的，天生就有，因为就是带来的。</p><p>我刚才也分析那个我执坚固的习气，就是每一念都在熏习、都在坚固它；所以我们其实是念念有我的。我们刚才举例子从早上起来，你一天什么时候忘记“我”？没有的，都是从“我”的立场，去出发做所有的事情。你的想法、说法、作法都没有离开“我”的。那这样做有什么样的结果呢？就是你念念都回熏到第八识那个执著有一个“我”的习气，一直在坚固当中，即使你今天学佛修行，它坚固的力量也没有减少。如果你不是往空性跟无我的这条路上去进行的话，其实我们都在增长我执，每天都在做同样的事情，即使你听闻佛法你也没有忘记有一个“我”在学习佛法、“我”在发菩提心、“我”在行六度、“我”是菩萨、“我”要成佛、哦……“我”要求神通、“我”要度众生，也没有忘记啊！</p><p>所以他还是念念熏习这个我执的习气，所以它是越来越坚固。那这所有习气的种子都回熏到第八识，所以我们八识一变现这个见分，我们很快的就认为它是“我”了，我执很快就生起，太习惯这种模式了。因为我们每天都这样去熏习，而且是继续的坚固它，所以它的力量是越来越强、我执的力量是越来越强。</p><p>所以这个“俱生我执”呢不用人教的，也不是说我有分别心的时候它才有，我没有分别心的时候它就没有了，不是！它还是有的。所以即使我们在那边修定啊，想要证到第六意识无分别的现量境啊，好像也没有，好像那个时候没有我。错了！“恒审思量”那个作用一直在。所以我们昨天也讲过，那只是第六意识的什么？法尘境界，我、法的执著并没有因为我们暂时不起分别而消失、没有，所以它叫做“俱生”，没有一刹那间断过，这才叫做可怕，没有一刹那间断过。</p><p>所以“俱生我执”它分成两大类：一个是恒常没有刹那的间断、恒常相续的，这个是怎么形成的呢？就是我们已经背的很熟的，第七识什么？恒审思量执八识见分为我。我们这句话已经背的很熟，这句话就说明了我们那个“俱生我执”是恒常相续的，为什么是恒常相续没有一刹那的间断呢？因为它是由第七识的恒审思量。恒审思量的那个“恒”，就说明第七识的作用，从来没有间断过；所以由第七识的见分来执取第八识的见分为我的时候，它的作用就从来没有间断过，为什么？因为它是由第七识的见分而起的作用，那第七识的功能既然它没有刹那的间断，所以它所引起的“俱生我执”也没有刹那的间断过，所以它都是念念执八识的见分为我。</p><p>那八识的见分就是我们认知、了别境界、认识作用这样一个自性的功能；可是我们把这样一个认知的自性的功能、了别外境的所有的自性的功能，把它当作是我。所以我们在看的时候，“我在看嘛”。刚才在打坐的时候，那个有几个腿熬不住了，那你有说…，譬如说：你的腿是麻了，你的念头会认为说：“那只是麻，跟我没关系。”没有，一定是“我”的腿麻了嘛，是不是？所以“我”的腰酸了、“我”坐的很不舒服、空气很闷了——那个是见分的作用，那个认知的作用是八识的见分，所以它能够看。</p><p>我们的自体有能见的功能、有能闻的功能，它只是这样而已。可是第七识就把这个见分的作用，把八识这个了别外境或者认知的这样的一个作用把它当作是我在看、我在听：我的头痛、我的脚麻！</p><p>所以我们就知道，第一类的“俱生我执”它是怎么产生的？就是第七识恒审思量，第七识的见分执八识的见分起作用的时候，把它当作是“我”，这就是第一类的“俱生我执”。它不了解说这个是我们心识所变现的，是我们自性的功能在起作用这样而已，并没有一个“我”的存在。因为我们还有我执，第七识还没有转成无我，它是恒审思量有我。</p><p>如果第七识转成平等性智，恒审思量的功能还在，可是恒审思量无我。所以它现在来看这种种境界的时候，它就不会把“我”放进去了，它就很清楚的了知说：诶！这只是八识的见分的功能这样就完了，没有一个“我”在作用，没有把“我”放进去。</p><p>那每天上班的是谁上班？行尸走肉？还是怎么样？每天吃三餐的是谁？还要加宵夜的是谁？那个老板脸色不好，挨骂的时候，那个被骂的是谁？所以一个了悟空性、证到无我的人，他的恒审思量第七识的作用是念念是无我的。他只看到一个什么？五蕴的假合在那边发出种种的音声。那个发出音声的那个五蕴的假合，有一个名称叫做“老板”；那他发出音声讲的一些内容，好像指的某个五蕴假合的那个对象，所以他都不会把那个有我、有你、有他，然后老板、每个角色…，他虽然清楚，但是他不会对某种对象产生贪、瞋、痴这样的一个执著。所以他看到一个人不会说，我喜不喜欢他，没有这样的执著。</p><p>喜不喜欢也是来自于我执，你有“我”了以后才我喜欢嘛。我跟他相应，我就喜欢，我们谈得来，臭味相投。那个不相应的，就觉得：“诶！谈不来，我就不喜欢他”，这个也是有“我”来的。</p><p>所以第七识就等于说、变成说：诶，我们俱生我执生起主要的罪魁祸首，都是出在它的身上。可是它本身的功能并没有好坏，没有好恶的。好坏在它有没有转识成智，它没有转之前，它就会执八识的见分的功能认为是“我”、“我”在作用。那转成无我以后就不会，就平等性智以后，它就观一切的法平等、观一切的众生平等，一切的对象是平等的。</p><p>所以他的观念就没有说那个对象的差别，在心中没有把它分等级：那个最知心的，那个平平泛泛之辈，那个淡水之交就好的，还是那种见面就是会引发一些不好的感受情绪的。他不会在心中把一切的对象，人、事、物的对象分种种好恶的等级，不会这样；因为已经证到平等了。所以他即使今天来修一切的法，从小乘、大乘、到金刚乘，他对一切的法也是平等看待、圆融无碍。所以他的心里面不会觉得小乘比较低劣，然后金刚乘最殊胜，没有这样的想法，是因为他已经证到平等性智了。所以他对一切的事物也是同等的看待，都是因缘假合的，都没有它的自性可得。所以他面对一切的众生，“众生”就是众缘和合而生的这样一个对象，他永远都明白自性是空的。那在空性当中是永远没有什么？二元对立的对待，没有分别，因此他可以做到平等。</p><p>我们有喜、怒、哀、乐，有贪、瞋、痴，是因为我们的心不平等，不平等当然就会有好恶，就会引发贪、瞋、痴。</p><p>这是我们对俱生我执第一种现象，恒常相续的来讲的俱生我执，是第七识的见分执八识的见分为我，所以它是两个见分所形成的一个相分叫做“我”。</p><p>第二类的，是有间断的俱生我执，它是由第六意识的见分执五蕴为我。因为第六意识的作用是有间断的嘛，第六意识的作用有间断，哪些时候间断？现量无分别的时候间断，所以他在入定的时候，暂时第六意识不起分别的时候它就间断；入灭尽定的时候间断；入无想定的时候间断；睡着了没有做梦的时候间断；昏倒了闷绝昏过去了，没有了，暂时间断——这就说明第六意识的作用它是有间断的。那既然第六意识的作用有间断，因此它所引起的、它所执著的这个俱生我执呢，它就有间断的。</p><p>所以第二类的俱生我执是有间断的，是因为它是由第六意识的见分所起的执著。那它执著的对象是什么？五蕴，它执著五蕴为我：</p><p>色蕴为我，这一定是我的身体嘛，色蕴为我。</p><p>我每天有不同的感受啊，老板骂我，当然不爽！那时候就有不好的感受；那老板今天称赞我说“你工作很努力，下个月加薪”，我就乐受生起。那是谁在感觉高兴？谁在感觉生气？我嘛，对不对？对。所以我们都会认为种种的感受是有一个“我”在感受，认为感受是“我”，受蕴是“我”。</p><p>那谁每天在胡思乱想？起心动念那个是谁？我们也会认为是“我”在想嘛，我坐在这边想很多事情，或者我今天想了很多事情，我有不同的思想、有不同的见解、有不同的看法，这所有都是想蕴到识蕴的作用。所以五蕴的生起呢，我们都会把“我”放进去，这个是谁在做这件事情？就是第六意识在做这件事情，第六意识的分别在告诉我们（第六意识的见分起了分别）：认为这个色身是我，种种的感受是我，种种的想、想法是我，种种的见解、思惟是我。</p><p>可是五蕴它是怎么形成的呢？五蕴从哪里来的？五蕴怎么来的？五蕴哪里来的？生来就有的，是吗？不是？那是怎么来的？色、受、想、行、识是怎么来的？八识的变现，八识的相分嘛，不是吗？一切法都是心意识的显现，那一切法有没有包含五蕴这个法？五蕴身心的法有没有包含在一切法里面？五蕴就是色、受、想、行、识嘛，色蕴就是色法，受、想、行、识属于心法；所以这个色法、心法也没有离开我们心意识的变现嘛！</p><p>我们昨天不是说三能变吗？八识是三能变，变现出一切什么？宇宙万有。那我们五蕴从哪里变现出来的？八识的变现嘛，是不是？八识所变现的相分。那我们又因为不明白它是八识所变现的，我们第六意识的见分才会执五蕴身心为我——这就是第二类的俱生我执的产生，是这样产生的，它是属于有间断的，是第六意识的见分执五蕴的相分为我。所以它是怎么生起的？一个见分、一个相分加起来的结果，就有第二类有间断的俱生我执。</p><p>刚才第一类的俱生我执是两个见分加起来的结果；第二类是一个见分、一个相分加起来的结果。七识的见分执八识的见分为我，两个见分形成一个相分，那个叫做“我”。第二类有间断的，是第六意识的见分执什么？八识所变现的五蕴的相分为我，一个见分、一个相分，而组成了第二类有间断的俱生我执。</p><p>所以我们现在就知道，俱生我执是怎么形成的呢？有两类、有两种形成的方法：一个是第七识的功能、一个是第六识的功能。所以我们现在就明白：那个俱生我执，那个俱生就是与生俱来，一生下来就有的，念念都有的那个俱生我执，它是怎么形成的？原来是第七识跟第六识的作用，就形成了这个俱生我执。</p><p>那要怎么断呢？什么时候可以断呢？什么时候断得了？我们现在这样修止观可以断得了吗？当然是断不了嘛。所以它要靠我们明心见性，见空性之后的那个空性的智慧，才能够断除由俱生而产生的这两种我执，要见道位以后，修道位的时候才能断，所以它是登地菩萨以后才有这个能力断，而且它是在空性当中智慧的观察，在空性的智慧观察当中，彻底地了悟、现见一切因缘所生法的自性是空的，就能够断除这个俱生我执。</p><p>那我们现在熏修，熏修也是熏修什么？也是观一切因缘所生法自性是空的；可是为什么断不了俱生我执呢？就是因为它是有漏的，因为有一个“我”在观一切有为法如梦、幻、泡、影，有我也有法，因此它没有空性智慧的观察，因此那个断除的力量不够。一定要空性智慧的力量，才能够真正地断除俱生的我执。光是有漏的，就是带者我执、带着烦恼的这样一个观察呢是不足以断除俱生我执。</p><p>所以我们知道它是登地以后才能一步一步的断，一直要断到八地菩萨，才能够把俱生我执这个问题真正地解决，是八地菩萨。所以初地也没有那个能力，初地是观照，他已经见空性了，他也可以在空性当中来起这样的一个观照：缘生性空这样的观照，一切因缘所生法，自性是空的，在空性的智慧当中，起这样的观照；可是初地菩萨他是在起观的时候有；他出定，没有在起观的时候就没有了，因此他没有办法彻底的断除。</p><p>二地、三地、四地，一直到七地都是同样的。只有到八地才有这样的能力，是因为八地所起的空性智慧的观照是任运无功用能现起，不会退失了，就是说他起的这个空性智慧的观察没有退失的时候，是任运生起的，不用再提醒自己了说“哦！我现在要来起这样的一个观照，我要起这样一个智慧的观察。”他不用动这样的一个念头，我们叫做“任运”。无功用，“无功用”就是他不用再起任何的功用来断除这个俱生我执，不用再起任何的功用叫做“无功用”，而且是可以任运生起的，不是有观才有，没有观没有。</p><p>那七地菩萨，是因为他的这样一个功夫是有功用的，还没有办法做到无功用、任运生起。因此第七地的菩萨也还没有办法完全断除，是因为他还要加功，还要有功用，来起这样的一个观照。他在起观的时候，他才能够断除；可没有的时候，他还是没有办法断除。所以第七地为什么没有办法完全断除俱生我执的原因，是因为他没有办法任运生起，无功用行。那八地菩萨有这样的能力，因此八地菩萨才能够真正来断除俱生我执。</p><p>今天就谈到俱生我执它是怎么生起的？还有到什么时候才能断除它？然后用什么方法来断除？就是空性的智慧，彻底地了悟、现见缘起性空的道理，才能够真正的断除。</p><p>所以我们现在开始起修，有俱生我执是一定的，是很正常的。所以那个我执并没有那么容易断除。</p><p>那初地菩萨断除的也只是分别我执而已，俱生我执他是丝毫都用不上力。那什么是分别我执呢？我们明天再谈，那个初地菩萨就可以断，只要你见空性就能够断，它就比较容易。</p><p>那俱生的话就比较难，它要到修道位才可以。那分别我执是见道位就可以断了，只要你见空性、明白无我的道理，就可以断。</p><p>好，我们今天就讲到这里。</p> </div></div>"
},{
    "title": "4.分别我执",
    "author": "净莲上师",
    "date": "",
    "html": "<div class=\"B1_text\"><div id=\"fontsize\">\n<p style=\"text-align: center;\">最尊贵的净莲上师讲授</p><p>我们今天从五十九页开始讲，介绍“分别我执”。</p><p>那这个“分别我执”为什么叫“分别”呢？它是由第六意识分别而来的。所以只要第六意识转成妙观察智的话它就能断，初品的，就是下品的妙观察智，就是断见惑。一切由分别而起的错误的知见都能够断除了。所以这个“分别我执”也是在这个时候可以断除，就是见道位。</p><p>那它是怎么生起的？它不是与生俱来，俱生我执是与生俱来，分别我执它是分别而来，是后天熏习的。后天你碰到什么样的…，你受什么样的教育啦，或者你亲近什么样的一个上师，听了一个什么样的有关于修行的内容呢，有关于介绍“我”的内容，他是怎么告诉你的？那我们第六意识分别了知之后呢，就把它记录下来。那等到我们修行的时候呢，它就会现前。譬如说：如果你亲近的上师他是告诉你（我们现在是说外道的），外道的那个邪教邪分别的内容，就是不同的外道有不同的分别我执的说法跟看法。</p><p>那如果我们亲近这样一个师父，他告诉我们说“诶，有一个我，这个是小我，这是个人的意识。那我们慢慢修练就可以融入那个至上意识，那个是叫做大我”。那我们就印象里面有一个我，那我们的一切修行呢，就是要把我这个小我融入那个大我，个人的意识融入那个至上意识。像这一类的，它就是不能够解脱、不能够开悟，因为它强调“我”的修行要怎么样去融入那个宇宙意识里面。那我们听了这样的一个教导之后呢，我们的观念里面就种下了所谓的“分别我执”这样的一个念头。第六意识就生起它的见分，它的见分去认识什么呢？认识你所听闻的这些教理，有关于介绍“我”的这些内容。那这些内容其实就是我们听闻之后，第六意识所现起的影像这样而已。那我们执著这个第六意识所现起的影像为“我”。那它是怎么来的呢？就是听了邪教或者是我们个人起了邪分别、错误的知见，不正见所造成的结果，所以它是由第六意识所产生的。那第六意识有间断，所以这个也是有间断的。</p><p>那只要我们第六意识能够保持…，从保持现量境开始练习，慢慢地能够契入空观，观一切因缘所生法自性是空的，能够契入这个空观之后呢，我们就知道：由第六意识所分别的这一切我执呢，都是自性了不可得，都是错误的。这个时候我们就能够破除分别我执了，所以它比较容易断。</p><p>那也谈到我们修行的次第，也是先从第六意识起观嘛，第七识的恒审思量是没有办法马上断的，因为它是内执而跟外境没有关系。它是一种内在执持八识的见分为我，是这样一个强烈的执取，那我们不容易断。我们昨天也谈到，你必须要修道位的时候，有殊胜的生空观，就是非常殊胜的性空缘起的这样一个观察，就是说你这个观察都是在空性当中起观，而不是有漏的智慧观察。</p><p>可是我们今天讲的这个分别我执呢，我们在凡夫位就可以做这样的练习：我们即使是有漏的智慧来观察“一切因缘所生法自性是空”，这个性空缘起的智慧的观察训练，在我们有漏的智慧也能够熏修。那就是为什么要修止修观的原因，第一步要破的就是分别我执，因为它比较容易。只要我们第六意识能够保持在现量境当中，再加上我们现在不断不断训练的那个止观方法，你就可以很快的见到空性。很快见到空性，那你这个由第六意识所生起分别的这个我执就马上能够断除，你什么时候见道，它什么时候就断除，所以它是比较容易的，也是我们起步修行的初步目标。然后见道位之后呢，才能够起这个殊胜的空性智慧观察，来破除俱生我执，这是有关于分别我执的内容。</p><p>那有人就有问题啦，说“既然没有我的，本来是没有我的，可是为什么我们能够记忆过去的事情？哪个人曾经对不起我们，我们就把他归在怨敌那个范围。哪个人曾经有恩于我们？我们也要常常想怎么去报答他。有所谓要防小人，然后要报恩人。诶！这些过去事情的记忆，如果没有我的话，到底是谁在记忆这些应该报恩报怨的事情呢？这个记忆到底是由谁来担任这样的一个责任？或者我现前能认识种种外境，如果没有一个我的话，那是谁在认识外境？去了知分别外境，我怎么能叫出你们每个人的名字？如果没有我的话，谁来分别？这种种的分别，对人事物的分别——这个作用又是从那边来的？不是我在分别吗？如果没有我的话，我怎么能够计划未来？我可以规划我的未来，我修行的生涯规划，不是世俗红尘的生涯规划。我决定我几岁要退休、决定什么时候要闭关，诶，我可以计划未来。可没有我的话，谁在计划未来呢？”</p><p>就有人提出这样的问题：过去世的记忆，曾经、过去，已经过去的这些记忆，是谁在记忆？现前的了知境界，是谁在了知？又是谁在计划未来？如果没有我的话，谁来承当这些责任？</p><p>那站在唯识学家的立场，他就能够做出答案，他就能够回答这样的问题。是谁在记忆呢？没有一个“我”在记忆，对不对？谁在记忆？这是什么？八识，诶，对！八识：能藏、所藏、执藏嘛，它是一个记忆的大仓库，对不对？所有过去的这些数据，全部都输入这个第八识的电脑里头，这个档案都存盘存得很好。过去世所有的现行全部回熏到第八识，成为未来的种子。所以第八识含藏过去劫以来无量的种子在里面，那就包含了我们过去好的记忆、不好的记忆，怨、亲、中庸，各种不同的人、事、物的记忆。所以是有一个八识这个记忆库、这个资料库在记忆，而没有一个“我”在记忆这件事情。</p><p>那现前的了知又是谁在了知呢？第六意识在分别了知。还有没有？第七识的恒审思量执八识的见分为我，再加上八识有一个大的记忆库，所有的种子都是由八识生起了种种的现行，现行再熏回第八识成为未来的种子。所以了别外境其实也是八识的什么？八识的自证所显现的见分跟相分的作用，对不对？还有一个“我”了知，然后被了知的种种的境界，其实也是见分跟相分，它也是八识的变现。那谁在计划未来？也是同样的道理，都是八识的种子生起现行。我们觉得有一个“我”可以计划未来，其实不是，都是八识的作用。</p><p>那又有人问：“如果没有“我”的话，是谁在造业？谁在受报呢？难道我们不是认为有一个‘我’每天在造身、口、意三业吗？那不是‘我’在每天受报吗？”我们吓得要死，希望不要…，尽可能的避掉一切的果报在我身上成熟，所以我们要祈请上师加持啦、要修回向啦、要修除障法啦，那干嘛这么忙呢？如果没有一个“我”在受报，我们就不用害怕果报降临在我们的身上啊！那是谁在造业、谁在受报呢？谁？造业的是谁？没有“我”啊，又是八识，八识有这样的功能。</p><p>八识变现出什么？身心世界，都是八识的变现，八识变现了这个身心世界之后呢，我们就执著这个身心世界的真实存在，也同时执著五蕴身心的活动过程是“我”，“我”的五蕴。那不知道五蕴是八识所变现的相分，那我们就执著这个五蕴为“我”。那就是把五蕴身心活动的过程当作是“我”，所以就是这样造了身、口、意业，其实它是五蕴身心活动的过程当中，就有所谓造业的这样一个过程。可是我们知道，即使是看似有身口意造业的过程，其实它也是种子生现行，现行回熏成种子这样一个因果关系而已。</p><p>所以造业的谁？是第八识所变现的五蕴身心活动的过程，看起来好像有我们所谓造业的这样一个现象。因为过程……所谓活动的过程就是譬如说：我们每一天五蕴的每一刹那它都在生灭、生灭，那这个生灭生灭的现象当中，就是不断有外缘的牵引，引发我们八识的善的种子起现行，或者是恶的种子起现行。譬如说：我们现在动一个念头是不好的念头，就是八识恶的种子生起了现行——这就是我们心的活动，好像在造一个恶业了，因为动了一个恶念头，我们就说你造了一个意业，它是不好的意业，动了一个坏念头；或者是我现在一念发菩提心，这一念发菩提心——就是八识这个善的种子，生起了现行，生起了一个好的念头说：“哦，我要度一切众生，众生无边誓愿度。”发起这个四弘誓愿来说的话，这样看起来好像在造善业嘛，那也不是一个“我”在造善业，而是八识这个善的种子怎么样？生起现行了。</p><p>所以我们其实每天都是五蕴身心活动刹那、刹那在生灭。那这个刹那、刹那生灭有很多的造作在里面，就是所谓身口意的造作：种种的善或者恶，所以造业是这样形成的。那同时我们身心五蕴在活动的这个过程当中，也同时好像在受报：今天有比较顺心啊，或者是今天有不顺心（我们看有这样不同的现象）。那所谓今天比较顺，就是过去的善业今天成熟了；今天比较不顺，就是过去的恶业现在成熟了。所以受报也不是有一个“我”在受报，也是同样在五蕴身心活动的过程当中，展现有造业有受报这样的一个现象，并没有一个“我”在造业跟受报这样就回答了第二个问题。</p><p>第三个问题：如果没有“我”的话，谁在轮回？又是第八识。没有“我”的话，这些都是外道在问的，因为他们听我们佛法讲说，本来一切法无我的嘛，那他们就提出这些问题：没有“我”的话，那轮回的是谁？不是一直“我”在轮回吗？在他们的观念里面，是有一个恒常的“我”、永恒不变的“我”一直在轮回，在善道、恶道，这样不断不断地轮回。或者是他们有不同的见解说你这世是人，就生生世世都是人；你这一世是狗狗，就生生世世都是狗狗；那个印度的四个阶级，你是刹帝利就生生世世都是刹帝利种；婆罗门种就通通都是婆罗门种。那他们的观念里面就是有一个永恒的“我”，它不断不断地轮回。可是你们现在说没有一个“我”，那谁在轮回呢？那又是谁觉得轮回很苦，要赶快证得涅槃呢？如果没有“我”的话，我何必要辛辛苦苦念佛往生极乐世界？是因为“我”觉得娑婆世界很苦，所以有一个极乐世界我要去，这个离苦得乐的这样的念头不是很多余吗？如果没有“我”的话，对不对？谁要脱离轮回的苦？谁要证得涅槃的乐？好像也是多此一举，也是很多余的嘛。</p><p>那还要不要去阿弥陀佛那边？还是执迷不悟要去？</p><p>可是我们现在都很厉害，因为我们唯识现在呱呱叫嘛，所以也能够回答这样的问题啦！谁在轮回？也是八识、八识的作用。（有师兄说：是八识去投胎，那个中阴身…）哦，八识去投胎，中阴身是八识，所以去投胎的是八识，没有一个“我”去投胎，对不对？都是八识的作用，八识变现出不同的身心世界。</p><p>因为我们有一个八识，每个人的八识，它就是那个电脑、那个大电脑储存了很多的种子在里面，这个种子所有都是熏习进去的种子。所以就看哪一个种子先成熟，变现出那一道的身心世界来，那个就是六道——就是这样形成的，其实就是八识所变现的身心世界，没有离开八识的变现。那不同的种子它就变现出不同的身心世界：饿鬼道的种子先成熟，它就面现出饿鬼道的身心世界；那天道的种子先成熟，唉，它就变现出天道的身心世界——这个正报跟依报。</p><p>所以所谓的那个“中阴身”也不是“我”，它就是八识哪一个种子先成熟，它就变现出那一道的身心世界。那我们就方便说：他投生到那一道去了，其实是他自己八识变现出那一道的身心世界，那我们就认为说：“诶！他去投胎了。”其实没有一个“我”去投胎。</p><p>那这样来讲的话，是谁在觉得轮回是苦的呢？那我们为什么会觉得……，八识会觉得轮回是苦吗？我们执八识为“我”，我们因为无明的关系，把这个五蕴身心它所变现的身心世界，我们把它当作是真实存在的。所以我们执著身心这个生灭相续的过程，我们把它执为是“我”。所以才会生起我执，有了这个我执，就会有贪、瞋、痴，有贪、瞋、痴就造业，所以就会有种种的苦报。</p><p>所以它的源头是因为无明，以为有一个“我”的关系，所以才会造业，然后受报。那他在受报的时候，也会觉得“我”在受苦，所以他会觉得轮回是苦的，所以“我”要赶快离开轮回、“我”要赶快解脱、“我”要赶快证得涅槃。</p><p>其实轮回是虚妄的、涅槃也是虚妄的、六道也是虚妄的、“我”也是虚妄的。“凡所有相，皆是虚妄。”</p><p>所以我们就明白：其实都是唯有识，唯识，唯有识，唯有心识，都是心识所变现的，并没有一个真实的“我”存在。</p><p>所以对于外道所问的这三个问题，唯识学家都能够合理很圆满的解释，而证明确实没有一个“我”的存在。</p><p>所以讲到这边为止呢，我们就把我执介绍完了：俱生我执跟分别我执介绍完了。那现在我们就应该是讲到第几页呢？我执的部分就讲完了，就是七十二页，我们讲到七十二页。从下一次开始，我们就进入了法执的部分，就是七十二页的最后一行黑体字这边开始，是我们下一堂要进行的进度。</p><p>那为什么我们这次讲唯识没有勇气看课本呢？就是用听的会觉得好像比较懂，一看文字就不懂了，所以我们这次就不敢念书。那你们华文有兴趣的你们就自己看。因为我们所有的重点都已经介绍过了。那如果说华文看起来没有问题，那也可以好好的去听CD，然后再好好地来对照课本来温习，这样能够加深印象。那如果没有华文的基础也没有关系，你只要听得懂我在讲什么就行了。</p><p>那为什么中间还有一大段跳过去呢？因为那是在讨论外道的我执的种类，那我们先不要念，因为我们先把正确的记下来。我们正确的还没有弄清楚之前，先念了那个搞不好就熏到第八识，然后又混乱，所以我们回过头来再念。所以我们跳过去的那个部分，是在讨问外道有哪些我执的种类，然后唯识学家怎么破斥他们的我执是错误的，是这样一个论辩的过程，那我们到后面再讲。</p><p>那我们现在讲的都是正确唯识的观念。这个很重要，我们先把什么是正确的记下来，那回头我们再看怎么去破斥外道他们的我执。</p><p>那我们这次的课程就到这边结束。</p> </div></div>"
}]