[{
    "title": "壹、见道分——七处征心",
    "author": "元音老人",
    "date": "",
    "html": "<div class=\"B1_text\"><p><p style=\"text-align: justify;\">壹、见道分</p><p>《楞严经》卷第一 七处征心 （空如来藏）</p><p>　　一、开经缘起</p><p>　　二、七处征心<br/><br/>　　　   （一）执心在内<br/><br/>　　　　（二）执心在外<br/><br/>　　　　（三）妄计潜根<br/><br/>　　　　（四）开合明暗<br/><br/>　　　　（五）合处随有<br/><br/>　　　　（六）计在中间<br/><br/>　　　　（七）一切无著　</p><p><br/><br/></p><p>（四）开合明暗</p><p>　“佛告阿难，汝当闭眼见暗之时，此暗境界，为与眼对？为不对眼？若与眼对，暗在眼前，云何成内？若成内者，居暗室中，无日月灯，此室暗中，皆汝焦腑。若不对者，云何成见？”<br/><br/>　　佛问阿难：当你闭眼看见黑暗时，这黑暗的境界是否与眼睛相对呢？如果相对，则黑暗的境界应在眼前。即然在眼前，就不应该在身体的内部。如果你执意要认为，同样是黑暗，此黑暗与彼黑暗完全一样，没有区别，所以闭上眼睛看见的黑暗，就等同于看见身体的内部一样。如果真是这样，当你在一个黑暗的房间里，没有日光、月光，也没有灯光的时候，所看到的黑暗应等同于你身体内部了。这样房间里面不就成了你的五脏六腑了吗？可见，这是不对的！所以，闭上眼睛看见黑暗的时候，如果黑暗的境界与眼睛相对，是不能称为身体内部的。如果不相对，你连看都看不见，就更不能说是身体内部了。因为我们看见什么东西，这个东西一定是在眼前，与眼睛相对。比如现在我看到在左边的录音机，在右边的茶杯，这些东西都是在我们眼前，与眼睛相对。否则，我是看不见的。<br/><br/>　　“若离外见，内对所成，合眼见暗，名为身中，开眼见明，何不见面？若不见面，内对不成。见面若成，此了知心，及与眼根，乃在虚空，何成在内？若在虚空，自非汝体，即应如来，今见汝面，亦是汝身。汝眼已知，身合非觉。必汝执言，身眼两觉，应有二知，即汝一身，应成两佛。是故应知，汝言见暗，名见内者，无有是处。”<br/><br/>　　这时，阿难反驳说：如果我的心能离开身体，就可以与身体相对（这就是“内对”），这样闭眼看见的黑暗，就可以称为看见身体的内部了吧？！对此，佛继续开示：假如你的心真能离开你的身体，与身体相对，而你又将闭上眼睛看见的黑暗称为看见身体内部，那么睁开眼睛为什么看不见你自己的面孔呢？就象我的心在你的身体外面，我就可以看见你的面孔，但你自己却看不见，这就说明你的心不可能离开你的身体。假如有人强辩：我有特异功能，我能看见自己的面孔。假如你真的能看见你自己的面孔，那么你这个觉知之心和你的眼根就在虚空之中，就不在你的身体里，这自然就不是你的身体！否则，我释迦佛能看到你阿难的面孔，释迦佛就是你阿难了，显然这是不可能的。再进一步说：如果你的心在虚空中，在你身体之外，你的眼睛能看见，但你的身体也不应该有知觉，就好象你能看见我吃饭，但你永远不会饱一样，因各有所属。如果你硬要说：身是身，眼是眼，有两个知觉，那么你阿难一个人就应该成两个佛了，这是不可能的。其实，身不离心，心不离身，身心是一致的，不可能有两个知觉。所以阿难将闭上眼睛看见黑暗称为看见身体内部的说法是错误的。<br/><br/>　　阿难错就错在执着在妄念上，不知道回光返照。比如修禅宗参话头贵在起疑情，当参“念佛是谁？”这个话头时，这个“念佛是谁”的念头一直在心里转。在此疑情中，妄念“啪”一断：这时并不是死人，而是了了分明，这是什么？这时要回光返照！当下一觉，便可亲证真如实性了。你要是在那念：“念佛是谁，念佛是准……。”没有用！既使念上几十年也不得消息。对于修净土念佛法门的人，同样如此：“阿弥陀佛，阿弥陀佛……”念到心行路绝，心念停止的时候，能念之心和所念之佛一时脱落。这个时候，也是要回光返照，当下一觉，便可亲证真如实性。这就是净宗人说的“花开见佛悟无生”。有些人不懂，当念佛念到恰到好处时，身体没有了，佛号也没有了，他倒惊讶了：“哎呀，我怎么离开佛了，空了，不行，不行”，这样妄念一起，就错过亲证本性的时机了。这都是因为我们不知道用功的诀窍啊！我们念佛要念到无能念，无所念，这才是念佛三昧。真正证到三昧之时，既无能念，也无所念，赤裸裸地悟出来了，不需要再废口舌。这就是我们所说的“言语道断，心行路绝”。有很多修行的人就是不知道用功的诀窍，不知道时时回光返照，反被各种外境迷惑。实际上，我们眼前的各种境界都是由妄心蕴积而成，“色受想行识”五蕴中的色蕴就是由于我们坚固妄想，蕴积而成。当我们将妄想打破，境界当下消殒，这时大地平沉，虚空粉碎。真如佛性豁然现前。所以佛非常慈悲，总是反复叮嘱：在什么处、什么处……，就等于我们宗下所问的是什么？是什么？……。都是言下指归，都是要我们能在当下回光返照，亲证本来。可惜，阿难尊者就是不理会言下指归，一会儿说在这里，一会儿说在那里，说来说去都不对！<br/><br/>　　关于“七处征心”我们已经讲了四处：一执心在内，二执心在外，三是妄计潜根，四是开合明暗。这四处都是阿难从世法上想出来的，已被佛一一否定。但是阿难一向多闻，他听过很多佛菩萨讲经，道理研究得很细。他想：既然从世法上讲不对，那我就从出世法上来讲。所以“七处征心”的后三处征心就是从出世法上来讲的。假如不是阿难多闻，让一般人来讲，还讲不出这些道理。所以，不要说阿难多闻不好，多闻也有多闻的好处啊！下面我们再来看经文:<br/><br/>　　（五）合处随有<br/><br/>　　“阿难言，我尝闻佛开示四众：由心生故种种法生，由法生故种种心生。”<br/><br/>　　这段经文中“由心生故种种法生，由法生故种种心生”这两句话在佛教中具有非常重要的意义，所以我们先讲一下。这两句话简单的来讲就是：由于我们的心念动（即“心生”）的缘故便产生种种的现象（即“法生”）；又由于种种现象的产生，再使我们产生种种的心。这里的“法”字是指世间的事事物物等一切现象，但这两句话中的两个“心”字，仔细推敲是有区别的。<br/><br/>　　《大乘起信论》中说：无明熏真故……。我们的真如佛性，即真心，本来具足智慧德相，本来就是大圆镜智、平等性智、妙观察智和成所作智。但由于无明的熏染，真心中生出了妄心，智慧变成了识：大圆镜智变成第八识、平等性智变成第七识、妙观察智变成第六识、成所作智变成前五识。第八识叫阿赖耶识，其功用就象一个大仓库，不管好坏各种念头都往里收藏；第七识叫末那识，是第六识的根子，叫意根，执着有我，因为有我之故，一切都为我着想；第六识，就是我们平常说的意识，也就是我们平常人所说的心，我们一般人对心的认识仅停留在这一层上。因为无明的熏染，真心中生出了妄心，妄心再动，反过来复熏无明，使妄心动得更加厉害了。这就是因还果、果继因、因起果、果再还因，反复熏染，引起妄境。引起妄境的过程就是第七识的功能，因第七识是传送识，位于六识与八识之间。妄境一升起便产生种种现象，这就是“由心生故种种法生”。所以，这一句话中的“心”就是指第七识。由此我们可以看出，世间的种种现象、种种境界都是由我们的妄心创造的，都是虚妄不实的。但是虚妄的境界一经产生，反过来会再熏染我们的妄心。比如，贪财之人看见金子就会生出占有之心，好色之徒看见美色就会生出贪恋之心……，这就是妄境反过来再熏染妄心，使我们的第六意识产生种种分别，心念变易，这就是“由法生故种种心生”。所以这一句话中的“心”是指第六识。因此这两句话中同样是“心”，但其意义不同。<br/><br/>　　真心与妄心的最大区别就在于：真心是不动的，而妄心生灭不已。第六意识受环境的影响，跟着前五识，即眼耳鼻舌身转，变化不定。下面给大家讲一个公案：临济祖师的传法弟子三圣慧然禅师，得道之后，游访到仰山，仰山有位大禅师，是沩山灵佑的传法弟子，叫仰山慧寂禅师。有一天，朝廷有位官员来访，仰山问：你是什么官职？官员答到：我是推官。推官是当时朝廷的一个官职，主要职责是观察世上不平之事。这时仰山禅师将佛尘一举问：你推得这个吗？推官答不上来。仰山禅师问其他人，没有人能回答。于是仰山禅师派侍者去问三圣禅师，看看三圣禅师怎么答。侍者跑到凉棚，三圣禅师正在那里养病，侍者说明来由，问：还推得这个吗？三圣答道：“咳，祸生也！祸生也！”。“祸生也”就是祸事生出来了。为什么是祸事生出来了呢？因为“由心生故种种法生”，妄心一动，就是祸生！侍者回去告诉仰山禅师。仰山禅师想看他是否悟得透彻，于是对侍者说：你再去问他，不知生出什么祸了？这一次，三圣禅师历声答道：“再犯不容！”。这就是说：心不能再动了，还什么祸不祸的，本来一法不立，净裸裸，赤洒洒，毫无所得。仰山禅师赞叹道：三圣慧然禅师真是了不起。所以，心不能动，心一动种种法就生出来了，并且彼此互为因果，互相和合。<br/><br/>　　当我们理解了“由心生故种种法生，由法生故种种心生”两句话的含义之后，再看这段经文：<br/><br/>　　“我今思惟，即思惟体，实我心性，随所合处心则随有，亦非内、外、中间三处。”<br/><br/>　　阿难说，我曾听佛讲法，开示四众（“四众”即四众弟子。就是指出家二众比丘、比丘尼，在家二众优婆塞、优婆夷。）：“由心生故种种法生，由法生故种种心生”。所以，我想：我现在能够思想的这个思维体，就是我的心性，随着境界现前，这个思维体与之相合，我的心就产生了。所以它是无处不在的，不只是在内、在外、或在中间。这是阿难根据佛所说的“由心生故种种法生，由法生故种种心生”这句话推断出来的，但阿难却只着重后面这句话。所以阿难所说的思维体，就是妄心，就是第六识。因为第六识，它势力最强，无论什么地方，什么时间，无处不在。<br/><br/>　　“佛告阿难：汝今说言，由法生故种种心生，随所合处心随有者，是心无体，则无所合。若无有体而能合者，则十九界，因七尘合，是义不然。”<br/><br/>　　佛恐阿难再变，所以又重复了一遍阿难所说的观点。佛说：你现在认为你的心是与各种境界相合才产生的，也就是说由于种种境界的存在，才生出种种的心。假如你认为心是这样的话，那么你所说的心是因境而有的。因境而有，离境则无，这就等于是空中之花、水中之月一样没有自体。没有自体，则不能相合。我们知道，相合需要有两个必要条件：第一是要有自体，第二是属性要相同。比如说：六根合六尘而生六识界。六根就是眼耳鼻舌身意，六尘是色声香味触法。六根与六尘相合一定是眼根与色尘相合生眼识界，耳根与声尘相合生耳识界，鼻根与香尘相合生鼻识界，舌根与味尘相合生舌识界，身根与触尘相合生身识界，意根与法尘相合生意识界。这样六根、六尘与六识界共称十八界。但是我们不能说眼根与声尘合，耳根与色尘合，这是无法相合的，因为属性不同。现在阿难用他所说的思维体，实际上就是意识心，与外面的五尘：色声香味触相合，等于在六尘之外又多了一尘，即由色声香味触组成的种种境界，这不就变成第七尘了吗？！阿难用他所说的思维体，这个无体根与这第七尘合，不就成了“十九界因七尘合”了吗？！实际上，只有十八界，只有六尘，第六识不能与色声香味触合，只能与法尘合。所以阿难这时对心的认识仍然停留在第六意识上，这个心仍然是虚妄不实的，没有自体！没有自体是不能相合的。但假如阿难仍固执地认为：我所说的心是有体的！上面佛讲的是无体的情况，下面佛就针对阿难认为他所说的心是有体的这一观点进行剖析。<br/><br/>　　现在我们看经文：<br/><br/>　　“若有体者，如汝以手自擣其体，汝所知心，为复内出？为从外入？若复内出，还见身中，若从外来，先合见面。阿难言：见是其眼，心知非眼，为见非义。佛言：若眼能见，汝在室中，门能见不？则诸已死，尚有眼存，应皆见物。若见物者，云何名死？”<br/><br/>　　“有”有两种含义：一是指本来有，比如我们说众生的佛性是从无始以来就具有的。二是指后来有，就是说，本来没有的事物但后来才具有的。那么佛在这里首先分析后来有的观点。如果什么事物是后来才有的，那必定有其来处。比如，我们以前没有录音机，现在有了一台，那么这台录音机是怎么来的呢？是买来的，还是别人借的呢？还是从别的什么地方来的？它一定有来处。没有来处就不可能有这个录音机。有的人说是偷来的，即使是偷来的也是有一个来处。<br/><br/>　　所以佛说：如果你所说的这个心是有体的话，那么你用手敲一下你自己的身体，你便知道痛。那么这个痛是从什么地方来的呢？是从身体里面出来还是从身体外面进去的呢？假如是从身体里面出来的，那就一定能看到自己身体里面的东西。假如是从身体外面进去的，那一定会看到你自己的面孔。但事实上，你既看不到你身体里的心肝脾胃肺，也看不到你自己的面孔。这就说明，你所说的这个心，既不是从身体里面出来，也不是从身体外面进去，是没有来处的！没有来处怎么会有呢？听到这里，阿难反驳说：见是我的眼睛，我所说的心不是我的眼睛。我这个心是知觉，不能象眼睛一样看。所以你用能不能看见来分析是不对的。佛说：假如眼睛能看见的话，那么你在房间内，房门能看见东西吗？在这里佛用“门”来比作眼睛，用“你”比作心。我们常说，眼睛是心灵的窗户，真正能看见东西的是心，而不是眼睛。所以佛继续说：你在房间内，你可以看见东西而门不能看，说明能看见东西的是心而不是眼睛。如果有人说，门是无情，人是有情，用无情之物来比有情之人，这个比方不对！所以佛又进一步举例：假如人已经死了，眼睛还存在，那么这时他为什么看不见了呢？再反过来讲，假如他能看见东西的话，又怎么能说他死了呢？佛就是为了让我们明白，我们能看见东西，不是用眼睛而是用心！念佛也是这样，不是用嘴念而是要用心念。参禅也同样如此，要用心去参：这个念佛的人是谁呢？所以说佛法是心地法门！讲到这里，佛就将阿难所说的“心是后来有”的观点否定了。下面，佛接着分析阿难所说的心是本来有的观点。<br/><br/>　　“阿难，又汝觉了能知之心，若必有体，为复一体？为有多体？今在汝身，为复遍体？为不遍体？若一体者，则汝以手擣一支时，四支应觉。若咸觉者，擣应无在。若擣有所，则汝一体自不能成。若多体者，则成多人，何体为汝？若遍体者，同前所擣。若不遍者，当汝触头，亦触其足。头有所觉，足应无知。今汝不然，是故应知，随所合处，心则随有，无有是处。”<br/><br/>　　这段经文就是假设阿难所说的心本来就有体性，而不是后来才有的。后来有就应该有来处，但追问到最后，阿难无法说明来处，所以阿难所说心是后来有体性的说法是错误的。现在假如阿难又说：我这个心是无始以来就有体性，不是后来才有的，这样就没有来处了。实际上，真正有体性的东西必定有相用。没有相用，就不能说明有体。体、相、用三者密不可分。即使我们证见本性之后，还是有相用。真如佛性不是说孤零零的一个，不是断灭，而是有无穷的妙用，有各种各样的境界。比如，东方有净土，南方有净土，西方有净土，北方也有净土，这些都是相用。没有相用就不能证明有体。就象镜子一样，镜子里必定有影子，没有影子就不能称其为镜子。假如阿难所说之心有体，那就一定能表示出来。因此，佛就追问：如果你所说的心一定有体，那么这个体是一体还是多体呢？现在在你身上，这个体是周遍全身？还是只在一处呢？假如说是一体的话，那么你用你的手打你自己的时候，比如打你的一只胳膊，那么你的另一胳膊和两条腿都应同时感觉到痛了。假如你的四肢真的都感觉到痛，那么到底打在什么地方呢？因为连不打的地方都痛，那如何分辨打在什么地方呢？这样“打”就不存在了。事实上打在什么地方，什么地方痛。这就说明，能知之心不是一体。如果能知之心是多体，人有觉知之心，一个人只有一个身体。现在这个能知的心有多体，那就一定有多个人了，这样哪一个人是你阿难呢？！所以，这个能知之心也不是多体。如果说能知之心周遍你的全身，那么象前面所讲的那样，打你一肢的时候，你的全身都会痛。这是不可能的。所以，这个能知之心也不是周遍全身。如果这个能知之心不是周遍全身，只在你身体中的某一部分。那么现在我打你的头的同时也打你的脚，这样如果你的头感到痛了，脚就不应感到痛。因为你的能知之心只在一处。在头上就不应在脚上，所以脚应是没有知觉的。但实际上并不是这样。这就说明，你的能知之心也不是不周遍全身的。<br/><br/>　　通过上面对这四个问题的详细论述，说明能知之心不是一体也不是多体，不是周遍全身也不是非周遍全身。所以能知之心，即我们的本性，是非一非二，非空非有，非即非离。不可执在一处，执在一处就是妄心，就不能圆融了。比如，我们现在在一个房间里，如果我们放下一切，心无所住，房间里的一切东西都在我们的视线之内，所有东西我们都看得非常清楚。假如我们心有所住，执着在某样东西上，比如专注于某件工艺品。这样你的眼睛里就只有这个工艺品，而其它东西就看不见了。所以，当我们心有所住的时候，视野就变狭窄了，就看不清世界的本来面目了。<br/><br/>　　这个世界上有许多哲学家、思想家，但归纳起来只有两大类：一类是唯心派，一类是唯物派。唯心派认为一切唯心造，心是主宰。物质文明就是由于我们的心灵手巧而创造出来的，所以没有心，便没有这个世界。而唯物派则认为心是客观事物在人脑中的反映。心必须受物质客观规律的制约，必须符合物质发展的规律，才能够进行创造发明。两派一直为此争论不休。事实上，唯心派也好，唯物派也好，是一个事物的两个方面。就象我们的这只手，一面是手心，一面是手背，但两面都是这一只手。只不过从这一面看是手心，从另一面看是手背，角度不同。唯物派与唯心派都是从各自的角度出发，只强调自己的道理，片面地执着在一边，所以不能圆满。而在佛教中，对这个问题论述得就比较全面。我们前面讲的“由心生故种种法生，由法生故种种心生”就代表了佛教的哲学思想。“由心生故种种法生”就是说由于我们的心念动，便产生种种事事物物，这句话讲的就是唯心；“由法生故种种心生”就是说由于世间存在种种事事物物，于是便产生种种心念，这句话讲的又是唯物。有人会问：佛教中不是讲“三界唯心，万法唯识”吗？所以佛教总体上说还是唯心派。其实这是人们对佛教的误解。我们平常人对心的认识仅仅是指第六意识，因为人们只知道第六意识！实际上，我们人不仅有第六意识，还有第七识、第八识。前面讲过我们的真心，即我们的真如佛性，被无明熏染就变成了识，即：大圆镜智变成第八识，平等性智变成第七识，妙观察智变成第六识，成所作智变成前五识。我们一般人所说的心就是第六识，就是意识。第六识的根子是第七识，而产生这些识的种子就是第八识，有时也称八识心王。<br/><br/>　　如果可以用一棵大树来作比喻：种子就是第八识，种子发芽生出了根就是第七识；根子吸取营养继续生长，长出了树干就是第六识；树干上长出的枝枝叶叶就是前五识。上次有人问：前五识有浮尘根和胜义根，不知其它几识的浮尘根在哪？浮尘根就是以四大为体，对取境生识仅起辅助作用的生理器官；胜义根是实际起取境生识作用的能力。所以前五识的浮尘根我们都知道，就是眼睛、耳朵、鼻子、舌头和身体；而第六识的浮尘根在大脑；第七识的浮尘根在大脑到心脏之间的脉管里面；第八识的浮尘根是在心脏里面。这些在显教里面讲得不是很清楚，在密教里讲得很详细。<br/><br/>　　密宗中讲：在我们人体的中央，从腹部通过心脏到大脑之间有一条脉管。这里与道教讲的不同，道教讲的是任、督二脉，而这儿讲的是中脉。八识在心脏里面，由五彩光环包裹着，这就是八识心王的王宫。它象太阳一样放射出光明，所以在我们打坐心净的时候就会看到光明，这个光就是你自身发出的，而且是五彩光明，不是单一的颜色。第七识就在心脏至大脑脉管的中间部位，在六识与八识之间起着通信的作用。第六识就在大脑。中脉通过左右二脉连到两个眼睛上，所以，我们说眼睛是心灵的窗户，通过眼睛我们就可以看到心光。密宗里有一些修法，就可以教我们如何观脉管，如何看光，因为密宗是要灌顶传授的，这里就不公开讲了。<br/><br/>　　唯心派也好，唯物派也好，他们所说的心，都是指的第六意识。而“由心生故种种法生”和“三界唯心”这两句话中所说的心与他们所说的心不同，不是哲学家们所说的第六意识这个主观的心！这两句话中所说的心是将主观与客观统一在一起的心，这就是我们说的一真法界，就是我们的真如佛性，也就是真心。所以说，佛教的哲学思想实在是比唯物派与唯心派要高深得多！<br/><br/>　　在佛教中，“唯心”有两个重要的含义：第一、是说一切东西都是由真心所创造的，都是虚幻不实的。这里“一切东西”就是指一切事事物物，包括我们平常所说的第六意识这个心，也都是空花水月，没有实体。所以佛教中说：心不自心，因色故心，色不自色，因心故色。“心不自心，因色故心”就是我们前面说的“法生故种种心生”，它说明了心的来处。因为有事事物物才有这个心，假如没有客观物质的反映，就没有这个心。但是，反过来，这个事事物物又是从什么地方来的呢？它不是从天上掉下来的。因为我们的心能够研究物质发展的客观规律，利用这个客观规律我们就可以进行发明创造，就能创造出种种事事物物，所以说“色不自色，因心故色”。这个色就是心所创造发明的。因此说，心来源于色，色又是心创造的。所以这里的心与色都不是真有实体，都是虚幻不实的，叫妄心、妄色。而创造它们的就是真如佛性，就是真心。这就是佛教中“唯心”的第一个含义。而佛教中“唯心”的第二个含义就是说，这些妄心、妄色正是我们真心所显现的。真心就是我们的真如佛性，它是创造万物的万能体。世间的一切事事物物，各种各样的心念，都是由它产生的。<br/><br/>　　所以，种种色、种种心的存在，就证明了真心的存在，真心是它们的体，它们便是真心的相、用。没有体就无法产生相、用，没有相、用就不能证明有体！下面我们举个简单的例子来说明体、相、用之间的关系。比如我们做米饭：首先应加适量的水，水多了饭就稀，水少了饭就硬，水加好后再用大火烧，烧开之后再用小火闷，这样米饭就做好了。如果一直用大火烧，饭就会烧焦。大家都知道，这个道理是没有形象的，但根据这个道理去做，把米饭做出来，就证明这个道理是对的。这个理体就在做米饭的过程中显示出来了，这就叫做理以事显。理体必须通过一定的相用显示，才能证明有体。如果没有相用，无法显示，就不能证明有体。就象镜子，镜子必定有影子，如果没有影子就不能称其为镜子了。所以理体与事物不是独立的，体、相、用是不可分的。因此我们说体相用就是一个，即一真法界；体相用又是多个，有种种妙用。所以说真心非一非二，亦一亦二。佛教道理讲得比较圆融，它既包含了唯心的思想，又包含了唯物的思想，远远超过了现在的唯物与唯心派对世界的认识。因阿难这时还没有开悟，不识真心，所以一会儿说一体，一会儿说多体，一会儿说遍体，一会儿又说不遍体，说来说去都不对！这是阿难的第五个妄计。<br/><br/>　　现在我们看经文：<br/><br/>　　（六）计在中间<br/><br/>　　“阿难白佛言：世尊，我亦闻佛与文殊等诸法王子谈实相时，世尊亦言，心不在内，亦不在外。如我思惟，内无所见，外不相知。内无知故，在内不成。身心相知，在外非义。今相知故，复内无见，当在中间。”<br/><br/>　　首先，我们应该了解一下什么是实相。因为一切有形相的东西都是在一定的条件下产生的，条件一旦消失，相应的形相就会消失。所以说世间的一切事事物物都是因缘所生，有生必有死。任何事物都逃不脱成住坏空这四个阶段，这就是辩证法。所以我们说有相之相都是要灭亡的，都是虚妄不实的，都没有自体。那么永恒的、真实的、不灭的东西是什么呢？这就是实相，就是大佛顶如来密因！它是不能用眼睛看见的，但它确实是真实存在的，只有用心地法眼去体会、去领悟。所以佛在《金刚经》中说：“若见实相非相，即见如来”。在佛教中，如来、真如、佛性、真心都是指的实相，只不过名字不同而已。现在我们所见的一切东西都是有形相的，比如，足球是圆的，桌子是方的。凡是有形相的，必定会消亡，必定是虚妄的。所以要见到实相，必须离开一切色相，即释迦佛说“若以色见我，以音声求我，是人行邪道，不能见如来”。<br/><br/>　　我们要真正见到实相就要息下狂心，把一切有相的都消光殒尽。比如我们真正用功念佛的时候，妄心“啪”的一下没有了，这时所有的相就消失了。为什么呢？因为相就是我们妄心蕴积而成的，叫“坚固妄想”。当妄心息下的时候，妄相也就消失了。所以当我们用功，恰到好处之时，身、心、佛都没了，古语叫做“妄念消尽幻身融”。妄念就是我们的颠倒妄想，幻身就是我们幻化的色身。在这些有形相的东西消失融尽的时候，一把擒来就亲见实相、就开悟了！但是有很多修行的人不明白这个道理，刚要到这个地步，他反而害怕了：哎呀，我要落空了，我要见佛呀？要依靠阿弥陀佛接我去西方极乐世界呀？现在什么都没有了？佛也没了，西方极乐世界也没有了，落空了，那怎么办呢？真可惜啊！这正是要见实相之时，他不知道就又退回来了，又落到相上了。这个相就是妄心，不是真实的！所以大家应当注意，实相是永恒的、不灭的、没有形相。<br/><br/>　　这段经文是阿难在听佛与文殊菩萨及诸法王子谈论“实相”的时候，讲到的一些法要。诸法王子就是得到佛法的要领，成为大菩萨的人。所以阿难说，当佛与文殊等这些大菩萨谈论实相的时候，佛说：心不在内，也不在外。我现在就想：如果我的心在内，就象一个人在房间里面应该先看见房内的东西，然后再看见房外的东西。但是我现在只能看见外面的东西，而不能看见我身体里面的心肝脾胃肺，这就说明我的心不在内。如果我的心在外，心与我的身体就不相关了，身体有感觉的话心就不应知道，心里知道身体就不会有感觉。但实际上我的身心是一致的，所以，心在外边也不对。所以我想心应当在中间了。<br/><br/>　　“佛言：汝言中间，中必不迷，非无所在。今汝推中，中何为在？为复在处？为当在身？若在身者，在边非中，在中同内。若在处者，为有所表？为无所表？无表同无，表则无定。何以故？如人以表，表为中时，东看则西，南观成北，表体既混，心应杂乱。”<br/><br/>　　“中间”实际上就是中道。对于明白中道的人来说，处处都是中道。对于不明中道的人来说，一定是相对而言。比如我们拿三个东西，一个放在这里，一个放在那里，第三个放在中间，这第三个的位置就表示中间。如果没有第一个、第二个，那么这个中间也不成立，这就是我们平常人所理解的中道。阿难并不明白中道的道理，只说中间，这个中间就是相对的，所以佛就继续追问了。<br/><br/>　　佛说：你说的中间，并不是随便一个地方，应当是有所指的。你说的中间到底是指人的身体，还是别的什么地方呢？如果你是指人的身体，那么具体说应在身体的什么地方呢？如果在身体的表面，比如皮肤上，那这不是当中啊；如果在身体里面，这就和上面讲的在身体内部是一样的了。如果你指的不是身体而是某一个地方，那应该能将它表示出来。如果你表示不出来，就说明没有这样一个地方。如果你能表示出来，那么这个表示一定是相对于某个参照物来说的。如果参照物不同，则表示也不同。比如，我们以这个茶杯为例：东边的人看这个茶杯是在西边，南边的人看这个茶杯是在北边，所以表示的方法不是一定的。既然表示的方法可以多种多样，那么你说的中间就变得混乱了。<br/><br/>　　由此可见，西方极乐世界也是一样，从我们这里看它是在西方，但在西方极乐世界的西方看它就是东方了。所以大家不要执着，西方是净土，其实东方，南方、北方也是净土啊！只要我们一切放下，心无所住，处处都是净土。如果有所住，就是秽土了。当我们的心清净的时候，当下即净土，自己就是弥陀。这部经重要就重要在时时刻刻打消我们的妄念，让我们回光返照，见到实相。因此本经被誉为禅门要观、教王宏纲。<br/><br/>　　“阿难言：我所说中，非此二种。如世尊言，眼色为缘，生于眼识。眼有分别，色尘无知，识生其中，则为心在。<br/><br/>　　视觉是我们认识世界的一种主要方式，视觉需要在一定条件下才起作用，这个条件在佛教中就称为缘。我们先仔细分析一下，需要什么样的缘，视觉才能发挥作用。在法相宗的《八识规矩颂》中说：“九缘八七好相邻，合三离二观尘世”。“九缘”，是说我们平常人看见外面色境的时候，需要有九种缘合起来才能发挥作用。九种什么缘呢？<br/><br/>　　第一是空，假若我们眼睛上贴个东西，把眼睛遮住，没有空间，那我们就看不见了，所以要有空缘。<br/><br/>　　第二是明，就是要有光明，黑暗的房间里我们也看不见，所以要有明缘。<br/><br/>　　第三是根，根就是指我们的两眼，如果是盲人，就看不见了。所以，眼根要好才能看见，这就是根缘。<br/><br/>　　第四是境，境就是外部的环境，就是色尘，没有外部环境，你看什么呢？所以要有境缘。<br/><br/>　　第五是作意，作意就是妄动，本来我们的八识心王很好，不执着也不分别，就是被作意害苦了。因为作意，妄心不停的动：“看！什么东西来了，别挡着我，好看啊！”这个作意时时刻刻在动，无处不在。即使人死了，它也跟着你生生世世，六道轮回，所以叫遍行心所。“遍行”就是处处都在。没有作意，心就不动了，就不执着了。所以要有作意缘。<br/><br/>　　第六是分别。这个分别比作意更坏，它使我们分别美丑，生出爱憎取舍之心。<br/><br/>　　第七是染净，染法就是世间法，烦恼重重。净法就是出世间法，即修佛法，使人身心清净。因为不是染法就是净法，所以必定有染净缘。<br/><br/>　　第八就是种子，种子就是埋藏在八识田里的心念。比如我们早上一醒来就计划要干什么、干什么……这样就将种子藏到八识中了。比如从现在起我们开始用心念佛，这样就把佛的种子培养到第八识田中，等种子成熟了就可以生西方极乐世界去了。有种子才能生出心愿，所以要有种子缘。<br/><br/>　　第九是根本，就是第八识。没有这个根本就无法收藏种子。没有种子，就不能生出其他识，所以要有根本缘。<br/><br/>　　综上所述，眼睛要起作用，必须具备这九种缘才行。从另一方面来分析，缘又分成四大类：<br/><br/>　　第一是因缘，是指根尘相对。<br/><br/>　　第二是所缘缘，是根尘相对之后，根对尘的缘取，也就是根据自己的心念对境的一种取舍。<br/><br/>　　第三是增上缘，就是根对尘缘取所需的必要条件，比如我们上面所讲的空、明等。<br/><br/>　　第四是等无间缘，就是作意，这是根对尘缘取的根本。我们的心念不停的动，前念与后念之间没有间隔，促使我们的五根对尘境紧抓不放。念佛法门、参禅法门、密宗的身口意三密加持法门，都是摄持这个作意的，能使我们的心念平和下来，不乱动，就容易入道了。<br/><br/>　　以上这四种缘，缺少一种，视觉就不能起作用。我们对缘有了一定的了解之后，再来看这段经文就好懂了。<br/><br/>　　阿难说：世尊啊，我所说的中间，不是您所说的中间。我说的是当我们的眼睛与色尘相对的时候，比如当我们看见这茶杯，眼睛便产生种种分别，知道这个茶杯是什么样式，但这个茶杯本身并没有感觉。这样通过眼睛与色尘相对，我的心就生起来了，这就是眼识。所以我说的中间就是指根与尘相对的中间，而不是您说的在身体上或者在某一处。这里阿难是以眼根为例，来进行说明。这里的眼根实际上代表我们的六根，即眼耳鼻舌身意，不光是指眼睛。<br/><br/>　　“佛言：汝心若在根尘之中，此之心体，为复兼二？为不兼二？若兼二者，物体杂乱，物非体知，成敌两立，云何为中？兼二不成，非知不知，即无体性，中何为相？是故应知，当在中间，无有是处。”<br/><br/>　　佛说：你的心若在根与尘相对的中间，那么这个心的体应如何表示，其相用是否兼有根与尘的特性呢？如果其相用兼有根与尘的特性，而根的特性是有知属有情，尘的特性是无知属无情，二者是相对立的。如何兼容成为一体呢！如果硬是让二者混为一体，那么这个体到底是有知还是无知？这样就杂乱了。所以二者是无法兼容成为一体的。如果其相用不是兼有根与尘的特性，那么这个心既不具有根的知的特性，也不具有尘的不知的特性，那么这个心的特性是什么呢？其相用就无法表示了，没有相用就没有体性。所以应该知道，你说的心在根与尘相对的中间是不对的！<br/><br/>　　到这里，第六处征心就讲完了。有的人认为，这一处征心应该放在第五处征心之前。因为第五处征心佛已经讲了，不在内，不在外，也不在中间，这里讲的又是不在中间，所以不太妥当。应该将这一处征心放到第五处征心之前讲比较好些。实际上这些人理解错了，因为在第五处征心时，佛讲的不在内、外、中间的意思是不仅仅在内或在外、或在中间，并没有否定在内在外或中间。实际上此心是处处都在，但不是只在内、或只在外、或只在中间，所以第五处征心并没有否定在中间。这一点大家应注意。<br/><br/>　　下面我们讲第七处征心：<br/><br/>　　（七）一切无著<br/><br/>　　“阿难白佛言：世尊，我昔见佛与大目连、须菩提、富楼那、舍利弗四大弟子，共转法轮，常言觉知分别心性，既不在内，亦不在外，不在中间，俱无所在，一切无著，名之为心。则我无著，名为心不。”<br/><br/>　　第六处征心，是阿难在佛与大菩萨谈论实相时听到的。而这一处征心是阿难在佛与大阿罗汉共转法轮的时候听到的。共转法轮就是大家共同宣扬佛的教义，将佛法传播出去。这些大阿罗汉主要是指佛的四大弟子：大目犍连，神通第一；须菩提，解空第一；舍利佛，智慧第一；富楼那，解经第一。这些大弟子都非常了不起，都能讲经说法，利益众生。阿难听这些大阿罗汉讲“一切无著名之为心”。一切无著就是任何色相都不要贪恋，这就是真心的显现。但阿难并不理解这句话，他偏空了。一切无著，并不是什么都没有，并不是什么事情都不做，而是象《金刚经》所讲的一样：“应无所住而生其心”。“应无所住而生其心”就是说只要为了利益众生，不论什么事情我们都应该去做。学佛并不是不做事，但做事的时候，应该随着因缘，不要粘着在事项上，就好像没有做一样。所以释迦牟尼佛说：“我说法四十九年未曾说过一字”。难道释迦佛没有说法吗？实际上，大家都知道，佛说法说了三藏十二部，但为什么又说没有说过一个字呢？这就是“应无所住而生其心”。这个心就是指真心的无穷妙用。所以要理解什么是“一切无著”，就必须理解什么是真心。<br/><br/>　　德山宣鉴禅师在他见性以前，研读《金刚经》，并注解了一本书，书名叫《青龙疏钞》。当时南方禅宗倡导“见性成佛”，但依他的理解，需经三大阿僧祗劫才能成佛，所以他认为是魔说。于是他担着一担《青龙疏钞》到南方去破禅宗的魔子。走到澧洲这个地方，见一位老婆婆在路边卖油糍。油糍是当时的一种食品，类似于现在糯米做的汤团。他走得肚子饿了，便放下担子，要买油糍作点心吃。老婆婆问他挑的是什么，他说是《青龙疏钞》，解释《金刚经》的。老婆婆说：“我有一个问题，你若答得出来，我就布施油糍给你作点心；若答不出来，就请你到别处去买”。德山说：“可以，你问吧”。老婆婆说：“《金刚经》云：过去心不可得，现在心不可得，未来心不可得。上座您要点哪个心呢？”德山善于讲《金刚经》，原以为自己通达经中奥义，没有什么问题能难得住他，谁知到这里却被一个老婆婆问倒了。他干瞪眼答不出话来，老婆婆就指示他去参访附近的龙潭崇信禅师，后来就开悟了。其实《金刚经》中讲的很清楚，老太太问他“要点哪个心”呢？实际上就是这个“应无所住而生其心”的心。<br/><br/>　　再举个例子，有位老太太隔壁住着一个和尚整天念经，她每天都听到：不可得，不可得……。她就想：什么东西不可得呢？今天听、明天听，听到机缘成熟，她正在做衣裳的时候，一针戳过去，一拉线：“啪--”，“噢！不可得！”她明白了。那个念经的和尚还没有明白，这位老太太就已经知道了。一切处一切时都是真心的显现，并不是在内、在外、或在中间，而是无所不在，处处都在啊！所以“一切无著名之为心”并不是没有心，而是处处都是真心的显现。但阿难这时并不明白，虽然他说同样的一句话，但意思却完全不同。<br/><br/>　　阿难对佛说：以前，在您与大目犍连、须菩提、富楼那、舍利弗等四大弟子谈论佛法时，常说：能够觉知，能够分别的心性既不在内，不在外，也不在中间，任何地方都没有，而是一切无著，这就是心。那么我现在无著，这是不是叫心呢？阿难经过这几次征心，已经变得犹豫了，因为他并不明白“一切无著”的真实含义，实际上他是偏空了，他理解的“一切无著”就是什么都没有了。<br/><br/>　　“佛告阿难：汝言觉知分别心性，俱无在者，世间虚空水陆飞行，诸所物象，名为一切，汝不著者，为在为无？无则同于龟毛兔角，云何不著？有不著者，不可名无。无相则无，非无则相，相有则在，云何无著？是故应知，一切无著名觉知心，无有是处。”<br/><br/>　　佛问阿难：你说你能够觉知分别的心性，任何地方都没有，那么世间这些空中飞的，水中游的，陆地上走的所有东西，你不著，到底是有东西不著，还是根本就没有东西而不著呢？如果根本就没有东西，就象乌龟身上的毛，兔子头上的角一样（因为乌龟身上根本没有毛、兔子身上也没有角）等于是顽空了，那还说什么不著呢？本来就没有如何去著？如果没有著，就更谈不上不著，所以没有东西就谈不上不著。如果有东西而不著，既然已经有东西那么就不能说没有。没有相就是没有东西，有东西则一定有相。既然有东西就是有相存在，有相存在，怎么能说不著呢？所以你说的一切无著就是觉知之心，是不对的。<br/><br/>　　这里，我们大家应该理解，佛是在考验阿难，让大家回光返照。因为有的确是有，但这个有都是空花水月，没有自体，等于有而没有。所以，佛说的有与阿难所说的有不一样。阿难所说的有，与我们一般人理解的一样，是与空相对的有，他所说的空是与有相对的空，这就是顽空。如果说“一切无著”真象阿难所说的这样，是顽空的话，那么我们就落入虚无漂渺之中了。什么事也不用做了，西方极乐世界也没有，佛也没有了，还修什么法，成什么佛呢！<br/><br/>　　西腊的大哲学家苏格拉底就是这样，他所谈的空就是顽空。所以他把所有东西都扔光了，住在马路边的下水道中，但还留了一个杯子喝水用。有一天，他看见小孩用两只手捧着水喝，于是他哈哈一笑：噢，原来杯子也是多余的。砰！把杯子也扔掉了。说起来好像是好事，什么东西都抛弃了，但实际上，佛说的空，不是这样的空啊！佛告诉我们：一切事事物物本体是空，并不是说一切事事物物都没有相，相反这些相正是真如佛性的妙用。所以修行不应落入顽空。该做的事情还是应该认真去做，只是不要执著就行了。<br/><br/>　　讲到这里，七处征心就讲完了。对此，教下的师傅有些争执。有的说：这七处征心是问心在什么地方，所以是征处，并不是问什么是心，后面才是征心。有的说：后面这部分是七处征心的余补。其实征处就是为征心，比如我们有一个宝珠找不到了，不过只要我们真的有，那一定是放在什么地方了。比如壁橱里，柜子里，总有个地方。只要找到放它的地方就找到珠宝了。所以征处就是为了征心，没有必要再为此纷争了。<br/><br/>　　在七处征心中，前面六处是破有的，后面一处是破空的。因为有是千差万别，所以要六破，而空都一样，只需一破就行了。现在，有和空都破光了，就该画龙点睛了。因为阿难已经走投无路，妄念已不现行，这时，正是真心现前之际，只需回光返照，一把擒来，即可就路还家了。</p></p></div>"
},{
    "title": "壹、见道分——二种根本",
    "author": "元音老人",
    "date": "",
    "html": "<div class=\"B1_text\"><p><p style=\"text-align: justify;\">三、二种根本<br/><br/>　　现在看经文：<br/><br/>　　“尔时阿难，在大众中，即从座起，偏袒右肩，右膝著地，合掌恭敬而白佛言：我是如来最小之弟，蒙佛慈爱，虽今出家，犹恃娇怜，所以多闻，未得无漏。不能拆伏娑毗罗咒，为彼所转，溺于淫舍，当由不知真际所诣。惟愿世尊大慈哀愍，开示我等奢摩他路，令诸阐提，隳弥戾车。作是语已，五体投地。及诸大众倾渴翘伫，钦闻示诲。”<br/><br/>　　这时，阿难非常惭愧，从座位上站起来，袒露右肩，右膝著地，双手合掌（这是印度的一个礼节），对佛说：我是您最小的弟弟，蒙您慈爱，现在虽然出家，但并未受到严格的约束，经常只是听听道理，没有脚踏实地的修行，所以被娑毗罗咒摄持（娑毗罗是一个金黄头发的人，外道之一，能知道八万劫内的事，他专修一种邪咒，就是先梵天咒）），进入了摩登伽女的房间，险些毁坏佛的戒律。这都是由于我不知道佛教的真实义理所致。现在，请您老人家慈悲可怜我们这些没有智慧的人，为我们开示妙奢摩他路。使不具信的人（阐提就是不具信，在佛面前没有种过善根的人）能摧毁恶知见，（弥戾车就是恶知见，宣扬没有因果、顽空等邪见）。说完之后，阿难五体投地，在会的大众都翘首伫立，渴望听到佛陀的开示。<br/><br/>　　本来阿难是三个问题一起问，即问什么是妙奢摩他、三摩提、禅那，但现在分开问了，请佛一个一个地开示。他先请佛开示什么是妙奢摩他路。妙奢摩他就是止、定，就是制止妄念，得到正定。路就是方法，通过此方法可以证到大佛顶，证到如来密因，这就是三摩提。这里的核心问题还是先要明白什么是三摩提。佛从一开始，“舒金色臂，摩阿难顶”就告诉阿难：我“有三摩提，名大佛顶首楞严王，具足万行，十方如来，一门超出，妙庄严路。”但是直到现在，佛并没有明确的告诉我们什么是三摩提。为什么呢？因为三摩提也就是我们所说的真如佛性，本身是无可言说的，无法用语言表达。说出来的就不是了，都是在敲边鼓，所以说：“言语道断、心行路绝”，“说是一物即不中”。佛无法直说，但是佛一直在破除阿难的妄计。妄想破尽之时，正是显露真心三摩提的时候。就象我在门里，你在门外，门一开就看见人了。所以开门之际正是见人之时，并不是说等门开了之后，再慢慢地找人。宗下叫做“皮肤脱落尽，唯余一真实”。皮肤就是指我们的妄想执着，将这些妄想执着破除之时，正是真心显现之时。佛不断地打破阿难的妄计、妄想，正是为将三摩提，即我们的真心，显现出来。可惜阿难不能领会，还要请佛继续开示。<br/><br/>　　禅宗在指示学人时，也是如此，有很多方便。但总体来讲可分两种，一种是比较直接的指示，比如达摩大师就是直接指示，叫直指。另一种是绕很多弯，而不直接说明，这叫曲指，比如参话头。参话头是宋朝大慧杲禅师看见学人根机钝了，浮夸，所以用参话头来接引，使学人妄想剿绝。当学人的妄想剿绝之时，正是真实显露的时候。目前人们对这两种方法有些争议，有的说，学人前来参禅，应该直接指示他，但有的人认为这样不妥当。一方面因为直接指示学人，他是听来的，不是自己费心得到的，所以根本就不珍惜。另一方面，他一听，原来就这么稀松平常，这么清淡，也没有什么。就象是不孝之子，继承了祖宗的遗产，但不知道来路的艰辛，狂用一通，变成个落魄子。直接指示之后，学人应该好好保任，把自己多生历劫的习气除光才行。这就是古人所说的“牧牛行”。只有这样才能得真实受用，否则，直接指示也就失去了意义。所以有的人主张曲指，让人参话头，绕一个大圈子，参到心行路绝之时，真如实体就显示出来了。但是，参话头要有师傅的方便接引才行。比如学人来问师傅：“如何是佛？”师傅就让学生：“自己去参”，有的师傅说，“你参是你的，我参是我的”。假如完全靠学人自己去参，师傅没有开示，没有指点，那么还要你师傅干什么呢？而且参话头要对症下药，看看学人有什么因缘？根基如何？应该用什么样的话头才能引起他的疑问。但现在是千篇一律，无论是谁，人人都参“念佛是谁？”参了几十年也没有消息。对此也有人主张恢复本来的直接指示。比如学人来参问“如何是佛？”老师便说道：“即汝便是！”或者说“清淡对面，非佛而谁？”这就是直接指示。用哪种方法应该根据来人的根基而定，有的人一听，“啊？这就是佛啊！恐怕不是吧！”有的稍微聪明一点的人一听“这就是佛，这么简单，不稀奇，不稀奇”。扔到一边，跟没听到一样，这样就不行了。所以，接引学人不应该定个死框框，一定要怎么怎么做，而应该根据学人的根基采用不同的接引方法。有的人与禅宗有缘可以直接指示，也可以参话头，还有的人与净土宗有缘，那就应该教他念佛，还有的人与密宗有缘，就应该教他密宗的修行方法。佛法完全要根据学人的根基、因缘而定，不能固定死。固定死就不是佛法了！<br/><br/>　　“尔时世尊，从其面门，放种种光，其光晃耀，如百千日，普佛世界，六种震动。如是十方微尘国土，一时开现。佛之威神，令诸世界，合成一界。其世界中，所有一切诸大菩萨，皆住本国，合掌承听。”<br/><br/>　　这时，佛从其面门（即眉毛上面的额头部分）上放射出种种颜色的光。我们前面讲过，八识心王由五彩光圈包裹着，平时由于妄念纷飞，本性光明被遮蔽了。一旦清净下来，就会放射出光明。不要以为只有佛才有光明，其实我们人人都具足光明，而且和阿弥陀佛，释迦佛的光完全一样。我们知道阿弥陀佛就是“无量光，无量寿”的意思。无量光就是形容光明非常强烈耀眼。释迦佛这时放出的光，犹如百千万个太阳，照亮十方世界，使每一世界都产生六种震动。六种震动就是动（晃动）、涌（涌现）、起（升起）、震（震动）、吼（吼叫）、击（击打）。它使得象微尘一样多的国土霎那间显现出来，并在佛的威力下，合为一界，这就是一真法界。这些世界中的所有大菩萨并不需要跑到释迦佛的面前，而是住在本国就可恭敬的聆听释迦佛说法。<br/><br/>　　为什么说十方世界都会成一界呢？这个“一”又指什么呢？这个“一”就是我们的真如佛性，当我们证到这一层次的时候就知道万物的佛性都是一体，没有区别，没有远近，亲疏之分。所以各国土菩萨可以不受距离的限制，住在本国就可以聆听释迦佛的法语。这就是万法归一。但一又归何处呢？<br/><br/>　　这里我们给大家讲一个近代的公案：清朝有很多皇帝都懂佛法，像顺治皇帝出家，康熙皇帝被称为老佛爷，雍正皇帝是禅宗开悟的皇帝。乾隆皇帝也懂佛法，在他下江南的时候要去寺院里看看，于是所有的寺院里都张灯结彩，搭高台说法，迎接圣驾。只有常州的天宁寺静悄悄的。天宁寺的法座当时是眼开老和尚。他说，今日圣驾来了，我们这里坐香迎接圣驾。坐香就是大家在禅堂里拈香打坐，叫一个小沙弥在门口迎接。乾隆皇帝到了天宁寺，寺里一片漆黑，只有一个小沙弥前来迎接，小沙弥身价比较低，所以乾隆皇帝心里不太高兴，就问：“你们的方丈呢？”小沙弥说：“陛下，我们方丈和诸大众都在禅堂里坐香迎接圣驾。”乾隆皇帝一听就更不高兴了。因为乾隆皇帝深知禅堂的规矩：和尚在禅堂里坐香的时候是不能惊动的，否则就是毁人的慧命。所以他说：“既然如此，我就去大殿里供供香。”于是，乾隆皇帝到大殿供了三支香，小沙弥撞了三下钟。供完香，小沙弥送上茶，乾隆皇帝就坐在一边等。过了片刻，和尚还不出来，小沙弥说：“香还没有坐完，再等一等”。又过了一会，怎么还不出来，于是乾隆皇帝生气的走了。乾隆皇帝回到北京后，给大臣们一讲，大臣们都说：“哎！这真是个有道的和尚，其它的和尚都是拍你的马屁呢！我们应请他进京做国师。”于是，乾隆皇帝下了一道圣谕，请眼开和尚做国师。眼开和尚一接到圣谕就想：哎哟，糟糕！糟糕！我不来迎接圣驾，就是要脱离这个烦恼，没想到，皇上封了个国师，这麻烦就更大了。算了！我走了，但走之前得找一个法子。“于是他左看右看，看到了一个烧饭的师父，这个和尚又黑又粗，名字叫川海。他走到川海面前问：“你的饭熟了吗？”川海说：“饭早就熟了。”眼开和尚说：“那么我问你，什么是万法归一？”川海把烧火铲从炉里抽出来说：“喏！”。眼开和尚又说：“那一归何处呢？”川海把烧火铲往炉里一插说：“喏！”。眼开和尚说“好了，好了，我的法子找到了，我可以走了。”于是，眼开和尚召集大众说：“因为皇上封我做国师，我实在是不够资格（这里他是谦虚）。我要走了，给你们找了一位方丈”。他让小沙弥把川海叫过来，大家哄堂大笑，说：“这个和尚又粗又黑，简直像个大老粗，怎么能做方丈呢？”趁大家开玩笑之际，眼开和尚将计就计将袈沙披在川海身上，自己就走了。这就是万法归一，一归何处！大家是否懂得其中的奥妙呢？！<br/><br/>　　有一次，一个外道来问佛，他说：“不问有言，不问无言。”因为对我们平常人来讲，不是有就是无，不是无就是有，只有这两种答案。但现在外道既不问你有，也不问你无，你怎么说法？于是，“世尊良久”。就是释迦佛沉默了很长时间。所以外道说道：“世尊大慈大悲，开我迷云，令我得入”。外道说，非常感谢您的慈悲，拨开了我的迷云，使我见到本性了。说完，外道就顶礼走了。但阿难却疑惑了，问佛：“他为什么向你顶礼呢？他悟到什么了呢？”佛说：“如世良马，见鞭影而行。”就是说，世间的好马，不需要鞭子打上去才跑，只要看到鞭子的影子一晃，它就跑了。所以“世尊良久”并不是什么都没有，而是说明了一切！<br/><br/>　　还有一次，大家讨论什么是不二法门。于是大家，你说一句，我说一句，说了很多种看法。最后轮到维摩诘居士说了，维摩居士默然无语--正是如此！这就是万法归一。一归何处呢？就在此处。但有的人装模做样，就不能算数，要真正觉悟证到真如佛性才行。<br/><br/>　　又比如文喜禅师到五台山去参文殊菩萨，到了五台山，太阳落山了，天也黑了，前不着村，后不着店，上山也看不见路。忽然，他看见前面一个庙，遇一老翁牵牛而行，邀师入寺。翁呼“均提”，有童子应声出迎。翁纵牛，引师升堂。堂宇皆耀金色，翁踞床指绣墩命坐。其实这正是文殊菩萨所化。文殊问文喜：你从南方来，南方有多少众啊？因为当时南方鱼目混杂，宗派很多。文喜反过来问文殊：你们这里有多少众？文殊菩萨说：我们这里是“前三三、后三三”。文喜一听就糊涂了，于是就想什么是“前三三、后三三”，这一疑就是三年多，后来忽然开悟了。为什么呢？前面是三，后面是三，三三得九，九九是无穷无尽的数，九九返本还原，还是一体。所以说无穷无尽的国土返本还原还是一界，无穷无尽的佛菩萨说来说去都是一体。<br/><br/>　　所以，各大菩萨不需从他所在的国土跑到释迦佛面前来，住在本国就可以聆听释迦佛说法。其实并非只有大菩萨能这样，只要我们能回光返照，心不外驰，每个人都可以做到。听《楞严经》也是一样，我们不要只根据文字表面的解释，要回归自己本来的心地，回光返照，就能明白佛陀的真义。因为佛讲法，并不是只有通过语言表达才是说法，这种说法是化身说法。佛还有其他的说法形式。比如，以香饭说法，这种说法，不用说话，给大家弄点饭（这饭是香的）吃吃，人们就懂得佛法了。还有前面讲过的“世尊良久”，这也是一种说法，这种说法是法身说法。在这段经文开始，佛从面门发出种种光也是<br/><br/>说法，这种说法是报身说法。佛有法报化三身，都可以说法。法身是真假都不说，因为法身无相，无所说，本身即是。报身是说真不说假，因为报身就是智慧身，就是光明身，它说法不用嘴巴，而是放光，人们就懂得了。而化身是说假不说真。为什么呢？因为化身是用嘴巴说法。凡有言谈，皆无实义。所以用嘴巴说法，说来说去都是敲边鼓，都是烘云托月。本来月亮显现不出来，用云彩烘托一下，月亮就显出来了。化身说法，实际上说不到真实之处。<br/><br/>　　阿难仍不理解佛的用意，他不知道佛现在破除他的妄计，就是为了显示真心，就是告诉他什么是三摩提。所以阿难只有跟着佛的舌根转。并不是只有阿难一个人这么愚痴，实际上我们众生都是这样，只知道追逐眼前的色尘，随境生心，分别取舍，造业不停。人们处处都是妄心用事，一旦妄心打破的时候，反而觉得落空了，正如唯物主义所讲：心是物质世界在人脑中的反映，所以物质第一性，决定了一切。这样一旦没有事，就没有心了，反而不知所从了。因为他们并不知道这只不过是妄心做怪，妄心就是第六识，就是前面讲的“法生种种心生”的心。在佛打破我们妄心的时候，我们应该回光返照，这样我们就可以证到三摩提，这就是涅磐妙心，就是正法眼藏！佛在这里就是借阿难之口，向我们大众宣说佛法的妙义，使我们能够回光返照，证见本性。所以佛又是放光，又是六种震动，但法身，报身说法只有上根人才能懂得，中下根人就茫然无知。所以阿难及大众还要等佛开口，继续开示。<br/><br/>　　现在看经文：<br/><br/>　　“佛告阿难：一切众生，从无始来，种种颠倒，业种自然，如恶叉聚。诸修行人，不能得成无上菩提，乃至别成声闻缘觉，及成外道，诸天魔王，及魔眷属。皆由不知二种根本，错乱修习，犹如煮沙，欲成嘉馔，纵经尘劫，终不能得。”<br/><br/>　　佛告阿难：一切众生从无始以来，无明与自性就同时存在，所以叫俱生无明。并不是说先有我们的佛性，后来才生出无明。就象牛的两支角，生出来就同时存在，而不是一支一支长出来的。无始就是指没有开始，一直如此。从无始以来，人人都有觉性。由于无明之故，一念认明，颠倒不觉，追取尘境，于是生出贪、嗔、痴等心，造业受报，这就是“业种自然”。因为我们一着相就会产生印象，这个印象被印入八识里贮藏起来，这就是种子。等因缘成熟之时，这些种子就会发芽，自然产生果报，就象“恶叉聚”一样。“恶叉聚”是印度的一种树。这种树又叫“线串珠”，因为它的果子象一串珠子一样，三个连成一串。由于无明之故，产生疑惑，将尘境当成真实的，于是就造业了，造业就会受报，于是有了种种的苦。起惑，造业，受苦，就象这恶叉聚的果子一样连成一串。为此许多人寻求解脱之道，这些人就是“诸修行人”。修行的人很多，比如，我们现在的各种宗教，有基督教、天主教、伊斯兰教、道教等等，其修行的方法也各不相同。但大多数宗教都是要求人们做善事，修善就可以升天，就可以离苦得乐，这就是因果律。但升天福报享尽之后仍要掉下来，所以这种方法并不究竟，不能得到无上菩提。无上就是至高无上，没有什么比它更高了。菩提，就是《心经》中讲的“阿耨多罗三藐三菩提”，就是无上正等正觉，就是究竟涅磐。那么学佛的人同样有很多也不能证得无上菩提，而是成为声闻缘觉，甚至成为外道、魔王及魔眷属。为什么会这样呢？这都是因为他们不知道“两种根本”。这“两种根本”也是意在引导阿难，使阿难证得三摩提。这一点在下段经文中讲。所以我们修行人首先应该识得大佛顶，如来密因，否则，就是盲修瞎练，这就是“错乱修习”。这样修行，修来修去就象用砂石来做饭，不要说经过一两天，纵然经过象灰尘一样多的大劫，也不能成就。<br/><br/>　　我们众生，大部分人不知道修行，造业受报，这是由于无明。还有很多人知道修行，但不知如何修行，仍不能证得无上菩提，这还是由于无明！这个无明从无始以来一直跟随着我们，要证得无上菩提，就要将无明彻底打破。有人会问：“假如我们修行，破除无明，证得无上菩提之后，会不会再升起无明？再升起无明的话，那不就又堕落了。”这是不可能的！为什么呢？因为这个无明不是你觉悟之后升起来的，而是无始以来，你根本就没有觉破过。所以它和你的法性同时俱有，叫俱生无明。无明一旦被彻底打破，就不会存在了。但并不是我们刚刚开悟见性，无明就破除光灭干净了。因为无明细分起来可分为四层，一是见惑，二是思惑，三是尘沙惑，四是无明惑，就是最微细的俱生无明。刚刚开悟只是破了见惑，仍然要继续磨练，才能将无明彻底打破。所以要修行成就，需要坚持不懈地努力才行。无明一旦被彻底打破，就如同出矿之金，不会再变成沙石。那么，如何才能将无明打破，证得无上菩提呢？就要从修行的因地入手。修行只有因地正，才能证得正果，如果因地偏了，就不能证得正果。所以修行的起因很重要。我们上面说，有的人学佛，修到最后修成声闻缘觉，不能证得无上菩提，这是什么原因呢？这就是因为他们因地上偏空了，认为有生死可了，有涅磐可证。不知道生死、涅磐本身就是空花水月，不可得。所以修到最后，成为声闻、缘觉。成为声闻、缘觉还是比较好的。因为声闻、缘觉证成四果罗汉之后，就得了漏尽通，了了分段生死。这个时候，他看见各大菩萨都在六道中度众生，自己一个人坐在那里不动，就感到惭愧了。这时他会回小向大，发大心广度众生。在度众生的过程中，将尘沙无明，消光灭尽。所以能修成罗汉也不错。如果修成外道，甚至各天的魔王及魔的眷属，那就糟糕了。<br/><br/>　　很多人修成外道，是由于他们不能理解无生之意。他们认为一切都是有生灭的，而不是不生不灭的。比如道教中讲阴阳相交后，可以生出个阳神，叫婴儿姹女。最后可以修成一气化三清，就是可以修出三个阳神。但他们并不知道这只不过是意生身！仍然有生灭。所以不将生灭知见打破，是不能证成无上菩提的。庞居士夫妇有一儿一女，一家四口都开悟了，所以庞居士说个偈子：有男不婚，有女不嫁，合家团圞圆，共说无生话。有一个和尚听到之后，也说了一个偈子：“无男可婚，无女可嫁，大众团圞圆，说甚无生话。”因为和尚无家，没有妻子儿女，只有大众，所以，大家在一起说什么无生话呢？现在，我们不妨也说个偈子：“有男亦婚，有女亦嫁，子子复孙孙，是说无生话。”我们在家居士，可以结婚，也可以生子女。子女又可再生子女，这就是子子复孙孙。子子孙孙就是无生。所以大家不要以为无才是无生，这个知见是错误的。只要我们不着相，所有相都是佛法的妙用，有就等于没有，有生就是无生！真如佛性一旦离开了色相，就没有一点价值了。有些外道不懂，修行时死死压住念头不动，压到后来，没有一点知觉，这样就变成土木金石了。我们以前讲过无色无想，无色就变成空，在空中消散了，无想就变成土木金石了。有人会说：“这些土木金石都是烂泥石块，是器世间，而动物和人都是有情，有知觉，怎么会变成这些物质呢？”其实，我们修行人走错了路，的的确确就会变成土木金石。我们以前讲过，有个人坐在那不动，头上就长出了草。大家都说“哎哟！这个人功夫好！”其实这个人是做死功夫、死掉了，不是功夫好！功夫好的人是智慧无穷，内心坦坦荡荡，净裸裸、赤洒洒，做任何事都不住着，灵活妙用，逍遥自在。这就是大定。大定是无出入的。因此，我们修行的人不许压念不起。念头来了，念佛的人把佛号提起：“阿弥陀佛，阿弥陀佛……”，这样就把妄念转了。而参禅的人一起疑问“这是什么呢？”就这样当头一捧，这个念头就没有了。所以我们修行的人一定要认清本性，念头一来，不予以理睬就行了。<br/><br/>　　还有一些人由于着相之故，取他人的功行为自己的功行，这样修下去就成魔王了。后面我们会讲到五十种阴魔，个个都神通广大。他们也要经过修行，不是轻而易举就做了魔王。修行功夫差一点的就变成魔眷属了，附属在魔王的下面。这些人走到这个地步。就是因为因地不正，所以不能证得无上菩提。上次，我到天台寺，碰到两个小和尚。我问他们：“你们为什么出家？”现在不象从前。从前可以说：“哎呀！我家里比较穷，没有饭吃，迫不得已而出家。”或者，有的人让人算命。算命先生说：“这个小孩命不好，恐怕不会长大，还是把他送到庙里做和尚，这样就好了。”现在不会有这样的事了。所以我问他们，为什么出家呢？这两个小和尚回答不出来。哎呀！这样就糟糕了，他们不是为真正的理想而出家。他们这样子懵懵懂懂地跟着人们上上殿，念几句“南无阿弥陀佛……”，再做做晚课，一天就混过去了。这跟世俗人做工作有什么区别呢？这样修行，几时能成道呢？！所以讲起来，现在佛教真是可怜得很呐！<br/><br/>　　“云何二种？阿难，一者无始生死根本。则汝今者，与诸众生，用攀缘心，为自性者。二者无始菩提涅槃，元清净体。则汝今者，识精元明，能生诸缘，缘所遗者。由诸众生，遗此本明，虽终日行，而不自觉，枉入诸趣。”<br/><br/>　　本来阿难问什么是妙奢摩他路，但佛并没有直说，而是讲了“二种根本”。为什么讲到这里呢？这就是佛的慈悲。佛没有让阿难去修净土宗念佛法门，也没有让他去修禅宗的参禅法门或密宗的其他法门，因为这些法门都是绕弯路。在这里佛是直接指示阿难，因为三摩提无法用语言表达，那么如何指示呢？只有破妄显真！妄念破除之后，真心就会自然显露。佛悲心痛切，为我们开示了使人们堕落的原因，其目的就是为了破除人们的妄念。<br/><br/>　　上段经文讲到，人们不识三摩提，枉受轮回之苦是由于人们不知道“二种根本”。所以佛说：什么是二种根本呢？第一，就是无始以来的生死根本。造成生死的根本原因就是我们的五根（眼、耳、鼻、舌、身）一直跟着外境（色、声、香、味、触）转，攀缘不息。由此而产生的心就是攀缘心，就是妄心，即第六意识。唯物主义认为心是物质世界的反映，没有物质世界就没有这个心。所以这个心随境而生，随境而灭，没有自体，叫妄心。因为我们大家不知道真心，反而把此心当成是真心，在物境上分别取舍，造业受报，生死轮回，无有了期。这就是“无始生死根本”。我们无始以来，生死不断的根本原因就是把这个攀缘心当成自性。自性本来是不生不灭，而妄心是有生有灭，二者不同。因为我们错认自心，所以枉受其苦！第二，就是“无始菩提涅磐，元清净体”。涅磐的意思就是寂灭。可分为四种：<br/><br/>（1）自性涅磐，就是说一切众生本具佛性，不生不灭。<br/><br/>（2）有余涅磐。有余就是还有无明，就是指声闻缘觉法见未除而证的涅磐。<br/><br/>（3）无余涅磐。无余就是一切都除干净了。这是佛所证的涅磐。<br/><br/>（4）无所住处涅磐。无所住就是没有一个地方，随处都是涅磐。就是说在生死当中没有生死，不是离开生死以外另有一个涅磐的地方。<br/><br/>　　释迦佛在涅磐的时候对大众们说：我没有离开你们，就在你们当中。这就是无所住处涅磐。佛无所不在，处处都在。只是我们心里龌龊，妄想颠倒，看不见佛。只要我们心里清净，随时随地都能看到佛。“元”就是本来，“清净体”就是没有污染的妙体。所以“无始菩提涅磐，元清净体”就是说我们本来就具有这个不生不灭，没有污染的清净妙体。我们现在能够认识世界，能够随境生心的本体就是“识精”。因为它本来就具足光明，所以又叫“元明”。这个光明不是我们眼睛所看到的光。我们眼睛所看到的光是相对于黑暗来说的，这还是妄光。我们所说的这个本具的光明，是一个万能体。一切事物都是从它生起来的。没有它就没有一切。唯心主义者说：我们为什么能创造出丰富多彩的世界，就是因为我们的心能研究事物的发展规律，并利用这个规律进行发明创造。没有心就没有这丰富多彩的世界。但唯心者所说的心与我们大众所认识的心一样还是妄心，不是我们所说的“识精元明”。“识精元明”就是我们所说的真心，它将我们大众所认识的心与物统一在一起，而不是将心与物分开，再争论谁主宰谁。在佛教中，真心是唯一的，它主宰一切，创造一切，包括我们一般人所说的物质与心。所以这个真心“能生诸缘”。但它本身并不是由什么东西生产的，而是无始以来本来就具有的。所以真心是绝对的，没有什么与它相对，因而是不能被缘的，所以叫“缘所遗者”。“遗”就是遗漏、忘记了。我们众生本来就具有这么一个无价之宝，时时刻刻都未曾离开过，整日都是这个识精元明的妙用，但大家却不知道，一直认假为真，造业受报，六道轮回，真是冤枉啊！所以佛说，“由诸众生，遗此本明，虽终日行，而不自觉，枉入诸趣”。<br/><br/>　　这一段经文中的“元明”与“本明”不同。本明说的是识精的体，元明说的是识精的妙用。“遗此本明”就是说众生不知道自己本身就具有这个识精，只要我们息下狂心，就是菩提。禅宗为什么要参“念佛是谁？”就是为了让我们认识自己的“识精”！当我们参这个话头时，疑团凝聚在“谁”字上，不向外寻求，而是回光返照。“是谁”？这一问，念头不行的时候，不是了了分明吗？这不正是识精放光吗！所以要抓住它、认识它，能识得就好，就可以大摇大摆大休息了。一切事情尽管做而不住着，那就潇洒自在了。其实一切法门的目的都是如此，就是让我们息下缘心，缘心息下，识精顿时显现。但现在念佛、参禅或修密的人不知道这个关键，他们向外追求：“我要本明，我要本明。”这样永远无法见到本明。因为这一念要追取之心就是妄心。所以要见到这个识精必须息下缘心！这个真心到底是什么呢？有人说：“能给我显示一下，让我看见就相信了，你不让我看见，我总是半信半凝。”如果能显示的话，释迦佛早就给阿难和大众示现了，可惜不行，无法做到。因为真心“说是一物即不中”，无论你怎么说，无论你怎样描述，都无法表示它。那该如何做呢？只要我们能息下妄心就可以证到。如果修行人不把握这个关键，那么念念修行，念念造生死，永远也解脱不了。修行人要懂得这个道理并按这个道理脚踏实地去做，息下诸缘，就可以证得大道了。<br/><br/>　　现在看经文：<br/><br/>　　“阿难，汝今欲知奢摩他路，愿出生死，今复问汝。<br/><br/>　　“即时如来举金色臂，屈五轮指，语阿难言：汝今见不？<br/><br/>　　“阿难言：见。”<br/><br/>　　佛一直在破除阿难的妄念，目的是为了让阿难见到自己的真心。但阿难并未领会，所以佛继续问阿难：你现在要想知道奢摩他路，并由此而出生死苦海。我现在来问你。于是佛举起自己紫磨金色手臂，屈五轮指（因为佛有三十二妙相，其手臂放光呈金色，手指一节一节的纹路，张开就象车轮的网一样，所以叫“举金色臂，屈五轮指”），问阿难：你看见没有？阿难答道：看见了。<br/><br/>　　阿难回答说看见了，这个“见”字却大有出入。本来，大佛顶如来密因是无所见的，假如有所见就不是了。宗下说：“见着即瞎”。就是说如果你能看见，眼睛就瞎透了。但是，在无见当中也不妨有见！为什么呢？因为一切都是妙明真心所显现的，见就是真心的妙用啊！从前有位承皓禅师做了一条短裤（布裈），写上历代祖师的名号穿上，并说：“只有文殊、普贤好一点，暂且写在裤带上”，大家称他为“皓布裈”。佛祖本应该是很尊贵的，应该顶礼膜拜，怎么能做成短裤穿呢？因为他心里空净了，就无所谓。另外一个僧人不懂，效仿他，承皓见了，呵斥道：“你竟敢把这事当作儿戏，等到将来吐血就来不及了”，结果这个僧人最后吐血而亡。同样做一件事情，但果报却不一样。前者因为心里空净，不受业障的约束，而后者蒙昧无知，造业受报。象丹霞禅师骑在佛像的头上，马祖还赞叹他“我子天然！”所以，大家不要只看表面现象，而要看一个人的内心是不是真空净。这位承皓禅师有一次上堂说法，一句话不说，过了很长时间，才问大众：看见了吗？大众不知所以。这时，有一位开悟的居士反问：和尚看见了吗？承皓禅师答道：你已经见到了！说完就下座了。所以这个“见”与“不见”不能说死。就“体”说来是无所见，就“用”说来无所不见。所以阿难说“见”，可以说答得好也可以说答得不好，就看你是真见还是妄见。因为佛的手正是心的显现，透过手的相就可以看到真心，就象用手来指月亮一样，通过手指就可以看到月亮，这样的“见”是真见。如果仅仅是看见手的相就不是真见了。所以下面佛要继续试试阿难是不是真见。<br/><br/>　　现在看经文：<br/><br/>　　“佛言：汝何所见？<br/><br/>　　“阿难言：我见如来，举臂屈指，为光明拳，耀我心目。<br/><br/>　　“佛言：汝将谁见？<br/><br/>　　“阿难言：我与大众，同将眼见。<br/><br/>　　“佛告阿难：汝今答我，如来屈指为光明拳，耀汝心目，汝目可见，以何为心？当我拳耀。<br/><br/>　　“阿难言：如来现今征心所在，而我以心推穷寻逐，即能推者，我将为心。<br/><br/>　　“佛言：咄！阿难，此非汝心。”<br/><br/>　　佛继续问阿难：你看见什么东西呢？<br/><br/>　　阿难说：我看见您举起手臂，屈指握拳，闪闪发光，照我心目。这一下阿难露馅了，就可以看出他落在相上了。他这时所说的“见”仍然是妄见，不是真见。<br/><br/>　　于是佛再追问一句，你用什么看呢？这一句就象禅宗参“念佛是谁？”一样，给他当头一棒。提醒他能看见东西的是什么呢？<br/><br/>　　但是阿难却答道：我和大众都是通过眼睛看见的。这下更糟糕了，阿难不仅一个人是个懵懂汉，连其它人也一同拉下水了。其实，其他很多人早已心领神会了。就象我们前面讲的，良马见鞭影而驰，千里马只需看见鞭子的影子一晃，它就知道了，就开始奔跑，不需鞭子打在它身上。如果阿难在佛这么一问的时候，回光一照，就象参“念佛是谁”的时候，一起疑心，一觉，心境俱亡。心境俱亡的时候，并不是什么都不知道，而是能觉之心昭然而显，这就是妙奢摩他路。可惜阿难不识得，仍然向外驰求，以攀缘心为自性，落在尘相上。所以佛处处指示阿难，但阿难却屡屡错过，不能领悟。但是佛悲心痛切，不厌其烦，死马权当活马医，万一阿难嘴上说通过眼睛看见，但其心里却不着眼见呢？这也有可能。<br/><br/>　　所以佛继续问阿难：你说我屈指握拳，光照心目。你通过眼睛可以看见这一切，那么你以什么为心呢？前面七处征心时佛就问过阿难这个问题，大家知道，心不在内、不在外，也不在根里，也不在中间，不在任何一处，也不是虚无飘渺。那么现在佛又问一遍：你以什么为心呢？释迦佛真是苦口婆心，希望阿难在他再次提出这个问题的时候能回过头来，见到自己的本来面目。本来真正开悟的宗师就是这样教导学人，他步步紧逼，逼得你没有地方退身，再退就是墙壁了，这个时候只有转个身。在你转身之际，回光一荐，就见到本来了。现在很多师父没有这个手段，你去问他，他说：“你们自己去参，又不是我参。我参是我的，你参是你的。”如果真是这样，那么要你师父干什么呢？所以这时阿难如果能回过身来就好了。<br/><br/>　　无奈阿难还是不能领会，阿难说：您问我以什么为心，我现在能推理思考、能追逐眼根中色尘影子的就是我的心。我们说，六根与六尘相对留下的影子就叫六尘缘影心。这就是攀缘心，就是妄心。<br/><br/>　　到这时佛已将阿难的病根看透了，于是呵斥阿难：“咄！阿难，此非汝心。”这个“咄”就是禅宗的棒呵，犹如雷鸣！可以使学人顿然心念不行，回光返照。在心念不行之时，并不是死人，也不是石头、木头，没有知觉，而是灵知了了。这个灵知了了不正是我们的本性吗？这样证道。是何等痛快！所以佛呵斥阿难，并告诉他：这不是你的心，这只是六尘缘影心！<br/><br/>　　“阿难矍然，避座合掌，起立白佛：此非我心，当名何等？<br/><br/>　　“佛告阿难：此是前尘虚妄相想，惑汝真性。由汝无始至于今生，认贼为子，失汝元常，故受轮转。”<br/><br/>　　这时，阿难惊恐万分（矍就是惊慌的意思），从座位上站起来（避座就是离开座位），双手合掌对佛说：这不是我的心，那是什么呢？佛告诉阿难：这是你对眼前的尘境而生出的虚幻妄想迷惑了你，使你从无始以来，认此幻相为真实，遗失了你原本常住的真心，所以在生死苦海中轮回不已。<br/><br/>　　经文中为什么说是“前尘”呢？因为眼前的境界就象灰尘一样，淹没了我们心地的光明，这些境界都是因缘合和，没有自性，因而是虚妄不实的。这些虚妄的境界就是相。“相想”就是相在心上翻滚，一会儿想这，一会儿想那，一会儿想金子，一会儿想女人，这就是妄想。就是由于这个妄想，使我们不只一生一世，而是从无始以来，经过多生历劫，在六道中轮回。但是至今我们仍执着这个妄想，抱着不放。把它当成是真实的，这不就是认贼为子吗？！为什么说是贼呢？因妄想执着使我们遗失了原本常住的真心（即“元常”），使我们丢掉了这个不生不灭的无价之宝，所以沦落在生死苦海之中！当然并不只是阿难一个人这样，我们众生都是如此。而现在阿难早已成道，可我们还在六道里头出头没，所以我们应该感到非常惭愧。现在佛教有很多法门，象净土、禅宗、密宗等等，都是为了帮助我们返本还原，超脱生死轮回的。我们只要一切放下好好修行，一门深入，就能得到真实受用。可惜现在很多师父分门别派，认为只有他那个法门好，其他的法门都不好，比较狭隘。其实修什么法门都要根据学人的根器来定。从前的师父很慈悲，能识取来人的根基。要是来人跟他不对机，他会说：我修得不好，我给你介绍一位更好的师父。并指示学人到什么地方去。可是现在的师父，将弟子看成是自己的私有财产，对弟子说：你只有皈依我才好，别的师父都不好。假如你要再皈依别的师父，就好象叛变了一样。这样的师父收取徒弟，是为了名闻利养，这就是妄想执着。师父都这样妄心乱动，弟子怎么会证见本性呢？真是可悲可叹！<br/><br/></p></p></div>"
},{
    "title": "壹、见道分——十番显见",
    "author": "元音老人",
    "date": "",
    "html": "<div class=\"B1_text\"><p><p style=\"text-align: justify;\">四、十番显见</p><p style=\"text-align: justify;\">　（一）明暗无亏，显见非眼<br/><br/>　（二）动乃客尘，显见不动<br/><br/>《楞严经》卷第二十番显见（不空如来藏）<br/><br/>   （三）童耄观河，显见不灭<br/><br/>   （四）颠倒名失，显见无失<br/><br/>　（五）八还辨见，显见无还<br/><br/>　（六）见性周遍，显见无杂<br/><br/>　（七）心能转物，显见无碍<br/><br/>　（八）心物一如，显见不二<br/><br/>　（九）本无是非，显见超情<br/><br/>　（十）非因非缘，显见离见　</p><p style=\"text-align: justify;\">　“阿难白佛言：世尊，我佛宠弟，心爱佛故，令我出家。我心何独供养如来，乃至遍历恒沙国土，承事诸佛及善知识，发大勇猛，行诸一切难行法事，皆用此心。纵令谤法，永退善根，亦因此心。若此发明不是心者，我乃无心，同诸土木，离此觉知，更无所有。云何如来说此非心？我实惊怖。兼此大众，无不疑惑，惟垂大悲，开示未悟。”<br/><br/>　　阿难对佛说：世尊啊，我是您最宠爱的弟弟，因见佛妙相庄严，光明自在，心生敬爱，故发心出家。现在我一心供养如来，乃至我以前走遍了象恒沙一样多的国土，不怕困难，不怕吃苦，为诸佛及善知识做侍者，发大勇猛心，承做一切难行之事，都是用此心。既使诽谤佛法三宝，永退善根，也是用此心。如果您说这不是心的话，那等于我没有心，和草木一样了。因为我离开这个对前尘所生起来的觉知之心还有什么呢？为什么您说这不是心呢？我实在是惊恐万分！并不只是我一个人是这样，在会的大众也和我一样惊慌失措。还是请您老人家大慈大悲，给我们这些没有悟道的人讲一讲。<br/><br/>　　这段经文，阿难说他受佛宠爱（宠爱有偏爱之义，这种爱就不好了），因为阿难是佛最小的堂弟，所以阿难自己这么说。但佛可不是这样，因为佛对一切人都是一样平等慈爱，只是由于因缘有些差别，从表面上看可能有些亲疏之分，其实佛对众生的心是一样的。阿难见佛有三十二妙相，紫金光聚，所以发心出家供养如来。供养就是供给佛衣服、饮食、卧具、医药这四种日用所需。因为阿难发心做诸佛的侍者，所以多生历劫，阿难走遍了象恒沙一样多的国土，为诸佛和善知识做侍者。善知识必须理事圆融无碍，如果仅仅说到做不到就不是善知识。阿难是佛的侍者，不怕困难，不怕吃苦，发大勇猛心，行“一切难行之事”。这种“难行之事”在西藏密宗就讲得比较全面。因为修密宗的人，要消灭种种罪障，需经受种种严峻的考验。比如，有的人要到冰河中，赤身露体，冻得不得了，受冰河地狱之苦。还有的人，在天气热的不得了的时候，坐在大火炉边上烤，受火炮铜柱地狱之苦。还有的是在羊圈、猪圈中支个铺，住在当中受苦。修行要能经得起各种艰苦磨练才行。当然学佛的目的并不是为了吃苦，但通过苦行可以磨炼人的意志，消除习气。这与外道以吃苦为目的，执着在吃苦相上是不同的。在我们内地，人们比较聪慧，只要学佛的人努力上进，不后退就是难行之事。因为有恒心是很难得的。有的人发心一两天很容易，要天天都如此就不容易了。很多人今天找个法来修修，过两天“哎呀！吃不消，吃不消”，休息一下再说，这样就难以成就。所以修行人要有恒心，要能发勇猛心，这就是难行之事。<br/><br/>　　阿难说，如果他离开对前尘所生起来的觉知之心，就没有心了。因为他发心学佛用的是此心，即使不学佛，甚至诽谤佛法三宝，也是用此心。离开此心还有什么呢？讲到这里就非常关键了，阿难这里所说的心仍然是妄心。离开这个妄心，就是妄心息处，这个时候，你并不是死人，不是和草木一样没有知觉，仍然是了了分明，这是什么呢？这就是空寂灵知！空者，一切事物都没有；寂者，不来不去，不动不摇；灵知者，了了分明呀！不信诸位试试看（此时元音上师一击掌），“啪--”一声……<br/><br/>　　此时前念断处，后念未起之时，不正是这个了了分明吗？！这个了了分明是什么呢？学人能当下荐取，就是见性了。所以见性，不是难事呀！不需要经过几十年、几百年的参禅。在这当下一击之际就能够证见本性。见本性之后就需绵密保任了。绵就是长久、连绵不断；密就是要勇猛精进、不疏松，就象我的手指张开空气就从指缝中透过去了，如果我的手指紧闭就没有缝隙了，这就是密。要保住什么呢？就是要保住这个妙明真心，无所住着，时时空寂，时时灵知。时时空寂灵知而又不住空寂灵知。假如住在空寂灵知上，还是有所住，还是妄想心。因为你还有空寂灵知之心在，在禅宗里，这就叫“圣堕”。堕落在圣位上，还是有生死。我们说要归无所得，任何事都不可得。归无所得正是大得。所以这个真心并不需要诸位费多大力气，只要回光返照，当下就是。只是诸位要有福报，什么福报呢？要敢肯定“噢！这就是真心。”毫无疑虑，这就是多生历劫所培养的善根、福德。假如你不敢肯定“哎呀，恐怕不是吧？”，这就是缺少善根福德。要生西方极乐世界也是如此，《阿弥陀经》不是说“不可以少善根、福德、因缘得生彼国”。所以要生西方极乐世界也不能缺少福德。以前我们讲过，有一位居士，临终时西方圣境已经现前，就要生西方。这时，他最亲爱的小老婆一哭，他的心就乱了，结果就退回来了。这就是因缘不凑，因缘不凑巧就是缺少善根福德的缘故。缺少善根福德，不能当下承当，不敢肯定，就只能继续修法了。就象念佛者念佛，参禅者参禅，修密者修密，这样慢慢地培养善根福德。学佛人有五种根器，第一种就是人天乘，对于这类人就是教他们做做好事，培养福报，临终后可以升天，或者不失人身。比如基督教、天主教，伊斯兰教都是这样。第二种就是声闻乘，对于这类人就是教他们偏空之理而证有余涅磐。第三种就是缘觉乘，对于这类人就是讲十二因缘，这类人仍然是小乘根基，你让他发大心，比较困难。只有等到他们证得罗汉果位之后，他们才能做到。第四种就是菩萨乘，这类人发大悲心，自觉觉他，勇猛精进。他们不生西方极乐世界，就在这个世界中与众生滚在一起，救度众生。众生不度尽誓不取佛位，这就是大心菩萨。第五种就是佛乘，这类人是圆顿根器，不需要经过渐次方法，一言之下，一切都了。学佛要根据人的根器，一点都不能勉强。就象现在我给你们指示真心一样，如果硬要你们当下肯定，就象按牛头吃草一样。牛不吃草，你将它的头按进草堆里，嘴里嘟囔着：朝这看，朝这看，这样就不行。因为这件事非同小可，勉强不得。<br/><br/>　　讲经，不能只依文字来解释，应该讲解出经文的真实意义。《楞严经》重要的真实的意义就在于指示我们的真心，这就是心地法门的核心所在。在宗下这就叫“画龙点睛”，就是指示给我们看什么是真心。在教下就叫做“点中言”，就是讲解经文中的要义，光是依据文字来讲解就没有多大意义了。<br/><br/>　　阿难这时仍然不能理解佛法的妙义，因为他离开妄心就不知所从了，这就是众生的特点。众生之所以成为众生就是因为他认妄想为心，并在此基础上妄中求妄，求蹊跷，玩弄小聪明。使用种种花招向人们显示：我能这样，我能那样，欺骗诱惑别人。妄心妄动，虽然能促进物质文明的高度发展，但是因为人们缺乏智慧，人类的欲望也越来越高，贪心也越来越强，所以虽然物质文明发展了，但是世界并不安宁，到处是战争与暴力，这都是由于人们执着妄想造成的。所以大家要是能学佛，把妄心息下来，检点一下自己的行为，这个世界就美好了。否则，争了一辈子，到头来还是要空手而去，真是冤枉啊！所以，阿难再三请佛为我们这些未开悟的众生开示，使我们能够离开虚假的幻相，恢复我们本来自在，本来不生不灭的真心，脱离生死苦海，这正是佛的悲心啊！<br/><br/>　　“尔时世尊，开示阿难及诸大众，欲令心入无生法忍。于狮子座，摩阿难顶，而告之言：如来常说，诸法所生，唯心所现，一切因果，世界微尘，因心成体。”<br/><br/>　　无生法忍是什么呢？“无生法”就是说一切事物都是不生不灭的。“忍”就是心肯，就是我在这里说法，你们心里肯不肯接受。如果我说人是有生死的，大家都肯接受；如果我说人是没有生死的，大家就不肯接受了。因为大家都看到小孩出生了，也看到别人病死了或老死了，这不是有生死吗？你为什么要说不生不死呢？他不肯接受这个观点。实际上，当我们证见本性的时候，就会知道我们的的确确是不生不死的！无生法忍就是说大家能够接受、认可一切众生都是不生不灭的这个真理。<br/><br/>　　这时，佛希望阿难及诸大众都能入无生法忍，接受不生不灭的道理。所以佛坐在“狮子座”（狮子座就是形容佛的座位非常庄严威猛）上，一边摩着阿难的头顶（摩顶有两层意思：一是护惜阿难，因为佛讲了这么长时间，阿难还是不领悟，所以佛很怜惜阿难；另一层意思是希望阿难能开顶门之眼。）一边继续开示。佛说：一切有生有灭的事物，都是从妄想心中生出来的。世界的一切因果，乃致于一粒微尘都是因心而有。<br/><br/>　　这段经文中的“诸法所生”就是指一切有生灭的事物，“唯心所现”就是说一切色相都是从妄想心中生出来的，这里所说的“心”指的是第六意识。我们前面讲过，因无明熏真如，妄想就升起来。结想成蕴，蕴集不散，就形成了色，就出现了地水、火风、四大种性。再进一步，结色成根，就形成了我们的眼、耳、鼻、舌、身、意六根。这就是心生种种法生，由于心动的缘故就形成了形形色色的世界。形形色色的世界产生之后，再反过来熏妄心，这就是法生种种心生。妄心妄动，这个世界就变成现在这个样子。世界上一切事物的产生都必然有其因果。但凡夫不怕造恶因，只怕受苦果。那些罪犯在抢劫别人的时候，就不会想到自己因此要受到惩罚。这就是目光短浅，没有智慧。凡夫只看到眼前利益，贪得无厌，不惜造业。等到果报来临时又怨天尤人，不知道这正是自己造成的。比如那些杀人犯被抓起来枪毙时，却吓得不得了，可当时为什么想不到杀人者必偿命的道理呢？！菩萨就比较有智慧，因为他懂得因果的道理，不会去做坏事。由于不造恶因，就不会受苦果。世界上的一切事物都离不开因果。现在的科学家发明创造正是利用了因果律。当我们把水加热就可以产生蒸气，产生的蒸气又能推动火车，这就是因果律。如果我们违背了这个规律，就不可能发明创造。所以因果是不能颠倒的，但对于大修行人来说却不同，他们能够超越因果，能够洒脱自在。下面讲一讲百丈野狐的公案：一天，百丈禅师上堂说法，讲完之后大众都散了，只有一个老头还不走。于是百丈禅师问：“您有什么事？”老人说：“我不是人。在过去迦叶佛时，我曾住此山，因学人问：‘大修行人落不落因果？’我回答说：‘不落因果。’于是五百生堕落成野狐身。现在请和尚代为下一转语，使我脱去野狐身。”于是就问：“大修行的人落不落因果？”百丈禅师答道：“不昧因果”。老人于言下大悟，作礼道：“我已经脱去狐身，住在后山，请和尚能依照亡僧的礼节治丧。”第二天百丈禅师带领僧众，在后山岩石下挑出一条死狐狸，依礼火葬。所以，对大修行人来说，就可以超越因果。超越因果就是不昧因果，而不是否定因果。修行圆满就可以这样萧洒、自在。<br/><br/>　　世界上任何事物的产生都有一定的原因，都必须具备一定的条件，这就是因缘。条件（因缘）一旦改变，这个事物就不存在了。所以说一切色相，都是因缘合和而成，究其根本却是空。那么这些色相是怎么来的呢？我们前面讲过，就是从我们妙明真心中生出来的。所以说：一切因果，乃至于世界的一粒微尘，都是因心而有。这就是说，一切色相都是因缘和合，本身是空，它的体就是我们的妙明真心。再换句话说就是：一切色相都是真心的变现，都是真心的妙用。我们可以看见男女老少，饮食起居，山河大地，草木丛林……种种法相，就如同看见我们的真心一样。只要不住着，处处都是法身的显现，如果硬压住念头落于顽空，就如同土木金石一样没有知觉，就看不见了。那么，在用功修法的时候，一下子境界现前了，究竟是见、还是不见呢？<br/><br/>　　六祖大师的弟子神会问六祖：“和尚坐禅，还见不见？”注意：神会在这里提出了是见、还是不见的问题。六祖没有直接回答，信手打了神会三柱杖，反问：“吾打汝，是痛不痛？”这很不好答，痛是凡夫俗子，不痛是土木金石，痛不痛啊？神会答：“亦痛亦不痛。”很轻巧、蛮巧妙。我的心已经空了，不住在痛与不痛上，所以也痛也不痛。六祖大师肯他吗？没有马上肯。因为他也可能倒在两边--痛、不痛，一边倒有、一边倒无。六祖也没有马上否定他，要考考“亦痛亦不痛”是不是他的真境界，就借他的语脉随口答了他的问题：“吾亦见亦不见。”神会问：“如何是亦见亦不见？”这下狐狸尾巴露出来了。痛与不痛、见与不见，本是同类的问题。自己刚答过“亦痛亦不痛”，却不明白“如何是亦见亦不见”。可见那答语只是口头工夫，并不踏实，脚跟不点地啊！六祖大师慈悲为人，要借他这一问提携他，指导他见性，于是痛下钳锤：“我之所见，常见自心过衍，不见他人是非好恶，是以亦见亦不见。汝言亦痛亦不痛如何？汝若不痛，同其木石；若痛，则同凡夫，即起恚恨。汝向前见不见是二边、痛不痛是生灭。汝自性且不见，敢尔弄人！”六祖一针见血地指出他落在生灭两边，激励他明见自性。神会根性大利，当下离开两边，自性朗然现前。于是礼拜悔谢。六祖又说：“汝若心迷不见，问善知识觅路。汝若心悟，即自见性，依法修行。汝自迷不见自心，却来问吾见与不见。吾见自知，岂代汝迷？汝若自见，亦不代吾迷。何不自知自见，乃问吾见与不见。”神会再礼百余拜，求谢过衍，服勤给侍，不离左右。他这是报师恩啊！<br/><br/>　　我们看这个公案，不能着在痛与不痛、见与不见上。这象是一付手铐、一付脚镣摆在面前，看你能不能脱开，说痛说见手铐搭上去了，不痛不见脚镣搭上去了，脱不开不行啊！我们平常用功应脱开事相，做任何事都不着相，并不是不做事。做事着相--倒在有边，不去做事--倒在无边，都不对。真如佛性不是死的、不是顽空，它能生种种法相、能起种种妙用。佛性本体不能离开相用，体相用一即三、三即一。所以，见与不见这个问题，在宗下、在教下都非常重要。<br/><br/>　　从前，藕益大师有个弟子在扬州高旻寺打佛七，拼命用功，以期成就念佛三昧。他念佛精进勇猛，一下子西方圣境现前了，阿弥陀佛、观世音菩萨、大势至菩萨、莲池海会圣众……统统现在面前，“阿弥陀佛”四个字金光灿烂。他很高兴，告诉藕益大师：“我向左走一走，阿弥陀佛向左转一下；我向右走一走，阿弥陀佛向右转一下。境界好得不得了。”藕益大师是一位明眼人，告诫他：“不许着此相！”着相怎么行啊？着相就会着魔，《楞严经》就讲了五十种阴魔。虽然我们念佛生西是要见佛，是要去西方净土修行成佛，但一样不能着相。一着相就有所住，因执相之故，就不能证到念佛三昧。念佛三昧是正受，不受一切受，任何境界现前都不动摇。因不受之故，一切妄境不现，就会透过相见到自己的本性，亲证念佛三昧。若住在境上，就被前尘遮蔽了心光。心光不能透脱，就见不到本性了。<br/><br/>　　记得有一次我去随喜一个法会，有位法师在上面讲法，讲诸法空相。墙上挂了一张佛像，佛像头上有光圈。法师指着佛像问：“你们大众还见么？”有人答：“不见。”法师认可。其实他答得并不对。不见？你的眼睛做什么用？我们修法做功夫难道是闭着眼睛吗？这样做功夫是死的呀！天真佛性玲珑剔透、能生万法，证之便得真实受用，闭着眼睛不见怎么能行？见性实际上是透过事相见到本性，事相都是从自性中流露出来的，不是凭空生出来的。禅宗说：“隔山见烟便知是火，隔墙见角便知是牛。”譬如我们看见树在摇动，就知道这是风来了。林中画风不写树，那怎么画风啊？同样，当我们看见一切境界的时候，就知道这是佛性的妙用。只要我们不着在境界上，就是随时随地见性，正如《六祖坛经》所说：“见性之人，……轮刀上阵，亦得见之。”<br/><br/>　　所以，见与不见这个问题，在佛教的修行中非常重要。只要我们把这个关键掌握好，把能见所见都摄于一心，这样，修行起来就容易多了。<br/><br/>　　现在看经文：<br/><br/>　　“阿难。若诸世界一切所有，其中乃至草叶缕结，诘其根元，咸有体性。纵令虚空，亦有名貌。何况清净妙净明心，性一切心，而自无体？”<br/><br/>　　草是微不足道的，可它能够长出叶子。缕就是丝线，丝线可以编织出种种东西（比如：衣服），最简单的就是打一个结。叶从草生，叶的根源是草，叶有草的体性。结是缕成，结的根源是缕，结有缕的体性。<br/><br/>　　佛告诉阿难：所有的世界，乃至世界上所有的东西，哪怕是微不足道的草叶、缕结，若追究它的根源，都有来处，都有体性。任何事相都不是虚无缥缈、都不是没有来由，都是由体生起来的，没有体就没有相。即使是虚空，也有虚空的名字和相貌。虚空尚且如此，那么，能生起一切心的“清净妙净明心”，怎么会没有本体呢？<br/><br/>　　“性一切心”的“性”字，是指佛性。本来是名词，在这里却作动词用。性一切心，就是从佛性生起种种心。“清净妙净明心”的“心”字，也是指佛性。佛性以“清净”为体，以“妙、净、明”为相，以“性一切心”为用。本体清净，是说佛性根本就不会被污染，并不是用过以后就脏了。如果我们真的不着事相，妙、净、明的心相就会朗然现前，内心充满清净、光明，妙不可言。非语言所能描述，非思维所能揣测。即使是着了事相，也只能遮蔽妙净明之相，而于本体无碍，本体依然是清净的。譬如珍珠埋藏地下，虽然外面包着泥土，显不出珍珠之相，但珍珠本体依然是玲珑剔透的。六祖大师悟道时说：“何期自性本自清净，何期自性本不生灭，何期自性本自具足，何期自性本无动摇，何期自性能生万法。”自性就是佛性。本自清净，是言佛性之体。本不生灭，是言佛性之妙相。眼前所见的任何有相的事物，都是生灭不停的，佛性却是不生不灭的，妙不可言啊！本自具足，是言佛性之明相。无量光、无量寿一体具足、一时具足，明明大千界啊！本无动摇，是言佛性之净相。清净无染、不变不移、不动不摇。能生万法，即“性一切心”，是言佛性之用。佛性就是妙明真心。日月星辰、山河大地、草木丛林、花鸟鱼虫……乃至草叶缕结，一切事物都是从妙明真心生起的，妙明真心是一切事物的源头。“物不自物，因心故物”，若无妙明真心，一切事物都不会有的。妙明真心怎么会没有本体呢？我们要想亲证这个本体，就必须放舍一切贪求，不住一切形象，或念佛、或参禅、或修密，渐渐脱离妄想执著，心胸宽阔如同虚空，进而豁然打破这个虚空，就会亲证本体、亲见本来面目，那就是见道了。<br/><br/>　　“若汝执吝分别觉观、所了知性，必为心者。此心即应离诸一切色、香、味、触诸尘事业，别有全性。如汝今者，承听我法，此则因声而有分别。”<br/><br/>　　执是执取，吝是吝惜。觉，在这里是指起心动念，面对事物的时候，初念一起，就叫做觉。观，在这里是指思量取舍，琢磨琢磨，考虑考虑。分别觉观，就是面对事物的时候生起分别心，这事对我好不好呀？若有利于我，盘算怎样得到它；若有害于我，盘算怎样驱除它。这样就算是明明了了地知道这件事了。其实，这样的“所了知性”是妄心，不是真心。妄心虚妄不实，只是六尘落谢的影子，没有本体。“心不自心，因物故心”，譬如我们面前摆着一个录音机，我们就生起录音机之见，有了录音机的概念。假如我们根本就没见过、也没听说过录音机，还会有录音机的概念吗？所以妄心是假的，对境而有、离境而无。<br/><br/>　　假如你执取这个心是妙明真心，从而去吝惜它、保护它。那么，这个心就应该是：即使离开“色声香味触法”六尘，即使离开所面对的事物，也有完全属于自己的体性（全性）。比如你现在听我说法，前面讲到七处征心，你就明白了应该把妄心驱除掉。你是听我说了之后才有了此心，假如我不说法、你不听法，还会有此心吗？此心是因分别声尘而有啊！“分别觉观”这样的“所了知性”，对境而有、离境而无，没有完全属于自己的体性，这是第六识的现行，不是妙明真心，而是妄心。妄心因“分别觉观”而起，遮蔽了真心的光明，使你见不到妙明真心。我们学法修行，就是要把这样的妄想执著之心驱除掉。但这决不是压念不起、落入断灭。请看下面的经文：<br/><br/>　　“纵灭一切见闻觉知，内守幽闲，犹为法尘分别影事。”<br/><br/>　　前面讲的是对境生心，着相了，不对！现在讲对境所生之心泯灭了，也不对！<br/><br/>　　见闻觉知，即见闻嗅尝觉知，是六根--眼耳鼻舌身意的功能。见属眼、闻属耳、嗅属鼻、尝属舌、觉属身、知属意。内守幽闲，幽是幽静，闲是不动。打坐修行的人往往有这个毛病：锁闭六根，不见不闻，空空荡荡，平平静静，死守这种心态不动，他就以为这是见到了诸法空相，其实这是偏空。着色相是偏有，泯色相是偏空。妙明真心非有非空。它无相可寻，故说它非有；它能起种种妙用，故说它非空。所以空也着不得、有也着不得。着个空，空还是有，因为有个空在。<br/><br/>　　纵然锁闭六根，泯灭一切见闻觉知，死守空荡幽闲的心境，这还是法尘，还属于分别，还是光影门头的事，不是妙明真心。<br/><br/>　　凡夫的习气，执着得厉害，处处着有。那就从有上起修，逐渐进步，把着有的习气了了。不着有的时候，又容易落入无记，无记就是偏空。偏空下去会变成土木金石，这个还是分别影事、法尘上的妄见。这都是毛病。不要着有、不要着空，空就是有、有就是空。本体非有非空、即有即空，能起妙用，能生万法。观世音菩萨讲耳根圆通时说：“……闻所闻尽，尽闻不住，觉所觉空，空觉极圆，空所空灭。……”空也不可得啊。空也要打破，不打破不行。禅宗讲：虚空粉碎、大地平沉。假如虚空不粉碎，有个空在，滞在心里，光不透脱，还是法尘分别影事。这只是影子，不是真正的主人公。所以不能着有，也不能着空，空有皆不住，一切不可得。“无眼耳鼻舌身意、无色声香味触法……心无挂碍”，不是说对境有心、还是无心。而是活泼泼地，“啪”地一下，前念已断、后念未起，当下是真空实际理地。真空不是断灭，还有个了了分明在啊！这是离念的灵知灵觉，这个知觉没有能知所知，没有能所相对，是绝对的。这才是本命元辰，它的体性就是无相，并不是个什么有相的东西。<br/><br/>　　我们接着看经文：<br/><br/>　　“我非敕汝执为非心。但汝於心微细揣摩：若离前尘有分别性，即真汝心。若分别性离尘无体，斯则前尘分别影事。尘非常住，若变灭时，此心则同龟毛兔角，则汝法身同於断灭，其谁修证无生法忍？”<br/><br/>　　前面刚刚讲到：“分别觉观”不是妙明真心，“内守幽闲”也不是妙明真心。<br/><br/>　　佛对阿难说：并不是我有意令你认为这些都不是真心。即使我不告诉你，你也应该自己仔细揣摩一下。揣摩，就是思考思考、研究研究。你自己细心想想：假如离开前尘，也就是离开眼前的一切色境界或圣境界，你还有分别心在吗？如果离开前尘还能分别，那么分别心就是你的真心了。前面讲过，分别心是妄心，对境而有、离境而无。分别心离开前尘是绝对没有自体的，所以分别心决不是真心。<br/><br/>　　佛继续启发阿难：如果分别心离开前尘便无自体，那它就是前尘分别影事，是“色声香味触法”一切境界的影子，而不是妙明真心，而不是法身，不能依之修证无生法忍。为什么呢？因为前尘并不常在，前尘是变迁不定的，所谓“沧海桑田”，一直在变来变去。在前尘变灭的时候，分别心就象龟毛兔角一样，也就随之没有了。龟没有毛，兔没有角，龟毛兔角是比喻根本没有、并不存在、没有自体。如果分别心是真心、是法身的话，当这样的“法身”随着前尘一起断灭的时候，谁来修证无生法忍啊？忍有认可之意，无生法忍就是认可法身不生不灭，即亲证妙明真心，也称见性，也称开悟，又叫阿鞞跋致。<br/><br/>　　僧问大随禅师：“劫火洞然，大千俱坏，未审这个坏不坏？”这个，是指妙明真心，也就是佛性。佛性不生不灭，怎么会坏？若错认分别心为佛性，那就坏了。大随禅师只用一个字作答：“坏！”大随禅师怎么知道他是错认分别心为佛性呢？从这僧所问的话就可以看出来。其实，劫火是假，大千非真。将佛性与劫火、大千联系起来，劫火、大千就是前尘。这样的“佛性”分明是前尘分别影事，而不是妙明真心，所以大随禅师答他：“坏！”<br/><br/>　　我们说的是妄心本无，不是说没有真心，真心是有的。前面讲过，连草叶缕结都有体性，何况真心！真心即法身。如果法身没有了，那么报身、化身也就都没有了。这岂不是落空了么？这岂不是断灭了么？<br/><br/>　　“即时，阿难与诸大众默然自失。”<br/><br/>　　这时，阿难和诸大众的妄心都起不来了。大家好象失掉了自我，讲不出话，无法申辩，这就是默然自失。至此释迦佛把大众的妄心都破光了，能与释迦佛辩论的还有什么心呢？穷遍思维再也找不出来了。大家默然自失，开不得口，动不得念，言语道断，心行处灭，当下妄想空净，一念不生，了了分明，刹那间省悟了。哦！以前执虚为实、认假作真，原来以前都错了。<br/><br/>　　雪窦禅师说：“二十年来曾苦辛，为君几下苍龙窟。屈！堪述！明眼衲僧莫轻忽。”这里的“君”，是指佛性。为了寻找佛性，为了见性，雪窦禅师二十年来吃了多少辛苦啊！就象几下苍龙窟一样，九死一生。屈──原来以前都错了！堪述──是为了启发后学：明眼的衲僧千万不可轻视这个、千万不可忽略这个啊！<br/><br/>　　“佛告阿难：世间一切诸修学人，现前虽成九次第定，不得漏尽成阿罗汉，皆由执此生死妄想，误为真实。是故汝今虽得多闻，不成圣果。”<br/><br/>　　次第就是顺序。九次第定就是九种禅定：四禅、四无色、灭受想。从低到高，按顺序从一种定进入另一种定。四禅：初禅、二禅、三禅、四禅；四无色：空无边、识无边、无所有、非想非非想；灭受想定又称灭尽定，把“色受想行识”五蕴里的“受”和“想”灭掉。一接触外境，这是什么呀？就领受了。蕴是蕴藏、蕴积的意思，领受得多了蕴藏起来，就是受蕴。领受以后就想：哪个对我有利，哪个对我有害，有利的怎样得到它，有害的怎样消灭它……这许许多多的想法蕴积起来，就是想蕴。打坐做功夫，先粗住，再细住，然后是欲界定、未到定，未到定就是还没有到初禅。继续打坐做功夫，生起八触十功德，就到了初禅。然后从初禅经过二禅、三禅、四禅，进入四无色定。经过空无边、识无边、无所有，到了非想非非想定，还有一丝想蕴未灭。最后把受蕴和想蕴全都灭尽，就是灭受想定了。<br/><br/>　　漏就是烦恼，烦恼就是贪、嗔、痴、慢、疑、恶见。恶见就是身见、边见、见取见、戒禁取见、邪见等，这些见解称为“见惑”，贪、嗔、痴、慢、疑等心态称为“思惑”，这是粗分--粗粗地分类。若是细分那就名相太多了：俱舍宗分见惑为八十八品，唯识宗分见惑为一百二十品；思惑呢？思惑可分为九地八十一品。这些名相很繁杂，对于先断哪个、后断哪个在教界还有争论，在这里我们就不细讲了。总之，见惑和思惑都属有漏，把见惑和思惑这二惑都断尽了就是漏尽。不得漏尽就是没有断尽二惑，那就不能证成阿罗汉果。为什么不能成阿罗汉呢？因为在修法的时候不是用真心来修的。真心就是“大佛顶如来密因”，就是妙明真心、就是佛性啊！它是不生不灭、不来不去、不动不摇的。不用真心修法，而用对境生起的妄心来修，就比如煮沙成饭，无有是处。虽然能修成功九次第定，但还是不得漏尽成阿罗汉。<br/><br/>　　生死妄想，就是有生有灭的妄想。<br/><br/>　　佛告诉阿难：现在世间一切修法、学法的人，纵然能修成九次第定，也不能断除见思二惑、证阿罗汉果。为什么呢？因为他们执著有生有灭的妄心，误认为妄心就是真心。所以你如今虽然号称多闻第一，但你不用真心修行，还是不得漏尽成阿罗汉，还是没有证成圣果。<br/><br/>　　石霜庆诸禅师圆寂后，大众欲请首座继续主持法席。石霜禅师的侍者（九峰道虔禅师）对大众说：“须明得先师意，始可。”首座不服，反问：“先师有什么意？”九峰说：“先师道：‘休去，歇去，冷湫湫地去，一念万年去，寒灰枯木去，古庙香炉去，一条白练去。’其余则不问，如何是‘一条白练去’？”首座答：“这个只是明一色边事。”九峰不肯他：“原来未会先师意在！”首座一听，恼了：“你不肯我那？但装香来！香烟断处，若去不得，即不会先师意！”侍者马上点上香，香还没有燃完，首座就已经坐脱了。九峰抚摸着首座的背说：“坐脱立亡即不无，先师意未梦见在！”诸位在这个地方注意了，如果修成九次第定，能入灭尽定，就可以坐脱立亡了，但那是真成道么？不一定啊！要明见真心才算数。禅宗有言：舍利十斛，不如转语一句。若不明见真心，任你坐脱立亡、舍利无数，也只是一色边事。<br/><br/>　　有人提出问题来了：九次第定修到最后，灭受想定也修成了。修成灭受想定，不受一切受，思想也没有了。这就是说，思惑已经断尽了。思惑已断的人，分段生死就应该了了。为啥经文上说，九次第定修成以后，也不得漏尽阿罗汉果呢？<br/><br/>　　这个问题问得很好。现在从两方面答一下：<br/><br/>　　第一、注释《楞严经》的人很多。有些人讲，修九次第定，到成就的时候，三界九地的思惑都已经断尽了。<br/><br/>　　我们上次讲过，三界就是欲界、色界、无色界。九地就是欲界里的五趣杂居地，色界里的四禅：离生喜乐地、定生喜乐地、离喜妙乐地、舍念清净地；无色界里的四空：空无边处地、识无边处地、无所有处地、非想非非想处地。这九地里，每一地都有上中下三类思惑，每一类又可细分为上中下三品。如此，每一地都有九品思惑。<br/><br/>　　他说的修成灭受想定能断尽思惑，就是指这九地八十一品思惑都断尽了。那么见惑呢？他说是没破。因为见惑没破，知见不正，就会认假当真，遇境还会沉沦。见惑不破，就不得无生智。见惑破了之后，才能得无生智。见惑、思惑都破了，才能证得阿罗汉果。见惑还没破，无生智不得，所以不能够证到漏尽阿罗汉果。<br/><br/>　　第二、如果修行人不晓得不生不灭的真心，在那里执着生死妄想，象阿难一样，误以妄心为真实，就会认假迷真，这就是见惑，是知见不正。见惑如果不破，前尘是不会丢完的。我们面前讲的色、声、香、味、触，这种种的尘境，他挥不开、丢不完。前尘既在，思惑哪能说破尽呢？他沉空守寂，不对境，好象没事。一旦对境的时候，他就生心了。心生的时候，种种欲望就来了。这样看来，思惑并不是破尽了。见惑是迷于理，就是道理上不明白；而思惑是迷于事，事情当前的时候，心就发昏了。理既不明，思想怎能全清爽呢？道理都没弄明白，遇到事情，心能不动吗？所以说，虽然能够修成九次第定，也不得漏尽阿罗汉果。<br/><br/>　　相宗里有的人说，修行应该先破见惑，后破思惑。因为见惑是分别所生，分别所知障叫见惑。而俱生所知障与烦恼障是思惑。俱生，就是于无始以来就有的。一定先破分别的，后破俱生的。一定是先破见惑，后破思惑。不可以说先破思惑，后破见惑。由此可见，修成九次第定，而不证阿罗汉果，讲得不对，连《楞严经》经都是伪造的了。其实他的解释是没有道理的。细细思量，假如九次第定修成功了，灭受想定是否真能破思惑？我想并没有破。为什么呢？他是伏的，把思惑伏到里面了。因为他在修定的时候，不是用真心修，是用妄心修的。克制妄心，压念头不起。如同把石头压在草上，叫草不要生起来，这并不是从根本上解决问题。草压在石头下，等拿掉石头，草又生出来了。灭受想定修成之后，所得的定是有劫数的，劫数过了之后，他出定了，反而要来个大翻动，妄动的习气比从前更厉害十倍。<br/><br/>　　玄奘法师到印度取经的时候，就看到一位法师在山里等释迦佛降生说法。这法师在释迦佛降生之前，就住在山上啦。玄奘法师是修道人，在路过这座山时，看出这个山上有紫气，知道山里有修道人，于是让大家去寻找。因年代太久，洞口已没了，碎石、树木倒塌，封住了洞口。好不容易挖开洞口，见里面有一个人坐着。玄奘法师的弟子说：哎呀！死了吧。玄奘法师说：不是的，他是修灭尽定。便拿磬在他耳边敲，使其出定。出定之后，他看见玄奘法师身穿袈裟，以为是释迦佛来给他传法了。玄奘法师告诉他，释迦佛已经圆寂了。他听后痛哭流涕，觉得错过了机会，空等了一场。玄奘法师告诉他：“你不要哭，震旦正在兴起大乘佛教，你可到那边去投生。你这个身体这么多年下来，皮肤骨骼都不行了，不能用了，再去投生，换个新的吧。你要到高楼大厦、琉璃瓦、黄墙头的地方去投生。”那位法师就圆寂了。投生后，就是后来的三车和尚。为啥叫三车和尚呢？这个人投生在尉迟恭家里。投生后，习气大的不得了，原来修灭受想定压下去了杀、盗、淫，现在呢？是大杀、大盗、大淫。这样，他就闯了大祸，被打入太庙，要杀头了。按照唐朝法律，犯了死罪，出家做和尚可以免死。尉迟恭没办法，只好让宝贝儿子出家做和尚，不然要杀头的。三车和尚说：“爸爸，我出家要带女人走。”父亲问带多少？三车和尚说要装三车（三车和尚的雅号就是这样来的）。你看看，这还得了！所以说修灭受想定，思惑是断不了的。一旦泛起来，更是大得不得了。只好说“相似断”，好象断了，实际是包在里面。见惑迷理，迷于道理，知见不正。思惑迷事，遇到事情就泛起来了，思惑顶难破。因此我们说，有人修九次第定，定是有，但却是克制的，因其没有真正的无生智，所以不究竟。不究竟就不能得漏尽阿罗汉果。<br/><br/>　　这个理答复完了，如果还有疑问，等到以后有机会我们再讨论。<br/><br/>　　（一）明暗无亏，显见非眼<br/><br/>　　“阿难闻已，重复悲泪，五体投地，长跪合掌而白佛言：自我从佛发心出家，恃佛威神，常自思惟：“无劳我修”，将谓如来惠我三昧，不知身心本不相代，失我本心。虽身出家，心不入道。譬如穷子，舍父逃逝。今日乃知：虽有多闻，若不修行，与不闻等。如人说食，终不能饱。”<br/><br/>　　这段经文很容易懂，这里只讲讲“三昧”。简单地说，置心一处、一心不乱，就是三昧。铺开来说，那就太多了。《大日经疏》里就讲了五种三昧：入“阿”字门、一念法界，是毗卢遮那三昧；於莲花印一心不乱，是观自在三昧；於金刚慧印一心不乱，是秘密主三昧；於释梵诸尊之法门一心不乱，是净天眼三昧；於大悲藏云海中一心不乱，是普眼三昧，又称普现身三昧。要想得到三昧，就必须自己修行。若不实修，知道的理论再多，也得不到三昧。<br/><br/>　　阿难听了以后，再次悲心发动、潸然泪下，后悔自己以前不对。急忙向佛五体投地，虔诚顶礼。然后长跪合掌，向佛诉说：自从我发心跟佛出家以来，总想依靠佛的威神之力。我常常这样想：“不用我辛辛苦苦地去修行。”总以为如来会给我恩惠，将来会把三昧赏赐给我。不知道我的身心和佛的身心本是不能互相代替的。从而失掉了我的本心。我的身体虽然已经出家，象是个修道的样子，然而，心还没有出家，心与道还不相应。就象富家的儿子，逃离了父亲，结果一身贫苦。今天我才知道，我虽然听佛讲经听得多，但如果不修行，就等于没有听过。这就象：只是听别人说说食物，自己不去吃，那终究是不能饱的。<br/><br/>　　现在有些修净土的人说：阿弥陀佛四十八愿度众生，不用我念佛修行，只要我相信阿弥陀佛的愿力就行了。这哪儿成啊！阿弥陀佛不会拉我们去的。这不跟阿难一样吗？自己不肯用功修行，只等着佛的恩惠。“欲净其土，先净其心，随其心净，即佛土净”，心好比一杯水，佛好比天上之月。心水不清净、很浑浊，就映现不出天上之月。临命终时，非但见不到佛，生不到西方，而且业障现前，那就不由自主地跟它跑，随它六道轮回去了。永明延寿大师教导我们要好好念佛，每日要念十万八千，为什么呢？因为如果念佛得力，“阿弥陀佛！阿弥陀佛！……”十分得力，就把我们心水里的污秽消灭掉了，心水清净就映出明月，实相就现前了，亦即亲证“念佛三昧”。三昧不能靠恩惠，不能靠赏赐，必须自己努力修行才行。这还是显教的说法。<br/><br/>　　若照密宗的说法：佛是无缘大慈，对一切众生统统无分别地放光普照，无论是谁，你们都到我这里来呀！无奈众生害怕佛的光明，照得眼睛睁不开呀，快逃快逃，远离逃逝了，这是不相应啊。假如你修行得好，心水清净了，你的心也就光明了，你的光明与佛的光明两光相照，相得益彰，自然就合上去了。这么一相应，就生到净土了。其实是公修公得、婆修婆得、不修不得。说食不饱，靠恩惠赏赐是不行的。其实，给你说食就已经是恩惠了。<br/><br/>　　有的人讲，《普门品》上不是说了么：求男得男、求女得女、求财得财、求福报得福报……那不是恩赐么？唉！众生执着得厉害，佛菩萨慈悲心切，一开始无法使你信入，就先给你点甜头尝尝，你要福报就给你点福报，那是“先以欲钩牵”哪！<br/><br/>　　“世尊，我等今者，二障所缠，良由不知寂常心性。惟愿如来，哀愍穷露，发妙明心， 开我道眼。”<br/><br/>　　二障，是指烦恼障和所知障。详说这个道理，很深奥、很复杂，我们现在浅显地简单地 讲讲。<br/><br/>比如我们现在用的这个录音机，它是自性所显现的。并不是天生就有个录音机，是大脑-- 第六意识根据客观环境的规律、根据电子学的原理研究发明出来的。那么，第六意识又是从哪里来的呢？前五识（眼耳鼻舌身）、第六识、第七识都是从第八识生出来的，五、六、七 识的根子是八识。前五识起照境的作用，第六识分别思量，第七识搬运执取。第七识执著第八识为“我”，把前面的善恶造作搬到第八识，形成业力种子，这便是以后受报的因。一旦种子成熟，就会受到善恶之报，这就是果。人都知道前五识和第六识，而不知第七识，更不 知第八识，在那里争论唯物、唯心。物是“所见”，心是“能见”。其实，世间的一切都是第八识的显现，“能见”是第八识的“见分”，“所见”是第八识的“相分”。心、物都没有离开第八识啊！<br/><br/>　　“相分”是境。“见分”对境产生“所知”，这时候还没有成“障”。由于不了解真心 ，起了法见，认为实有这个东西，这就成障了。譬如见到了录音机之后，不晓得这是真心的 作用，着了录音机之相，哦！有这样一个东西，名字叫录音机，作用是录音，这是真实的。这就是所知障。烦恼障是从所知障生起的，认为实有录音机这个东西，就想得到它，如果得 不到就烦恼。得到之后还是烦恼，这可是宝贝呀，不敢碰不敢摸，弄坏了可了不得。这就是烦恼障。世间人都是这样，在烦恼障和所知障这二障里滚来滚去。<br/><br/>　　我们修行人起心动念要修法、要证道，其实这是所知障。哦！我明白了：原来法法平等 ……。这还是所知障，因为你还有个法执、有个见地在。所以禅宗说：“‘佛’之一字，我不喜闻！”念一句“南无佛”，便挑水打扫禅堂，要扫掉这一句佛号的污染。这就是要去掉所知障啊！要去掉所知障，必先去掉烦恼障。烦恼障来是后来，去是先去，所知障是先来后 去。<br/><br/>　　寂是不生，常是不灭。寂常心性就是不生不灭的心性，也就是妙明真心。<br/><br/>　　穷是穷尽、彻底，露是发露、揭示。穷露就是彻底地揭示出来。<br/><br/>　　道眼是见道之眼。了知妙明真心不生不灭，就是开了道眼。一旦开了道眼，就去掉了烦 恼、所知二障，所知是智慧，烦恼即菩提。<br/><br/>　　所以阿难说：世尊啊！我们现在被烦恼、所知二障所牵缠，如同游子不能归家，是因为 我们没有悟道，不能了知寂常心性妙明真心。恳求您老人家怜悯我们、护念我们，把妙明真心给我们彻底地揭示出来，打开我们的见道之眼。<br/><br/>　　如来不负众望，开示道眼，显现报身说法：<br/><br/>　　“即时如来，从胸卍字，涌出宝光。其光晃昱，有百千色。十方微尘普佛世界，一时周遍。遍灌十方，所有宝刹，诸如来顶。旋至阿难及诸大众。”<br/><br/>　　佛胸口有个卍字，这个卍字是梵文，表示万德庄严、清净无染、吉祥如意。卍字涌出宝 光是表法的，因为阿难求佛开示道眼，卍字就表示清净道眼，宝光表示清净道眼所生的功德。这功德是多生多劫积累的，万德庄严、吉祥如意，所以放出光来。晃昱形容明亮，耀眼生 辉。有百千色是表法的，表示真心的妙用千变万化，妙用无穷，能生万法。<br/><br/>　　“十方微尘普佛世界一时周徧”。十方就是东西南北四维上下，我们常说：四面八方， 八方加上上下两方，就是十方。微尘就是微细的尘埃，十方有多少佛世界啊？就象微尘那样 多。一时周徧，那么多的佛世界刹那间都普遍的照到了。这是表示见性了，因为佛性本来就是满虚空遍法界的。《阿弥陀经》云：“彼佛光明无量，照十方国，无所障碍”，佛光既是 如此，我们众生的光也是如此，只是被妄想执著封闭，不能显发、不能朗照。我们用功修法 ，就是要去掉这个妄想执著，定中的种种境界都不要睬它，不要住境着相。到了开悟的时候，就会刹那打破妄想执著，见到一线光明。为什么只能见一线光明呢？因为我们多生多劫妄 想执著惯了，很难一下子全改过来，妄想执著只打破了一线，所以只能见到一线光明。这就是见性了，妙用也就跟着来了，由于只有一线光明，所以妙用的力量也很微弱。将来随着妄 想执著的减少，光明增加，妙用的力量也增加。西方极乐世界的莲花也是表法的，莲花开表示心花开。花开见佛悟无生，表示开悟了，悟到了本来不生不灭。<br/><br/>　　“徧灌十方所有宝刹诸如来顶，旋至阿难及诸大众”。旋是旋即，立即、马上之意。前 面刚说过，十方有那么多佛世界、那么多宝刹，每个宝刹都有一尊佛。释迦佛从胸口卍字涌 出的宝光，普遍地灌注到那么多佛的头顶上，此后，立即就灌注到阿难和与会诸位大众的头上。这也是表法的，表示灌顶、表示加持、表示心心相印。报身放光也是说法，但不是开口 说法，紧接着如来就开口说法了：<br/><br/>　　“告阿难言：吾今为汝建大法幢，亦令十方一切众生，获妙微密性净明心，得清净眼。 ”<br/><br/>　　大法幢比喻正知正见。建大法幢就是建立正知正见。要建立正知正见，就必须摧灭邪知 邪见。一个一个邪见就象一幢一幢房子，要把这一切妄心都去掉，才能树立起正见。这就叫建大法幢。<br/><br/>　　妙微就是微妙。自性能生万法，世界上一切东西都是自性所生的，这多么微妙啊！而自 性无相，它虽实有，你却看不见它，无法出示与人，秘密得很，这就叫密。虽有而不可得，虽不可得却能生万法。如何获得这个“妙微密”啊？至此言语道断、心行处灭，只能意会， 不能言传，全靠以心印心了。一旦心领神会，原是本地风光，毫无秘密可言。禅宗有言：不 会则“世尊有密语”，会则“迦叶不复藏”。不复藏，就毫无秘密可言了。不密而密、密而不密，那到底是个什么呀？那就是“性净明心”，也就是佛性，它本体清净毫不污染，能朗 照十方起无量无边的妙用。这样的心（佛性）就是性净明心。亲证这个性净明心，就见道了 。用什么见，用清净眼啊。所以见道就是得清净眼。得了清净眼就不会再着相了。<br/><br/>　　佛告诉阿难：我现在为你建立大法幢，使你扫除邪见、树立正见。也使十方世界的一切 众生获得微妙秘密的“性净明心”，亲证本来，得到能见道的清净眼，使他们道眼通明。<br/><br/>　　如何能做到这一点呢？这就要想想办法，也就是世尊度化的方便，没有办法怎么能行啊 ！正如禅宗的宗师，要想使弟子开悟，就要有办法。若无办法，没有一点方便，只是叫弟子去死参“念佛是谁”，那怎么开悟啊！佛的方便法门很多，佛是有办法的。请看下文：<br/><br/>　　“阿难，汝先答我，见光明拳。此拳光明，因何所有？云何成拳？汝将谁见？”<br/><br/>　　佛叫阿难，你要先答复我。你看见我的光明拳的时候，这拳的光明是从什么地方来的呢 ？次问“云何成拳？”又怎能成为拳头的呢？第三“汝将谁见？”这个最重要。是什么在参念佛是谁呢？这个见是谁呢？<br/><br/>　　“阿难言：由佛全体，阎浮檀金，赩如宝山。清净所生，故有光明。我实眼观，五轮指端，屈握示人，故有拳相。”<br/><br/>　　阿难只执著前尘，而不晓得真心。阿难讲：“由佛全体，阎浮檀金”，因佛身清净光明，就象阎浮檀金一样。阎浮檀，梵语，译为胜金。须弥山南有洲，多此檀树，其果汁入水， 沙石成金，叫阎浮檀金。以此金一粒置一般金子中，悉皆失色。以此金一寸置于暗室，其光耀如白昼。以喻佛身金光如檀金，佛的身体像阎浮檀金颜色一样。“赩如宝山”，赩是说颜 色红润，象宝山一样光明。佛问这光明从何而来，阿难说是清净所生，故有光明。佛问你用 什么看到的，阿难说我是用眼看到的。“五轮指端，屈握示人，故有拳相。”手伸出来是掌、屈起来是拳，手握紧了就是拳头。<br/><br/>　　佛在这里是做个比方，先问阿难，光明是从什么地方来的？拳头是怎样形成的？用啥东 西看到的？先问定之后再来讲道理。<br/><br/>　“佛告阿难：如来今日，实言告汝。诸有智者，要以譬喻，而得开悟。阿难，譬如我拳，若无我手，不成我拳；若无汝眼，不成汝见。以汝眼根，例我拳理，其义均不？”<br/><br/>　　不用譬喻不大容易懂。譬喻就是比方。用知道的事比喻不知道的事，容易理解。如来讲 ：我告诉你呀！一切有智慧的人，还要用譬喻开悟，若没智慧更要用譬喻。“阿难，譬如我拳，若无我手，不成我拳。若无汝眼，不成汝见。以汝眼根，例我拳理，其义均不？”阿难 ，譬如拳头，假如没有手怎会成拳呢？譬如眼根，若没有眼根怎会看见东西呢？用你眼根比 方我拳头，其义均不？是说这个比方合适不合适？拳头是从手来的，若没手不成拳，那么没有眼就不能成见。用你眼根比方我的拳头，这样比方是不是合适呢？<br/><br/>　　“阿难言：唯然，世尊，既无我眼，不成我见。以我眼根，例如来拳，事义相类。”<br/><br/>　　阿难说，世尊你讲的对啊！假如无眼，我怎能看见呢？用我的眼比方如来的拳头是同类 相比，是很相似的，没有差别。<br/><br/>　　其实这个理不相类似。因为拳无实体，拳是手生成的，伸出为手掌，屈起为拳。而见是 有体的。刚才讲世间之物尚有体性，何况妙明真心呢？一定有体。而拳是假相。一伸为掌，不伸为拳。两者不相类似。阿难说是类似，这是错误的。<br/><br/>　“佛告阿难：汝言相类，是义不然。何以故？如无手人，拳毕竟灭。彼无眼者，非见全无。所以者何？汝试于途，询问盲人，汝何所见？彼诸盲人，必来答汝，我今眼前，唯见黑 暗，更无他瞩。以是义观，前尘自暗，见何亏损。”<br/><br/>　　佛告诉阿难，用我的拳头比方你的眼根，你说是相类似的，其义不然，不是这样啊。“ 何以故？如无手人，拳毕竟灭。”譬如无手人怎会有拳呢？有手才能形成拳呀！“彼无眼者 ，非见全无。”没眼的人并不是没有见。比如瞎子他只见暗，黑洞洞的。只见黑暗还是有见 啊。见到录音机、见到台灯、见到杯子是见，他见到黑暗怎么不是见呢？“所以者何？汝试于途，询问盲人，汝何所见。彼诸盲人，必来答汝：我今眼前，唯见黑暗，更无他嘱。以是 义观，前尘自暗，见何亏损。”试问路上的瞎子，你们看见什么了？他一定告诉你，我眼前只有黑暗，其他什么也看不到。其实“前尘自暗”，我们眼前这些色尘本来都是暗的。能见 到它们是因为光啊！灯光，太阳光等。假如没有光，怎么会看见呢？如果我们被关到黑房子 里，没有光明，眼前也是一片黑暗，什么东西都分辩不出来，与盲人不是一样吗？世上的人错就错在，见到东西是见，见到黑暗不算作是见。眼前是黑暗还是见，你见的是黑暗，不能 说不见。“前尘自暗，见何亏损？”见黑也是见，“见”哪里会损坏和欠缺呢？见是不坏的、不欠缺的。不看《楞严经》不晓得，众生原来都不晓得，哪里知道见暗、见黑也是见啊！<br/><br/>　“阿难言：诸盲眼前，唯睹黑暗，云何成见？”<br/><br/>　　阿难跟我们一样的境界，盲人只看见黑暗，哪能看见东西，云何成见呢？我们说的是‘ 见’，不是看见东西呀！‘见’是能见之性，不是看见东西，这点很要紧。<br/><br/>　“佛告阿难：诸盲无眼，唯观黑暗，与有眼人，处于暗室，二黑有别？为无有别？”<br/><br/>　　佛进一步问阿难，你说看见黑暗不能成见。我再问你，瞎子可以看见黑暗，有眼人在暗 室见暗，这有眼人与瞎子都见暗，这是一样还是两样？是同、还是别呢？<br/><br/>　“如是世尊，此暗中人，与彼群盲，二黑校量，曾无有异。” <br/><br/>　　阿难说，有眼人在黑房间见的黑暗，与瞎子所见的黑暗，是一样的，没有差别。这样看 来，见黑与见东西不关于眼的事。为什么？刚才讲了，眼见东西要有增上缘。眼睛对色境的时候，没有增上缘是不成功的。增上缘就是空、明。假如没有增上缘，眼睛对色境的时候， 还是看不见东西，这不关眼的事。见暗不关眼，见明又何尝关眼呢？假如不是增上缘显现光明，假如没有空间，你也不能见呀！所以说这与眼无关。<br/><br/>　　“阿难，若无眼人，全见前黑。忽得眼光，还于前尘，见种种色，名眼见者。彼暗中人，全见前黑，忽获灯光，亦于前尘，见种种色，应名灯见。若灯见者，灯能有见，自不名灯 。又则灯观，何关汝事！”<br/><br/>　　佛又问阿难，假如是无眼的人，见到的全部是黑，忽然有了眼，比如有一个瞎子被医好 ，忽得眼光，还是前面这些色尘，又都可以看见了。“见种种色，名眼见者”，种种差别、形形色色的东西都可以看见。这种见，假如叫做“眼见”。如来下面要说明这不是眼见，这 个眼睛是照，“见”是我们的心见。　　假如说瞎子“忽得眼光”是眼见，那么黑暗中的人在完全见黑暗时，忽然灯光一照，也能见种种色，这是因灯而见，就应该是“灯见”了。前 面已说明瞎子医好能看见东西，是眼见。那么黑暗中人一遇灯光，见种种色，这就是灯见啦 ！“灯能有见，自不名灯”，假设说灯能够见到东西，那就不叫做灯，应该叫做眼了。“又 则灯观，何关汝事”，假如灯能看见，那是灯看见的，和你不相关啊！<br/><br/>　　“是故当知，灯能显色，如是见者，是眼非灯；眼能显色，如是见性，是心非眼。”<br/><br/>　　“是故当知”，因是之故，我的比方你应当晓得了。“灯能显色”，灯是增上缘，把一切色境显现出来了。“如是见者，是眼非灯”。显现出来的东西我们能看见，却不是灯看见，灯只是使之显现而已。是眼睛看，而不是灯看。“眼能显色，如是见性，是心非眼。”眼能显色，眼譬如灯，眼根是‘见’性的增上缘。眼根不坏，增上缘就有了。眼根坏了，就等于在黑暗房间中灯没了。增上缘没了，就不能见。增上缘有了，事情才能成功。实际上能见东西的不是眼睛，眼根只是‘见’性的增上缘。缘具足了，就能见东西。眼根坏了，缘不具足，就不能见到前尘了。“如是见性，是心非眼。”见性，就是见到东西的本性。这个能见的本性是心，不是眼睛。<br/><br/>　　（二）动乃客尘，显见不动<br/><br/>　　“阿难虽复得闻是言，与诸大众，口已默然，心未开悟。犹冀如来，慈音宣示。合掌清心，佇佛悲诲。”<br/><br/>　　上面我们讲了十番显见的第一番显见：明暗无亏，显见非眼。我们‘见’性，不是有了眼根才有的，我们的‘见’性是本来就存在的。眼根只是增上缘，可以使‘见’性起作用，帮助起作用而已，就象灯光帮助我们的眼睛起作用一样。黑暗里有灯光，我们就能看见各种景色。佛就是讲这个比方给阿难听。因阿难认妄心，不认真心。妄心是依据六尘（色、声、香、味、触、法）生起来的虚妄相想。假如没有前尘，没有色、声、香、味、触、法，这个心就生不起来。所以佛就把手握成拳头打比方：我有手，可以握紧拳头，假如我没有手，拳头就握不成，这是启发阿难。因为阿难说：我有眼能看，没眼我就不能看了。佛问阿难，我这比方对不对呀？和你讲的一致不一致呀？我的比方恰当吗？阿难讲：蛮恰当。有眼能见，没有眼睛就不能见；有手就能握成拳，没有手就握不成拳。实际上，这掌、这拳头都是假相，可以变来变去，而‘见’性是不动的，见性不是因眼根存在才有的。眼根没有就是瞎子，瞎子眼根坏了，不能看东西了，但它能见暗，见暗也是见。尽管明、尽管暗，见性并没有亏损，这就是第一番显见--明暗无亏，显见非眼。十番显见都是充分表示，真心是存在的，不是因境界才有。<br/><br/>　　接着讲第二番显见--动摇名尘，显见不动。<br/><br/>　　阿难和与会的大众，听佛讲了见是心见、并非眼见的道理，知道佛讲得对，已无话可说。但还是没有彻底明白，还希望佛能大发慈悲，继续宣讲。大家合掌净心，等待着佛的慈悲教诲。<br/><br/>　　“尔时世尊！舒兜罗绵网相光手，开五轮指。诲敕阿难及诸大众：我初成道，于鹿园中，为阿若多五比丘等，及汝四众言，一切众生，不成菩提及阿罗汉，皆由客尘烦恼所误。汝等当时，因何开悟，今成圣果？”<br/><br/>　　佛当然知道大家心里想的什么，于是就伸开那软如舒兜罗绵、靓如网相光的手掌。象圆圆的车轮一样，张开五个指头。从自己刚成道时，在鹿野苑度五比丘讲起。<br/><br/>　　“为阿若多五比丘等，及汝四众”，阿若多，即憍陈那，阿若多是名字，憍陈那是姓。佛刚出家的时候，他的父王就派五个人跟着他。这五个人是谁呢？一个即是阿若多；一个是摩诃那摩，即拘利；一个是跋波；一个是阿舍婆阇，即跋提；一个是跋陀罗阇。这五个人陪释迦佛一道到深山修行，后来这五个人离开佛到鹿野苑去了。鹿野苑是波罗奈国养鹿的地方，他们到鹿野苑修学外道去了。释迦佛雪山成道以后，先到鹿野苑去度五比丘，相继为他们说四圣谛法。四圣谛法即苦、集、灭、道，于是这五个人得道，成阿罗汉果。所以佛叫他们来说法，用他们的亲身体会讲。<br/><br/>　　“一切众生，不成菩提及阿罗汉，皆由客尘烦恼所误。”见性不动，不动是主人，动摇就是客人。客尘是打比方，妄心就是客尘。客是客人，尘是尘境。客尘迷住了我们的真心，那我们就修不成菩提道，也证不成阿罗汉了。遇事的时候，对境生心，烦恼就来了，这都是客尘烦恼所误。“汝等当时，因何开悟？今成圣果。”你们几个人，当时是怎么样开悟的？怎么样修成功的？佛是让他们用自己证成圣果的经过，来解阿难及四众之迷。<br/><br/>　　“时憍陈那，起立白佛：我今长老，于大众中，独得解名。因悟客尘二字成果。”<br/><br/>　　憍陈那年岁比较高，年高德重，所以称为长老。憍陈那讲，我于大众之中独得解名。什么叫独得解名呢？因佛说法时，他第一个先悟道，悟到佛说的真理，因此得解，晓得道理了，因此说他在大众中“独得解名”。<br/><br/>　　“因悟客尘二字成果。”憍陈那是在客尘二字上悟出了道理成正果的。这是什么道理呢？我们的身体生灭不停，像客人一样，客人就不能常住，头出头没，来来去去；也象灰尘一样，灰尘飘动不息，摇摆不停。是比喻我们的肉身和客人、尘土一样，来来去去不能常住。有客就有主，有尘就有空。我们今天在座的大家都是客人，待一会儿都要走了，而老魏同志是主人（这是打比方，因在老魏家讲经，故说老魏是主人，来参加法会的都是客人。），他不走。主人常住，客人不能常住。肉身就是客人哪。我们不看色身，要看见里面的主人。主人是什么？主人就是我们的‘见’性。第一番显见，‘见’性不是眼睛，‘见’性就是我们的主人。而我们错就错在只认客人、不认主人。这色身是幻身、是客人，它一刻也不停地变化。细胞的新陈代谢，一秒钟也没有停止过。大概一个月吧，全身的血液就都换了一遍，不是原来的了。但是我们只认这变迁不息的尘境，不认佛性空寂体。客对主、尘对空，憍陈那就在这两个字上悟道了。‘见’性是不生不灭的。要识得‘见’性，不要光看到法尘的浮动。大家都执著这个家庭，为妻子、儿子、金银财宝烦劳一生，捞，捞，捞！到最后一样东西也带不走，赤裸裸来，赤裸裸去。去的时候还不是完全赤裸裸，还要带一样东西，什么东西？“业”！业要带去，造的业还要跟你一道走。憍陈那他就聪明，佛对他讲过之后，他悟到了这个主人。他见到“见”性是恒常的。他见到本体是真空，不是昏糟糟的尘境相。<br/><br/>　　其实憍陈那的悟，只是悟了个小乘的涅盘。为什么是小乘的涅盘呢？他晓得了‘见’性是常境，像虚空一样。六尘呢？就是色、声、香、味、触、法，像客人一样。舍客尘而得主空，自己本性得到了，已经得到了这么个小乘果。再进一步，这变动不息、来去不停、分段生死的客尘，当体就是如来藏妙真如性！如来藏不生不灭。不生，不是死死的不生，生生不息就是不生。因其不生，故也不灭。认得这个，即无生法忍。心不住境、尽起妙用，这就了了变异生死。大乘、小乘就差这么一点点。<br/><br/>　　“世尊，譬如行客，投寄旅亭，或宿、或食，宿食事毕，俶装前途，不遑安住。若实主人，自无攸往。”<br/><br/>　　世尊，比如行路的客人，匆匆忙忙的“投寄旅亭”，到旅馆里投寄住宿；“或宿或食”，或者住下来，或者只吃吃饭。住吃之后呢，“俶装前途”，还是要打起行李去赶路。“不遑安住，”不能够长住下来不再走。“若实主人，自无攸往。”假如他是主人的话，他就常住，不会走了。<br/><br/>　　“如是思惟，不住名客，住名主人。以不住者，名为客义。”<br/><br/>　　“如是思惟，不住名客，住名主人”，你来了之后不住就是客人，常住不动就是主人，“以不住者，名为客义”，不能常住，来来去去就是客。我们这个幻身，在这个世界的旅馆里就象客人一样。古人云：“夫天地者，万物之逆旅；光阴者，百代之过客。”天地就是我们住的旅馆，我们到这个世界上来，也等于客人一样的，烧烧吃吃，事情完结就走了。事情怎么完结？就是我们在这个世界上做了一番事业，造了一番“业”，到最后老死。死了嘛，“俶装前途”要走。到啥地方去呢？新业成就。宿业完结了，就是我们过去世所造的业，这一世已经都享完了，换个新的皮囊去享受新造的业。我们大家，各人的环境不同，是因为过去所造的业不同。“要知前世因，今生受者是；要知来世果，今世做者是。”我们今生所作所为，就是来世的果。带着今生所做的业走了。“不遑安住”，我们不能永远住下去，还要在六道轮回中转。“若实主人，自无攸往”，我们的‘见’性，不生不灭。不生不灭的真心有什么来去相呀！所以我们说生净土，很多年后转了个身，说“生者生己，去者未然”，这是说主人翁没有来去相，没有生灭相。刚才说了，我们要了变异生死，不生当中不妨现生，不来不去当中不妨来来去去。所以说，如来者，不来而来，来而不来。为啥说不来呀？是晓得了主人翁啊。尽管来去，他是不动的。我们不能执著前尘、外境，前尘、外境是客人。修道就是要认得主人翁，认得真心。把前尘、外境这些东西一放，就成就了。<br/><br/>　　祖师说，不要去念佛、参禅，多此一举，这是披枷戴锁汉！为啥这样说？因他逍遥自在了。随缘放旷，任运逍遥。识得本来的如来藏心，认得主人翁。凡夫只识得客人，不识得主人翁。差这一点点，就不得了。憍陈那说，常住是主，不住是客，所以我就把这个幻身放下了。<br/><br/>　　“又如新霁，清旸升天，光入隙中，发明空中，诸有尘相。尘质摇动，虚空寂然。如是思惟，澄寂名空，摇动名尘。以摇动者，名为尘义。”<br/><br/>　　“佛言：如是。”<br/><br/>　　再作个比方，刚才的比方是客，现在的比方是尘，这就说完了客、尘两个字。尘是灰尘，比方雨过初晴，清新的阳光升起来了。“光入隙中”，就是光从缝隙中穿过。一片光的时候看不见灰尘，假设光从缝隙中射出来，就能看见阳光中都是灰尘。我们有这样的经验，看到一线阳光里全是灰尘，多的不得了。“尘质摇动，虚空寂然。”灰尘摇动不停，但虚空是不动的。“如是思惟，澄寂名空，摇动名尘。”他就这样想了，澄然而寂静的便是虚空，摇动不停的便是灰尘。这是比方我们用功修行，初除烦恼时的情况。而对大根器的人，直说“无修无得无证”，大根器人要放一切放，这种人是有的，不是没有，但少。大多数人都需要一步一步地慢慢升进。初除烦恼的时候，等于是雨过初晴，空气清新。这是比方我们开始觉悟了，看到我们烦恼习气重得不得了，如在光线之中看到灰尘在飞。这世界上的东西森罗万相，都是幻起幻灭、生灭不停，但是虚空却是寂然不动的。这寂然不动的虚空表示我们的真心，因为真心之体是寂常的。虚空中的灰尘是动摇的，动摇的灰尘表示我们的妄想。这样比喻很恰当，所以佛说：“如是。”对的，对的。<br/><br/>　　“即时如来，于大众中，屈五轮指，屈已复开，开已又屈。谓阿难言：汝今何见？<br/><br/>　　“阿难言：我见如来，百宝轮掌，众中开合。”<br/><br/>　　这时候，佛要证明憍陈那讲的话是正确的。就把五个手指屈起来，握成拳头.屈起来又伸开，伸开又屈起来。这是啥道理呢？这是比方客人来去不停。问阿难：“汝今何见？”你现在看见什么了？<br/><br/>　　阿难说，看见如来的百宝轮掌（佛的手有百宝千波轮相，佛的脚也有轮相。）在大众中展了再合起来，合起来再展开。<br/><br/>　　“佛告阿难：汝见我手，众中开合。为是我手，有开有合？为复汝见，有开有合？<br/><br/>　　“阿难言：世尊宝手，众中开合。我见如来，手自开合。非我见性，有开有合。”<br/><br/>　　佛又问阿难：你见我的手在大众中开合。是我的手在开合，还是你的‘见’有开合呢？<br/><br/>　　阿难回答：是您的手在开合，我的见是没有开合的。<br/><br/>　　“佛言：谁动谁静？<br/><br/>　　“阿难言：佛手不住。而我见性，尚无有静，谁为无住？<br/><br/>　　“佛言：如是。”<br/><br/>　　佛进一步问：什么东西在动，什么东西是静的？<br/><br/>　　阿难说：是佛的手在不住地动。而我的见性，连静也没有，哪能无住呢？无住就是不住，不住就是动。连静也没有，哪能有动呢？<br/><br/>　　佛说：对的，对的。<br/><br/>　　这也是比方，手在开合，见没开合。这下子阿难的见解已经比较正确了，晓得见是不动的，没开没合。但是，见不动也有差别，什么差别呀？是真正识得不动的见性了呢，还是暂住不动呢？比如客人和老人家是亲戚，见到了老人家，唠了一阵子，说暂住一个月。这毕竟是暂住，不是真正主人，老人家才是真正主人。要是把这个暂住的客人当成主人就错了。佛正是恐怕阿难还不是真见性，所以问他“谁动谁静？”叫你真正见清爽，什么东西动？什么东西静？阿难说，佛的手在不住地动，我的见性静也没有，哪能有动呢？这下阿难就真开悟了。动与见是相对而有的，假如没有动，见根本不存在。我的见静也没有，哪来动呢？所以不存在动。这个蛮要紧的。假设说“见”是静的，那就是暂住的客人，不是真见。动静两边都脱开，都没有，才是真静。阿难在这个地方已经明白了，见性也没有啊，哪能有住呢？佛认为他答的很对，所以说“如是”。<br/><br/>　　上面讲的是主客关系，下面讲尘空关系。<br/><br/>　　“如来于是从轮掌中飞一宝光，在阿难右，即时阿难，回首右盼；又放一光，在阿难左，阿难又则，回首左盼。<br/><br/>　　“佛告阿难：汝头今日因何摇动？<br/><br/>　　“阿难言：我见如来出妙宝光，来我左右，故左右观，头自摇动。”<br/><br/>　　佛再用尘空之意试试阿难。从百宝轮掌中发一道宝光在阿难右边，阿难就向右边看。再发一道宝光在阿难左边，阿难又转向左边看。佛问阿难：今天你的头为啥摇动啊？<br/><br/>　　阿难说：如来发的宝光在我的左边、右边，我左右观光，所以头就摇动。<br/><br/>　　“阿难，汝盼佛光，左右动头，为汝头动，为复见动？<br/><br/>　　“世尊，我头自动。而我见性，尚无有止，谁为摇动？<br/><br/>　　“佛言：如是。”<br/><br/>　　佛又问阿难：你看宝光，左右动头的时候，是你的头在动，还是见在动呢？和上面一样的，还要进一步问：是你的头动，还是你的见动？<br/><br/>　　阿难说：是我的头动。我的见性并不存在止（止是停止，和摇动相对而言），哪里有动呢？尘在飞舞，慢慢落下来，停止不动了，就是止。有止就有动，这是相对而言的。我们的本性是不动不静的，所以说“尚无有止。谁为摇动？”不在相对上取则。<br/><br/>　　佛证明阿难说得对：如是，如是。<br/><br/>　　一切尘相，色、声、香、味、触、法这些东西，它也有静的时候，但它的静是由动而静的。既是由动而静，就会由静而动。总是动静两边跑，不得常住。而见性本来如此，并不是由静而动、由动而静。所以阿难说，我的见性连止也没有，哪能摇动呢？这话讲得彻底。<br/><br/>　　“于是，如来普告大众：若复众生，以摇动者名之为尘，以不住者名之为客。汝观阿难头自动摇，见无所动；又汝观我手自开合，见无舒卷。云何汝今，以动为身，以动为境，从始洎终，念念生灭，遗失真性，颠倒行事，性心失真，认物为己，轮回是中，自取流转？”<br/><br/>　　假设大众“以摇动者名之为尘，以不住者名之为客”，就识得了客尘两个字，客尘是烦恼。这些客、这些尘，它时刻在动，时刻在变化。无常故苦，于是烦恼就来了。你们看阿难 头在摇动，而“见”没动；再看我的手有开有合，而“见”没有伸舒，没有卷起。为什么你们现在“以动为身，以动为境”？为什么把这个幻身当身体，把尘境当境界？<br/><br/>　“从始洎终”，从无始以来，直到最后。到哪个最后呢？一直到我们成道，修成佛果为 止。假设我们不修道，不成佛果，就没有终。因为六道轮回没有停止的时候，不会息灭的。我们这个世界即使坏了，我们这些众生也不是就完结了。这个世界灭啦，业缘就把我们牵到 别的世界里去了。在别的世界里还是六道轮回！等那个世界坏了，这个世界又成了，就又转回来了。成、住、坏、空，没有停息的时候，没有终止的时间，没有最后。我们要是用心修 行，证得佛果之后，那就叫终。<br/><br/>　　“念念生灭，遗失真性，”我们都认妄身、认妄境，把虚幻身当成我们自己的身体，把 虚幻境当成我们宝贵的境界，恋恋不舍。心在动摇，生灭不停。“把我们不生不灭的真性遗忘了。在是在，就是不晓得有，在那里“颠倒行事”。众生对自己寂常不灭的本性不晓得了 ，认生灭不停的妄心，搞颠倒了。行什么事啊？那就是造业受报。刚才讲了，见惑思惑就是 邪知邪见。认假的前尘当成真的，才会起贪心造业，造业之后受报，受报就是受苦。故称“ 惑、业、苦”。这不是颠倒吗？蛮好的一尊佛，变成六道众生，这就是颠倒。<br/><br/>　　“性心失真”，什么叫性心呢？就是一切法界的法性，种种东西、种种法相，都是由法 性生起来的。比如前面所说的草叶缕结，叶子是草生出的，草是叶子的体性；结是由缕结成功的，缕就是结的体性。这个缕、这个草，比喻我们的真心，谓之性心。众生把真心遗失了 ，不晓得真心了，认妄为己，把一切有相的东西看成自己了。因为妄执有我，我要这样，我要那样，追逐外境。众生认妄为己，佛是真心所显现。佛的所说所做，都是真心的妙用。差 别就这么一点点。简单地说，众生著相，佛是一点不著相。佛见诸相非相，见一切相都是没有相。<br/><br/>　　众生“认物为己”，执著个东西，于是有了色身。有了色身以后，有“我”就有“我所 ”。我要一切东西，私心杂念，重重无尽。欲望无尽，烦恼无尽，六道轮回就来了，于是“ 轮回是中，自取流转。”什么是“是中”呢？就是客尘当中、烦恼当中、妄想当中、六道当中。因为妄心追逐外境，就轮回在这些当中。“自取流转”，就这样流转不停了。怎么叫自 取呢？自己遗失真性，自己认物为己。因而流转不停，所以叫自取。<br/><br/>　　因为造的业不同，各个众生的受报也是不同的。有些人遇到不顺心的事情，不是怨天就是尤人。哎呀，老天爷怎么没眼睛，我的良心这么好，怎么叫我受这个报应。那个人那么坏，为啥还那么有福！还有人讲：我信佛了，吃素了，命怎么还是这么不好；有的人不信佛，不吃素，却家境好得很。这是啥道理？他不晓得因果通三世，因果不是一世的，你这世做好事，把你前世的罪业减轻了，并不是没减轻。本来等着你的是大苦，这世做事做得好，就可以把前世的恶业减轻一些。人家享福，那是他过去世种的福报，过去世善事做得多。如果这世做坏事，来世也要受苦的。只要做坏事，即使现在不受苦，也会减轻来世的福报，冥冥之中自有减轻。所以不要怨天尤人，都是由于颠倒行事之故。颠倒行事，就会在这当中轮回不已。<br/><br/>　　我们要知道，着相是这样的愚痴。我们从今以后放下万尘，随其环境，晓得这些都是客 尘烦恼。我们认得真主人是不生不灭的。着相的习气生起也不怕，惟一的办法是保任，要与习气斗争。修行实际上是闹革命，不是革他人的命，是革自己的命。我们要先革凡夫的命，凡夫是执著有的，先革掉；再革二乘的命，因落空、偏空也是不对的，空也得革掉；再革菩萨的命，因菩萨还有法见。法见是什么呀？如：度众生有功德了，我能离开生死轮回了，我能成道了……等等，这些都是法见。功夫就是这样做的，勇猛前进，直取上乘，久久行去，就成道了。<br/><br/>　　刚才讲的是第二番显见--动摇名尘，显见不动。主人是不动的，客人来去不停；虚空 是不动的，灰尘一直在动。显示见性不动。下面讲第三番显见--童耄观河，显见不灭。这见性从来没有生灭过，永远不会生灭的。</p><p style=\"text-align: justify;\">（三）童耄观河，显见不灭<br/><br/> 　　“尔时阿难及诸大众，闻佛示诲，身心泰然。念无始来，失却本心，妄认缘尘，分别影事。今日开悟，如失乳儿，忽遇慈母。合掌礼佛，愿闻如来，显出身心，真妄虚实，现前生灭与不生灭，二发明性。”<br/><br/> 　　这个时候，阿难开悟了，诸大众也开悟了。“闻佛示诲，身心泰然”，泰然是轻安、舒畅，一切包袱都放下了。认取真心以后，多么轻快啊，所以身心泰然。“念无始来，失却本心”，想想无始以来不晓得真心。本心是不会失去的，但是你不知道，等于是遗失了。“妄认缘尘，分别影事”，时时刻刻粘着色、声、香、味、触、法。粘尘生心，分别好丑，好的要多得，贪图名利；坏的，怎么取消掉。这些缘影落在八识田里成了种子，致使六道轮回，痛苦不堪。“今日开悟”，今天开悟之后，多轻快。禅宗行人开悟之后，不少人忽然大哭一场，痛哭流涕。多生历劫以来受这冤枉苦，我有这么好的大宝贝却不晓得，堕落尘境，冤枉生死，六道轮回，冤枉，冤枉啊！忽然又哈哈大笑起来，庆快平生啊！<br/><br/> 　　百丈禅师就是这样。百丈禅师和他师父马祖一道游玩，马祖看到一群野鸭飞过，就问百丈：“是什么？”百丈说：“野鸭子。”（追逐前尘）马祖问百丈：“哪里去了？”（慈心太切）百丈说：“飞过去了”（犹不惺惺）。马祖把百丈的鼻子一扭，百丈忍不住喊痛，这喊痛的是什么？百丈一痛之下豁然大悟了。百丈回到寮房哀哀大哭，同参问：“你是想父母吗？”“不是”“被人骂了吗？”“没有”“那你为什么哭啊？”“我的鼻头被师父扭得太痛了。”“因为什么事啊？”“你去问师父。”同参就去问马祖，马祖说：“他心领神会了，你去问问他。”同参又去问百丈：“师父说你心领神会了，叫我来问你。”百丈哈哈大笑。同参说：“你刚才哭，现在为什么又笑？”百丈说：“刚才哭，现在笑。”把同参说愣了。第二天，马祖上堂说法，刚刚上堂，百丈禅师就把席卷起来了，马祖见他把席卷起，就下座回方丈。百丈跟到方丈，马祖问百丈：“我还没说法，你怎么就卷席呀？”百丈说：“昨天让师父扭得鼻头很痛。”马祖说：“你昨天向什么地方用心？”就是说昨天的事你知道落在啥地方吗？百丈说：“今天鼻头又不痛了。”马祖说：“你深明昨日事。”百丈作礼而退。<br/><br/> 　　刚刚哭，现在笑，开悟之后就是这样。多生历劫，宁不冤苦，这不是儿戏呀！“如失乳儿，忽遇慈母”，就象吃奶的小毛头看到了离别的母亲。多么亲切、多么庆快呀。“合掌礼佛，愿闻如来，显出身心，真妄虚实，现前生灭与不生灭，二发明性。”，悟是悟了，但还不太明白，还请如来更明白地开示，这个身心，何真何妄，何虚何实。前面讲见性不动，阿难现在已经悟到了我们的身心有真有妄，肉身虚妄，“见”是真的。虚妄身有生灭，真性不生灭。肉身有生灭，法身不生不灭。但是不晓得身心从无始以来，怎么真，怎么妄；怎么虚，怎么实；怎么生灭，怎么不生灭？这个道理还弄不清楚。就是说，虽然身心有生灭，有不生灭，有真也有假，有虚也有实，不晓得怎么显现出来。希望如来把它显现出来。从哪儿显现出来呢？从真假、虚实、生灭与不生灭，从这相对的两边把我们的真心显示出来。<br/><br/> 　　“时波斯匿王起立白佛：我昔未承诸佛诲敕，见迦旃延、毗罗胝子，咸言此身死后断灭，名为涅槃。我虽值佛，今犹狐疑。云何发挥，证知此心，不生灭地？今此大众诸有漏者，咸皆愿闻。”<br/><br/> 　　波斯匿王有一种迷惑没解决，前面佛的开示触动他的心境，故站起来跟佛讲：我从前没有遇到佛来给我们说法的时候，迦旃延、毗罗胝子（这两个人是外道头子），他们都说，人活着是有，死了就什么都没有了，死后就断灭了，并把这断灭称之为涅槃（我们讲涅槃，是不生不灭。外道的这种讲法，是对涅槃的误解）。我今天虽遇到佛了，但还是很迷惑。狐疑，狐狸是多疑的，狐狸在冰上行走的时候，总是走走听听，听听是否有水流的声音，假如有声音，牠就不走了，怕冰一下子裂开，掉在水里面淹死。前面讲过一个公案，答了一句“不落因果”之后，他自己怀疑了，唉呀！这样答复对不对呀？一疑就是五百世野狐身。<br/><br/> 　　波斯匿王因为迷惑，故请问佛：“云何发挥，证知此心，不生灭地？”请您发挥发挥，把道理说明，让我准确知道这个“不生灭”。并且“今此大众诸有漏者，咸皆愿闻。”现在在座的大众，没有证到无漏阿罗汉果的，都愿意听啊。漏是什么？漏就是烦恼。有漏就是有烦恼。漏含有漏泄和漏落二义：贪嗔等烦恼，日夜由六根门头漏泄流注而不止，叫做漏；烦恼能使人漏落于三恶道，也叫做漏。“诸有漏者”，就是烦恼没有断尽的人。“咸皆愿闻。”都愿意听。<br/><br/> 　　“佛告大王：汝身现在。今复问汝，汝此肉身，为同金刚常住不朽，为复变坏？<br/><br/> 　　“世尊，我今此身，终从变灭。”<br/><br/> 　　佛告波斯匿王说：你现在身体还在。我现在问你，你这肉身是否同金刚一样不毁坏呢？还是会变坏呢？<br/><br/> 　　波斯匿王说：世尊！我的身体到最后还是要变灭、要死掉的。<br/><br/> 　　“佛言：大王，汝未曾灭，云何知灭？<br/><br/> 　　“世尊！我此无常变坏之身，虽未曾灭。我观现前念念迁谢，新新不住。如火成灰，渐渐销殒。殒亡不息，决知此身，当从灭尽。<br/><br/> 　　“佛言：如是。”<br/><br/> 　　佛说：你现在还没有灭，怎么知道将来会灭？<br/><br/> 　　我们要晓得将来的事情有三种办法：一种是推理，像侦探破案一样推理，这个事情怎么做，做了以后结果是什么，推出道理；第二种是比量，以一个事情比方别的事情，从而知道；第三种是经验，过去已经历过的事情，又碰到了，从过去的经验，知道结果是什么。波斯匿王是从推理、比量得出结论。“念念迁谢”是说念念变迁，前念灭、后念生，时时刻刻都在变化迁谢；“新新不住”是说新陈代谢，又“如火成灰”炭火烧起来被风一吹，一层一层剥，灰落火新，剥到后头，一点光炬都没有了，都成灰了。“渐渐销殒”，直至殒亡。不过，念念不住，所以销殒也是“殒亡不息”，永不停息。因此“决知此身，当从灭尽”，很肯定地知道这个身体靠不住，要灭尽的。<br/><br/> 　　佛说，对的。你讲的不错，你从推理、比量而知这个身体是不长久的。经验也有，看看别人好了，张三死了李四哭，李四哭张三那是在哭自己，因为将来自己也还是要死的。对的呀，看看要轮到我了，这岂不是经验吗。根据推理、比量、经验，所以知道身体是不长久的。但是，虽然身体不长久，却有个长久的在。<br/><br/> 　　“大王，汝今生龄已从衰老，颜貌何如童子之时？<br/><br/> 　　“世尊，我昔孩孺，肤腠润泽，年至长成，血气充满。而今颓龄，迫于衰耄，形色枯悴，精神昏昧，发白面皱，逮将不久。如何见比，充盛之时？”<br/><br/> 　　佛进一步问波斯匿王，你现在已从年轻时进入衰老期了（当时波斯匿王已62岁了），你的容貌和形体跟儿童时比较比较，觉得如何啊？<br/><br/> 　　世尊！我在幼儿时期，皮腠（皮和肉之间称腠）滋润而光泽；成年时期我血气充满；现在老了，身体、容貌都变得枯燥憔悴不堪，老眼昏花，头脑不清楚，头发变白，满脸皱纹，所谓“鸡皮鹤发，老态龙钟”，大概是不久于人世了。“如何见比，充盛之时？”怎么能和壮盛之年相比呢？这个地方是说两种变化：一个是时间的变化，一个是空间的变化。年龄是时间的变化，形色、精神是空间的变化。<br/><br/> 　　“佛言：大王，汝之形容，应不顿朽。<br/><br/> 　　“王言：世尊，变化密移，我诚不觉，寒暑迁流，渐至于此。”<br/><br/> 　　佛又讲了：大王，你的形体应该不是立刻之间就变衰朽的。<br/><br/> 　　大王说：对呀，世尊，是渐渐地、慢慢地变化的。比如说此刻指甲长出来一点，头发长出来一点，但都不知觉，都是秘密长的，不是立刻长的。就这样，寒来暑往、一年一年地过去，以至于到现在，老了。<br/><br/> 　　“何以故？我年二十，虽号年少，颜貌已老，初十岁时。三十之年，又衰二十。于今六十又过于二，观五十时，宛然强壮。”<br/><br/> 　　我为什么晓得呢？我二十岁时，虽然还是少年，可颜貌比十岁时已老多了。到了三十岁，又比二十岁衰老了。我现在六十二岁了，看五十岁时，显然要比现在强壮得多。<br/><br/> 　　“世尊，我见密移，虽此殂落，其间流易，且限十年。若复令我，微细思惟，其变宁唯一纪二纪，实为年变。豈唯年变，亦兼月化。何直月化，兼又日迁。沈思谛观，刹那刹那，念念之间，不得停住。故知我身，终从变灭。”<br/><br/> 　　我晓得是秘密移化，不是立刻之间变成这样。虽然我把这个从衰落到死亡的变化，暂且限为十年一个阶段。假如我细细地思考，这个变化何止是一纪才一个变化呢？实际上是年年在变，月月在变，日日在变。“沈思谛观”，如果冷静地思考，仔细地观察，其实是刹那刹那在变，时刻、分秒，念念之间，不停地变。所以我知道我的身体最后要变灭，总是要死的。<br/><br/> 　　细细地思考，一层一层，刹那刹那，是什么意思呢？《仁王经》里讲：一念之间有九十个刹那，一个刹那当中有九百个生灭。刷的一个念头动，就有九十个刹那。有人说了，我哪有这么多生灭，我念头没这么快。那是你没看到，我们的色、受、想、行、识，到最后的识蕴，动作快得吓人，不得了啊！见不到，是没功夫，定力深了就看到动了。到了识蕴湛不摇处（水不起波浪叫湛），你看起来停止不动，其实快的不得了，一念当中九十个刹那，一刹那当中九百个生灭。要有很深的定功才能看见。<br/><br/> 　　“佛告大王：汝见变化，迁改不停，悟知汝灭。亦于灭时，汝知身中，有不灭耶？<br/><br/> 　　“波斯匿王合掌白佛：我实不知。<br/><br/> 　　“佛言：我今示汝，不生灭性。”<br/><br/> 　　佛再开示：你看到变化、迁移、改变，不停地进行，就悟到了你的身体一定会变灭。在这个变迁当中，知道你的身中有不变灭的东西在吗？<br/><br/> 　　波斯匿王合起掌来，对佛讲：我实在不知道。<br/><br/> 　　佛说：我现在指示给你不生不灭的自性。<br/><br/> 　　这变灭，是空间的变灭相；迁改，是时间相。空间、时间都说了。因为时间、空间的变迁，晓得身体会变灭，却不知身上还有不生灭的东西呢。波斯匿王和普通凡夫一样执著前尘，不能离开尘相，忘失了能见之‘见性’。只晓得看外头的东西，把自己主人翁给迷失了。实际上，错误就在这上头。执著外相的时候，忘记自己的主人，不晓得我们在变灭当中有不灭的东西在，这个主人翁实在是一分一秒也没有离开过我们。傅大士说：“夜夜抱佛眠，朝朝还共起。”我们每天每夜都是抱着个佛睡觉，早上起来还和他一道起来。这就是心的觉性，自己就是不知道。这个自性，虽说我们流浪生死也不曾离开过我们一分一秒，一直和我们在一道，可惜你不知觉。我们众生都贪生怕死，最好让我们的身体长住，活长命些。所以到了春节的时候，恭喜你身体健康、长命百岁。实际上我们是无量寿，人却不识。像秦始皇得皇位后就想成仙，就想长生不死。实际上有永远不死的东西在。那么不生不死的东西是不是不能知道呢？不是！比如我们讲第一番显见、第二番显见、第三番显见，就是在显示这个不生不死的东西。后面讲到第四番显见，就越来越清楚了，把这个东西和盘托出。大家都知道了，只是不肯认嘛。并不是不能知道，只是习气污染，深染执著，不肯放弃前尘。人啊，不肯哪，是个大过患呐！<br/><br/> 　　“大王，汝年几时，见恒河水？<br/><br/> 　　“王言：我生三岁，慈母携我谒耆婆天，经过此流。尔时即知，是恒河水。”<br/><br/> 　　佛问：大王何时见到过恒河水？<br/><br/> 　　大王说：我三岁的时候，我的母亲带我去拜耆婆天时，经过这条河流，我就晓得那是恒河水了。耆婆天就是常住天。拜常住天神，保佑长命百岁。<br/><br/> 　　“佛言：大王，如汝所说，二十之时，衰于十岁。乃至六十，日月岁时，念念迁变。则汝三岁，见此河时，至年十三，其水云何？<br/><br/> 　　“王言：如三岁时，宛然无异。乃至于今，年六十二，亦无有异。”<br/><br/> 　　佛说：如大王你所说，二十岁时显得比十岁时衰老。乃至现在六十多岁了，随着年月日时的推移，念念都在迁移改变。但你三岁时所见的恒河水，和十三岁时所见的恒河水，是不是有变化呀？<br/><br/> 　　王言：我十三岁时所见恒河水与三岁时所见的没什么不一样。就是现在，已六十二岁了，所见恒河水还是没什么两样。<br/><br/> 　　“佛言：汝今自伤，发白面皱。其面必定，皱于童年。则汝今时，观此恒河，与昔童时，观河之见，有童耄不？<br/><br/> 　　“王言：不也，世尊。”<br/><br/> 　　真心是没有形象的，没法拿出来给我们看，所谓“言语道断，心行处灭”，用语言不好说明，用思维无法想象，只好打比方。禅宗也是烘云托月，勉强去说也说不到，说什么也没有比这更难说。佛为了给大家解惑，勉强用恒河作比。<br/><br/> 　　佛言：你自己悲伤发白面皱，其面皱于童年。而那个见恒河之“见”呢？比你孩童时见恒河之“见”是不是也像身体一样衰老了呢？<br/><br/> 　　波斯匿王说：不是的，见还是一样的。我现在的见和三岁时的见一样，没有衰老。<br/><br/> 　　这里告诉我们，见不衰老，这个东西是不生不灭的。身体衰老是假相，身体要衰老，要变灭。这个见性，是个真体，不衰老，不变灭。因为它不生不灭，不来不去，不动不摇。今天告诉你，让你晓得，你要自肯承当啊。<br/><br/> 　　“佛言：大王，汝面虽皱，而此见精，性未曾皱。皱者为变，不皱非变。变者受灭，彼不变者，元无生灭。云何于中，受汝生死？而犹引彼，末伽黎等，都言此身，死后全灭。”<br/><br/> 　　佛对波斯匿王说：你的面孔虽然皱了，但这个见精不会皱。能变皱者才是变，见性不皱，就没有变。变者当然要灭了，而不变者哪有生灭呢？所以这个见精云何生死呢？这个见，不会你生他跟你生，你死他跟你死。所以说生来他也没生，死来他也不死，他是不生不灭的。而这个身体不同，这个身体生，能看见他生了；身体死，能看见他死了。<br/><br/> 　　“而犹引彼，末伽黎等”，末伽黎是外道，这个外道讲自然，即自自然然的。“都言此身，死后全灭。”跟前面说的两种断灭外道一样，他们都说，人死了自然就什么都没了。他们说得不对！这见精并没有灭呀。<br/><br/> 　　“王闻是言，信知身后，捨生趣生。与诸大众，踊跃欢喜，得未曾有。”<br/><br/> 　　波斯匿王听了佛所说的话，“信知身后，捨生趣生。”捨生者，就是捨掉这个身体；趣者去也，趣生者，就是到一个地方投胎去了。不是变灭，不是断灭，是六道轮回去了。但这还不究竟，捨生趣生都是业障。要认个捨生趣生就坏了，我的身体死了之后，再投胎吧，这正是六道轮回。更进一步讲，佛菩萨涉生死海以广度众生，这是愿力所致，并非捨生趣生。尽管生而未曾生，虽未曾生而不妨生。<br/><br/> 　　上面讲二发明性,“愿闻如来，显出身心，真妄虚实，现前生灭与不生灭，二发明性。”身体是生灭的，见精是不生灭的。这两边就是二发明性。虽有不生不灭的见性在，我们还要使它壮大起来，从一点点发扬开来。为什么说一点点？因为刚刚见到。有人问，阿罗汉见性没有？罗汉当然是见性了，不是不见性，是见得不彻底，因为他法见未除，还是有无明未尽。他只相当八地菩萨，十地菩萨也还有一分无明在，也还不彻底。我们不能得少为足，临济禅师说“三要印开朱点窄”，三要就是身、口、意，朱点就是心，就是不生不灭的佛性。由于刚刚见到，这“朱点”还“窄”呀，还须要“印开”。印开，就是把它发扬壮大。身、口、意三要，无修之真修，要成为佛果才行。不能象外道一样，才晓得捨生趣生，知道不是断灭，就得少为足。捨生趣生并没有了，还是有漏相。<br/><br/> 　　“踊跃欢喜，得未曾有。”因原来以为是断灭啦，现在晓得不断灭，开心得不得了。<br/><br/> 　　（四）颠倒名失，显见无失<br/><br/> 　　<br/><br/> 　　下面讲第四番显见--颠倒名失，显见无失。<br/><br/> 　　第三番显见讲见性不灭，现在讲见性无失，是说见性不会失掉，不会遗失。这些讲法都是根据他们的疑情来说的。刚才讲见性不灭，是因为外道讲断灭，触起他们的疑情，佛就显示出见性不灭。现在讲见性无失，是根据什么疑情呢？前面佛斥责阿难，说他遗失真性。阿难现在觉得，真性在呀，并没有遗失，怎么佛说遗失呢？现在讲见性无失，就是根据这个疑情。<br/><br/> 　　请看经文：<br/><br/> 　　“阿难即从座起，礼佛合掌，长跪白佛：世尊，若此见闻，必不生灭。云何世尊，名我等辈，遗失真性，颠倒行事？愿兴慈悲，洗我尘垢。”<br/><br/> 　　阿难起疑情了，因为上面第二番显见，讲客尘动摇，见性不动。佛说阿难遗失真性，颠倒行事，认物为己。而在第三番显见，跟波斯匿王讲，见性不生不灭。一个说遗失，一个说存在，所以阿难有疑问了。故从座起，礼佛合掌，长跪白佛，求佛解释：世尊，既然此见性原本不生灭，为什么您斥责我遗失真性、颠倒行事呢？请如来慈悲，洗去我迷惑的尘垢。<br/><br/> 　　实际呢，是阿难错解了佛意，佛说阿难遗失真性，是说阿难迷惑了，不知道有不生灭的真性。既然不知道有，那就好象遗失了一样，并不是真的丢掉了。真性哪会丢掉呢！不知道何为真性，何为虚妄，不就等于是遗失真性，颠倒行事吗？<br/><br/> 　　“即时如来，垂金色臂，轮手下指，示阿难言：汝今见我母陀罗手，为正为倒？<br/><br/> 　　“阿难言：世间众生，以此为倒。而我不知，谁正谁倒。”<br/><br/> 　　佛把手臂垂下来，手指地下，问阿难，你看我的手是正呢还是倒？“母陀罗手”即如前面所说的“百宝轮掌”。其实手哪有正倒呢，这是比喻性的说法，喻行事颠倒。<br/><br/> 　　阿难知道，众生的一切知见都是分析的习惯，故答：世间众生，认为这不是正，而是倒。我不执著这个，不知道怎样算正，怎样算倒。<br/><br/> 　　“佛告阿难：若世间人，以此为倒。即世间人，将何为正？<br/><br/> 　　“阿难言：如来竖臂，兜罗绵手，上指于空，则名为正。”<br/><br/> 　　佛顺着世间的习俗说法，问阿难：世间人以何为正啊？<br/><br/> 　　阿难说：以佛的兜罗绵手上指于空为正。兜罗绵手，就是软绵绵的手，佛的手很软。<br/><br/> 　　其实哪有什么正倒，指上指下都是虚妄，说正说倒都是妄见，是所知障生成的烦恼障。实际上原本没有二障。世上的人，往往没有自己的知见，只是跟着别人跑，附和习俗的知见。习俗知见哪是真实的道理呀！……<br/><br/> 　　…………<br/><br/> 　　（五）八还辨见，显见无还<br/><br/> 　　（六）见性周遍，显见无杂<br/><br/> 　　（七）心能转物，显见无碍<br/><br/> 　　（八）心物一如，显见不二<br/><br/> 　　（九）本无是非，显见超情<br/><br/> 　　（十）非因非缘，显见离见<br/><br/> 　</p></p></div>"
},{
    "title": "壹、见道分——四科虚妄",
    "author": "元音老人",
    "date": "",
    "html": "<div class=\"B1_text\"><p><p style=\"text-align: justify;\">　五、二种妄见<br/><br/>　　（一）别业妄见<br/><br/>　　（二）同分妄见<br/><br/>　　六、四科虚妄</p><p style=\"text-align: justify;\">　　第一科五阴虚妄，本非因缘、非自然性<br/><br/>　　　　（一）色阴虚妄<br/><br/>　　　　（二）受阴虚妄<br/><br/>　　　　（三）想阴虚妄　　　　<br/><br/>　　　　（四）行阴虚妄<br/><br/>　　　　（五）识阴虚妄<br/><br/>《楞严经》卷第三四科虚妄七大本真（空不空如来藏）<br/><br/>　　　第二科六入虚妄，本非因缘、非自然性→点击进入<br/><br/>　　　　（一）眼入虚妄<br/><br/>　　　　（二）耳入虚妄<br/><br/>　　　　（三）鼻入虚妄<br/><br/>　　　　（四）舌入虚妄<br/><br/>　　　　（五）身入虚妄<br/><br/>　　　　（六）意入虚妄<br/><br/>　　　第三科十二处虚妄，本非因缘、非自然性<br/><br/>　　　　（一）色与见二处虚妄　　　　<br/><br/>　　　　（二）听与声二处虚妄<br/><br/>　　　　（三）嗅与香二处虚妄<br/><br/>　　　　（四）尝与味二俱虚妄<br/><br/>　　　　（五）身与触二俱虚妄<br/><br/>　　　　（六）意与法二俱虚妄<br/><br/>　　　第四科十八界虚妄，本非因缘、非自然性<br/><br/>　　　　（一）眼、色、色界，三处都无<br/><br/>　　　　（二）耳、声、声界，三处都无<br/><br/>　　　　（三）鼻、香、香界，三处都无<br/><br/>　　　　（四）舌、味、舌界，三处都无<br/><br/>　　　　（五）身、触、身界，三处都无<br/><br/>　　　　（六）意、法、意界，三处都无</p><p style=\"text-align: justify;\"><br/><br/></p><p style=\"text-align: justify;\">　<strong>　第一科 五阴虚妄，本非因缘、非自然性</strong><br/><br/>　　（一）色阴虚妄<br/><br/>　　…………<br/><br/>　　“若目出者，既从目出，还从目入。 即此华性，从目出故，当合有见。若有见者，去既华空，旋合见眼。若无见者，出既翳空，旋当翳眼。又见华时，目应无翳。云何晴空，号清明眼？是故当知，色阴虚妄，本非因缘、非自然性。”<br/><br/>　　“若目出者，既从目出，还从目入。”你所看到的这个空花如果是从眼睛出来的，既然能够从眼睛出来，当然也就能够再回到眼睛里去。一切事物都是相对而有的， 不光空花是这个样子，别的东西也是这个样子，就是说出与入是相对的。好与坏，长与短，方与圆，也都是相对的。因为有出必有入，同样，有好必有坏、有长必有短，……。假如无入，不能为出，这就是规律，这就是虚妄相貌的规律。正因为如此，所有我们才说一切相都是相对而有的。规律、规格要先把它明确下来，后面的法要依照这个规格说，如果把规格打破了，法就不好说了。<br/><br/>　　为什么说“即此华性，从目出故，当合有见”？因为花性是从眼睛出来的，我们知道眼的性能是能看见色相，那么眼睛生出来的东西，也应该能看物才对。就等于人生出来的是人，马生出来的是马，牛生出来的是牛，同一类生出来的相，跟上一代应该是一样的，那么眼睛生出来的东西也应该有能见的性，也应该能看见呀！<br/><br/>　　“若有见者，去既华空，旋合见眼”。假如花性是有见的，就应该能看见色相，但实际上这个花是顽空，根本没有的，所以不能看见。不但空花如此，就是我们自己种出来的花，也是没有灵性的，是无情物，也不能看见。现在假设这个空中之花是从眼中生出来的，是有见的，所以说“去既华空，旋合见眼”。这个“去”是说花从眼睛出去，到空中了，如果花到了空中，那么应该“旋合见眼”。旋是返回来，因为有出就有入，花从空中返回来的时候与眼睛是相对的，应该能看见眼睛。事实上花能看见眼睛吗？当然不能，所以就说明花不是从眼睛出来的，因为它没有见性。这是第一种从正面假设“有见”的比喻。<br/><br/>　　然后，再反过来假设“无见”的比喻。有见是与无见相对应的，前面证明有见不成立，那么现在再看看无见是不是能成立呢？因为花是无情之物，无情之物怎么会有见呢？如果花是无见的，那么“若无见者，出既翳空，旋当翳眼”。翳是障碍的意思，就是说当这个花出到空中的时候，应该能够翳空，花所在的虚空都将被它所障碍。假如花能够翳空的话，当它反过来的时候，也应该能够翳眼，眼睛有翳就成障碍了，就看不见东西了，这是从反面来说的。实际上花是不是翳眼呢？不是的。其实空中本来没有花，我们是因为眼睛有翳，所以才看见空中有花。看见空中无花的时候，得到的是清净空，说明此时眼睛是好的，是无翳的。眼睛如果有翳，就不会看见空中无花，这就说明没有见花从眼睛出也不成立。因为有出就有入，出的时候他有翳了，那返回之后他还应有翳。眼睛遇障碍之后，看到空中应该有花才对，而现在你的眼睛是清净的，即眼睛无翳，既然无翳眼睛应该看见空中无花，这证明花也不是从眼睛出来的。<br/><br/>　　接下来“又见华时，目应无翳”的意思是，因为花是从眼睛出去的，应该看见花在空中才对。既然华在空中嘛，那眼睛应该是清净的，眼睛不应该有翳呀！但是事实不是如此。看见空中有花的时候，就是眼睛有翳的时候，假如眼睛没有翳，看空中也应无花才对。因为空中实际上没有花，只因眼睛有毛病之故，于是才看见有花。同样两个人，一个眼睛是好的，另一个眼睛有翳，眼睛好的看空中无花，而眼睛有翳的却看见空中有花。假如这个花是从眼睛出来的，当这个花出到空中了，你眼睛就应该清净了。实际上，你看见空中有花的时候，应该是没有分别意识的，是无意的，你并不是有意来证明这个花不是从眼睛出来的。下面再反过来说：“云何晴空，号清明眼？”晴空就是空中无花，清明眼又叫清净眼。为什么晴空叫清净眼呢？清净眼就是眼中无翳，眼睛是好的，既然无翳所以应该看见空中无花。但是现在看晴空的时候，说花是从眼出去的，从眼出去当然还要从眼进来了。当花进到眼睛来的时候，你眼睛应该是有翳的。假如眼睛有翳，那么看见空中一定有花，不会看见空中没有花；假若看见晴空中没有花的时候，一定是清明眼，因为眼睛无翳所以才空中无花。经过正反两方面这样反复推敲证实，说明花也不是从眼睛生出来的，从眼睛出来是不成立的。所以说，当看见晴空没有花的时候，你的眼睛是清净无染的，是没有翳的。<br/><br/>　　前面讲了见这个花时，目应无翳，证明这个花不是从眼睛出来的。后面讲“云何晴空，号清明眼”，证明这个花并没有到眼睛里去。因为有出必有入，既然现在并没有入，从而证明本来就没有出。<br/><br/>　　“是故当知，色阴虚妄，本非因缘、非自然性。”所谓色就是外面一切形形色色的东西，即色相。阴就是说这个色相遮蔽了我们真如佛性的光辉，也就是对色所生起的妄心、妄想。众生之所以会被这些色相影子，遮蔽了自己的真如佛性，就是因为有妄想执着。色阴虽然是无明所生起的虚幻之相，但是它的本体就是我们的真如佛性，没有真如佛性这个本体，我们哪能见到形形色色的东西？我们以前曾经用空中的云做比喻，云本来是没有固定形相的，由于在风的吹拂之下产生流动，因而能显现出猫、狗、狮子等种种相。云的相虽然可以千变万化，可它的本体还是云，这个本体并没有随着形状的改变而改变。我们的真如佛性也是如此，它并不是死在那里不动，而是万能的灵性，能够随缘起各种用。这个万能体不但能够随缘显现人身、猫身、牛身、马身，乃至于能显佛、菩萨身、天人身及种种身。尽管显而无所显，尽管生而无所生，因为它的本体是不生不灭，不变不移的。假如我们的真如佛性不是灵性，那就变成了呆子，变成了砖石瓦块，就不能随缘起作用了。所以说色阴本来就是我们的真如佛性，我们要学会由相而见性，如果看见相就著在相上，那么就变成虚妄了。因此，我们一再说不要跟着相跑，就是叫大家不要著相。比如，当我们看见用金子打成的盘子、杯子时，不要只认盘子和杯子的相，而要认得金体，若只认得相就错误了。金子的形状可以改变，但它的性体不会改变。比如我可以把杯子再打成盘子，也可以把盘子再打成杯子，这些器皿的相能够变来变去，而金子总是一块。我们真如佛性也是这个道理，虽然可以随缘现出各种相，但本体是一样的，没有两样。<br/><br/>　　为什么说是“本非因缘，非自然性”？因缘二字中的因是自生，缘是助生（他生），因与缘合起来就是共生。而色阴是虚妄之相，本来没有，本来没有还说什么生呢？所以是不自生、不他生、不共生。自然性就是无因而生之意，既然色阴根本就是虚妄的，所以也不是无因生。真如佛性本来如此，既没有生，也没有灭，若有所生，那就是因缘性或自然性了。由于不自生、不他生、不共生、不无因生，所以说本非因缘、非自然性。从真如的本体来看，它是生无所生、无生而生的。比如云不管怎样变化，它的本体没有变，它还是一片云，这就是无所生。虽然本来不生，但它不无变化，它能够变成猫、狗、狮子等等形象，这就是无生而生。我们的真如佛性能够随缘起一切妙用，所以叫无生而生。这个无生而生就是虚妄之相，它是由众生的执著而生出来的。假若众生不去执著，那么虚妄之相就变为真如妙性，就是真如随缘起的妙用，我们所现的一切形相，都是真如的妙用。众生之所以在六道里沉沦，坏就坏在执著，如果能够打破这个执著心，那么一切业缘当下就了啦。<br/><br/>　　比如某人家里有一个宝贝儿子，家里人都对他喜欢得不得了，后来这个孩子染了疾病，翘辫子啦（死了）。宝贝儿子死了，大人自然哭得非常伤心。此时你如果对他讲：你的儿子实际上根本就没有死啊！因为这个生就是无生。过去缘生的时候他来了，现在缘灭了，他就走啦。其实不但他的生命根本没有，就连你自己本身也根本没有，你为什么还要执著这个儿子的相呢？他听了以后会说：你的道理讲得很对，可是过去孩子在的时候，给了我们那么多的欢乐，那么多的亲情。现在宝贝儿子没有了，看不见啦，我们怎么能不伤心，怎么能不难过呢？你看孩子的尸首停在这里，他从前活蹦乱跳的时候多好啊，可现在躺在这里不会说，也不会动了，看起来怎能不叫人伤心呢？他就是在这里透不过去。<br/><br/>　　众生惨就惨在妄想执著，如果把妄想打掉，就可以见到自性，就不会再跟着假象跑了。比如我们刚才说的金杯、金盘，它的相可以有种种的变化，但体并没有改变。假如把杯子、盘子熔化了，原来的相虽然没有了，可金子的本质没有改变，还可以将它打成别的东西。众生也是这样，当他在这里的因缘结束了，又会随缘到别的地方去受胎，生灭的相虽然一个接着一个，但是自性的本体并没有动过，这叫根本不变。因为这个根本不曾变易之故，所以说他没有生没有灭。众生错就错在执著，由执著而生出妄想，把虚妄的假相当作实有，于是生灭心就生出来了。假如我们现在回过头来，明白假相就是我们的真如佛性，都是自性随缘显现的妙用，假相虽然有生有灭，而真心之体是寂然不动的，从此永远不再执著假相，就可以透过假相得见真如性体了。性与相是体与用的关系，如果只知“即性是相，”把性变成相，就是众生境界。众生皆因为执著相，念念只见相生相灭，所以不能见性。能够懂得“即相是性，”明白相就是性，就是佛菩萨境界。菩萨因为已经破掉了无明妄相，见一切相无不是妙明真心的显现，于是时时见相就变成处处见性。众生的生死是从哪里来的？就是从著相来的。因为著相之故，所以才会认为我的儿子死了，他离开我了。你的儿子其实没有离开，他的真如心和你的真如心本是一体。自性也叫法身，法身是千佛万佛共一体的，就是说不但佛与佛共一法身，而且佛与众生，众生与众生，也都是共一法身。我们可以用大海的水来比喻法身，大海里的水都是一体，不分彼此，就象法身不分你我一样。海水虽然是一体，但是海面上可以翻起一个个的水泡，每一个水泡就好比是众生的一个身体。虽然海面的水泡看上去彼此互相分离，互相独立，但都是从大海上生起来的，都没有离开大海。众生的身体也是彼此分离，相互独立，但也都是从同一个真如佛性上生出的，没有离开真如佛性。当水泡啪地破了的时候，就重新还灭在大海里头，它的起灭始终没有离开大海。当众生缘尽舍报的时候，他又重新融入真如体中，因为他的真如佛性是如如不动的，他的生死始终不离佛性。生的时候佛性未增，死的时候佛性也不减，这就叫做尽管生灭未曾生灭，尽管去来未曾去来。我们所说的醒悟，就是要明白这点道理。懂得了这个道理，永远不再执着了，就是开悟，就是见性。所以说明心见性并不难，不是非要找个地方关起门来修，也不是非得躲到山里去做功夫。更不是一定要参多少年的禅，或一定要念多少遍的佛，才能开悟。用功不在时间的长短，不管是当下打开，还是参禅、念佛多少年才打开，开悟的情景都是一样的。有句话叫做用功数十年，悟在刹那间。所以说一言之下悟道，与几十年参禅悟道没有两样。所谓悟道，就是要悟得个无心可心！比如参禅讲究起疑情，那我就参念佛是谁，疑情起了。待时节因缘一到，砰地一下疑情打破，于是豁然明了：哦！原来佛性不曾离开我分毫，就在我六根门头放光啊！真是叫踏破铁鞋无觅处，得来全不费功夫。参禅悟道本来并不复杂，打个比方，我们的真如佛性就象一座放满宝物的仓库，现在门被上了一把锁，想进去必须先把门锁打开。于是我们找来钥匙开这个锁，钥匙如果不对（表示我们用错了心）自然打不可，找对钥匙的话，那么锁砰地一声就打开来了，悟道其实就象开锁这么简单。上次我们说早知灯是火，饭熟已多时！因为早知道这灯就是火嘛，就不用到外面去求啥火种了，饭老早就烧熟了。同样的，悟道就在当下！能够彻底放下，一尘不粘，纤毫不染，这就是了。所以说，“本非因缘，非自然性”，就是这么个道理。<br/><br/>　　为什么说生而无生，无生而生呢？因为自性不是死的，不是死在那里不动，如果自性是死的，就成为断灭了。假如没有这个世界，假如自性一点妙用都不起，那么佛教还有什么意义？还有什么积极性呢？我们说佛教是积极的，是入世的，因为佛法就在世间，离开世间去寻找个人的解脱，既不可能，也没有意义。做一个合格的佛教徒、佛弟子，首先要学会做人，这样活在世界上才有意义，有价值。我们懂得了真如佛性的道理，就不能死在那里不动，要学会起妙用，通过自己的努力，用发明创造使众生都生活得幸福美满。所以释迦佛教导我们，在认识自性之后，还要学习五明，因为见性只得素法身，如果想利益众生，就必须再学习其它的知识。五明中的工巧明，就是指自然科学与发明创造，科学越发达，发明创造越多，大家生活的环境与质量就会越好。医方明指的是医术与医药，医术越高明，医药的效果越好，人类的疾病就越少，活得就越健康。<br/><br/>　　但是我们所做的研究，所进行的发明创造，并不是真有，都是缘起性空的，这就叫做生而无生。反过来真空也不碍妙有，虽然一切法的性体本来是空的，但并不妨碍我们去研究和创造，这就叫做无生而生。如果每一个人都是抱着服务社会，利益众生的思想去工作，去发明创造，他就不会有私心杂念，如此人类才会真正幸福和睦。象现在所谓的科学研究，都是从欲望出发，从个人利益出发，发明越多，对社会的消极影响反而会越大。因为我研究出这个东西之后，可以得到多少多少的好处，可以发多大多大的财，可以使得自己吃得好、穿得好、住得好，个人的欲望因此会变得越来越大。从欲望这个出发点来讲，可以说科学技术越进步，所造的罪业就越大。为什么呢？因为物质生活的这种进步，会使大家的欲望变得越来越高，当欲望无法实现，得不到满足时，就会发生矛盾，就会去做坏事。大到国家、民族之间的战争冲突，小到团体、个人之间利害得失，哪一个不与欲望有着直接的关系呢？改革开放以来，我们国家的经济虽然发展很快，但是犯罪率也越来越高，这就是一部分人个人欲望过分膨胀的结果。反过来说，如果我们明白了生而无生、生无所生的道理，知道一切相、一切法、一切心，都是真如佛性的妙用，都是虚幻不实的影子，离开真如佛性根本就空无所有，就不会再去执著，就不会再为一己的得失而不择手段，去做违背天理良心的犯罪勾当。知道一切都是自性的妙用，离开真如佛性根本就无人无我、无得无失，我们就不会再事事从自己的私心杂念出发，而是真正生出利益众生、服务众生、救度众生的深宏誓愿。我们会向佛菩萨发愿，将来我们也要成就象西方极乐世界一样殊胜的国土，愿一切众生都能生到我这个世界，离一切苦，得一切乐，人人皆是一生补处，他日也当作佛，去利乐无量无边众生。这样的人不会再有一点个人的私心，不会再想着自己的愿望实现之后，应该怎样去发财，应该怎样去享受。这样的人不再为个人的得失而烦恼，不再为满足自己的欲望而违法犯罪。所以说佛教对人类社会的进步，有着非常积极的作用，如果每个人都能按照佛陀的教导，规划自己的人生，规范自己的言行，净化自己的心灵，那么这个世界一定会充满了和平、安宁、互助与友爱。<br/><br/>　　现在回到前面的问题。假如说空中的花是自己来的，那么这个花就是自然性。可是空中的花并没有来处，所以不是自然性。假如说空中的花是借因缘而生的，比如从空中生出，或者从眼根飞出，可以说是因缘性。可是它既不从空中生出，也不从眼根飞出，是生而无生的，所以也不是因缘性。既然是根本没有的虚妄相，所以说“色阴虚妄，本非因缘、非自然性”。<br/><br/>　　（二）受阴虚妄<br/><br/>　　“阿难，譬如有人，手足宴安，百骸调适，忽如忘生，性无违顺。其人无故，以二手掌，于空相摩。于二手中，妄生涩滑冷热诸相。受阴当知，亦复如是。”<br/><br/>　　色阴讲过了，现在讲受阴。什么是受阴呢？受阴就是眼、耳、鼻、舌、身、意六根，粘著色、声、香、味、触、法六尘，对着前境领受事物以为心之作用，就叫做受阴。那么这个受阴怎么讲呢？佛为阿难举例了：“譬如有人，手足宴安，百骸调适。”四肢、百骸指整个身体，宴安、调适是说整个身体都很健康、很安适、很舒服，没有任何毛病。这句话是用来比喻清净心的，因为我们的妙明真心原本就是清净的，没有任何染污，就象人的身体四肢百骸都很调和、很舒适，一点毛病也没有一样。什么叫做“忽如忘生，性无违顺？”就是在本来清净无染的心体上，由于一念不觉，而起无明妄动，于是忘记了生平。生平比喻本来面目，就是生无所生的清净心。这是说你因为一念不觉，忽然之间无明妄动，迷失了本来面目，使原本清净的心体受到了染污。违是违背我的意志，顺是符合你的心境。我们的清净心虽然能够现出生灭去来之相，但是这些相都是自性的影子，都是真心的妙用，根本就是没有的，所以叫生无所生。既然是生无所生，一切事相本来都没有的，还有什么违和顺呢？法由心生，众生因为心存妄想，认为一切法、一切境相都是实有的，所以就会有违、顺的觉受。比如在日常生活中，遇到符合自己心意的事情就哈哈大笑，遇到不符合自己心意的事情就怨愤烦恼。其实事情本身并无违、顺，一切违、顺都是从心生的，因为众生都在妄想执著，所以遇事才会觉得有违有顺。我们的妙明真心本来是清净无染的，虽然能够生一切法、起一切用，但它是生无所生。既然原本没有一切相，既然是生无所生，又哪有什么违与顺呢？有违有顺是妄心，是无明所住的妄想境，从根本上说，就是由于真如不守自性，因一念妄动，忘记本来面目，使清净心受到了染污的结果。<br/><br/>　　接下来的“其人无故，以二手掌，于空相摩。”这句话是什么意思呢？无故表示的是无明，无明生了之后，就会处处著相。用手掌在空中相摩，表示著相以后，由于心境相触，于是就领受、接受了前境。当两个手掌在空中互相摩擦，于是生出了冷、热、滑、涩等不同感觉，比如一会儿冷了，一会儿热了，一会儿滑了，一会儿涩了。这种种的感觉就等于我们的心与境相触之后，见到、领受到各种觉受，于是五颜六色来了，是是非非来了，家庭、社会以及世界的各种事情都来了。这种种的相、种种的感受都是虚妄，并不是真有的。所以说“受阴当知，亦复如是。”简单说，就是当心境相触，诸相现前之后，于是我们的心就接受、领受了现前的境相，这就是受阴。<br/><br/>　　受可以分为几种受：一种是苦受，一种是乐受，一种是舍受，一种是忧受，一种是喜受，合起来称为五受。这里的苦受、乐受、舍受，就是我们的眼、耳、鼻、舌、身五根，忧和喜这两个受是意根，实际上都是第六识意根。对这个受我们必须搞清楚，如果能够破掉受阴，不受一切受，就叫做三昧正受，得此三昧就可以灭一切苦。今天有人问我，到了地狱里是不是苦得不得了？当然了，地狱里的苦不是我们所能想象的。那么苦到底是什么呢？根本就是你的妄想啊！其实身也好、心也好、境也好，本来都是虚妄的，根本就没有。可是当你的妄心生起来的时候，你就认为一切东西都是有的。于是当你看到刀砍在你虚假的身体时，你就会疼得不得了；当你看到油浇到你虚假的身体时，你就会烫得不得了。其实一切苦乐的感受都是假的，都是你的妄心生出来的。假如你心空了，这些东西根本就没有。你如果能够不受一切受，那么地狱也和天堂一样！不然的话，菩萨又怎么能到恶道里救度众生呢？比如地藏王菩萨发愿要庄严地狱，救度一切地狱众生，如果他不能灭掉苦受，他自己都苦得不得了，还怎么救度众生呢？再比如调达，他因为多次想谋害释迦牟尼佛，结果堕入了地狱。后来佛让阿难去问他，问他在地狱里感觉如何？他说我这里一点苦也没有，就如同享受三禅天之乐。调达这个魔王怎么会这样呢？因为魔王也有力量，他可以不受这个苦受，足以见一切东西都是随我们的心而生啊！所以我们说不是一悟就一了百了，还要做功夫，就是要锻炼不著这个相，让自己的心真正空净下来，心能空净就能起大用。<br/><br/>　　众生因为有妄想，因为执著相，所以一点痛就疼得不得了。我们的心如果真的空了，那么一切苦乐降临时，都不能使我们动摇。就象禅宗二祖慧可禅师临终说的：“将头临白刃，犹如斩春风。”这个不只是说说玩的，他因为受人诬陷，真的被杀了头！但是砍头对他来讲，就像斩春风一样，一点事也没有，因为他的心真空净了，他根本就不受这个受。据《法华经》上介绍，以前在日月灯明佛出世的时候，有一位众生喜见菩萨（药王菩萨的前身），为了报佛恩，他发出大愿，要用自己的身体来做供养。他先服食香油和香料，让自己的五脏六腑都变得清爽、干净，然后在身上涂上香膏、香脂，再用布裹起来浇上香油，最后把整个身体点燃起来，作为献给佛的供养。他是活的时候用自己的身体来供养，不是死了以后去供养，他为什么能这样做呢？就是因为心已经真的空净，已经真的成道了。所以我们做功夫就应该向菩萨学习，也要把自己锻炼成这个境界才行。<br/><br/>　　讲到悟道，首先要悟到一切相皆是我真心的显现，皆是自性所起的妙用，皆是虚妄不可得的，否则就不是真正见性。因为只有不著相才能见性，如果明白相就是性，无相可得就是性，就可以时时处处见性。所以开悟之前讲修行，都是盲修瞎练，因为你不知道什么是妙明真心，不管怎样修也不能成道。开悟以后由于已经知道什么是真如佛性，已经识得根本了，修行才能上路，所以说悟后修方是真修。见性以后不是马上即可了手，还要锻炼身心，勤除习气，因为众生多生历劫以来著相惯了，习气一下子扭转不过来，需反复清理打磨才能消除净尽。这部《楞严经》上就说：“理属顿悟，乘悟并销；事须渐除，因次第尽。”开悟之后见惑当下就断了，但是思惑不能一下子断尽，还要有一个渐渐除灭的过程。有人问什么是悟后的真修呢？所谓悟后的真修就是要学会观照好自己的心，照顾好自己的念头。倘若心著相了，跟着念头跑了，马上凛觉：著什么相啊！那是妄心，不许著相！就这样与妄念做斗争。经过成千上万次的斗争，由一开始的念起不觉，到念起能觉，由觉而不能转，到一觉即转。这个练心的过程就好比炼钢一样，先用矿石炼出铁水，这好比是见性。但是刚出炉的铁水只是生铁，里面还有许多杂质，还需再经过千锤百炼，才能把顽铁炼成精钢，这好比是悟后保任。顽铁炼成优质钢，就可以收藏起来以便随时使用，比喻功夫纯熟了，就可以随缘自在，随时起用。所以悟道之后只要不放逸、不懈怠，在事境上反复历练身心，久而久之心念自然就扭转过来了。你看从前那些祖师，个个在事境上把得定，脚跟立得稳，他的功夫不是从外面跑到身上的，都是这样练出来的。象刚才说的慧可禅师，他把法传给三祖以后，时常出入酒肆等污秽场所，别人看见就问他：你一个出家人怎么能来这种地方呢？他说：“我自观心，关汝何事？”象他那样的大祖师还不忘在事境上继续磨练，我们这些后来人就更要好好用功了！做功夫不是一朝一夕的事，不是早上打一坐，夜里再打一坐，就万事大吉的；更不是早晚做做功课，唱念敲打一番即算数的。<br/><br/>　　修道的第一步是先要悟道，首先要知道哪个是你的真心，知道什么是真心以后才好修行。比如你要为国家、为社会培养人才，首先得有个小孩子，如果没有小孩子你培养谁呀？如果你找来的不是小孩子，而是小猫、小狗，培养了半天又有什么用呢？所以第一步先得有个孩子。仅仅有了婴儿还不行，因为他现在太小了，什么都还不能做，还得养育、调教才能长大成人。修行也是如此，初悟道只是素法身，还需长养圣胎才可以起妙用啊！我上次讲过，大鹏金翅鸟一飞九万里，全靠脚下这一点点力，如果没有脚下一踏之力，它就飞不起来。脚下一点地就相当于悟道：哦！自性原来如此啊！见性以后再绵密保任，久而久之自然就成功了。所以说修行要有诀窍，找不到诀窍去盲修瞎炼，譬如煮沙成饭，必然终无所成。<br/><br/>　　一说到苦和乐，有的人就会说：哎呀！这个东西落到我身上苦得不得了，就象到了地狱里。或者说：哎呀！碰到这样的事情真高兴，简直就象到了天堂一样快乐。实际上所谓的苦与乐，根本就是假的，根本就没有这个东西。为什么呢？因为这些苦乐的感受，都是根尘相对之后，起心去分别接受它，才有苦、乐之分。假如光有五根，假如根对境不生心，哪里还有苦受、乐受呢？比如眼根见色生眼识，这个眼识就是心，不是只有乐受才是心。同样耳根听到声音生起耳识，分辨这是什么声音，这个耳识也是心。所以，眼、耳、鼻、舌、身表面看起来是根，根与境相对之后生起识，这个识不是心是什么呀？实际上根就是识、识就是根。同样，根是心，识也是心，心与根、识不能分开。<br/><br/>　　五受中的前三受，苦受、乐受、舍受是根，后面的忧受、喜受是心。众生之所以会感到有痛苦、烦恼，就是因为有这五受，只要受阴一破之后，我们就可以解脱一切苦厄，就能够起妙用。我们曾经听说过达摩祖师吃毒药的故事，他吃了别人下的毒药，为什么毒不死呢？就是因为他已经破了受阴，一切苦乐、一切毒害他都可以不受。在达摩祖师从印度来中国之前，我们这里的出家人修的都是渐次禅，象天台止观一样，要研究教义，立文字相，从四禅八定这样一步一步修上去。而达摩祖师传的禅宗不讲渐次，没有次第，没有加行，所谓直指人心见性成佛，是一步即可登天的圆顿法门。因为禅宗是教外别传，以前翻译过来的经典里都没有讲到有这么个法，所以当时的佛教界对他很不满意，说他是魔王说法。达摩祖师想，既然你们的根器不够，传法因缘暂时不具，那么我就先躲起来，于是躲在嵩山的石室里闭关。以后慧可禅师找到他，跟着他学禅，这样禅宗才慢慢被人们所接受，向他求法的人才渐渐多了起来，这样一来又得罪了许多人。因为来的人以前是跟着别的法师学习的，现在陆续跑到达摩这里，原来的师父弟子少了，吃不到供养了，于是对达摩怀恨在心，派人在他的饭里下毒，想把他毒死。但是因为达摩祖师心已经完全空净了，你就是下了毒，也毒不死他。这是真功夫，不是假说的，需要多锻炼才能成就。<br/><br/>　　在禅宗以外的其他教派，都说成佛需要历经三大阿僧祗劫，在断尽了见、思、尘沙、无明等惑业之后，才能成就。而达摩祖师却说成佛没有那么麻烦，只在一问一答之际，一棒一喝之下，可以让人立即成佛。难道成佛真的这么容易吗？他讲的是真的还是假的呢？教下都对这个道理一直弄不明白。现在我讲个公案给大家听听，在北宋徽宗皇帝年间，有一次当朝太尉请诸山长老来家开无遮大会（无遮就是尽情而说，乘兴而谈。有人错解了，说无遮大会是把衣服都脱光了，就叫无遮了，这是不对的）。与会的不但有各门各派的尊宿大德，连徽宗皇帝也身着青衣小帽亲预其会。<br/><br/>　　会上有华严座主出来问道：“以我们教下讲来，要成佛须经三大阿僧祗劫，你们宗下却讲一棒一喝即能证道，这和佛所说的大相径庭，不能使人无疑。今宗下大德在此，如一喝能透得过贤首五教，则能使大家信服棒喝确有此功效。如透不过五教，则所谓棒喝能使人成道者，便同魔说。敬请宗下大德来开示愚蒙。”<br/><br/>　　当时临济宗大德圆悟勤禅师也在座，他听到华严座主提出的问题，即以目视净因成禅师，成会意（净因因为年轻，在诸位长老面前不好自己出来，现在得到圆悟的授意，这才站了出来），于是对大众说：此问题很简单，不值得前辈长老解答，就由我少长老来试答吧。要透贤首五教，须先将五教教义立明，以免下喝时混淆不清。所谓五教者：<br/><br/>　　①小乘教：小乘著有，以有法可修，有道可成，有生死可了，有涅磐可证为义；<br/><br/>　　②大乘始教：破小乘的有，乃真空绝相之理法界，以一法不立、一尘不染为尚；<br/><br/>　　③大乘终教：以非空非有为义，空有双非，乃空有皆不住之事法界；<br/><br/>　　④大乘顿教：以即空即有为义，空不碍有，有不碍空，乃空有双运之理事无碍法界；<br/><br/>　　⑤大乘圆教：以非空而非有，非有而非空，圆融无碍为旨，乃佛祖心髓之事事无碍法界。<br/><br/>　　成举罢问座主：“这五教宗旨是否如此？”座主曰：“如是，如是。”成曰：“既如此就听好了，我这一喝要透过五教。”于是大喝一声，问大众：“听到了吗？”大众说：“听到了。”成曰：“那么是有了，可以透过小乘。”过一会儿声音没有了，成又问大众：“你们现在还听见这一声喝吗？”大家说：“听不见了。”成曰：“那么是空了，可以透得过大乘始教。”<br/><br/>　　成又曰：“现在没有声，而刚刚是有的，这是非空；刚刚是有，而现在没有了，这是非有。现在无声是非有，刚才有声是非空，非有和非空都是因为我这一喝之后，才能这样讲，如果没有这一喝，又怎么能这样讲非空非有呢？所以这一喝能透过大乘终教。”<br/><br/>　　接下来是顿教的即空即有。所谓空是在我喝了一声之后，喝没有了，没有即是空。这个没有不是凭空没有的，是因刚刚有过这一喝，现在才能说没有，倘若没有这一喝，现在又怎么能说没有呢？这个“没有”是因为“有”才说没有的，这样一来“没有”不就是“有”吗？所以说空就是有，有就是空。空和有是相对而有的，不是绝对的，一就是二，二就是一。说有之时，有非是有，因空而有。同样，说空之时，空非是空，因有而空。离空即无所谓有，离有亦无所谓空，这就是即有即空。那么这一喝，又可以透过大乘顿教了。<br/><br/>　　最后说大乘圆教非空而非有、非有而非空。“我一喝不作一喝用，做一切事毫无去留、粘染。终日吃饭，未曾咬着一粒米，终日穿衣，未曾挂着一丝纱。不动身心而日应万缘，端拱无为而妙用恒沙。说无之时，周遍法界，说有之时，纤毫不立。诸子百家，百工技艺，莫不如此。此大乘圆教圆融无碍之旨也。”大众闻后，莫不信服赞叹，在座的徽宗皇帝也点头不止。<br/><br/>　　这里最要紧的就是一喝不作一喝用，你不要执著在这一喝上，喝就是没喝。同样的，我们吃饭就是没有吃饭，穿衣就是没有穿衣，做事就是没有做事。所以，吃饭的时候不要百种计较，穿衣的时候不要万般挑剔。不管做什么事情，做了即同于没做，不要执著在上面。众生就坏在执著上，见什么都执著为实有，那就上当了，就要造业受报。一喝不作一喝用，不是没有喝，而是不执著喝、不留碍喝，喝了还同未喝。如此即可周遍法界，你融摄我，我融摄你，彼此交参无碍。就象屋内的这几盏灯，这个灯的光，和那个灯的光，光光相摄，你中有我，我中有你，彼此无碍，叫周遍法界。《华严经》在讲周遍法界的时候，用镜子做比喻，拿十面镜子互相映照，这个相貌照在这面镜子里，那个相貌照在那面镜子里，镜子再照镜子，象因陀罗网一样，彼此交参，重重无尽。所以说一喝中即有五重玄义，是有而非有，非有而有；空而非空，非空而空；非空而非有，非有而非空，一喝即可透过贤首五教。非但一喝如此，连同法界中的一切现象，连同社会上的一切学说，也都是如此。假如我们懂得了其中的道理，就会发现面前的一切事物，不管是男女老少、饮食起居、山河大地、有情无情，也都是重重无尽，彼此交参无碍。只要你心不住相，就可以不受一切受。受阴破掉了以后，就有这样的妙用。<br/><br/>　　“阿难，是诸幻触，不从空来，不从掌出。”<br/><br/>　　阿难，这些虚幻的感觉、触觉，既不从空来，也不从掌出。你不要以为两手在空中相摩擦，所以冷、热、滑、涩这些触觉就一定是从空中来的，或者是从手掌出的。为什么呢？因为冷、热、滑、涩这些感觉都是幻觉，不是实有的。假如不是幻觉，为什么要摩擦之后才有，不摩擦就没有了？象这样摩擦即有，不摩擦即没有，就等于魔术师变幻出来的东西一样。我们看魔术师在表演魔术的时候，可以变幻出鸡、鸭、鸽子等很多东西，变幻出来的东西用的都是障眼法，并不真的从无中生有变出来的。下面就证明为什么这种触觉既不从空来，也不从掌出。为什么是幻有，而不是实有。<br/><br/>　　“如是阿难，若空来者，既能触掌，何不触身？不应虚空，选择来触。”<br/><br/>　　假如冷、热、滑、涩的触觉是从空中来的，既然能触动你的手掌，为什么不触动你的身体呢？因为我们的整个身体都在虚空当中，不光是手掌，包括面孔、躯干、头脚等等，都在虚空当中。如果触觉是从空中来的，那么不光能够触手，而且应该触身，因为虚空是无情，不能选择相触的位置，这就证明不是从空出了。为什么这样说呢？因为这与我们前面说的受阴一样，都是变幻来的，既不是从色来，也不是从心出，根本就不是实有的。<br/><br/>　　“若从掌出，应非待合。又掌出故，合则掌知离则触入。臂腕骨髓，应亦觉知入时踪迹。必有觉心，知出知入。自有一物，身中往来。何待合知，要名为触？”<br/><br/>　　假设冷、热、滑、涩的感觉是从手掌出来的，那么就不需要用两只手去摩擦，它自己出来好了，与摩不摩擦没关系。然而实际情况却是磨擦之后才生出来感觉，如果不摩擦就没有感觉，所以证明不是从手掌本身出来的。　　又假设触觉是从手掌出来的，当两手合起来摩擦的时候，手掌才有知觉，才知道冷、热、滑、涩。那么两手离开之后，冷、热、滑、涩的触觉应该进到手里去了，就像我们刚才讲的空花一样，有出必有入才对。假如冷、热、滑、涩的触觉是从手掌生出来的，那么当两手不摩擦的时候，这个触觉应该回到里面，不但手掌能够感觉得到，包括手臂、手腕，乃至最里面的骨髓，也应该知道它的踪迹所在。如果触觉有往来行踪，那么“必有觉心，知出知入。”一定要有一个知觉心，能够感觉到它的进出才对。<br/><br/>　　假如真的如此，那么“自有一物，身中往来。何待合知，要名为触？”既然冷、热、滑、涩的触觉是从手掌出，也是从手掌入的，那就说明这个触觉是从身内往来的。如果是身内往来，那么与两手的相合摩擦即没有关系，又何必要等两手合在一起摩擦才有知觉？又何必要将这个知觉名为触觉呢？假如你磨擦之后，冷、热、滑、涩从手掌出来了，那么不摩擦之后，冷、热、滑、涩又进到了手掌里面，可以说这种感觉是从手掌生出来的。可你现在的感觉并不是这样，你并没有感觉有冷、热、滑、涩在手臂进出，这就证明不是从手掌出来的。<br/><br/>　　“是故当知，受阴虚妄，本非因缘、非自然性。”<br/><br/>　　经过前面的论证，证明受阴既非因缘性，也非自然性，根本就是虚妄的。为什么这样说呢？所谓自然就是有自体。能够自体成就的事物，是自然性。假如说触觉是从空中自然而来的，可以叫自然性，但它不是从空中来的。所谓因缘就是没有自体。靠内外因缘和合而生的事物，是因缘性。假如说触觉是从手掌中出来的，以手掌为因，以磨擦为缘，那就是因缘性，但实际上它不是从手掌出来的。既不从自然生，也不从因缘生，所以不是实有，根本就是虚妄之相。既非因缘，亦非自然，就是不自生、不他生、不共生、不无因生。所谓无生而生、生无所生。这个生无所生就是妙真如性，这个无生而生就是我们妙明真心的妙用。我们讲，执著就是虚妄，不执著就是妙用，差别就这一点点。你不执著，才是灵明妙用，你若执著，那就死掉了，就不能得自在解脱。<br/><br/>　　受阴到这里讲完了，下面再来讲想阴：<br/><br/>　　（三）想阴虚妄<br/><br/>　　现在讲想蕴，这个妄想很不好。我们修行就是要打破妄想，把一切扫干净，不要执着在心上，盘旋不去。假如我们的妄想没有了，马上就可十方虚空同时消殒，这个五浊恶世就变成清净世界，我们就有意生身能够十方国土随意去来。所以我们用功要掌握诀窍，第一要紧的就是开悟，明白道理之后，时时绵密保护，同自己的妄想、妄念、妄心作斗争，把这妄想打破，妄心就转为清净心，就得自在受用了。<br/><br/>　　《楞伽经》说有三种意生身。第一种就是三昧乐正受意生身。我们刚说三昧耶是不受一切受。把受阴和想阴都打破，这时候内心会感到无比的清净、轻安，明晰的不得了，不受一切受，所以叫三昧乐正受。由于不受一切受了，意生身就出来了。这有一个自然的过程，不能用心去求。如果你想出阳神，去做气功，那个危害会很大的。为什么呢？做气功的人都是先执着个气在身体里盘旋，转得久了，就会因为有这个妄想而时时着在上面，一遇惊吓，气就不通啦，会出大毛病。<br/><br/>　　还有就是拔苗助长。这个气还没通，就硬要叫它通，这样也会出毛病。从前苏州有个名医，许多人都请他去看病，其中有个人的病很奇怪。医生问他：“你这个是什么毛病呀？”那人说：“我这不是一般的毛病，药医不好。我这个是练气功练的”。医生说：“哎呀！你是虚火偏高，真的是药医不好的”。所以这个医生就写了一篇文章，劝大家不要这么练气功，弄得虚火出来，就不好办了。<br/><br/>　　这还是小毛病，有的人真的把阳神炼出来了，刚出来的阳神看上去就象是个小孩，他走出去被其他人瞧见：咦！这是什么地方来的小孩子呀，我们来吓吓他，放个炮仗，嘣！一吓，小孩噗地飞掉了，后来我们得知这个人出了毛病，他的阳神回不来了，人就变成痴子、傻子了。这样不行啊！为什么你炼阳神出了这么大的偏差？那是由于你不知道真如佛性才是自己的本命元辰，光有神通没有用，因为你还在着相，所以生死不能了。<br/><br/>　　我们说悟道没什么奇特玄妙，一开始的时候什么都没有。等到你保任做得圆熟了，把妄想断光，心里面真正什么都没有了，你不要它出来，它自然就来了。意生身是第七识的影子，这个第七识上面平时盖满了各种尘垢，贪嗔痴慢疑等等、等等，都覆盖在上面，它出不来。当你把尘垢打扫干净了，六根清净不受一切受，第七识上面的盖障拿掉了，它自然就出来了。佛教和道教不同，道教认为阳神是通过修炼生出来的，我们佛教讲的是本来如此，是本无所生的。这个真如佛性众生同具，不从外来。虽然无生，但是能生一切法，因此叫无生法忍。<br/><br/>　　我们讲开悟，当下这一悟，就是无生法忍。不要说，哎哟！开悟了怎么没有一点玄妙奇特啊，我还是这个老样子嘛，因此不敢承当。不敢承当就不知道起妙用，就好比发了财之后要学会去用，不然还是穷小子。学会起用就是脱胎换骨，不再是从前的凡夫俗子了，因为凡夫总是时时处处在着相。开悟以后，人依然还是旧时人，只是不在旧时行履处，从前的一切都改过自新了。<br/><br/>　　“阿难，譬如有人，谈说酢梅，口中水出；思蹋悬崖，足心酸涩。想阴当知，亦复如是。”<br/><br/>　　什么叫想呢？我们上次讲过，根对境接触之后，所生的种种相出现在心上，当境已经灭掉了之后，相还在心上盘旋，叫想阴。想包括回忆从前、悬想将来两种情况。因为所想皆是虚妄，终归没有什么道理，所以叫妄想。妄心、妄念、妄想这三个东西，是全然不同的。妄心是根本，因为无明不觉，执著前尘，就是妄心；妄心与尘相对，念头动了叫妄念；妄念著在这个相上了，盘旋不去，即为妄想。<br/><br/>　　既然讲到想阴，就要证明想阴虚妄不实。吃过梅子的人，都知道梅子是酸的。当以后再谈说梅子的时候，嘴里就有口水流出了，其实你并没有吃到梅子。如果想到自己站在悬崖峭壁上，马上要跌下来的样子，你的心就会慌乱，腿就会发抖了。<br/><br/>　　想阴也不是实有，都是妄想啊！<br/><br/>　　“阿难，如是酢说，不从梅生，非从口入。”<br/><br/>　　我们谈说酢梅，嘴里就有水出。这个水不是从梅子生出来的，因为你并没有吃梅子嘛；非从口入，也不是从嘴进去的。这个口中水出的现象，都是想阴的作用，是我们思想的法尘。它既不是从真如实相生出来的，也不是从真心进去的，它由于无出无入之故，所以是妄想。<br/><br/>　　“如是阿难，若梅生者，梅合自谈，何待人说？”<br/><br/>　　为什么说酸不是从梅子生出来的呢？如果这个酸是从梅子生出来的，那梅子自己说好了，何必要人说呢？如果梅子自己说了，那么可以说这个酸是梅子生出来的，可梅子并没有没说，是人说的。所以这是妄想啊！<br/><br/>　　“若从口入，自合口闻，何须待耳？”<br/><br/>　　假如是从嘴进去的，这张嘴就应该能听到声音，还用耳朵作什么呢？<br/><br/>　　“若独耳闻，此水何不耳中而出？”<br/><br/>　　假如只有耳朵能听见，这个水为啥不从耳朵里流出来呢？<br/><br/>　　“想蹋悬崖，与说相类。”<br/><br/>　　上面的两个例子，一个是吃梅子，一个是思蹋悬崖，道理都是一样的。即不是从嘴生，也不是从眼生，都是妄想哦。<br/><br/>　　“是故当知，想阴虚妄，本非因缘，非自然性。”<br/><br/>　　因为是不从梅生，不从口入，所以这个不是因缘性，不是自然性。假如这个酸是从梅子生出来的，应该叫自然性。那么既然不是从梅子生的，当然非自然性。假如这酸是从嘴进去的，可以叫因缘性。可是这酸并不是从嘴进去的，也非因缘性。所以说非自然，非因缘，还是妄想哦。<br/><br/>　　同前面的道理一样，生即是无生。这想阴就是如来藏性，因为如来藏性是生无所生，所以想阴本身也是生无所生。虽生无所生，但是也不无，嘴里有酸水出来，这是生，虽然生而不可得。这就是真如佛性的妙用啊！但是我们也不要执着它，一执着就变成妄想，就糟糕了。<br/><br/>　　想阴之后再讲行阴：<br/><br/>　　（四）行阴虚妄<br/><br/>　　“阿难，譬如暴流，波浪相续，前际后际，不相逾越。行阴当知，亦复如是。”<br/><br/>　　行阴比想阴还厉害，它川流不息，有如江河之水，滔滔流个不停。“大江东去，浪淘尽，千古风流人物！”在这个永不停息的浪潮中，千古人物都如过眼云烟，我们人生也是这样没有一分一秒地停留，由小而少，由少而壮，由壮而老，由老而死，每一刻都在不停的变化，行阴就是如此。我们身体里面血脉流转，呼吸循环，也都是行阴。它就象山洪暴发时的暴流，从上灌注而下，没有丝毫停息的时候。我们这个业报身，犹如后浪推着前浪，这个身体坏掉了，那个身体又生出来了，就这样六道轮回无有息时。行阴的第一个特点，是川流不息，永不停顿，第二个特点，是前际后际，不相逾越。就是前后波浪接踵而来，不互相跳过。好比我们的身体，是由小、少、壮、老这几个阶段，依次顺着走下去的，不可能出现前后跳跃的情况。同样我们的业报身，也是一个接着一个来，不可能这个业报身还没有坏，后一个业报身已经起来了，所以叫不相逾越。还有一种夺胎的情况，就是我这个身体还没死，另外一个胎胞已经形成了，那是别人的识进去了。等我这个身体死了之后，再从另外一个胎胞里把别人的识赶走，自己进去，这也是不相逾越的。所以“前际后际，不相逾越，行阴当知，亦复如是。”<br/><br/>　　这个行阴如果断了，我们就能得到第一种意生身，即前面说的三昧乐正受意生身。我们的自性，本来就是一个能起种种变化的万能体，无边广大的神通，是通过见性以后一步步证得的。所以讲到功夫，就在我们当下这一悟，假如不悟这个真如本性，后面的都不能得。神通有几种，一种是报通，就是过去世用过功夫，做过善行，积累功德，报给你的。一种是修通，用种种方法修来的，密宗里就有很多这样的法。还有妖通、依通，依靠一个什么大将、天神，或者妖精鬼怪附在你的身上，把神通给你。凡是修来的、求来的神通，都靠不住，一口气断了，就什么都没有了。所以我们不能执着神通，一有贪恋，还是妄想，念念凝滞，不得解脱。真正的神通是证得的，如果我们内心清净无染，无修无得无证，最后证到这个本来如此。这样用功，阴魔就不会发生。第二种意生身叫觉法自性性意生身，第三种意生身叫种类俱生无行作意生身。<br/><br/>　　佛教的一切行门中，明心见性是最重要的，如果不见性，任你修什么法，都是盲修瞎炼。<br/><br/>　　“阿难，如是流性，不因空生，不因水有，亦非水性，非离空水。”<br/><br/>　　流性就是水哗哗地在流淌。这个流性不是因空才有，也不是因水才有，但是它“亦非水性，非离空水”。流性为啥不是水的性呢？水性的特性是湿，而不是流，假如流性就是水性，下面讲到当水不流的时候，应该不叫做水，而是叫它作流了，所以水性不是流性。但是这个流性既不离空，也不离水。离开空，堵塞住了，水就流不过去。空与塞是对待、相对讲的。这个世界的事物都是相对的，都不是真的。水离不开流性，流性也离不开水，如果离开了水，哪里还有流呢？这就是不即不离，亦不即水，亦不即空；亦不离空，亦不离水。我们的自性，就有如此的妙用。<br/><br/>　　“如是阿难，若因空生，则诸十方无尽虚空，成无尽流。世界自然俱受沦溺。”<br/><br/>　　假如流性是因空而有的话，则诸十方无尽虚空，就都变成无尽流了。因为流性是空中生的，那么此空 能生流性，彼空也能生流性，整个虚空都生流性，所有世界都成了水世界，一切生物都要淹死了。所幸现在不是这个样子，水是水，空是空，没有成无尽流，这就证明流性不是因空而生的。<br/><br/>　　“若因水有，则此暴流性应非水，有所有相，今应现在。若即水性，则澄清时，应非水体。若离空水，空非有外，水外无流。”<br/><br/>　　假如这个流是因水而有的，它就不应该是水性，而是流性，就应该有一个所在的地方。假如流性是由水生出来的，从这一个东西生出另一个东西，它就需要另外有个地方。譬如大人生出一个小孩，那么一大一小就是两个人，他们要占两个地方。这个流性如果是水生出来的，那么离水之外就是别有一个流性，它应该另外有个相貌、有个所在，也就是“有所有相”。 如果“有所有相，今应现在”，它就应该有个所在，你应该能拿出来给我们看看。现在这个流性在什么地方呢？事实上离开水，就什么都没有了，因此说不是因水才有的。<br/><br/>　　所以世尊又说：“若即水性，则澄清时，应非水体。”假如这个流性就是水性，那么这个水澄清不流的时候，应该不是水的体，而是流的体了。但现在水不流的时候，我们看到的依然是水，不是流。 就象面前这个茶杯，里面装的是水，而不是流。我们上面说过，流性是以不停地流动为体，水性则是以湿润为体，所以水性不是流性，流性也不是水性。当水静止不动的时候，是水体，而不是流体，所以说流性不是水性，它们的特性是各自不同的。再进一步说，假如离开空，离开水，还有流性吗？就是“空非有外，水外无流”。空之外没东西，离空别有是不可能的，而离水之外，也找不到流，所以是不即不离。<br/><br/>　　“是故当知，行阴虚妄，本非因缘，非自然性。”<br/><br/>　　假如说流性是实有的，它就是自然生，离空离水，自有自体。既然离空离水没有流性，因此也不是自然生的。所以说不是因空因水而有流性，不是因缘生；不是离空离水而有流性，也不是自然生。既非自然，也非因缘，所以是生而不生，不生而生，这就是妙真如性。但是不能执着，执着即是妄想，就变成行阴了。<br/><br/>　　下面讲五阴中最后一阴--识阴：<br/><br/>　　（五）识阴虚妄<br/><br/>　　“阿难，譬如有人取频伽瓶，塞其两孔，满中擎空，千里远行，用饷他国。识阴当知，亦复如是。”<br/><br/>　　这识阴之识，就是识别、了别、鉴别。这是什么东西，那是什么东西；这个是红的，那个是黄的；这是长的，那是方的；这个是男，那个是女。因为有了别，所以名识。<br/><br/>　　有一种频伽瓶，它的样子就象西方极乐世界的迦陵频伽鸟，通常别的瓶子只有一个孔，这个瓶子有两个孔，喻色体两空。假如有个人把瓶子的两个孔塞起来，里面装满了虚空，拿在手上，“千里远行，用饷他国”。跑到别人那里去说，你看我把虚空拿到你这里来了。满中擎空表示背觉，用饷他国表示合尘，这是表示我们违背正觉，合到尘劳上去。以为虚空可以装走，拿到他国去，这是做不到的。虚空到处都是一样的，你装也装不走，搬也搬不动。这一点不觉，就是无明妄动。这里告诉我们识性是周遍圆满，尽虚空、遍法界的。为什么叫识阴呢？你现在取那么一点虚空装到瓶子里，把这一小部分当成是整个识性，这就叫识阴了。识性就是我们的真如佛性，它没有方所，众生迷而不觉之故，认为在身内，等于瓶子里装着的那点空，认为整个虚空都装在里面，大家都迷在这里。阿难一上来回答，心在什么地方？在我身体里面，那么这就是识阴，这就是妄心了。把瓶孔一塞，拿着各地方跑，这就表示把真如实性封闭在身体里，在六道里轮回呀！<br/><br/>　　比方说，你忘了大海这个水体，而误认当中的一个泡泡为实体，叫迷海认沤。取瓶中之空，而把十方大空扔掉了，这就是识阴，结果就六道轮回。用饷他国，所以叫合尘。识阴就是这样虚妄不实，我们不要做这个痴心事。尽虚空、遍法界，正是我自己本身，自身当中所有东西都是我的妙性，自心所显现的一切都是妙用。不要认为自己聪明得很，我装个瓶子就把虚空带走了。只认取身体里面的那点知觉性，那就变成识阴了。能够弃一浮沤去拥有大海，不再迷著自己的身体，这个识阴当下就打破了。这是佛为我们打的比方、做的妙喻。所以“识阴当知，亦复如是”。<br/><br/>　　“阿难，如是虚空，非彼方来，非此方入。”<br/><br/>　　那么这个虚空是不是从他方世界来的呢？不是从他方世界来。是不是从此方入呢？也不是从此方入。虚空没有来去相，没有动摇相，既装不进，也带不走。这就证明了我们的识性是不来不去、不动不摇的。所以你尽管六道里轮回，它不受六道生死，虽然往生西方极乐世界，而亦无来去之实体。因为实无所来，亦无所去，所以“生则生矣，去则未也；去则去矣，生则未也”，也可以说“生则决定生，去则实不去”，从而彻底打破生灭来去之相。假如说这个虚空从彼方来，就等于是这个佛性从诸佛世界来投胎了，那么佛界就有所减，众生界就有所增。但是佛界实无所减，众生界也实无所增，所以不是从彼方来。假如从此方入，那么众生界就有所减，佛界就有所增了。可是众生界并未减少，佛界也并未增多。它是在圣不增，在凡不减，本来如此的，所以说一切众生本来是佛。这里就证明虚空不从彼方来，不从此方入。<br/><br/>　　“如是阿难，若彼方来，则本瓶中，既贮空去，于本瓶地，应少虚空。”<br/><br/>　　世尊进一步问阿难，假如这瓶中之空，是从他方世界装来的，这个瓶子原来所在的世界中，虚空应该少一块。但是彼方的虚空并未缺少，这个空是装不走的，所以证明不从彼方来。这就表示众生的识性，不是从真如佛性――正觉世界所带来。它是无来无去，不动不摇，生而无生，妙用恒沙的。以下世尊又再换一个方面说：<br/><br/>　　“若此方入，开孔倒瓶，应见空出。”<br/><br/>　　假如这空不是从彼方世界带来的，而是从我们这方面装进去的，那我们开孔倒瓶，应当看见有个空倒出来，但是因为无入之故，所以没有空出。如果我们转迷成觉，既没看见我们众生的世界少了一点东西，也没见佛的世界多了一点东西，不见有众生成佛，因为众生本来是佛，所以是成无所成，无修无得无证的。假如执着有所成，那就是法障，被法见障住了。成而无可成，得而不可得，所以不见空出。就是说众生成佛时，并不是把众生的心都收回了，因为妄心就是真心，扔掉妄心，真心也不可得啊！真妄只在一念间，你执着了外面的色相，就是妄；悟到相就是性，舍迷还觉，就是真。觉醒就如同开孔倒瓶，但是不见空出，就是不要还掉妄心。如同水起了波浪，把波浪还掉了，水也不可得，所以说不舍众生之心。<br/><br/>　　我们之所以不舍妄相，因为妄就是真，相就是性。并不是有个佛可成，也不是有个什么东西可得，我们只要把执迷的心拿掉就行了，所以说是无修无得无证。假如我们能够不再执着，知道这一切都是妄相，就可以随缘起用，在在处处都感到快乐，当下就生到极乐，不是等死了以后才生西方极乐世界呀！<br/><br/>　　“是故当知，识阴虚妄，本非因缘，非自然性。”<br/><br/>　　因为这个识阴，不从彼方来，不从此方入，既不是自生，也不是他生，所以是非因缘性。离开瓶子，没有瓶子的空相可得，再比如这个盒子是空的，离开盒子，盒子的空相还有吗？也不可得，所以是非自然性。因为非因缘、非自然，所以是无生而生。无生而生，是虚妄之相；生而不生，就是妙真如性。色、受、想、行、识这五蕴，从法相宗来说，其中的色属于色法，受、想、行、识是属于心法的。法相宗是讲开合的，在这里叫合色开心，也就是说色比较少，说心比较多。因为人们的迷惑不一样，有的人迷心，有的人迷色。对于迷心比较厉害的人，讲合色开心，说色法一，说心法四。实际讲来，五蕴中的受想行识固然是心，因为离心无受，离心无想，离心无有迁流不息，离心无有分析了别。若是更详细地讲，色法也是心法，因为色与心相对，色就是心，心就是色。色非自色，因心故色，心非自心，因色故心，心与色是当体不二的。假如只有色，没有心，心不成立，色从何来？<br/><br/>　　因为心是对色而生的，所以说因境故心。假如我们说，这个色属于根，就是眼根、耳根、鼻根、舌根、身根这五根。如果这根可以说是色尘，那么，不仅意根，其他五根都能了别，眼睛能看东西，耳朵能听声音，都有了别识。这样看来，根就是心。所以离色之外没有心，离心之外也没有色，心与色无所谓开，无所谓合，这是《楞严经》上所讲的道理。法相宗讲心与色是有开有合的，他的观点与《楞严经》有抵触，所以有的唯识家反对《楞严经》，说它是伪经。所谓识者就是根对境之后，识到心里去了。六根对六尘吸收这个境像，成为一种识，这就叫六识。<br/><br/>　　在法相宗看来，意根对法尘，所以是心法，其余五根都是对外面的色尘，因此皆是色法。若照这样说，六个都是色法，因为第六意根也有浮尘根，否则不能生识。色是具四大种性的，没有根，就不能起作用。既然第六识也有浮尘根，那么以根来说，统统是色法，不应说是心法。也就是以浮尘根来说，统统是色法；以所生起的识来讲，统统是心法。这里的确有些分别，所以要说开说合。由于《楞严经》与法相宗的说法有些不同，因此就引起纷争，但真理愈辩则愈明，假如不争不辩，怎么会有百家争鸣呢？</p><p style=\"text-align: justify;\"><strong>　　第二科 六入虚妄，本非因缘、非自然性</strong><br/><br/> 　　接下来讲“六入”。六入是什么？实际上就是“眼、耳、鼻、舌、身、意”六根。为什么“根”又叫“入”呢？因为六根对六尘（色、声、香、味、触、法）的时候，就吸收了尘境，从而生出六识（见、闻、嗅、尝、觉、知）。所谓“入”者就是吸入尘境。现在不讲六根，而讲六入，是什么道理？由于六根对六尘，称为“十二处”；根对尘生识，称为“十八界”。讲完六根，接着就讲十二处、十八界。现在单讲六根，根能吸入尘境，故称“六入”。六根与六入实际上是一回事。根对尘的时候能够把尘境吸收进来，从而产生识。从根对境生识这方面来讲就是六根，从吸收尘境的作用来讲就是六入，二者并不是两个东西。<br/><br/> 　　“复次，阿难，云何六入？本如来藏妙真如性。”<br/><br/> 　　六入为什么说是如来藏妙真如性呢？这个道理不难懂。前面我们已经讲过五蕴，六入的破析方法与五蕴的破析方法其实相差不多。根对境的时候，吸收了尘境，这就是入。尘境全是虚妄，它并不是实有。比如我们以前举过的例子，白云生出的苍狗相其实是假的，但云是真的。可是白云也未离开苍狗相啊。所以这种相本来就是真如佛性。众生由于着相之故，忘记了真如佛性；佛菩萨不着相之故，明了即相是性，明白什么是如来藏妙真如性，就会知道这一切相都是我们的本来面目。这里先总的讲六入，下面分开来讲眼、耳、鼻、舌、身、意。<br/><br/> 　　首先讲眼入：<br/><br/> 　　（一）眼入虚妄<br/><br/> 　　“阿难，即彼目睛，瞪发劳者，兼目与劳，同是菩提瞪发劳相。因于明暗二种妄尘，发见居中，吸此尘象，名为见性。此见离彼明暗二尘，毕竟无体。”<br/><br/> 　　眼入是怎么一回事呢？佛说就象眼睛一直望着空中，瞪久发劳，时间久劳累了，就会看见空中有花。这是表明我们一念不觉，无明妄动，因无明妄动之故，而生出种种妄见。但是妄也不是实有，也是从如来藏妙真如性而来，所以说“兼目与劳，同是菩提瞪发劳相”。不但空中之花是劳相，我们眼睛也是劳相，根与尘同是妄相，并不是实有。打坐用功的人都知道，妄心不动的时候，非但妄境没有，而且幻身也没有，整个身体都融化掉了。非但坐着用功时身体不可得，就是在动作当中，若心不动，这身体也不可得，这是真真实实的事情。假如你的心当下空掉了，你这个人就没了。虽没有这个人，但路照样走，事照样做。好象在梦中走路，在梦中工作。假如走到了那个地方，或者事情做好了，会忽然之间生出一个念头：哦！到了。果然是到地方啦，或者事情已做好了。因此说，如果真的做到心外无物，一直走路也不会感到累，一直做事也不会疲劳。因为没有人在走路、没有人在做事呀！这叫做无心而应，虽然照样应缘接物，但我并没有应物之心，因此遍尘刹而不劳，做再多的事情也不会烦恼。所以说：这个眼睛看见的相，统统都是菩提瞪发劳相，也都是我们的妙真如性生起的妄想。<br/><br/> 　　“因于明暗二种妄尘，发见居中。”本来没有能见所见，是因为有明有暗才有了能所的见，可以见到光明，可以看见房间里有这么多东西。没有光明的时候，就都变成了黑影、暗相。离开明相暗相之外，还有什么东西可见呢？实在没东西可见。在这里，明暗表示我们的四大：地、水、火、风，其中火大是明相，地水风是暗相。四大，其实就是明暗两个妄相。我们的身体是四大假合之身，我们的眼、耳、鼻、舌、身、意这六根，也无一不是由四大和合而成。对于四大妄尘，因为一念不觉、无明妄动之故，现起四大的影子。我们所见的四大影子，就是由明暗二相产生的。明暗二相生起之后，粘湛发见，把我们湛然不动的真心粘在里面。所以憨山大师说：净色根是无明壳。相宗说净色根是四大促成的净相，由地水火风相促而成、还没妄动的清净之相。因为眼睛看不到，所以有人说，相宗的净色根是无实质的。憨山大师则说：这是一个无明壳。<br/><br/> 　　四大所促成的无明，力量很大，把我们的真心裹在这个躯壳里，叫粘湛发见。经上说“因于明暗两种妄尘，发见居中”，由明暗之相促成四大，把我们的妙湛真心裹在当中，发出能见的性和所见的相来。这个见是妄见。“二种妄尘，发见居中，吸此尘象，名为见性。”妄见发生之后，因为有见分、有相分，借助明暗，就见种种相了。所有一切相都是尘劳，它遮住了我们的心光，就象灰尘遮蔽镜子上的光明一样，这就叫做见性。这个“见性”并不是我们平时讲的见到真如妙性，是指我们能看见一切东西的性能，相当于眼识。<br/><br/> 　　“此见离彼明暗二尘，毕竟无体。”这个能见之见，离开明暗二相，并无一个实体。我们的净色根与浮尘根，都是因为一念不觉，妄动使然。由于尘劳妄相遮蔽，认取少分四大作为自己的身体，其余的四大就成了山河大地、日月星辰。在执着身体之后，就有我见我所，能见所见都随之而来。眼睛等对境能吸收尘境，吸进来的东西都是妄想，都是劳相，都不是实有的。地、水、火、风这四大，如果没有我们的见性在里面，是无法生起和合相的。见与四大是分不开的，假如只有四大没有见性，即不能发见。色与见和合在一起，就能够吸取尘相，就能生起种种妄相。这里说的见性等于是识性，不是真如佛性的那个能见之性。这个见性就象水中的波浪一样，波浪是水因风而起的，离风则无波无浪。所以眼根、眼入等，都是由境风而起的劳相。“此见离彼明暗二尘，毕竟无体”啊。<br/><br/> 　　“如是，阿难，当知是见，非明暗来、非于根出、不于空生。”<br/><br/> 　　因为是劳相之故，不是真正有个实体，所以要知道，这个见既不是从明来，也不是从暗来，既不是从眼根生，又不是从空中来。为什么这样说呢？因为这个见虽然能见明见暗，但它不是从明暗来的。明暗只是一种劳相。比如说我们用眼睛看物，离开眼睛就看不见东西，但是这个见不是从眼根生出来的。前面讲得很清楚，假如见是从眼睛出来的，那么回过来应该能看见眼睛。假如见是因眼睛而有，那么人死了眼睛还在，为什么不见呢？见不是从眼睛来的。也不是从虚空生的。假如见是从虚空生的，应该是虚空有见，而你自己不见，现在并不是虚空有见，而是你有见，所以也不从虚空生。下面再分开来讲，为啥不是明暗来？为啥不是眼根来？为啥不是空中来？以辨明这个道理。<br/><br/> 　　“何以故？若从明来，暗即随灭，应非见暗；若从暗来，明即随灭，应无见明。”<br/><br/> 　　为什么说不从明暗来呢？假如说眼睛的见是从明来的，就不应该看见暗，“应非见暗”，暗来了见就应该灭掉。假如这个见是从暗来的，“明即随灭，应无见明”，那么明来的时候，我的见就应该灭掉，就不应该见明了。你现在暗来见暗，明来见明，所以证明眼入不是从明暗生起的。<br/><br/> 　　“若从根生，必无明暗，如是见精，本无自性。”<br/><br/> 　　假如是从根生出来的（这里的眼根不是指净色根，而是指浮尘根），则必无明暗。因为龙生龙，狗生狗，我们这个浮尘根的眼睛，它本身既没有明、也没有暗，那么眼睛所生出来的东西当然也没有明暗了。这就叫做“若从根生，必无明暗”，因为根没有明暗，由根所生出的东西，当然也没有明暗。譬如我们现在暗也没有，明也没有，暗的时候是见黑影，明的时候分别诸色相。假如既没有明，也没有暗，你见什么啊？这时候你连见性都没有。连见的性能都没有，还说什么见呢？。所以说“如是见精，本无自性”，更无所生。这里说的见精并不是指我们的真如佛性，前面讲过的那个见精是八识体。现在说的这个见精是指能见东西的本体，既然连这个能见的本体都没有，还说什么有能见之性呢！既然没有能见与所见，那么，所说的见精、见性，也不可得。<br/><br/> 　　“若于空出，前瞩尘象，归当见根。又空自观，何关汝入！”<br/><br/> 　　假如说见是从虚空出来的，我们向前能看见种种境象、尘劳，那么，回过去又该看见什么呢？因为有去必有来，有出必有回，出去了就一定要回来。若这个见是从虚空出来的，它出来时看见尘相，回去的时候，就应该看见眼根了。如果这样，“又空自观，何关汝入”。假如说人能看见自己的眼根，是虚空看到的。那么，这只关空的事，不关你的事啊！现在的事实是，不是空看见，而是你自己在吸收尘境，是你自己看到许多东西。这就说明，见不是由空产生的。<br/><br/> 　　“是故当知，眼入虚妄，本非因缘、非自然性。”<br/><br/> 　　由是之故，这个眼入不是明暗生，不是根生，不是空生，它是无生的。既然无生，它就既不是因缘，也不是自然。假如说它从明暗或空中来，那可以说是因缘生；假如说它离空、离明暗而来，那可以说是自然生。但离空、离明暗并没有这个眼入，所以说也不是因缘，也不是自然。这就证明，眼入是一种虚妄不可得之相。<br/><br/> 　　前面十番显见的时候，是用十种说法显出这个见精，而没有详细去讲耳、鼻、舌、身、意。由于道理相通，用的是举一反三方法，通过说眼，把其他五根也都比喻在里面了，所以比较简单。现在六入就讲得比较详细，六个东西依次都分别讲了出来。<br/><br/> 　　下面讲耳入：<br/><br/> 　　（二）耳入虚妄<br/><br/> 　　“阿难，譬如有人，以两手指，急塞其耳。耳根劳故，头中作声。兼耳与劳，同是菩提瞪发劳相。因于动静二种妄尘，发闻居中，吸此尘象，名听闻性。此闻离彼动静二尘，毕竟无体。”<br/><br/> 　　讲到耳入，世尊就比喻：有个人用两手指堵住耳朵，急急地把两个耳朵塞牢。由于耳根感到劳顿的缘故，头中就会嗡嗡作声。嗡嗡响就是劳相。“兼耳与劳，同是菩提瞪发劳相”，耳根与劳相，两样都是菩提的瞪发劳相。瞪是用眼睛看，现在讲到耳朵为什么还要说是“瞪发劳相”呢？因为这六根，本是一精明，分为六和合。“眼、耳、鼻、舌、身、意”都是八识的精明，在六根上起用。佛在这里用“瞪发劳相”同时代表“见、闻、嗅、尝、觉、知”，所以下面所讲都是用“瞪发劳相”。这就告诉我们由于一念不觉，无明妄动之故，而生出山河大地、日月星辰，以及根身器界等种种尘劳之相。所有这些身体与境界，都是菩提无明不觉而起的劳相，叫“菩提瞪发劳相”。<br/><br/> 　　“因于动静二种妄尘，发闻居中。”眼睛视物指的是明与暗，那么耳朵听声指的就是动和静，声音就是震动嘛。我们在听的时候，有声音是动，没有声音是静。我们的听闻性是依靠动静，也就是依靠有声无声而起。假如离开动静，离开声音的有无，听闻性在什么地方呢？当然就没有了。这就证明听闻性是假的，都是我们的妄知、妄觉，不是真实的。听闻性如果是实有，那么，离开动的时候，也应该有声；离开静的时候，也应该无声。可实际上离开动静，离开这有声、无声，就连“听闻”也没有了。由于这个动静二相之故，“发闻居中”。前面讲眼的时候说“粘湛发见”，现在讲耳就说“粘湛发闻”。意思是说无明的力量，牢牢地拖住我们这个妙湛不动的真心，粘在动静二尘之中，而引发起妄想。在这动静二种妄尘当中，就“发闻居中”，发起我们的妄听来。吸收这个尘相，把它当作听闻性。我们人呀，专门喜好分别，吸收这个尘相，执着这个尘相：哎呀！这个声音好听得不得了！那个声音吵闹得不得了！跟着动静的尘相转。合己心意就哈哈大笑，不合己意就忧愁苦恼，妄见就这样起来了。这个听闻性就是耳入，它“离彼动静二尘，毕竟无体”。<br/><br/> 　　“如是，阿难，当知是闻，非动静来、非于根出、不于空生。”<br/><br/> 　　这里的比喻与前面一样，这个听闻性不从动静中来，也不是从根出的，又不是从空来的，为什么呢？下面就为我们讲道理：<br/><br/> 　　“何以故？若从静来，动即随灭，应非闻动；若从动来，静即随灭，应无觉静。”<br/><br/> 　　跟前面明暗的道理一样，假如听闻性是从动生出来的，那么声音静止的时候，你不应该闻静，不应该听出“没有声音”。假如是从静生出的，就不应该听到声音，即使有声音也应该听不到。可实际上不是这样，当有声音来了，我们会辨别出是什么声音，没有声音的时候，我们也能感到安静。<br/><br/> 　　喜欢清静的人，当一点声音都没有的时候，他会觉得很舒服。不好静的人，就会觉得压抑，要有点声音，动动、跳跳才开心。所以一切事物本身是没有好坏的，都是我们自己的分别心在起作用。因此说，苦受、乐受都是从心生出来的。是因为心有取舍，才有苦、乐的感受。符合你的心意，你就感觉到是乐受；不符合你的要求，你的感受就是苦受。比如，现在的小青年们喜欢跳舞，在公园里开着录音机，跳得很起劲。年纪大的人看到，就会说：哎呀！不好，不好。所以说，尘境本身是没有苦、乐之分的，有苦有乐的是你自己的心，是你的分别心生起的呀！这苦、乐、喜、忧的感受，无一不是你分别心的作用。<br/><br/> 　　耳入能闻动静，叫做听闻性。它既不从动生，也不从静生。如果从动生的话，就不应该闻静；假如从静生的话，也不应该闻动。可事实并不是这样，所以说，这不是由动静而生的。<br/><br/> 　　“若从根生，必无动静，如是闻体本无自性。”<br/><br/> 　　这个根是不是从耳朵生出来的呢？耳朵本身既没有动，也没有静，它如果能生出东西，当然也是既没有动、也有没静。没有动静的耳朵，生出来的东西却有动静，这是不可能的。既然没有动静，就没有能听的自体。六根都是四大假合来的，若无动静，就连耳朵这个自体都不会有的。<br/><br/> 　　毗舍浮佛说：“假借四大以为身，心本无生因境有。”我们本来没有身体，借了点儿四大假做身体。既然没有身，自然也就没有心。心是因境界才有的。反过来说，境也无生因心有。境本来也没有，是因心才有的境。所以说境就是心，心就是境，心与境是一体，而不是两个东西。以前我们常说：你们不要分唯心、唯物，实际上心就是物，物就是心，它们本来是一体。<br/><br/> 　　从耳根所生的，就没有动静。既然没有动静，又哪里有听闻的自性可得呢！<br/><br/> 　　“若于空出，有闻成性，即非虚空。又空自闻，何关汝入！”<br/><br/> 　　假如耳入是从虚空中生出来的，虚空能听到声音就是虚空有闻性。虚空如果能听到声音，它就不是虚空了，而是属于实体了。没有东西才叫虚空，假如有个能闻之性，就有了东西，就不成其为虚空了。<br/><br/> 　　“又空自闻，何关汝入！”假如说虚空能听见声音，那是虚空自己听见的，跟你不相干。可现在的事实不是这样，不是虚空能听见，而是你阿难能听见，所以它不是虚空生的。<br/><br/> 　　“是故当知，耳入虚妄，本非因缘、非自然性。”<br/><br/> 　　因此应该知道，耳入虚妄不实，本来没有这个东西的，它既不是因缘生，也不是自然生。比如今天这里有个杯子，它就是由因缘生的，因为杯子没有自体，不是本来就有的，而是由其它条件和合而有的，所以不是自然生。佛说：“因缘所生法，我说即是空”，讲因缘为的是破自然见，破除以为事物是自然而生这个虚妄不实之见。我们认为的实体，从根本上讲都是虚妄不实的。既然虚妄不实，还有什么好执着的呢？<br/><br/> 　　不管遇到顺的、逆的境界，听到好的、不好的事情，我们的心都不应该跟着动。真正见性的人，即使在极为聩闹的环境中，他的内心依然是清净的，因为他不受这个声尘，不受一切受，所以不觉得烦杂、吵闹。但是初开始打坐用功的人，应该选在安静的环境中修行，因为他的定力不够，听到别人说话会随语生解，心就跟着跑了。我们每个人都是着惯了尘相，平日里总是跟着境界跑，很难一下子就改过来。所以要按观世音菩萨教的耳根圆通的方法，“反闻闻自性”，慢慢可以把习气转过来。我们在这个尘世上，就应该这样做功夫，这样做出来的功夫，才是真功夫。</p><p style=\"text-align: justify;\">　　下面讲鼻入：<br/><br/> 　　（三）鼻入虚妄<br/><br/> 　　“阿难，譬如有人，急畜其鼻。畜久成劳，则于鼻中，闻有冷触。因触分别通塞虚实，如是乃至诸香臭气。兼鼻与劳，同是菩提瞪发劳相。因于通塞二种妄尘，发闻居中，吸此尘象，名嗅闻性。此闻离彼通塞二尘，毕竟无体。”<br/><br/> 　　急畜其鼻，就是用鼻子极快地、极频繁地呼吸，久了就会生出劳相。就象我们的眼睛，目不转睛地看久了会生出空花一样，我们的鼻子也会“畜久成劳”，就会有一个冷的感触。因鼻根有感触之故，就能分别出通塞虚实来。呼吸通畅，就是“通”就是“虚”，不通畅，就是“塞”就是“实”。<br/><br/> 　　“如是乃至诸香臭气，兼鼻与劳，同是菩提瞪发劳相。”鼻根不仅能感触通塞虚实，还能感触香、臭的气味。通的时候能闻到气味，塞的时候就闻不到气味啦。香与臭、通与塞、虚与实都是劳相。乃至你的鼻根，也统统都是菩提妙心的“瞪发劳相。”<br/><br/> 　　我们曾经讲过，六根本来是通用的，因为被眼、耳、鼻、舌、身这五个色根罩住，就有界限了。《心经》说：“无眼界，乃至无意识界”，必须把这个界打通。怎么打通呢？就是息下妄心。妄心息了之后，本来就只有一精明，也就是第八识，所以诸根是能够互用的。这里讲瞪发劳相，是因为妄心在里面动，所以鼻根只能起嗅气味的作用，只能用来辨别香臭，而不能起其它作用。在这部《楞严经》里，是用一根来代表其它几根，下面都讲瞪发劳相，就是用眼根来比喻其它几根，因为生起劳相的道理是一样的。鼻根因为有了通塞的尘劳相，粘湛发闻，就把我们妙湛不动的觉性，用无明的力量粘在里面。这个无明的力量非常大。所以憨山大师讲，如果不是无明的力量，还有什么东西能够把真心裹在躯壳里面呢？<br/><br/> 　　因为鼻根有通有塞，“发闻居中”，能够闻到各种气味，妄觉就由之而产生了。吸收尘象的功能叫嗅闻性，专门闻外面的气味，闻到香的就欢喜，闻到臭的就厌恶，于是种种尘劳之相就来啦，这些都是执着。所以说“此闻离彼通塞二尘，毕竟无体。”这个嗅闻性离开了通塞就不能发闻，不能发闻就没有鉴别和区别，自然也就生不出分别心来，因此它是虚妄不实的。我们的眼根、耳根、鼻根，都是因为无明不觉，无明壳粘在里面，所以粘湛发见、粘湛发听、粘湛发闻。因为无明是通过粘着我们这个圆妙真心来起作用的，妄见生起之后就映现出了四大，由执着四大就集成我们的根身。我们的根身，包括眼、耳、鼻、舌、身、意，都是由妄见粘滞在色相上，由色尘集聚而成的，因此叫“集色成根”。<br/><br/> 　　“当知是闻，非通塞来、非于根出、不于空生。”<br/><br/> 　　应该知道，这个能嗅香臭的闻性，不由通塞产生，不是从根出，也不是从虚空生出来的。<br/><br/> 　　“何以故？若从通来，塞则闻灭，云何知塞；如因塞有，通则无闻，云何发明香臭等触。”<br/><br/> 　　为什么这样说呢？<br/><br/> 　　假如这闻性是通畅产生的，那么当塞牢不通的时候，闻性应该灭掉了，你怎么还能知道是塞牢了？如果是塞牢才能生出闻性来，那么你的闻性应该只闻塞，“通则无闻”，通的时候就不应该闻到这个通了。那么通的时候，那些香气、臭气你又怎么能分辨呢？“云何发明香、臭等触？”事实上我们的鼻子能够闻到香臭的气味，这就说明闻性不是从通塞产生的。<br/><br/> 　　“若从根生，必无通塞。如是闻机本无自性。”<br/><br/> 　　假如是从鼻根生的（这里讲的根全是浮尘根），由于鼻根并无通塞，那么它生出的闻性，也应该没有通塞。可是现在我们之所以能闻，是需要借助通和塞的。通的时候能闻出香臭，塞牢的时候，就什么都闻不到，离开通塞你还有闻性吗？所以说“如是闻机，本无自性”，闻机就是能闻的机体，它是没有自性可得的，离开通塞根本就没有闻。<br/><br/> 　　“若从空出，是闻自当回嗅汝鼻，空自有闻，何关汝入。”<br/><br/> 　　假如闻性是从虚空中来的，那么它回过头来，就应该能够嗅你的鼻子。如果嗅到你的鼻子，那是“空自有闻，何关汝入”，虚空自己闻到气味，不关你的事情，你不应该知道。但是现在不是那个空知道香臭，气味是你闻到的，所以说闻性不是从虚空来的。<br/><br/> 　　“是故当知，鼻入虚妄，本非因缘、非自然性。”<br/><br/> 　　因是之故，就证明了鼻根能闻到香臭的气味，本来就是虚幻不实的。因为首先它没有自体，其次它既不是从通塞来，也不是自然所生。通塞生出来的叫因缘，离通塞生出来的叫自然。既然它不从通塞来、不从自然来，所以是虚幻不实的。也就是但有妄名，而无实体。<br/><br/> 　　讲个公案：有一天沩山禅师对弟子们说：老僧百年之后，在山下施主家投胎做一头水牯牛，右胁上写几个字：“沩山僧某甲”。在那个时候，你若喊我沩山僧，我是一头水牯牛，你若喊我水牯牛，我写的是沩山僧，你喊我什么呢？<br/><br/> 　　他在考验学人。有人就说：我知道，我就喊沩山水牯牛好了。<br/><br/> 　　其实答错了，为什么呢？因为一切名相都是虚幻不实的，你喊沩山水牯牛，就被他罩进名相里去了，还是没有跳出这个圈子，要跳出这个名相才对。宗下的手段就是这样，把手铐脚镣放在你面前，看你怎么去套。你说沩山水牯牛，那么好，手铐脚镣就统统带上了，因为你着了假相。<br/><br/> 　　后来有一位祖师说得好：“师无异名”，不跟你说什么名字，你没其它的名字，你也没离开这个名字，这样答就妙了。<br/><br/> 　　但是这个问题是不是只有一个答案呢？当然不是，随便你怎么说，横说竖说都可以。他这样是就体来说的，你反过来可以这样说：“闲名从来满五湖。”这些东西都是闲名，都是虚假的，都没有无实体。“从来满五湖”，非但你沩山僧，非但你水牯牛，这宇宙当中，世界之内，形形色色的一切东西，哪一样东西不是我们的真心啊？<br/><br/> 　　以上讲的是第三个鼻入，下面讲第四个舌入：<br/><br/> 　　（四）舌入虚妄<br/><br/> 　　“阿难，譬如有人，以舌舐吻，熟舐令劳。其人若病，则有苦味；无病之人，微有甜触。由甜与苦，显此舌根不动之时，淡性常在。兼舌与劳，同是菩提瞪发劳相。因甜苦淡二种妄尘，发知居中，吸此尘象，名知味性。此知味性，离彼甜苦及淡二尘，毕竟无体。”<br/><br/> 　　舌头和眼睛一样，也有瞪发劳相。舌头一直舐的自己唇吻，舐久了就会有劳相生出来。什么样的劳相呢？假如这个人有病，嘴里就会有苦味；如果没有病，就会觉得有点甜丝丝的。苦与甜的感觉，二者都是劳相。舐了就有甜有苦，不舐就无甜无苦，可以显示出当舌根不动的时候，有个淡性常在。世界上的妄相，都是相对而来，若无相对也就没有妄相。甜与苦是相对的，它们两个与淡来比较也是相对的，当舌头不动、没有舐得发劳的时候，有个淡性常在。<br/><br/> 　　“兼舌与劳，同是菩提瞪发劳相”。同前面讲的一样，苦甜这些劳相，乃至你的舌根，都是妙明真心中的尘劳之相，和眼睛生起瞪发劳相是一样的道理。我们的根尘都是由一念不觉，无明妄动而生起来的。<br/><br/> 　　假如我们自己能觉，能认取守住自性，这个世界就清净了，也就没有这个污浊世界了。有人可能会说：哎呀，没有这个世界还得了，那不是断灭了吗？不是断灭，而是清净。因为这个佛性是不生不灭的，不是今天有个身体，这个佛性就出来了，明天人死了之后，这个佛性就没有了。不是的，这个佛性不生不灭。我们现在这个世界是五浊恶世，大家因为无明妄动，就造业受报，于是就有这么个身体。由于各人所造的业不同，因而所受的报、所感的境遇也就不相同。一旦大家都觉悟了，那么就回复我们的菩提妙心，不再有这个劳相，这个世界就会当下清净，就象西方极乐世界一样，人人都是一生补处，不再象五浊恶世一样了。<br/><br/> 　　现在由于我们一念不觉，就象眼睛生起的瞪发劳相一样，在一念不觉之后，有甜、苦、淡等各种劳相出来，于是就“发知居中”。因为有了劳相，就死死地执着这个四大假合之身，就有了妄觉。再由这个妄觉去区分好坏，这个好呀那个不好等等，搞七搞八，造业受报。那么有人可能会说：我带业往生西方，杀两个鸡吃吃不要紧。许多人都是这样的，以为既然可以带业往生，造点业不要紧，实际上是不可能的！带业往生不是带这个业，所谓带业是指带我们多生历劫的习气，你即使见性了，也不可能把多生的习气一下子都消光。假如习气都消光了，他就是果地佛。古来禅宗大德也不敢说自己是果地佛，都说是因地佛。我们还是因地佛，都是小孩子，还没有成人呢！《指月录》上一千七百则公案，那么多大祖师只有少数几个人证到八地菩萨，其他都是二地、三地菩萨，不超过四地。<br/><br/> 　　开悟见性后生死还没了，因为悟后无明还在，还要有个地方去。所以禅宗大德开悟之后，回过头来还要再修净土。在西方极乐世界是一生补处，可以上上升进，不象这里迂曲轮回，一会儿上去了，一会儿又跌下来，这个道理不是随便瞎说的。说起禅宗还要修净土，有的人搞错了，认为我修禅宗是最高的，再让我回过头来修净土不是又降了一级吗？那是你不懂这个道理，要知道禅就是净土，净土就是禅，根本就没有两样，哪里会降级呢？净土宗是三根普被，上、中、下三根一体普摄，而禅宗只能摄取一根――上上根人，中下根它就无法摄受，所以说净土法门非常好。<br/><br/> 　　这种苦、甜、淡就是妄尘，因妄尘之故，“发知居中”。你有妄知妄觉在里面，自然要分别好坏，于是就去造业受报。“吸此尘象，名知味性”，吸收了尘象，把它当作知味性，世上很多人就是专门想着怎么吃。我以前有一个资本家朋友，整天专门想吃，非但各种各样的馆子都吃遍了，就是哪个私人家里有一道名菜，他听到之后也会马上备几份重礼送过去，人家收了礼不好意思，不知道怎么回报，他就说：我听说你家里做的某道菜非常好，我想请您烧这道菜，约几个朋友来品尝品尝。人家被他说得没办法，就约好一个星期以后来。因为这道菜当天烧不出来，需要几天时间，用什么鸡汤、蟹粉等作料，需要好多道工序，七天以后做出了这道菜。夹到嘴里一尝，好吃啊！好吃啊！吃得自己四十多岁就翘辫子了。世上贪吃的人可得注意了，厚味伤身啊！<br/><br/> 　　“吸此尘象，名知味性。此知味性，离彼甜苦及淡二尘，毕竟无体”。这个“知味性”，离开甜苦淡之外，就什么都没有了。原本没有什么味道呀，因为它没有本体，是虚妄之相，不是实有。这一切东西都是无明之力，把我们的元明真心圈在里面，吸取尘象，在妄尘当中发出妄知妄觉，造下种种的业。我们生生世世的苦都是冤枉的呀，实际上都是被这个妄尘圈牢了。<br/><br/> 　　“如是，阿难，当知如是尝苦淡知，非甜苦来，非因淡有，又非根出，不于空生。”<br/><br/> 　　应该知道，我们能尝到苦甜酸辣咸淡的这种知觉，不是从甜苦来，既不是因淡有，也不是从根出，更不是从空生的。<br/><br/> 　　“何以故？若甜苦来，淡则知灭，云何知淡；若从淡出，甜即知亡，复云何知甜苦二相？”<br/><br/> 　　假设知味性是从甜苦来的，“淡则知灭，云何知淡？”若淡来了，知味性即灭，我们就不应该知道淡了。但是现在淡来了，我们知道这是淡，那么这个知味性可见不是从甜苦来的。<br/><br/> 　　“若从淡出，甜即知亡，复云何知甜苦二相”。如果知味性是从淡生出来的，当甜苦来的时候，知味性就应该没有。既然没有了，又怎么能知道甜苦呢？你现在能够知道甜和苦，就说明不是从淡生出来的。所以说舌入不是从甜、苦、淡生出来的。<br/><br/> 　　“若从舌生，必无甜淡及与苦尘，斯知味根，本无自性。”<br/><br/> 　　假如这个知味性是从舌头生出来的，舌头是用来品味的，那么舌头本身一定是无苦、无甜、无淡的。既然没有苦淡甜，那么就可知道用来知味道的这个根，是本无自性的。自性就是体，因为没有这个本体，舌头本身是没有甜淡苦的，它所生出的东西也不应该有甜淡苦。因此就证明这个知味性不是舌根所生。<br/><br/> 　　“若于空出，虚空自味，非汝口知。又空自知，何关汝入！”<br/><br/> 　　假如知味性是从空中生出来的，那是虚空自己知道味道，而不是你的嘴里知道味道，即“非汝口知”。可事实上是自己的嘴知道味道，而不是虚空知道，这就证明知味性不是虚空中生出来的。<br/><br/> 　　假如是虚空知道，而不是你的嘴知道，那应该是虚空的事，不关你的事情。“何关汝入！”与你有什么关系。现在不是虚空知道，而是你自己知道，所以证明不是虚空生的。<br/><br/> 　　“是故当知，舌入虚妄，本非因缘、非自然性。”<br/><br/> 　　因此之故，你应该知道舌入本来是虚妄的，既不是苦甜淡生的，也不是舌根所生，更不是虚空所生，本来就是个虚妄之相。本来没有的东西，还讲什么因缘，讲什么自然呢？所以说“本非因缘、非自然性”。<br/><br/> 　　下面讲第五个身入：<br/><br/> 　　（五）身入虚妄<br/><br/> 　　“阿难，譬如有人，以一冷手，触于热手。若冷势多，热者从冷；若热功胜，冷者成热。如是以此合觉之触，显于离知。涉势若成，因于劳触。兼身与劳，同是菩提瞪发劳相。因于离合二种妄尘，发觉居中，吸此尘象，名知觉性。此知觉体，离彼离合违顺二尘，毕竟无体。”<br/><br/> 　　身入也叫触，是身体同各种事物接触之后所产生的触觉。譬如有人，用一只冷手去接触另一只热手，假如冷手的冷势多，热手就会跟着变冷。如果反过来，“若热功胜，冷者成热”，热手会把冷手给暖过来。<br/><br/> 　　触是合起来才有的。“显于离知”，本来并没有合在一起，是因为有离才有合，有合才有触。世界上的事物都是这样相对的。“合觉之触，离于显知”，你感到冷热的这个触觉，是因为有了离合的缘故才显出来的，假如没有离合就显不出来。<br/><br/> 　　“涉势若成，因于劳触”。涉是两个东西交涉在一起，就成触了。因离合之故而有触，离合和触互相交涉在一起，才有种种感觉。这种种感觉就是劳触，和瞪目发劳一样，也是劳相，这劳相“因于劳触”。为什么要有这个涉势呢？因为劳触需要有离有合，有离合才会有牵涉。假如没有离合，也就不会牵涉在一起。所以这些东西都是一种劳相。<br/><br/> 　　“兼身与劳，同是菩提瞪发劳相”。这个感觉到冷热的劳相，乃至于身根都是菩提妙性中的瞪发劳相。身根由四大假合而起，它本身是没有的，只因一念不觉，无明妄动，于是有了这个虚假的身根。我们这些人不知道四大的种性本来是尽虚空遍法界的，执着了少分四大以为身根，而其它的四大就作为虚空、世界，和种种身外之物。比如火性是尽虚空的，遇缘即可燃烧，假如空气中有一些煤气，遇到火就会呼呼地烧起来。众生就是因为粘滞执着四大之故，把我们的妙真如性封闭到无明壳子里，身体以内的是我，身体以外的与我无关。实际上这一切都是你自己，身根与一切触觉，都是菩提妙性中的劳相。<br/><br/> 　　因为有了离与合这两个妄尘，于是就“发觉居中”。前面讲牵涉是从什么地方来的，是因为有离与合的缘故。假如没有离，一直在一起，就说不上牵涉。如果一直合在一起，就不会有离；如果只有离而没有合，又怎么成离呢？所以离与合，都是相对而言的，因此也都是虚妄不实的。只有我们的妙觉真心是绝对的，这个绝对的真心没有实与不实，没有冷和热，没有长与短，没有方和圆，没有明与暗，这些分别都没有。假如有长短、明暗等等，这即是二相，如此则成二见。我们要入不二法门，一切都不能落入两边，有二即非真。所以说绝对真心就是当下这灵觉了了，一物也无，无能、无所，当体是绝对的，这就是般若智慧。众生因为错认一合一离这二种妄尘，因而发觉居中，于离合当中就有了种种变化。<br/><br/> 　　有了离合这两个妄尘，从中就生起知觉性，发生妄觉。因有妄觉之故，就会吸收妄尘，妄觉摄受妄尘叫身入，吸收妄尘就要造业受报了。这种知觉性，离开了离合、违顺，毕竟没有自体。离两边而有者是真心，离两边而无者是妄想。世上虚妄的东西，不是实有，都是相对而有，不能离开两边。<br/><br/> 　　“如是，阿难，当知是觉，非离合来，非违顺有，不于根出，又非空生。”<br/><br/> 　　知觉性不是从离、合生，不是从违、顺生，不是从身根来，更不是从空中出。<br/><br/> 　　“何以故？若合时来，离当已灭，云何觉离；违顺二相，亦复如是。”<br/><br/> 　　假如知觉性是从合生出来的，那离的时候知觉性就应该灭掉，就不应该知道离。而事实上我们是知道离的。既然知道离，它就不是从合生出来的。同样若是离的时候知觉性生出来了，那合的时候知觉性就应该灭掉，就不应该知道合。但是，我们现在也知道合，所以它也不是从离生出来的。既然不是从离与合生出来的，当然也不是从违与顺生出来的了，所以说“违顺二相，亦复如是”。<br/><br/> 　　“若从根出，必无离合违顺四相，则汝身知元无自性。”<br/><br/> 　　假如知觉性是从身根生出来的，身根并没有离、合、违、顺四相，怎么会生出能感知离、合、违、顺四相的知觉性呢？“则汝身知，元无自性”你的身体本来没有自性，无从生起，所以不从根出。下面说空：<br/><br/> 　　“必于空出，空自知觉，何关汝入！”<br/><br/> 　　假如说知觉性是从虚空生的，那是虚空知道这些冷热、滑涩的触觉，不关你的事情，你不应该知道。但是现在不是虚空知道，而是你自己知道，所以说明知觉性不是由虚空生出来的。<br/><br/> 　　“是故当知，身入虚妄，本非因缘、非自然性。”<br/><br/> 　　所以应该知道，身入，也就是身上的触觉，是虚妄不实、本来没有的。“本非因缘、非自然性”。既不是因缘生的，也不是自然生的。<br/><br/> 　　下面讲六入中最后的一个，意入：<br/><br/> 　　（六）意入虚妄<br/><br/> 　　“阿难，譬如有人，劳倦则眠，睡熟便寤。览尘斯忆，失忆为忘，是其颠倒。生住异灭，吸习中归，不相逾越，称意知根。兼意与劳，同是菩提瞪发劳相。因于生灭二种妄尘，集知居中，吸撮内尘，见闻逆流，流不及地，名觉知性。此觉知性，离彼寤寐生灭二尘，毕竟无体。”<br/><br/> 　　意知根比前面五根都重要，因为六入中意根的势力最强，行善作恶都是意根在里面起作用。眼、耳、鼻、舌、身这五根，都是只有了别，而无取舍。如果不是意根从中作祟，它们就象镜子照物一样，虽然有生有灭，本身并不会动。就是因为有了意根，才从中分别好坏，弃此取彼，有了种种的分别。比如说声音，同样的乐曲，欢喜静的人听了会嫌它吵闹；欢喜热闹的人听了，就会觉得非常好。这都是意根在作祟。六根中意根最重要，修行人要转识成智，不是从前面五识开始转，而是从六识开始，是转这个意根，意根清净了，前五识也就自然转过来了。所以六祖大师说：“六七因中转，五八果上圆。”第八识和前五识到最后才圆满。转识首先要转第六识，意根清净之后，第七识也就清净了。第七识又名传送识，它是染净依，把六识吸收的尘相传送给第八识。六识清净了，七识也就跟着清净；六识染污，七识也跟着染污。<br/><br/> 　　净土宗的念佛法门，就是从第六根上修起，把一句佛号牢牢印在意根上，就这样“阿弥陀佛，阿弥陀佛……”，不停地念下去，久而久之，原来颠倒的妄念，就会清净下来，叫做六根清净。平时第七识传送进去的，都是贪嗔痴、杀盗淫，第七识就被染污了，就把那些污秽龌龊的东西往八识田里面放。念佛法门就是让大家在无形当中把心转过来，把本来是污染的种子转成清净的种子，一句句的阿弥陀佛输送到第八识，这样八识田里就藏满了佛的种子。有人打了个比方，说用功的方法就好象往罐子里放火药，今天放一点，明天放一点，放到一定的时候，嘭！就爆炸啦。他讲得蛮对的，我们做功夫就是这样，念佛也好，参禅也好，修密也好，都是这个道理。念佛法门就是把佛种子往里放，放、放……放到饱满了、饱和了，就身心脱开，证到念佛三昧了。有一些念佛的老太太不懂得这个道理，当念佛念到身心脱开，连个佛号也不可得的时候，她反而害怕了：“哎呀！我是仗佛的力量升西的，现在连佛都没有了，这可怎么好？害怕得退了回来。这时候要有师父指点，告诉她这个是好消息，这是你的心地在发光，叫“花开见佛悟无生”。也就是心花开放，见到你的本性佛，你要悟到无生法忍了，不要怕！把你的心浸在里面，大胆地走过去。<br/><br/> 　　在禅宗讲这更是好消息，参究“念佛的是谁？念佛的是谁？……”追到疑情消竭，行不知行，坐不知坐，嘭！疑尽爆发，打开本来，桶底脱落，见到本性。<br/><br/> 　　密宗的修法也是这样，依靠佛力三密加持，功夫深到这个程度，就象有人在后面助你一臂之力，推你到悬崖边，嘭地一下！虚空粉碎，大地平沉，顿见本真。转识成智都要转第六根。但由于用功方法不同，所以初下手选取的根也不同，密宗和禅宗都是从第八识下手，而净土宗则是从第六识下手。第六根非常重要，势力也非常强，我们平时所做的观照保任，就是都在第六根上用功。现在我们就来讲第六根。<br/><br/> 　　“譬如有人，劳倦则眠，睡熟便寤。”这劳倦则眠，睡熟便寤，就是讲一个生一个灭，疲倦了要睡觉，睡好了就醒过来。这就好比本在无生住异灭当中，有了生住异灭。如何是“生住异灭”？比如我们的身体，小孩子落地是“生”；要活一个阶段，几十岁、一百岁、两百岁，这是“住”；住当中会有变化，由少而壮，由壮而老，由老而死，这就是“异”；到最后一口气不来，死了，就是“灭”。不但人是如此，这个世界亦复如是。譬如这个地球，形成了就是生；要延续若干个小劫，现在地球已有几十亿年了，这叫住；这地球时时在变，沧海可变为桑田，高山也可变成大海，这就是“异”；地球的寿命虽然长久，最后也要灭掉，历经火烧、水淹、风吹这三灾，连初禅、二禅、三禅天都要毁灭的，这就是“灭”。世界毁灭了以后叫空劫，所以地球的生住异灭，也叫做成住坏空四个中劫。空劫之后再成、再住、再坏、再空，就这样循环不已。这就好比我们的意根，本来是没有生住异灭一切形象的，因为疲倦之故，要睡觉了假名为灭；睡足之后完全醒过来了，这就叫生；醒的时候就叫做住；要睡没睡着、要醒还没醒的时候，就是异相。这是用睡眠比喻生住异灭，所以说“劳倦则眠，睡熟便寤”，睡眠过后，寤就生出来了。<br/><br/> 　　“览尘斯忆，失忆为忘”。这两句话也表示生住异灭，就是看到某些事情，触及到我们从前藏在八识田里的种子，回忆起从前一桩已经忘记的事情。我们经常有这种情况，一件事情本来已经忘记了，结果你讲了某句话，又促使我想起来了。这也叫触尘则忆，失忆为忘。如果想不起来，就是忘记了，这也是生住异灭。“览尘斯忆”，就是想起来了，即是生相；“失忆为忘”，失其所忆，忘记了，即为灭相。在生相与灭相当中，必然有住、异之相。一件事情本来你是记得的，后来慢慢就淡忘了，在记着的时候叫做住，慢慢淡忘了，就叫做异。生住异灭表示意根的颠倒相。<br/><br/> 　　“吸习中归”是讲眼、耳、鼻、舌、身这五根，专门吸取外面的五尘，久而成习，变成一股习气。我们总说要除习气，就是要把吸收尘境的习气除光。见到一切尘相，都是我们的自性，叫做透过相见性。在众生的份上，都是专门吸取尘相，吸收尘相后，就要造业受报了。这个“吸习中归”，就是外面五根，把吸收的五尘变成习气，收到第六根意根上去，第六根再往里送，通过第七根末那识，藏到第八根阿赖耶识里去，成为习气的种子。<br/><br/> 　　“不相逾越，称意知根”。不相逾越，就是前前后后收进去的东西，并不会次序颠倒。象一部计算机一样，你打进去的数据它一点也不会错乱，输进去是什么次序，就是什么次序，还可以很快就给打印出来。我们的意根就是这样的，对于先、后吸收输入的东西，不相逾越，总是排好的次序，不会混乱的。<br/><br/> 　　“兼意与劳，同是菩提瞪发劳相”。这个意根以及它所产生的劳相，就是我们上面所说的寤寐、生住异灭等，都是我们妙明真心中的尘劳。就象眼睛看空中看久了，生出来的空花一样，都是劳相。所以意根所分别的东西，也都是虚妄不实的。<br/><br/> 　　“因于生灭二种妄尘，集知居中”。生住异灭这二种虚妄的尘劳，专门在里面分别，于是就发起意知根。集知居中，就是意知根集聚在里面。<br/><br/> 　　“吸撮内尘，见闻逆流”。什么叫吸撮内尘呢？我们刚才说眼、耳、鼻、舌、身这五根，吸收外面色、声、香、味、触这五尘，这叫外尘。而意根不是用来看外面的，而是由前五根吸取外面的外尘，落谢的影子落在第六识上，叫内尘，也叫法尘。意根相对的是内尘、是法尘，它专门执着前五根所落谢的外尘的影子。我们把落谢的这个影子，叫作心；执取这个影子的就是意根，叫做意。<br/><br/> 　　什么叫“见闻逆流“呢？顺流就是跟着声音跑，跟着前境转。比如一个男人看到一个漂亮女人，就盯着一直看，这就是跟着跑了。逆流是反其道而行之，不跟着它跑，怎么做到不跟着跑呢？就是前五根对外面五尘，要视而不见、听而不闻，把这五根的窗子关起来，叫做见闻逆流。逆流是观世音菩萨用功的方法，后面要讲到的。顺流就会跟着分别，如果逆流，我视而不见，听而不闻，那么一切东西都没有了。由于逆流之故，就“亡所”了，就不会再去分别这个好那个坏，这就是见闻逆流。<br/><br/> 　　为什么叫“流不及地“呢？因为你虽然是逆流了，把前五根关闭起来，不跟着五尘跑，但是你只能把它守到第六意根，而流不到心地上去，所以叫流不及地。做功夫到这一步还差得远，现在先不讲，到了观世音菩萨耳根圆通时再讲。所以流不及地，就是不到心地。怎么才能到心地呢？后面就会讲到的。<br/><br/> 　　“名觉知性”，你能觉能知的那个，就叫做觉知性。<br/><br/> 　　“此觉知性，离彼寤寐生灭二尘，毕竟无体”。你这个觉知性离开睡与醒、生与灭，离开相对的尘境，是没有自体的。<br/><br/> 　　意根非常重要，在六根中它的势力最强，所以修行时时刻刻都要在意根上着手。<br/><br/> 　　“如是，阿难，当知如是觉知之根，非寤寐来，非生灭有，不于根出，亦非空生。”<br/><br/> 　　应当知道，觉知性不从醒和睡的状态中来，不从生灭中来，不从身根生出来，也不从虚空中生出来。虚空无知，怎么会生出觉知性呢？<br/><br/> 　　上面讲到觉知根是菩提劳相，不是实有的。什么是菩提劳相呢？菩提本来是不动的，因无明之故，一念不觉而生妄动，于是就沾染色、声、香、味、触五尘，因染尘之故，从而生起劳相。染尘就好象镜子被灰尘遮住了，因生劳相之故，种种的妄相都相对而生。你只要心不染尘，不遍计所执，心就不劳了。劳相在意根来说，就是生灭两种妄相。前面说的生住异灭、寤寐，睡着了则是灭，醒来了就是生。生、灭这二种妄相，在圆妙心中粘湛发知，即无明粘住了圆妙真心，湛然不动的真知真觉发出一个妄知。因妄知之故，就揽法成根，招揽前尘落谢的影子成为意根。所以说这意根就是菩提的劳相，并不是实有。<br/><br/> 　　“何以故？”<br/><br/> 　　为什么不是从寤寐、生灭、意根与虚空中生出来的呢？<br/><br/> 　　“若从寤来，寐即随灭，将何为寐！”<br/><br/> 　　假如觉知性是从醒生出来的，那么睡着了就应该灭掉。若觉知性灭掉了，就不应该知道“睡着”。实际上是知道睡着，睡着了也能喊醒，觉知性还在，并没有灭掉。可见，觉知性并不是从醒生出来的。<br/><br/> 　　“必生时有，灭即同无，令谁受灭！”<br/><br/> 　　如果觉知性一定是生的时候才有，那么灭的时候就应该没有了。但灭的时候并不是没有了，它也能知道灭，它还依然在呀。人虽然死了，并不是什么都没有啊！如果真的没了，真的断灭了，谁来受这个灭相呢？所以觉知性不是从生来的。<br/><br/> 　　“若从灭有，生即灭无，谁知生者！”<br/><br/> 　　假如从灭生出来，意知根应该是随着“灭”才会有，那么当“生”来时，意知根就没有了。如果意知根没有了，又是谁知道生呀？所以觉知性不是从灭来的。<br/><br/> 　　生、灭两方面都不可能生起觉知性，故知觉知性不是从生灭来的。<br/><br/> 　　“若从根出，寤寐二相，随身开合。离斯二体，此觉知者，同于空花，毕竟无性。”<br/><br/> 　　如果说觉知性是从意根生出来的，可是这寤寐两种妄相是随着身体的开合，而起现出来的呀。怎么叫随身开合呢？面五根起作用的时候，例如：眼根起见、耳根起闻、舌根起味、鼻根起嗅、身根起触，在这个时候就叫开；假如这五根不起作用的时候，就叫合。身根合的时候就是睡着了，身根开的时候就是醒了，所以随着身根的开合，意根也就随之而起落。睡着的人，你只要推推他，触动他的身体，或者喊喊他，触动他的耳根，那么这个人就可以醒过来。这就是说五根中的任何一根开，意根就开了，六根都合上，意根才合。所以我们睡觉的时候，既不在想，也没有看和动，当然也没有听和说。有人说睡着的时候意根还是有觉的，醒的时候意根先觉，这不一定。因为睡着的时候，你不推他的身体，不去喊他，他不会醒过来，而要等到睡足了之后才会醒转来，所以叫随身开合。“离斯二体，此觉知者，同于空华”。离开了开与合，也就是离开前五尘，就没有觉知性。这个意根就象空中之花，是根本没有的。毕竟无性，它没有自性，没有自体。所以说觉知性不是从意根生出来的。<br/><br/> 　　“若从空生，自是空知，何关汝入！”<br/><br/> 　　 假如意知根是从虚空生出来的，那虚空自己知道，与你阿难不相关，“何关汝入”？既然是虚空知道，你没有意根吸收这个法尘之相，你当然不知道。<br/><br/> 　　“是故当知，意入虚妄，本非因缘、非自然性。”<br/><br/> 　　通过以上的种种辩论可以看出，或者是从生灭，或者是从寤寐，或者是从虚空，或者是从意根，来寻找这个意入都不可得，所以说意入是虚妄的。既然是虚妄的，又哪里有什么因缘、有什么自然呢？假如那么一个东西是有的，可以讲是因缘生，或是自然生。现在连一个东西都没有，还谈什么因缘和自然呢？所以是不可得的。六入到这里就结束了。<br/><br/> 　　六入实际上就是讲六根，因为根能够吸收外面的色尘，六根把尘境吸收进去，就叫六入。从根生识的角度来讲，根实际上就是心，六入就是讲这个心。现在重点讲的是入，就是从吸收尘境这个角度，破除“以为六入实有”的假象。有一种说法，认为六根中只有意根是心，其它五根都是尘，不能这样局限地讲。因为从识的依处来讲，根就是尘，譬如眼识依靠眼根、耳识依靠耳根、鼻识依靠鼻根……。反过来讲，根也能生识，当根对境时，识就生了。另外根本身也包含识，不是一定要对境才生识，因此说眼、耳、鼻、舌、身这五根也都是心。相宗说五蕴中的色是尘，后面的受、想、行、识都是心，这叫“开心合尘”。把心开成四个，而尘只有一个，这是对迷于心的人讲的。六入讲的是“开色合心”，因为眼、耳、鼻、舌、身都是色，都是尘，色开成五种，心只有一个意根，这就叫“开色合心”。这是相宗的说法。实际上心和色并不是固定的，心就是根，根就是心，这取决于你从哪一方面来看。从识的依处来讲，根可以说是尘，从根能生心来讲，根就是心，并不是固定不变的。<br/><br/> 　　下面再把六入稍微总结一下：因眼根所看的色尘是明暗，耳根所对的声尘是动静，鼻根所对的香尘是通塞虚实。假如塞牢了就嗅不到各种气味，若不塞牢就可嗅到香和臭的气味。虚就能够闻到香臭的气味，实就闻不到了，这是相对的。舌根所尝的是甜、淡、苦，身根所触的是冷、暖、滑、涩，意根所缘的是前五根与外五尘落谢的影子。因为有影子之故，所以有生住异灭。所有这些妄相，非但外面所对的尘是菩提劳相，乃至于六根本身也统统都是菩提劳相。为什么呢？因为菩提心本来是不动的，由于无明之故，一念不觉，无故揽尘，所以就有了劳相。心劳之故，就生出种种相对的明暗色空、冷暖滑涩、生住异灭的妄相。复因为种种相对的妄尘之故，在圆妙心中，无明粘住了我们湛然的觉性，发生出见、闻、觉、知，映照上面所说的明暗色空、冷暖滑涩、生住异灭等种种妄相，再结成根。所以这个根，就是由无明揽住我们的不动真心，结合了外面的妄相而成的。根尘和合之后，就能够吸取尘相，由六根所吸取的尘相就是六入，所以六入归结起来就是见、闻、觉、知、嗅、尝。<br/><br/> 　　有位法师说见闻觉知就是六根的净色根，而外面的眼睛、鼻子、耳朵、舌头、身体则是浮尘根，这样说并不妥当。因为见、闻、觉、知是个妄知，是个妄见，根本不可得，既然不可得，怎么会是我们的净色根呢？所以还是憨山大师说得好，他说这见闻觉知就是无明壳，根本不是真有的，还是虚假的东西。假如不是无明的力量，就不能够把我们的真心圈到躯壳里去，这个无明的力量太大了。<br/><br/> 　　综上所述：不管六入是根还是尘，都是虚妄不实、没有自体的。<br/><br/> 　　下面我们开始讲十二处。什么是十二处呢？就是六根加六尘。所谓处者，就是说有个处所、有个地方。比如眼睛在脸上面，鼻子在脸中央，耳朵在脸两旁，舌头、身体也都有自己的位置，六根各有处所。六根对六尘，眼睛所对的色尘是些形形色色的东西，耳朵对的声尘不外动静二相，鼻、舌、身、意也都有各自所对的尘境，如此根尘相对，讲起来就有十二处。现在是用六根来破六境，破掉这个境，也就等于破掉这个处所。<br/><br/> 　　相宗把十二处分开讲，十一处是色，剩下的意根是心，它随境而生，没有处所，所以不列为处。这样的说法不很妥当，因为佛说十二处。假如只有意根是心，其它都是色，那么，当眼耳鼻舌身这五根对境的时候，应该是以色吸色了。比如眼也是色，眼根所对外面的境也是色，以色吸色就是无情对无情，这当然是不可能的，所以这种说法不太妥当。<br/><br/> 　　又比如根是能生识的，如果眼耳鼻舌身是色，色是无情，生出的识是有情，那么它们生识就成了无情生有情。此外根还能识色，如果根是色，那么就是以无情识无情。假如说根上没有心，必须要等待根尘相触生起六识的时候，才叫做心，那么众生就只能有六识，而没有七识和八识。因为前六根有各自所对的尘，能生起六识，而七、八识并没有具体的尘境，那么众生岂不是只有六识，七识、八识都不可得吗？所以这种说法有毛病。我们说六根还是有六处的。有的法师说：意根就是肉团心，这样的讲法也不恰当。我们肉团心实际上是第八识所依之处，第六识所依之处是大脑。按我们中医的讲法，心光上照大脑，心脑相接了，大脑才起作用，若心光不上照大脑，大脑就不起作用。大脑是第六识，心是第八识，第八识又称心王。<br/><br/> 　　这位法师又说：第八识是不动摇，无来去的，有来去的是第七识。可是根据《八识规矩颂》上所说：“去后来先做主公。”一个人死的时候它最后走，投胎时它先来，这是说第八识的。如果按他所说第八识是不动的，不生灭、无来去，这个有来去、有生灭的就该是第七识了。这样讲也不对，因为第八识之所以称为识者，它是有处所的，它不是我们的真心。第八识就是阿赖耶识，阿赖耶识是生灭与不生灭和合而成的混合体，它还是有来去动摇的。真正不来不去的是我们真心--佛性，就是《楞严经》中所说的妙明真心，它才是真正不生不灭、不来不去、不动不摇的。讲到八识，它是以生灭与不生灭和合为一体，里面还有生灭的部分，所以还是有生灭。我们把这些内容稍微讲一讲，是让大家明白，十二处和六、七、八识都是讲什么的。我们现在讲十二处，是着重在六识所依之处，也就是六根，根吸收的是尘：色、声、香、味、触，法，其中前五个是外尘，法是内尘，也就是前五识摄取的尘境在第六识落谢的影子。这些是相对而生，相对而有的，所以六根与六尘合起来叫十二处。我们现在讲十二处，就是为了要破这十二处，明白它根本就没有实在的处所。<br/><br/> <strong>　　第三科 十二处虚妄，本非因缘、非自然性</strong><br/><br/> 　　复次，阿难，云何十二处本如来藏妙真如性？<br/><br/> 　　现在世尊问阿难，为什么说十二处是如来藏妙真如性呢？这十二处是六根对六尘，也就是见分对相分。在根上是见分，在相上是相分，我们的阿赖耶识就同时具备见分与相分，这见、相二分只是一种假设，不要当成是实有的。这里所说的见和相，一个是能，一个是所，就象蜗牛的两只角，伸出来的时候就都有，缩进去的时候就都没有了，而蜗牛的体就比喻我们的真心。这十二处都是从我们妙圆真心中生出来的，它的体就是我们的真心，所以说十二处就是如来藏妙真如性。<br/><br/> 　　（一）色与见二处虚妄<br/><br/> 　　“阿难，汝且观此祗陀树林及诸泉池，于意云何？此等为是色生眼见、眼生色相？”<br/><br/> 　　佛问阿难，你现在看看这个祗陀树林和林中的泉池，你是怎样想的呢？你现在能看到这些东西的见，是色生眼见，还是眼生色相的呢？如果这个见是从色生出来的，叫色生眼见；假如是从眼睛生出来色相，叫眼生色相。这些树林泉池，究竟是你眼睛生出来的色相，所以被你看到？还是色相生出你眼睛的见，因为色而有你眼睛的能见呢？<br/><br/> 　　“阿难，若复眼根生色相者，见空非色，色性应销。销则显发，一切都无。色相既无，谁明空质！空亦如是。若复色尘生眼见者，观空非色，见即销亡。亡则都无，谁明空色！”<br/><br/> 　　这个眼见的地方就是处，现在要为我们破这个处了。那么色所显的相都是处，这些处也就是显的这些相，色相与能见的性，在我们一般人看起来都是实有的。象我们现在坐在这里，大家你看到我，我看到你，既能彼此看见，也能看到房间中的东西，既然有能见、有所见，岂不是有处所？这是众生的错觉，在佛眼看来根本就没有这个能见所见。为什么说没有能见与所见呢？因为这能所二处都是我们的分别心执着出来的妄相。如果从体上来说，透过相见到本性，明白一切相都是我们自性的显现，离性根本就没有相，因为没有这个相，所以一切皆无。比如说西方极乐世界，就体来说是没有的，什么地方有这么个世界呢？若就相用来说，西方极乐世界又是有的，真空不碍妙有。你如果执着相用，认为确有一切相时，就对你说无，为的是破你的有，因此说没有西方极乐世界，是为了破你对有的执着。<br/><br/> 　　假如你偏空，就对你说有西方极乐世界，因为相用不无啊！如来藏是个万能的真体，它不是死的，而是能现一切形相，能生一切妙用的，所以不能偏空。偏空或者偏有，都是我们的分别心在执着，就性体说来，它是非空而非有，非有而非空。所以说西方极乐世界，也是非空非有，非有非空，既不能说有，也不能说无。说有，它是妙有非有；说无，它是真空不空。所以不要着相，着任何一边都是过患、都不全面。<br/><br/> 　　净土宗的人说我们只要能生西方极乐世界就行了，他认为西方极乐世界是真有的，这样说有说无，说明他们没有从根本上搞清楚。净土宗在这个问题上其实说得很明白，既要你念佛观想，还要你读诵大乘。为什么要读诵大乘？就是要明白这个妙理，把这个道理搞清楚之后，才能上品上生呀！因为今天在座的诸位都想生到高品位，我们之所以要这样说，就是要讲明这个道理。否则就执着实有好了：有西方极乐世界，也有阿弥陀佛，你就这么修也可以去。假如我们生到西方极乐世界去，阿弥陀佛现在也正在说法，说什么法呀？也是说这个法，离开这个法，还有什么别的法？没有了。也是说的这个妙理。所以说你应该什么都不执着，一切的一切都是你的妙用，偏空、偏有都是错误，执着两边就都不对！<br/><br/> 　　世尊接着问阿难，你现在看见祗园的泉池树林，这些是你眼睛生的吗？如果是你眼睛生的这个色相，那么“见空非色”，你见到色相，色相生出来，色相是属于色，那么见到空的时候就应该是非色。接下来说“色性应销”，见空的时候，色相就该灭了。也就是说，见色就不应见空了。“销则显发，一切都无”，如果色相销了，虚空也不可得，一切都没有了。“色相既无，谁明空质！”因为空与色、色与空，都是相对而有的。色相既然没有了，空当然也无法成立，谁来识别这个空质？“空亦如是”，若空是从眼根来的，色性应销。把这种假设颠倒过来，道理也是一样的。所以色空都不是从眼根生的。<br/><br/> 　　“若复色尘生眼见者，观空非色，见即销亡。”反过来说，如果色相能生眼见，因为色尘之故生出个能见。“观空非色，见即销亡”，因为这个眼见是由色相生的，色相没有是空，那么空就不能生眼见，当观空的时候，眼见就没有了。“亡则都无，谁名空色！”见都没有了，谁来分别什么是色、什么是空呢？一切东西都是相对而有的，都不可得。刚才顾老师说：“心本无生因境有，境本无生因心有”，到这里就全明白了。因为“因空显色、因色显空”，有色之后才有空，有空之后才有色。假如没有空，怎么显色呢？假如没有色，又怎么知道空呢？比如现在这个桌子上，如果不把这些东西放上，我们说是空；如果放上这些东西，我们说是色。这是因为两下对比才有的。假如根本就没有这些东西，拿什么说是空、拿什么说是色呢？心和境也是这个道理，因心才有境，因境才有心。<br/><br/> 　　“是故当知，见与色空，俱无处所。即色与见，二处虚妄，本非因缘、非自然性。”<br/><br/> 　　这个见不是从色相生的，眼见也没有生出色相，所以见与色空都无处所，都是虚妄。既然色与见两处都无，本是虚妄，所以“本非因缘、非自然性“。非因缘之故，是为无生；非自然之故，就无不生。怎么叫无不生呢？假如有个东西说是从什么地方生的，那么有生处就有不生处。比如这个小核桃是杭州特产，那么杭州就是生处，广东、福建没有这种小核桃，那就是不生处。如果是个本来就没有的东西，又讲什么生处与不生处呢？所以没有生处，就是非因缘生；没有不生处，就是非自然生。这个见根和色尘都是虚妄不实的东西，所以没有处所，因此是非因缘性、非自然性。<br/><br/> 　　下面讲耳朵对声音--耳根对声尘：<br/><br/> 　　（二）听与声二处虚妄<br/><br/> 　　“阿难，汝更听此祗陀园中，食办击鼓，众集撞钟，钟鼓音声，前后相续。于意云何？此等为是声来耳边、耳往声处？”<br/><br/> 　　现在开始讲耳朵。世尊问阿难：现在你听这个祗陀园里，当饭菜烧好了，要开饭的时候，因为要聚集大众，于是先击鼓、再撞钟。这是一切丛林的规矩，现在大概是敲梆或板。我们看见丛林里挂着象鱼一样的东西就是梆。板子一敲，大家都听到这声音，就知道要吃饭了。<br/><br/> 　　先敲鼓、后撞钟，两个声音一前一后，前后相续，你听得很清楚。那么，究竟是声音到你的耳朵来，还是你的耳朵往声音那里去呢？我们能听到声音，大家都认为耳朵生在自己的头上，是有处所的。声音是从那边来，也是有处所的。耳根与声尘都有处所。这里马上要告诉我们，耳根与声尘，就同前面破掉眼根和色尘一样，既没有处，也没有不处。为什么呢？假如有处，那么是耳朵到声音那边去？还是声音到你耳朵里来呢？下面要破它了：<br/><br/> 　　“阿难，若复此声，来于耳边，如我乞食，室罗筏城，在祗陀林，则无有我。此声必来阿难耳处，目连迦叶应不俱闻，何况其中一千二百五十沙门，一闻钟声，同来食处。”<br/><br/> 　　这里先破声音到耳朵里来。假如说声音到耳朵里来，比如我本来在祗陀园里，当我要出去到室罗筏城去乞食，祗陀园里就没有我。如果这个声音一定要来到阿难的耳朵边，那么目连、迦叶，与其它一千二百五十沙门就不应该听到钟声了。就是说你在这里，别的地方就没有你，这跟我去室罗筏城乞食，祗陀园里就没有我一样，如果钟声到了你阿难的耳朵里，其他人都不应该听到，那为什么目连、迦叶与其他一千二百五十众统统能听得到呢？这是在破声音到你的耳朵里来，如果声音真的来了，那就象我乞食一样，我到室罗筏城去了，祗陀园中哪还有我？下面就讲如果耳朵往声音那边去，会怎么样。<br/><br/> 　　“若复汝耳往彼声边，如我归住祗陀林中，在室罗城则无有我。汝闻鼓声，其耳已往击鼓之处，钟声齐出，应不俱闻。何况其中象马牛羊，种种音响。若无来往，亦复无闻。”<br/><br/> 　　假如说你的耳朵已经到声音那边去了，就象我已经回到祗陀园中，室罗筏城就没有我了。你先听到鼓声，你的耳朵已经到鼓那边去了，等一会儿撞钟的时候，你就不应该再听到钟的声音，你为什么听完鼓声又能听到钟声呢？只能说你的耳朵没有到鼓那边去。何止能听见撞钟的声音，还有象、马、牛、羊种种声音，你为什么一时都能听到呢？所以说，耳朵到声音那边去，也讲不通。<br/><br/> 　　“若无来往，亦复无闻”，如果声音和耳朵没有来往，就应该听不到声音。这就好比我们用火去点燃灯芯，火要到了灯芯上才能点着，如果不到它那里，怎么能点燃呢？所以说耳朵和声音互有来往，这样是讲不通的。<br/><br/> 　　“是故当知，听与音声俱无处所，即听与声二处虚妄，本非因缘、非自然性。”<br/><br/> 　　前面说耳朵没有去，声音也没有来，耳朵去或声音来都不成立。既然耳朵不去，声音不来，就表明是不动。反过来说，虽然不动，鼓敲钟鸣的声音还是听到了，也就是不无往来。我们前面说过，西方极乐世界，性体虽然是空，但相用则不无，还是有相貌的。说无是就体而言的，从我们的真如妙性来说是没有的；说有是就相用而言，既有相、也有用，所以不无来往。所谓实相就是我们的真如实性，它是无相而无不相的，本体上虽然是无相，但也无不相，可以显现一切相貌和妙用。虽然妙用不无，但是我们要透过相见到体，不能执着这幻化的形相，而要看到幻相背后的性体。我们做功夫就是要在这个地方用功，认识到一切声色都是虚幻之相，都是自性所起的作用，不要执着它。只见性体，不认妄相，时时刻刻在这上面用功，功夫就容易成就。如果你忘记了这个性体，只跟着相跑，分别这个声音好听，那个声音不好听，那么你就跟着声尘跑了，这样就着相了。<br/><br/> 　　既然这个东西没有实体，是虚幻之相，所以不能执着。它就体来说是没有，就相用来说是不无，因为是性体上幻现出来的。虽然假说为有，其实还是没有。所以说声与听都无处所。既然没有处所，当然也没有个不处所，也就是处所既没有生、也没有不生。刚才说过，如果有生处，就有不生处，现在说没有生处，自然也就没有不生处。那么，这耳声二处，就都是虚妄了。因为虚妄之故，所以是既非因缘性、亦非自然性。假设有来有往，那就是因缘性；假如有不来往，有自体，那就是自然性。事实上并没有来往，所以是非因缘性；也没有不来往，所以是非自然性。非因缘、非自然，这不就是如来藏妙真如性吗？这里处处都在破妄显真。没有来处之处，就显出我们的真处，真处就是在在处处无不处，这就是妙真如性。<br/><br/> 　　下面讲鼻根与香尘：<br/><br/> 　　（三）嗅与香二处虚妄<br/><br/> 　　“阿难，汝又嗅此炉中旃檀。此香若复然于一铢，室罗筏城四十里内，同时闻气。于意云何？此香为复生旃檀木、生于汝鼻、为生于空？”<br/><br/> 　　旃檀就是紫檀，气味很香。这个香只要烧一铢（二十四铢为一两），整个室罗筏城四十里内，都可以同时闻到香气。你阿难是怎么想的，此香是紫檀木所生呢？还是你的鼻子所生呢？或者是空中所生呢？对于这种旃檀香，鼻根在内，香尘在外，所以鼻子对香尘一触就闻到了，由于一内一外，所以各有处所。现在佛问阿难，你鼻子闻到的这个香味，是从什么地方生出来的呢？实际上它本无所生，即不是鼻子所生，也不是檀香木所生，更不是空中所生。这种旃檀香中国没有，过去记载上都说是从外国进贡来的，一次进贡四块，有鸡蛋这么大。皇帝不相信有这么好的香，拿一粒黄豆大小的烧起来试试看，哎呀！整个宫里都闻到了，香得不得了。这种香大概产于印度，我们中国有一般的檀香木，但也是很少的。<br/><br/> 　　“阿难。若复此香生于汝鼻，称鼻所生，当从鼻出。鼻非旃檀，云何鼻中有旃檀气？称汝闻香，当于鼻入。鼻中出香，说闻非义。”<br/><br/> 　　假如这香是从鼻孔中生出来的，“称鼻所生”，你可以说是鼻子生香。可是鼻子并非旃檀，“云何鼻中有旃檀气”呢？你的鼻子根本是无香无臭的，怎么会生出这种香气来呢？<br/><br/> 　　“称汝闻香，当于鼻入”，如果说是你闻到这个香气，应该是香气入你鼻中。“鼻中出香，说闻非义”，如果是鼻子里多出来一个香气，说闻到香气是不对的，这不能称闻到。这种说法也不能成立。<br/><br/> 　　“若生于空，空性常恒，香应常在，何藉炉中爇此枯木。”<br/><br/> 　　假如香味是空中生出来的，这个空性是恒常不变的，香味也应该一直常在，不会一会儿闻到香、一会儿闻不到香。既然香气常在，又何必要我们把这个香木拿到炉子里来烧呢？所以这个香不是生于空中的。<br/><br/> 　　“若生于木，则此香质，因爇成烟。若鼻得闻，合蒙烟气。其烟腾空，未及遥远，四十里内，云何已闻。”<br/><br/> 　　假如这个香气是从木头生出来的，旃檀木用火烧了会成烟。如果鼻子要闻到这个香气，就应该让这个烟气熏到你的鼻子，你才能闻得到。可是这个烟现在腾空未及遥远，只有那么一点点地方有烟，为什么四十里以内都闻到这个香呢？也就是说只有我们鼻子蒙受到这个烟气的地方，你才能闻得到，而烟气不到的地方，就不应该闻到。但是现在这个旃檀香一烧之后，四十里内都能闻到。这就说明这个香并不是从木头生出来的。但是这个香也不离于木，离开木头也就没有这个香味。<br/><br/> 　　这就是我们刚才说的，虽然没有，亦复不无，那个外相、假用还是有的。叫我们不要执着，因为那些虚幻之相根本不可得，都是我们真如实性的影子。如果你执著外相、假相，那就错了，就要造业受报，就要轮回生死了。我们在识得真如佛性之后，要把那些颠倒妄想全破尽，明白一切相都是虚幻，都没有自体，如此才能解脱生死、超出轮回。<br/><br/> 　　“是故当知，香、鼻与闻，俱无处所。即嗅与香，二处虚妄，本非因缘、非自然性。”<br/><br/> 　　这里是破处所。如果闻性的处所是真实的，是确实有的，应该熏到烟的地方才能闻到香气。而现在香刚刚点上，烟没有熏到的地方也能闻到香气。这就说明闻性并没有一定处所。<br/><br/> 　　香、鼻与闻性都没有固定的所在，嗅与香二处都是虚妄不实的，“本非因缘、非自然性”。非因缘又叫做无生处，非自然又叫做无不生处。既无生处、也无不生处，所以都是虚妄不实的。<br/><br/> 　　下面再讲舌头和味道：<br/><br/> 　　（四）尝与味二俱虚妄<br/><br/> 　　“阿难，汝常二时众中持钵，其间或遇酥酪醍醐，名为上味。于意云何？此味为复生于空中、生于舌中、为生食中？”<br/><br/> 　　众生总要分别计度，总是妄计舌根与味尘，一内一外各有处所。佛眼不着相、不住相，看起来都是没有，两种都是虚妄。佛眼看来，都是如来藏，都是妙真如性。何以见得呢？假设托钵到外头去乞食的时候，你遇到很好的味道，上味，特等味道，酥酪醍醐啊，都是奶油里头提炼出来的，先炼成酥，后炼成酪，再精炼成醍醐，都是牛奶、奶油提炼成功的，越到后面越精，醍醐是最上味，最好的。假如吃到这么多味道的时候，这些味道是从空中来呢，还是生在舌头当中，或者是生在饮食实体当中呢？这三个地方，空、舌或食，什么地方生味呢？<br/><br/> 　　“阿难，若复此味，生于汝舌，在汝口中，只有一舌，其舌尔时，已成酥味，遇黑石蜜，应不推移。若不变移，不名知味；若变移者，舌非多体，云何多味，一舌之知？”<br/><br/> 　　假如说这个味道是从舌头上生出来的。这个舌头在嘴巴里头啊，你嘴巴里就一根舌头，如果吃酥的时候，这根舌头已经变成酥的味道了，再尝蜜时，就应该不知道了，因为它不推移哟，因舌头已经成酥味了，哪能会晓得蜜的味道呀？要晓得蜜的味道，你舌头已经移动了，已经变移了。实际上舌头并没有变移，“若不变移，不名知味”，若舌头只晓得一个味道，吃酥之后，成了酥味，其它都不晓得了，那怎么能够辨别出各种各样的味道来，怎能说尝百味，怎能知道一切东西味道不同呢？这是不是说明舌头变移了呢，“舌非多体，云何多味，一舌之知？”因为只有一根舌头呀，变移之后，嘴巴里成几个舌头了？你只有一条舌头，不是有两条、三条舌头，那为啥一条舌头能尝出各种各样不同的味道呢？这就说明变移不可能，不变移也不可能。既然两面都不可能，味道就不是从舌头生出来的，经过反反正正的推敲，这味道不是从舌头生出来的。<br/><br/> 　　“若生于食，食非有识，云何自知？又食自知，即同他食，何预于汝，名味之知？”<br/><br/> 　　假设味道是从食品当中生出的，食品是没有心的，食品是无情啊，无情哪里有知觉呢？“云何自知？”它自己怎么会知道呢？“又食自知”，假如说这个食品能够自己知道。“即同他食”，就等于是别人在吃了，不是你阿难在吃。“何预于汝名味之知？”和你有啥相干呢？你就不应该知道了。<br/><br/> 　　大家都说，吃什么东西，有什么味道。酸、甜、苦、辣各种各样东西有各种不同的味道，味道是在食品当中。是在食品当中么？食品没知觉，谁来辨别味道呢？辨别味道的是谁呢？若不辨别它，有了还等于没有。人人都有真如佛性，因迷而不觉之故，等于没有，六道轮回去啦。假如你不迷，你就不落六道轮回，就成佛了。同理，食品有味道，知道味道的是谁呀？若不知道，不等于没有吗？食品是无情，它哪能知道？就算食品能尝味，也与你阿难不相干啊，你就不应该知道这个味道了。所以知味性不是从食品生出来的。<br/><br/> 　　“若生于空，汝啖虚空，当作何味？”<br/><br/> 　　假设这个味道是虚空生的，你吃吃虚空看，虚空什么味道？<br/><br/> 　　“必其虚空若作咸味，既咸汝舌，亦咸汝面，则此界人同于海鱼。”<br/><br/> 　　假设味道真的在虚空当中，这虚空假如是咸的味道，你舌头尝到是咸的。虚空既然咸了你的舌头，也应该是咸到你的面孔。因为你整个都在虚空当中，你舌头受咸，面孔也应该受咸。那么，我们这世界的人岂不都同于大海的鱼了么！一切众生都在虚空当中，都被虚空的咸味腌着，就象咸味的海水泡着鱼一样。<br/><br/> 　　“既常受咸，了不知淡。若不识淡，亦不觉咸，必无所知，云何名味？”<br/><br/> 　　既然经常在咸的味道当中，哪里还会晓得淡呢？淡的就不应该知道了。“若不识淡，亦不觉咸，必无所知，云何名味？”咸与淡是相对说的，假如只是咸没有淡，咸也不成立了。譬如海水里的鱼，大海里的鱼，海水咸，它也不晓得，它哪能晓得咸呀？它一直待在海水里面，海水一直是咸，没有淡来调和一下，它没受到过淡的味道，它就不知道海水是咸的。酸、甜、苦、辣，都是相对分别出来的，如果只有一种味道，其它味道都没有，这一种味道也就不存在了。相对才能成立，假如不识得淡，咸也不成立了。若咸也不成立，就应该不知道味道。味觉都没有了，还说什么味道呢？<br/><br/> 　　“是故当知，味、舌与尝，俱无处所。即尝与味二俱虚妄，本非因缘、非自然性。”<br/><br/> 　　这就说明，舌根、食物、虚空三法，都不生味道。这个味道没出生之处。三处都不生，离开三处还有啥地方能生呢？没有啦。所以味道没有常住之处。既然没有常住的地方，这尝与味，就是虚妄不可得的。因为它无生处，所以是非因缘性；也无不生处，所以是非自然性。因为非因缘、非自然性，所以它虚妄不实，本体就是如来藏妙真如性。<br/><br/> 　　下面讲身触--身根与触觉：<br/><br/> 　　（五）身与触二俱虚妄<br/><br/> 　　“阿难，汝常晨朝，以手摩头。于意云何？此摩所知，谁为能触？能为在手，为复在头？”<br/><br/> 　　出家人每天要有三次摸头，摸头做啥呢？就是引起警惕性。出家人是落发的。就摸摸自己的头，啊！我出家了，出家为啥？了生死！不是混饭吃的。了生死就要痛切用功啊！一日三次摩头，告诫自己，要警惕，不要虚度光阴。以前用功人常常是这样，“擎钵参玄人，光阴不虚度”啊。从前用功人都是喊自己的名字：“某某人。哎。惺惺着！”你要清醒啊，要觉醒啊，不要糊里糊涂啊，不要着相啊。因此一日三次摩头。看到佛经上这么说，哦！出家人如此精进用功啊！<br/><br/> 　　那么我们在家人不是更应该如此吗？佛的四众弟子，比丘、比丘尼、优婆塞、优婆夷，优婆塞、优婆夷也应该精进用功，同样要出生死，同样要时刻警觉。所以我说，绝不是早上坐一下、晚上坐一下，或者是早上敲唱一遍、晚上敲唱一遍，就算数了。应该时刻用功，时刻警觉。要透过相见性，这些相都是性的妙用，都是虚幻不实的，不能执着。<br/><br/> 　　我们现在讲的十二处就是虚幻不实的，它没有自体，都是从真如实性生出来的。但并不是说它没有这个假相，也不是说它没有这个假用。假相，假用都是有的，我们不能执着它。也不是要去掉假相。若去掉假相，真心就没有啦。假相就是真心所现，假就是真。西方极乐世界之相虽然是假现、幻现，但它是阿弥陀佛的愿力所现，阿弥陀佛的愿力就是妙真如性、真如实性，那么这个相也就是真如实性。一真一切真，但是你不能执着。它是显现起用的，不能作为实有啊。它是妙有，妙有非有，所以一切不能执着。我们时时刻刻做这样的功夫，一切事相都是妙有非有。说西方极乐世界是有，娑婆世界也是有；说娑婆世界没有，西方极乐世界也没有。娑婆世界是众生业障所感，是苦果。西方极乐世界是阿弥陀佛的愿力所感，是净土。一个是秽，一个是净，所现之相说妄都是妄、说真都是真。你识得它，就是妙用；你执着它，就是虚妄。西方有九品四土之别，就是因为这个原因，所以不能执着啊。<br/><br/> 　　佛问阿难，你每天早晨用手摩头，摩的时候有个触觉。“此摩所知，谁为能触？”能触就是触觉，这触觉是从哪里生出来的？“能为在手，为复在头？”这个能触是在手上啊？还是在头上啊？有“能触”，就有“所触”。没有能、没有所，触觉就不能成立。佛现在问阿难，用自己的手摩自己的头，不是用别人的手摩。若用别人的手，就难辩虚妄了。若别人摩我的头，我的头就是别人的“所触”，他的手来摩，他的手就是能触。这样说，虚妄就难破了。自己的手和自己的头是一体，手是你，头也是你，不易妄立能所，容易说清楚。以手摩头的时候，触觉来了，你分分看，哪里是能触，哪里是所触？能触是在手呢，还是在头？<br/><br/> 　　“若在于手，头则无知，云何成触？若在于头，手则无用，云何名触？若各各有，则汝阿难应有二身。若头与手，一触所生，则手与头，当为一体。若一体者，触则无成；若二体者，触谁为在？在能非所，在所非能。不应虚空，与汝成触。”<br/><br/> 　　假设这能触的根在你手，头就不应该有知觉了。头无知，怎么会成触呢？成触必定有能有所嘛。“若在于头，手则无用”，假如能触之根在头上，头是知道触的，手无能触之根，就用不着手了。“云何名触？”手派不上用场，这不叫触了。假如说“各各有”，就是手也有，头也有，统统有能触之根，那阿难就该有两个身体。“若头与手，一触所生，则手与头，当为一体”，如果头与手合起来是同一个触觉，那么手与头就是一体了。既然是同一个东西，哪里会有能有所呢？比方我一只手，拍拍看，拍也拍不响，一只手哪会有能有所呢？“若一体者，触则无成”，如果一体，就形不成触觉。“若二体者，触谁为在？”假如是两个体，那么触觉在哪一边呢？“在能非所，在所非能”如果头手都是能触，就没有所触喽。假如头手同为所触呢，则又无能触之触觉了。一体根本不成触，二体也不能成触。“不应虚空，与汝成触”，触是接触到东西，虚空什么都没有，虚空与你成触，根本不可能。<br/><br/> 　　“是故当知，觉触与身，俱无处所。即身与触，二俱虚妄，本非因缘、非自然性。”<br/><br/> 　　所以应该晓得，觉触与身体都没有处所。也就是说，身体与触觉，这二处都是虚妄的。因这两处都是虚妄之故，“本非因缘、非自然性”。没出生处，就不是因缘性；又无住处，就不是自然性。非因缘、非自然之故，所以这是如来藏妙真如性。<br/><br/> 　　下面讲意根--法尘：<br/><br/> 　　（六）意与法二俱虚妄<br/><br/> 　　“阿难，汝常意中所缘善、恶、无记三性，生成法则。此法为复即心所生，为当离心别有方所？”<br/><br/> 　　这里说得蛮清爽的，就是心生境，境生心，意根缘法尘。我们前面说过，法尘就是前五尘落谢的影子，落谢在第八识中，第八识是含藏识。意根就吸取这个影子。这个影子是没有实质的，不象外五根所对的外五尘，外五尘还有点实质。意根吸取了这个影子，就牢牢地执着它，着牢就会生出妄境，妄境就叫法尘。归纳起来法尘有三种：一种是善性，一种是恶性，一种是无记性。于自己、于他人都有利的，就是善性；于自己、于他人都没利的，就是恶性；也不顺自己、也不顺他人，也不逆自己、也不逆他人，无顺无逆的，就叫做无记性。所以说“所缘善、恶、无记三性，生成法则。”在这三个法则里，又有种种不同：逆人而顺己者，就是对别人不利；对自己好，这是善中恶；逆己而顺人者，就是对自己不利、对别人有利，这是恶中善。<br/><br/> 　　在众生看来，意根与法尘，都是有处所的。但是在佛眼看来，都是不可得，都是虚妄的，都是如来藏所起的妙用。“此法为复即心所生，为当离心别有方所”这个意根缘三性的法则，是你的心所生呢？还是在你心之外别有方所呢？假如有生处，就是因缘性；假如有在处，就是自然性。假如没有生处、没有在处，就是非因缘、非自然性。下面就将此两处破尽：<br/><br/> 　　“阿难，若即心者，法则非尘。非心所缘，云何成处？”<br/><br/> 　　佛问阿难：假如这个法则就是心的话，心是“了别”意，那就不是尘了--“法则非尘。”<br/><br/> 　　“非心所缘”，它既然是心，心不缘心，心只缘尘啊。前面的五尘：钟鼓之声，耳朵能知道；醍醐之味，舌头能知道……五尘落谢的影子呢，唯意能知，只有意根能够知道，前面的五根不能知道。外五根有尘就有心、无尘则无心。里边的意根呢？因心而起境，就是“心本无生因境有”；无心则无境，就是“境本无生因心有”了。若没有心，哪里会有境呢？心是思量，思量就是意，法尘境界都是从思量上显现。前面的五根对五尘，因有五尘，所以有心；假如没有尘，就没有心。比如眼睛对色尘，若无色尘，眼睛就看不到什么东西，就不了别了。里面的意根呢？意根不对外，是因心起境。因为你的心着了前五根对外五尘落谢的影子，就有境界、有声音……因心起境，无心则无境。前五根对外五尘的时候，是“心本无生因境有”。内意根所对的法尘，则是“境本无生因心有”。前五根对外五尘，只是了别，没有思量，意根则属于思量。法尘不象前五尘那样有实质。色、身、香、味、触，都有实质，法尘却没有实质。法尘不象是色法，倒象是心法。所以佛就这样辨明，假如“意根缘三性”的法则是心的话，心是能缘，心能缘境，心不缘心，所以叫“非心所缘”，那就没有处了，处在啥地方呢？所以说这法则并非心生，也就是“非因缘性”。<br/><br/> 　　“若离于心，别有方所，则法自性，为知非知？”<br/><br/> 　　如果说这法则离开意识之心，在另外的地方存在着。那么，这法则的自体是有知觉呢？还是无知觉呢？问这两个问题，是因为后面要破除这两个问题了。有知不对，无知也不对。那就是离开心，这法则并没有在另外的地方存在，也就是“非自然性”。<br/><br/> 　　“知则名心，异汝非尘。同他心量，即汝即心。云何汝心，更二于汝？”<br/><br/> 　　前面有两问：假如这法则离开意识之心，在另外的地方存在着，这法则的自体是有知觉呢？还是无知觉呢？“知则名心”，若有知觉，就不是尘，就是心了。它有知觉，哪会是尘呢？尘是无情之物，无情之物是无知的。现在他却有知，那就是有情，那就是心，就不是尘了。“异汝非尘。”异汝，就是离开你，在另外的地方存在着。如果这样，也非尘境。因它有知觉，知觉是心，虽然不是你自己的第六根那个心，它总归不是尘。<br/><br/> 　　“同他心量，即汝即心。”你的心跟那个假定在外的心相同，都是同样地测度、比量。因为刚才是在内不成，假定在外，其实还是说这同一个“意根缘三性”的法则。“即汝即心。”那就是同你的心一样，没有区别，就是你的心了。<br/><br/> 　　“云何汝心，更二于汝？”如果在内不成，假定在外，岂不就变成两个心了么？哪能会有两个心呢？离开你没有另一个心哪。另一方面，你的心对法尘。第六根能知之心，是心；第六根所知之法，即所对的法尘，“境本无生因心有”，也是心哪。能知、所知都是心，岂不是你有两个心了吗？所以，二心不成！<br/><br/> 　　上讲的是“意根缘三性”的法则有知，有知不成立。下面就来讲这法则非知，非知也照样不成立：<br/><br/> 　　“若非知者，此尘既非色声香味、离合冷暖及虚空相，当于何在？”<br/><br/> 　　假如说这“意根缘三性”的法则没有知觉，那么这里面的法尘就是离开你的心在别处有喽，因为你的心是有知觉的呀。<br/><br/> 　　“此尘既非色声香味、离合冷暖、及虚空相，当于何在？”色、声、香、味、触（离合冷暖），是前五根所缘的境，都有实质。虚空也有处所。这法尘却没有实质、没有处所。那么法尘在啥地方呢？法尘只是个影子，并不是色、声、香、味、触有色之尘，也不是虚空。既不是五种有色之尘，也不是虚空无色之尘，除此之外，它还能在啥地方呢？<br/><br/> 　　“今于色空都无表示，不应人间更有空外。心非所缘，处从谁立？”<br/><br/> 　　现在，于色、声、香、味、触，乃至虚空，都表示不出来。那它在啥地方呢？它不是色、声、香、味、触，也不是虚空。那么离开这些之外，“不应人间更有空外”。离开我们这个人间、离开无际的虚空，另外再有个地方？不会有的呀。这就是说明意识与法尘都没有处所。<br/><br/> 　　“心非所缘，处从谁立？”纵然在人间虚空之外还有地方，我们的心缘不到它，想不到它，不能察觉到有它。若这样，这个假设的地方怎么能成立呢？<br/><br/> 　　“是故当知，法则与心，俱无处所。则意与法，二俱虚妄，本非因缘、非自然性。”<br/><br/> 　　所以应该晓得，善性、恶性、无记性，和缘这三性的心，统统没有所在的地方。“则意与法，二俱虚妄”那么，意（第六识）与法（三性）两处都是虚妄不实的。因为二俱虚妄不实，故不是因缘，也非自然。因其无生处之故，所以它是非因缘性；因其无住处之故，所以它是非自然性。既不是因缘，也不是自然，那就是如来藏妙真如性了。《楞严经》就是这样处处破妄显真，教我们不要执著，法尘也好，意识也好，统统是没有的。<br/><br/> 　　十二处就这样被破尽了。<br/><br/> 　　大家执着说，根在我身上啊，眼根、耳根、鼻根、舌根、身根、意根，怎么说没有啊？其实，这些根是假相，都不可得的，都是我们妄执。牢牢执着有一个我的，就是第七识：有我，有我……就是有我的身根，就是有我相。我相最坏，我们做功夫打七，就是要打倒这个老七。老七打倒就好了，八识就自由了，就会转成大圆镜智。我们或用念佛法门，或用参禅法门，或用密宗的修法，把这个老七打倒，老七打倒了，就亲证了无我的境界。众生妄执有我，欲望无穷啊！<br/><br/> 　　有两个青年讲：你这句话讲错了。假设没有欲望，世界就不会进步了。世界之所以有进步，就是因为人有欲望。没有欲望就不会进步。唉！他这话表面上看是对的：我有欲望，想满足我的欲望，要生活过得好，吃得好，穿得好，那么就想钞票。钞票从哪里来呢？他想：发明个东西，别人做不到，我能做到。做到之后，发明权我有了。有了发明权之后，我一个人独家经营，钞票就多了，欲望就满足了。假如不是出于这个欲望，他不会去研究。不去研究，东西就不会发明出来。没有创造发明，这个世界就不会进步，物质文明就不会有。如果科学不进步，物质就不会一代比一代文明。他说欲望是好的，没欲望就没有进步，有欲望才有进步，从这个角度看好象是对的。但这之后就坏了！怎么坏了？你的欲望是无穷的呀，不可能满足。物质文明越高，欲望也越高，追求物质越厉害。追求得厉害之故，若达不到目的，不能满足你日益增高的欲望，你就要做坏事了。抢呀、盗呀，杀盗淫妄都做了，犯罪率高起来了，社会上治安就难维持了。欲望有这个致命缺点哪！我们还应该看到，资本主义用物质刺激，你发明什么东西就给什么奖励，给你个专利权。社会主义提倡政治觉悟，提倡为人类着想、为大众着想。社会主义、共产主义好就好在改造人类思想，不要追求个人利益，要为人民服务，为大众着想。从这点出发，你那欲望还是好的嘛，我们佛教就蛮符合这个出发点的。我们晓得一切东西都是虚妄不实的，根本就是没有的，哪还会为自己着想啊？我们要发菩提心，为大众着想，救度众生，非但人类，所有一切生物都对它好，所作所为都是为使大家脱离苦海。从这个出发点出发，研究科学、研究医学，这个世界就和平、就安定。假如从个人欲望的出发点，用物质刺激来创造文明财富，那就会变成一个强盗世界。你看世界各国斗争不停，比如非洲石油资源蛮多，他们就说你有那么多资源，你不给我，我就抢你、我就打你，这不就是强盗了吗！共产主义就好了，大家都是为了一个目标，统统是为了提高人类的生活而发展生产，不是抢夺，这就好了。所以从不同的角度讲是有出入的。我们要打倒的欲望，是私欲，这就是我们佛教讲的道理。<br/><br/> 　　“格物致知”，这是王阳明说的，格就是格去，格去物情物欲，把你的欲望心去掉。才能“致知”，才能导致你的良知良能出现。我们佛教讲明心见性。若欲望无止境，全心都是龌龊污垢，全心都是烦恼，就把你的真心光明遮蔽住了，也就见不着真心了。如果把物欲去掉，真心就现前了。真心现前，就是觉啊！原来是这样的大宝贝，我们自己从前不晓得，只知追求假相物质，为物所遮，在六道里轮回生死，妄受辛苦。今朝打破樊笼，出了六道轮回之后，心中有多么开心、多么庆幸。自己出离了不算数，还有这许多众生在生死轮回之中，怎么叫他们统统出来呢？所以就发大心，要拯救众生。拯救众生当然也需要创造发明，因为要利益众生嘛，要为众生服务嘛！象这样为群众服务，为劳动人民、为大众利益着想，不是很好吗？所以我们佛教思想是很正确的。<br/><br/> 　　佛说的破五蕴、破六入、破十二处，就是破妄心啊，妄心破了，真心就现前了，我们就能得道。破妄正是显真。反过来说，这些五蕴、六入、十二处都是我们的如来藏妙真如性。如来藏是真，真如佛性是真，那么这五蕴、六入、十二处也是真了，因为这是我们的妙用啊。有了心王之后，这些伙伴、伙计，就不会乱来，就能够起妙用，岂不是很好吗？看你识得不识得，这个最关键，识得真心，在一转之间就是了。妄想也不要去，妄想本身就是真如啊，是水起的波浪。波浪本身就是水，波浪去掉之后，水也就没有了。所以，五蕴、六入、十二处也不要去掉，只要我们知道是妄心，不去执著它就是了。只要去掉我们的妄执，那就一真一切真了。你要是执着它，那就一假一切假，全都是假的了。你要是起了妄想执着，就又六道轮回中去了，又要受辛苦去了，多冤枉啊！所以我们要明白这个道理。<br/><br/> 　　《楞严经》就有这个好处，它说，五蕴、六入、十二处、十八界，法法全真，都是我们的妙真如性，用不着去掉它。一真一切真，认可了之后，法法都得真实受用。我们平时修行，要晓得一个“觉”字，要晓得道属于悟，不属于修。修是什么？说成修复就对了，就是回复我们的本来面目。假如本来没有，无中生有，把他修得生出来了，那就错了，那是“因缘性”，是因缘所生法。所以道是妙悟，悟得以后，要承受得起，承当得起，承当得起。然后时时刻刻做功夫保护它。保护一个阶段以后，再放任它，放手空心，就得真实受用了。参禅、念佛、修密都是祖师设立的方便门庭，是修行用功的方法，使众生能够进入般若之门所用的手段。各种方法都有不同，并非只有一个固定的方法。不是一定要参个啥东西出来，不是一定要念多少多少佛号，不是一定要秘密地修个啥神秘的东西出来。都是为的当下得悟，离开执著，得真实受用，不是一定要到啥地方去。所以我说，真生西方极乐世界者，当下即生。这里的娑婆，就是西方的极乐。这句话，人家容易误会，这就是西方极乐世界？西方极乐世界没有啦？不是这样说，是我们把西方极乐世界的范围扩大了。净土本来就是我们心啊，我们心包太虚，十方世界都在我们心里呀，西方极乐世界为啥不能扩大呢？当下即生，因为你不受一切受，你没有什么痛苦，没有什么烦恼，你时时空、时时刻刻都是常乐我净，你不是佛是什么？那还不是生西，又会是什么？所以不要迷执，一定要在西方，一定要是极乐世界，一定要念多少佛的名号才能生西方，修其它净业就不能生西方，这是错误的。西方极乐世界是净土，心净即佛土净，随便你修什么法门，只要你修得心清净，不粘污，你发愿生西方净土，就一定能生。不仅生西方净土，乃至于其它九方净土，亦复能生。只要你发愿往生，佛是不会拒绝的。“唉，你不是念佛的，你没有念我的名字，不许来，不许来。”不是这个样子。<br/><br/> 　　上面讲的是十二处。下面就要讲十八界了。<br/><br/> 　　十八界是什么呢？就是前面讲的六根、六尘，再加上六识，三六一十八--十八界。十二处是借根破境，十八界是破界，界限的界。这界是什么呢？界本来是界限，一种分界线，这样东西同那样东西毗连在一起，有条线划分开。在佛经里讲界的时候，很多人说，界可作为因来讲，因遇到缘就生出果来了。也有人说界是作种类讲，比如一个种族，或者一个类别。人的身份、地位和工作是可以分类的，譬如人家问你：“你是哪个行业的？”你可以回答：我在新闻界，或者是实业界、产业界等等。现在这个经文里讲到界，就是通常所说的界限的意思，因六根加六尘之后生出六种识，根、尘、识一共就是十八界。界等于一片田地，里边有许多田埂，每一个田埂就是条界限。我们的六根对着六尘，以之为界限生出来六识，比如眼根遇色尘生出来的叫眼识，耳根遇声尘生出来的叫耳识。其实根与尘生出来的识本来是第八识，它原本是一精明，本来是一个，不是六个，就如同一片大地，若没有田埂，它就是一片土地，没有界限。现在因为被前面的眼、耳、鼻、舌、身这五根罩牢了，识就被相互隔绝，所以不能互用。前五根对外五尘起分别，就有了差别相和差别心，将彼此互相隔离开，成为界。执著眼根只能见色、鼻根只能嗅味，六根的作用各有其分类和界限。根尘一接触，即因为六种和合而分为六个识。这里讲十八界，就是要破这个界。正如《心经》所说：“无眼界，乃至无意识界”。有个界在就坏了，它把我们的一精明完全隔断开。把这个界打破，界限没有了，诸根就可以互相为用。<br/><br/> 　　古时候对这十八界，是分成心法和色法来讲的，说这个十八界是“心色俱开”。我们前面讲五蕴的时候，曾经说是“开心合色”，因为以五蕴中的色为色法，受、想、行、识为心法，心法展开成四个，合一个色法，所以叫“开心合色”。讲六入的时候，又说是“开色合心”，在六根当中，眼、耳、鼻、舌、身这五根是识的依处，用这五根合第六意根，所以叫“开色合心”。现在讲十八界是“心色俱开”，心色怎么俱开呢？就是用眼、耳、鼻、舌、身、意这六识，再加上意根，加起来是七个识，作为心法；其它的眼根、耳根、鼻根、舌根、身根这五根，再加上色、声、香、味、触、法六尘，一共是十一处，作为色法。把这里十一处组成的色法，和七个识组成的心法，合起来构成十八界，叫“心色俱开”。其实这种说法也不一定准确。比如讲到开合，在五蕴法当中，前面的色为色法，即一切境界，后面的识是心法，是了别的功能，而受、想、行这三样既是色法，也是心法，如果没有心，怎么能去领受？如果没有色，又如何去接受？所以受、想、行既通心法，又通色法。因为它们两面都通，因而说“心不自心，因色故心；色不自色，因心故色。色即是心，心即是色”，这样合起来以后，我们说五蕴不完全是开心，而是把心色两方面都说到了。在讲到六入的时候，因为六根吸收分别外面六尘，从作用上讲，这个吸收就是心，这样一来六根也就是六种心，所以不能简单地讲是开前五根合意根。在这十八界当中，六个识心很重要，破掉这六个识心，这些界限就都破掉了。<br/><br/> 　　下面就开始依次破这十八界：<br/><br/> <strong>　　第四科 十八界虚妄，本非因缘、非自然性</strong><br/><br/> 　　“复次，阿难，云何十八界，本如来藏妙真如性？”<br/><br/> 　　十二处已在前面讲过了，现在要讲十八界。什么是十八界呢？为什么十八界是如来藏妙真如性呢？十八界中的六根、六尘，看起来都有处所，而生出的六识是妄心，它们怎么会是如来藏妙真如性呢？按照普通人的说法是真的有根、有尘、有识，因为他们粘着根、尘、识，认为外面有境界、有东西，于是就有了看、听、嗅、尝、触，再因看、听、嗅、尝、触而生出种种分别。其实根尘识这三样都是我们的妄心，本来都是没有的，但真也不离妄，如果能透过相来见，这根、尘、识都是我们妙真如性所显现的。就好比一片白云所现出来的那些猫、狗、狮子、山水等等相，那些相其实是假的、没有的，是由白云幻现出来的，云还是云，并不是猫、狗、狮子、山水，你如果明白二者之间的关系，就可以透过假象见到白云，否则就只能被假象所迷惑，见不到白云。假如我们眼里生翳，视觉出了问题，看见空中有花，就好比是有根尘识了。如果我们眼睛清净了、觉醒了，知道相就是性体，那么见相时即是见性，所以在佛眼看来根尘识都没有，都是妙真如性。但是众生因执着色相，心生颠倒之故，不认识这个真如佛性，只看见外面的色相，所以生出种种分别。这是什么缘故呢？为什么是妙真如性呢？释迦佛下面就分开来讲：<br/><br/> 　　（一）眼、色、色界，三处都无<br/><br/> 　　“阿难，如汝所明，眼色为缘，生于眼识。此识为复因眼所生、以眼为界？因色所生、以色为界？”<br/><br/> 　　阿难，正如你所知道的，“眼色为缘，生于眼识”。眼识是根对色接触之后生出来的，所以说眼色为缘，生于眼识。识是了别，使你知道看见的是什么东西，眼识生出来了，我们就可以看见一切东西，外面的男女老少、饮食起居、事事物物都能看得见。<br/><br/> 　　“此识为复因眼所生、以眼为界？”这个眼识是不是从眼睛所生，以眼为界呢？这句话的意思是说，眼睛生出来的东西，只能是眼睛，不应该是眼睛以外的东西。譬如狗生出来是狗，猫生出来是猫，那么眼睛所生出来的东西，当然还是眼睛，既然同于眼睛，只能以眼为界，不会是眼睛之外的东西。就象猫生出来的是猫，不可能到狗界中去；狗生出来的是狗，也不可能到猫界中去。如果这个眼识是眼所生，那么即等同于眼睛，既然以眼为界，应该只见眼睛，而不能见眼睛以外的色相。如果不是从眼所生，那么会不会“因色所生，以色为界”？假如眼识不是眼睛生的，那是不是由外面色尘而生，以这个色尘为界呢？假如是外面色尘所生，色尘所生的东西也一样都是色尘，在色尘之外不应该再有别的东西。假如是以色为界，就只能见色，而不能见空。空与色是相对的，如见空即违色，违色就不是色所生。在色与空之间有一个这样的界限。<br/><br/> 　　十八界主要是在讲六识，但是如果不与根尘连在一起说，就不能做详细的分别。就象我们刚才说的，一片田地，假如没有田埂，你就不能分清哪块地是谁的，如果用田埂隔开了，你就知道：噢！这一块是我的，那一块是你的。六识与根尘连在一起讨论，根尘就是十二处。由于十二处已经被破掉了，再破十八界也就好懂了。<br/><br/> 　　“阿难，若因眼生，既无色空，无可分别，纵有汝识，欲将何用？汝见又非青黄赤白，无所表示，从何立界？”<br/><br/> 　　这里要做进一步地分析了。“若因眼生，既无色空，无可分别”。假如眼识是眼所生出来的，这个眼睛哪里有色，哪里有空呢？我们每个人的眼睛无色又无空，既然无色无空你分别什么东西呀？因为有色有空才去分别，你面前究竟是猫还是狗，是桌子还是椅子，可以通过色相的差别区分开来。假如没有色只有空会怎么样？对于空与色之间的关系，我们说过是因空显色，因色显空，如果空里没有色，那么这个空又因何建立呢？又能有什么分别呢？所以眼识离开色空，就无可分别。<br/><br/> 　　“纵有汝识，欲将何用？”眼识是要依靠分别、了别来起作用的，如果没有一个可供分别的对象，你眼睛所生的这个眼识就派不上用场，有也就等于没有，所以说纵有汝识，欲将何用？就算你离开色空之外真的有这个眼识，有这个能力和能量在，但是没有色空，你能拿它来分别什么东西呢？没有东西你能见什么呢？根本就起不了这个作用啊！光有这个能见还不行，还要有所见才能起作用，否则就是有也等于没有。<br/><br/> 　　“汝见又非青黄赤白，无所表示”，就是纵然你有个见在，但你这个见不是青黄赤白，不是长短方圆，不是冷暖涩滑，没有任何名相和概念可以表述它、形容它，一切东西都没有，那么它“从何立界”呢？我们平时所说的每一样东西，都可以用它特殊的属性来加以表述、区别，而你这个见一切都没有，根本就无从表示，无从表示就等于没有，既然没有又从何立界？你怎样给它界定呢？有东西可以划界限，到这里为界，那边是你的，这边是我的。如果没有东西，这个界限即无从建立。既然无从表示，界限自然就没有了。<br/><br/> 　　“若因色生，空无色时，汝识应灭，”<br/><br/> 　　我们前面说过，被生出来的东西的性质，与生它的那个东西在本体上应该一样，不应当有二致。假如说这眼识因种种色境而起，是从色境上生的，那么这个识只应见色，而不应见空，当空来的时候你的眼识也应当灭掉。既然眼识没有了，那么：<br/><br/> 　　“云何识知是虚空性？”<br/><br/> 　　如果没有色就没有识了，你怎么会知道虚空性呢？这就说明眼识不是从色所生，不是由外面色境生出来的。<br/><br/> 　　“若色变时，汝亦识其色相迁变，汝识不迁，界从何立？”<br/><br/> 　　这个变即是生住异灭，因为每一样东西生出之后，都要经历由生而住、而异、而灭的过程。就象人一样，离开母体以后，都会慢慢由小而少、由少而壮、由壮而老，最后由老而死。“若色变时，汝亦识其色相迁变”。这个色境也是如此，在不断地起变化，不但现在的色相你知道，就是它起变化的时候，你也知道它在变化。“汝识不迁，界从何立”？前面佛问国王，你三岁时见的恒河与六十岁见的一样吗？有什么变化没有？国王说我六十岁所见恒河，与我三岁时见的恒河一样，因为这个识性不会随着岁月的流逝而变迁。既然你这个识不会随色而变，那从什么地方去立界呢？你的眼识好比是一块田，色相就象田里的田埂，如果田埂总是调来调去，那么这个界限即无法安立。既然色相是变迁的，可以随时变来变去，而你的眼识是不动的，这个界限当然也立不住了。<br/><br/> 　　“从变则变，界相自无。”<br/><br/> 　　既然一个变一个不变，界限立不住，那么现在反过来假设会怎么样呢？假如说色相变了，你的眼识也跟着变。一切东西都在变来变去，你连应该怎样划界都定不下来，所以说“界相自无”。刚才说田埂在变，大地不变，现在大地也在跟着变，两个都在变来变去，这个界限怎么立呢？这就反过来证明眼识不是从色生的。<br/><br/> 　　“不变则恒。既从色生，应不识知，虚空所在。”<br/><br/> 　　假如眼识不变，是恒常的。但是眼识是从色生的呀，从色生的只应当识色，那就不应当识知虚空了。但是我们现在不是如此，我们见色观空，既能见色，又晓得空之所在，这就证明眼识不是色尘所生。前面讲不是眼根自己生的，不是自生，后面讲的不是色尘生的，不是他生。那么不自生、不他生，或者是合起来一起生（共生）呢？所以再假设共生：<br/><br/> 　　“若兼二种，眼色共生，合则中离，离则两合，体性杂乱，云何成界？”<br/><br/> 　　把两种合起来了，根与色，眼根与色尘合起来生，我们来看看是不是能共生。<br/><br/> 　　“合则中离”，若合起来生，当中就没有了。比如现在，两只杯子当中是一本书，要把两边的杯子合起来，当中的书就离开了，就没有当中可得了。没有当中可得，分界线就没有啦。显然不能合起来共生，那么，离开了，再共生，行不行啊？<br/><br/> 　　“离则两合”，若离开了生，一个生一半，眼根生一半，色尘生一半，再把这两半合起来成为眼识。这又不对了！上面说过，从眼生的，性同于眼；从色生的，性同于色。打个比方：譬如一块田，一边靠山，一边靠水。靠山这一半田的性质是山田、高地，适合种玉米；靠水这一半田的性质是水田、低地，适合种水稻。两田性质不同，合到一起，种什么呀？一边是眼根，一边是色尘。眼根这边是有情，色尘这边是无情，有情与无情两个合起来，这可能吗？假如这样，就“体性杂乱，云何成界？”一半有情，一半无情，有情与无情怎么能合在一起，这就乱了套啦，这不可能啊。这就是说不能共生。那么，眼识是凭空产生的吗？也不是啊！这就是“不无因生”。不自生、不他生、不共生、不无因生，“是故说无生”，那就是无生了。了了见，无所见，根、尘、识三都不可得。都不可得故，就是菩提妙净明体，就是如来藏妙真如性。<br/><br/> 　　“是故当知，眼色为缘，生眼识界，三处都无。则眼与色及色界三，本非因缘、非自然性。”<br/><br/> 　　从根生不可得，从色生不可得，从共生也不可得。都不可得之故，你的“眼色为缘，生眼识界”这个知见，是不对的。眼、色、眼识，三处都是没有的。你晓得的这个知见只是通俗说法，执有的人通常都会这样看。照佛的眼光看来，一切都无。我们说西方极乐世界也是没有。这个没有，正是显真心、显真菩提心，不要误解这句话，理解成断灭啊。正当说“三处都无”时，我们的眼睛不是明明能看见东西吗？我们眼前，有男女老少。这房间里，你看多少东西，形形色色，桌子、床、厨柜，什么都有，这个假相不无。所以西方极乐世界也是有。其实是这样的：方便说是有，彻底说是无，究竟说来，是非空非有、非有非空，两边都不可得。说有说无、说真说假，都是你自己的分别心，都没有说到本体。说到本体，无可说处，没有你开口处。<br/><br/> 　　眼根、色尘与眼识，这三样东西都没有。都没有之故，“则眼与色及色界三，本非因缘、非自然性”色界是指眼识，眼根与色尘合起来生出眼识，所以叫做色界，这个“界”就是与根尘的分界。眼根、色尘、眼识，这三样东西，本非因缘、非自然性。不自生、不他生、不共生，就是非因缘性，不无因生就是非自然性。自然而有，自己无因而生，就是自然性。不是这样，不无因生，就是非自然性。<br/><br/> 　　大家有什么问题吗？要问这个因缘生呀？<br/><br/> 　　对呀，凡所有法，都是因缘所生，怎么会不是因缘所生呢？我们刚才讲过了，不自生、不他生、不共生、不无因生，就是因缘所生。因缘所生就是无生啊。佛说的因缘生就是无生义，不是有生。这些相都是假相，不是实有的，所以“因缘所生法，我说即是空”，是没有的。因缘所生就是无生，无生之故，还有啥因缘！就体说，是无生；就相用说，就是因缘所生。<br/><br/> 　　前面提到过，界是因。破界就是破因。因不可得，还有什么缘不缘的呢？须有因，才会遇到缘。因是主因，缘是助缘，因缘相聚，就会发起现行。譬如种子，种子有生起禾苗之因，遇着泥土、遇着太阳、遇着水份这些缘，就能生起禾苗来。假如没有因，没有这颗种子，尽管有太阳、水份、泥土，又有什么用？能生起什么东西来啊？有人说，界就是因。又有人说，界是种类。比如我们平常说，你在啥地方工作？噢！我在报界。<br/><br/> 　　现在讲耳识了。十八界主要是破六识，六识破了，界就破了。眼、耳、鼻、舌、身、意，挨次序下来，该破耳识了。<br/><br/> 　　（二）耳、声、声界，三处都无<br/><br/> 　　“阿难，又汝所明，耳声为缘，生于耳识。此识为复因耳所生、以耳为界？因声所生、以声为界？”<br/><br/> 　　这个句式与前面一样，前面懂了后面的就好讲了。<br/><br/> 　　世尊对阿难说：正如你所知道的一样，“耳声为缘，生于耳识”。耳识是由内里的耳根，听到外面的声尘，而产生出来的，这是大家都认可的道理，每个人都会说是我听到外面传来的声音。这个听声音的功能是从哪里来的呢？按照一般的说法，因为耳根有闻性，它根据外面声尘的起灭，而生出动与静的知觉。没有声尘的时候是静，可以听到有个无声；有声尘的时候是动，声尘传到耳朵里面就知道有声音。<br/><br/> 　　“此识为复因耳所生，以耳为界？因声所生，以声为界”？跟前面所说的一样，假如这个耳识是由耳朵生出来的，那么耳识的性质应该跟耳朵一样，所谓以耳为界，就是用耳朵做界限，只能听到耳朵里面的声音，而不应听到耳朵之外的声音。如果是因声所生，就应该以声为界，假如这个耳识是由声音生出来的，那么就只应该听到动的声音，在动之外的静你就不应该知道。也就是有声音时有这个耳识，没声音的时候这个耳识也没有了才对。但是我们的耳朵现在能起觉根的作用，不但有声音的时候能听得见，就是没声音的时候也是照样听到，因为这个时候我们还能听到个没声音啊！就象前面经文讲的，瞎子虽不能见物，但能见黑暗，见到黑暗还是有见。你听不到声音的时候，并不是无闻，你还闻到了一个无声啊！<br/><br/> 　　佛这样讲是为了说明，所谓由根尘合起来生出耳识，这些都是因缘所生的法。“因缘所生法，我说即是空”，这些因缘法本来是没有的，在佛眼看来当体是空。佛现在开始为阿难破这个耳识，在耳根、声尘、耳识这三样中，耳识居中，如果破掉耳识，则耳根与声尘也就当下破掉了。破妄是为了显真，只有破掉虚假的五蕴、六入、十二处和十八界，才能显出真实不虚的妙明真心。从我们前面讲的五蕴、六入、十二处，到现在所说的十八界，统统都是破，一层层地破光。到了后面的七大就统统都是有。破妄是为了显真，破掉妄心以显真心。真心是有，说有是为了懂得妙有。如果只讲真空不说妙有，怕人们落到偏空里去。现在讲耳识也是在破，要破得体无完肤，把根、尘、识统统破光。<br/><br/> 　　“阿难。若因耳生，动静二相既不现前，根不成知。”<br/><br/> 　　假如你的耳识是因耳朵生出来的，以耳为界，就听不到界外的声尘。动静两种声尘不现前，你这个耳朵应该不成知觉，也就是没有耳识。假如离开动静之相，你耳朵听什么呀？就象眼根离空离色即无所见一样，耳朵离开动静的声尘，也无所知。你耳朵既然没有知觉，那么耳根也就不能成知。<br/><br/> 　　“必无所知，知尚无成，识何形貌？”<br/><br/> 　　这个知就是体。连个知都尚且没有，识又做何形貌呢？连这个听的本体都没有，听出来的东西又在哪里呢？就好比没有父母，怎么会生出子女来？根本不可能嘛。再打个比方，比如稻子和麦子，它的种子可以发芽，可以生长出来。但是如果不遇到水，不遇到土，它就发不出芽来。那么这个没有发出来的芽是什么形状呢？当然没有形状可得了。我们的耳朵里有闻性，能听闻声音，但是如果不遇到动静的尘相，没有外缘的作用，是没有知觉的。就象种子本来可以发芽，但是也离不开水土之缘，离开水土就发不出芽来。没有动静二相，耳根不能成知，证明耳识不是从你耳朵里头生出来的。<br/><br/> 　　“若取耳闻，无动静故，闻无所成，云何耳形杂色触尘，名为识界？则耳识界复从谁立？”<br/><br/> 　　假如耳朵里有能闻之性，如此则“无动静故，闻无所成”。你耳朵里虽有闻性，却没有动静之尘。不遇外缘，这个听觉就不能成立。就象刚才所举的例子，稻种、麦种如果没有水土之缘，它就生不出来。耳识也是这个道理。既然是“闻无所成”，那么“云何耳形杂色触尘，名为识界？”怎么能说这个耳朵为根，接触色尘而成为识界呢？ “杂色触尘”就是耳朵的形体接触外面的色尘。这个触是身根的功能--触觉（身识界），不是耳识。这两者根本不是一回事，所以你这样想是错误的。“则耳识界，复从谁立”？你把耳识与身识相混，因为“闻无所成”，就用耳朵的形体接触色尘，那么这个耳识的界限，你从何处建立呢？既然耳朵已经归到身根了，现在连耳根也没有，你拿什么立耳识界呢？<br/><br/> 　　“若生于声，识因声有，则不关闻。无闻则亡声相所在。”<br/><br/> 　　假如这个耳识是从声音生出来的，既然是因声而有的，那与你的听觉就没有关系了。“无闻则亡声相所在。”假设你没有闻性，没有听觉，没有听到声音，那怎么能知道声相在呢？谁又能分辨这个声音究竟是美妙的乐曲、还是吵人的杂音呢？声音不能自己听自己，如果没有闻性，没有听觉，声相当然也就不可得。<br/><br/> 　　“识从声生，许声因闻而有声相，闻应闻识，”<br/><br/> 　　假如说这个耳识是从声音生出来的，就应该允许你说声音是因闻而有声相的。既然是由闻而有声相，那么这个闻也应能够闻到耳识。声尘生出来的东西应该等于声尘，既然你这个耳识是从声音生的，你听到声音应该就听到耳识呀！所以说“闻应闻识”。刚才说的是无闻，这个东西是声音，与你的闻性不相干（则不关闻）。现在说的是无声，声音就是耳识。那么，当你听到声音的时候，也就是听到了你的耳识。<br/><br/> 　　“不闻非界，闻则同声。”<br/><br/> 　　你能闻识吗？当然不能！哪有人能够闻到这个耳识呢？既然你不闻，听不到声音，“不闻非界”，那如何能构成界呢？<br/><br/> 　　假设有闻，“闻则同声”，这个闻性与声尘是一样的，同于声尘。声尘不能闻，那你自然就不能闻。所以这个耳识既不属于你的耳根，也不属于声尘。<br/><br/> 　　“识已被闻，谁知闻识？”<br/><br/> 　　假如允许你听到这个识，那么你的耳识已经变得跟声音一样了，如此则“识已被闻，谁知闻识？”这个耳识已被听到，成了所闻，那么能闻的耳识就没有了。没有能闻，是谁知道听到了这个识呢？耳识被当做声音听了进去，那是什么听到了这个耳识呢？这怎么能辨别究竟是声还是识呢？<br/><br/> 　　“若无知者，终如草木。”<br/><br/> 　　假如你没有知觉，就变得跟草木一样。现在我们都有知觉，都能闻声，所以我们都不是草木。既然我们不是草木，这就证明耳识不是从声音生出来的。经过这样反复的推演，从这边看，生不出识；从那边看，生不出识；合起来看，也生不出识。这就证明耳识是根本没有的。释迦佛这样反复地讲，就是帮助我们打破对识界的执著，由破相而见性。上面讲的是不自生、不他生，下面将它们合起来讲，就是不共生。<br/><br/> 　　“不应声闻，杂成中界。界无中位，则内外相，复从何成？”<br/><br/> 　　这里的中界，就是指耳识界。因为耳识既不从根生，也不从尘生，那么总不应该说，是由声音和闻性两下合起来，相杂而成耳识界吧。普通人认为这个耳识界，是由耳根对外面的声尘，内外两边和合，生出当中的耳识，如此而成界。我们刚才说过，由内外和合而生出当中，这个当中是不成立的。“界无中位”，既然没有中位，这个耳识界就是没有的。现在要破这个界，看看由内外两边能否和合成中间的界，如果中间的这个界不可得，那么内外的相又如何成立呢？所谓中者，必定要能够分出两边。譬如我们两个人，我在这边，你在那边，两人之间就为当中。我们两个如果合在一起，那么这个当中就没有了。所以说由两边和合起来，形成一个当中，这是不可能的。既然构不成中间的界，“则内外相，复从何成”？如果讲到这个界，就应该有当中，假如有一个当中的地方，可以说有两边的界限，如果中间的位置没有，那么两边的界自然没有，内外与中间都不可得。由于既无当中，又无两边，如此则内外相都不可得，这就是不共生。<br/><br/> 　　“是故当知，耳声为缘，生耳识界，三处都无。则耳与声及声界三，本非因缘、非自然性。”<br/><br/> 　　所以应该明白，你从前认为的以耳声为缘，生耳识界。这耳根、声尘和耳识三处，根本就没有，都是虚妄不实，不能成立的。前面讲由耳根、声尘和合生出耳识，这不过是顺应普通人的习惯，按照世间法来说的。世间上的法都是假法，你不能执着为实有，不要当真啊！因为这三处本来都没有。<br/><br/> 　　“则耳与声及声界三，本非因缘、非自然性。”界就是识。耳朵与声尘，以及二者和合生出来的声界，这能生与所生的三样东西，都是既非因缘、亦非自然。不自生、不他生、不共生，是非因缘性，不无因生是非自然性。由于既不是因缘，也不是自然，所以说根本没有。<br/><br/> 　　上面讲的是耳识，下面开始讲鼻识：<br/><br/> 　　（三）鼻、香、香界，三处都无<br/><br/> 　　“阿难，又汝所明，鼻香为缘，生于鼻识。此识为复因鼻所生、以鼻为界？因香所生、以香为界？”<br/><br/> 　　就象你所知道的，“鼻香为缘，生于鼻识”。鼻是鼻根，香是香尘，如果是以鼻根和香尘为因缘，生出鼻识，那么“此识为复因鼻所生，以鼻为界？因香所生，以香为界？”假如这个鼻识是从鼻根所生，应同于鼻，于鼻之外别无所知，所以说以鼻为界。假如这个鼻识是因香所生，应同于香，于香之外别无所知，所以叫做以香为界。这个界是不是这样立起来的呢？<br/><br/> 　　“阿难。若因鼻生，则汝心中以何为鼻？为取肉形双爪之相？为取嗅知动摇之性？”<br/><br/> 　　世尊问阿难：假如说鼻识是从鼻根所生，那么你心中以何为鼻呢？你用什么东西做为鼻根呢？我们外面的鼻子有两个孔，象两个脚爪合拢一样的，所以叫双爪之相。那么你是取肉形双爪之相，还是取嗅知动摇之性？<br/><br/> 　　“若取肉形，肉质乃身，”<br/><br/> 　　假如你取外面这个双爪的形相，作为鼻根的话，这个肉质的鼻子是身根啊！<br/><br/> 　　“身知即触，名身非鼻。”<br/><br/> 　　身体所感受的知觉是触觉，它只能觉离觉合、知冷知热，而不能嗅香嗅臭。既然这个肉质的鼻子只能领受触觉，那么就叫身根，而不是鼻根。<br/><br/> 　　“名触即尘，鼻尚无名，云何立界？”<br/><br/> 　　这个触觉即是触尘，因为只有触尘与身根，连鼻子的名字都没有，又怎么会有鼻体呢？如果没有鼻体，你拿什么做界限呢？<br/><br/> 　　“若取嗅知，又汝心中以何为知？”<br/><br/> 　　现在进一步问了：既然说鼻子是身根，那么我不取鼻子，我取嗅知之性，就是上面说的嗅知动摇之性，来做我的鼻根，这样行不行呢？假如你以这个嗅知之性做鼻根，“又汝心中以何为知？”这个知已经成为鼻根了，那么你心里还能以什么东西为知呢？<br/><br/> 　　“以肉为知，则肉之知，元触非鼻。”<br/><br/> 　　假如以鼻子肉体的感觉，作为鼻识之性的话，那么这个肉体能够知道的是触觉，而不是你的鼻识，这叫做元触非鼻。这就说明以肉为知是不对的，那么反过来说又如何呢？<br/><br/> 　　“以空为知，空则自知，肉应非觉。”<br/><br/> 　　既然说以肉为知不对，那么能不能以鼻孔中的空为知呢？如果以这个空为知，“空则自知，肉应非觉”。假如这个鼻孔中的空可以为知，那是空自己知道，鼻子的肉体即不应该知道。<br/><br/> 　　“如是则应，虚空是汝，”<br/><br/> 　　既然是虚空知道，那么虚空就应该是你，虚空就变成你自己了。<br/><br/> 　　“汝身非知，今日阿难，应无所在。”<br/><br/> 　　假如说是虚空知道，你的身体不知道，这是事实吗？当然不是事实。实际上是你的身体知道，而虚空不知道。这就证明根本寻不着你的鼻根，既然鼻根都没有嘛，还立什么界限呢？如果说以空为知，虚空就是我的身体，那么你阿难应是虚空了，虚空没有身体，那么今日你阿难应该没有所在。但实际情况是你有这个身体，你的身体还在这里，所以证明不是以空为知。那么接下来是不是以香为知呢？<br/><br/> 　　“以香为知，知自属香，何预于汝？”<br/><br/> 　　既然以根为知不对，那么这个鼻识是不是从香尘生呢？如果鼻识从香尘生出来，从香生出的东西，它的性质应同于香，这个知觉性属于香尘，那么何预于汝？与你有什么相干呢？因为与你不相干，你自然不应该知道。<br/><br/> 　　“若香臭气必生汝鼻，则彼香臭二种流气，不生伊兰及旃檀木。”<br/><br/> 　　因为我是用鼻子闻到香臭味的，假如香气与臭气一定是生在我鼻子里面，那么这香臭二种流动的空气，应该“不生伊兰及旃檀木”。 前面说过，伊兰生出的是臭气，旃檀木生出的是香气，假如这香臭二气是从你鼻子里面生出来的，那么这两种气流就不是生于伊兰和旃檀木。<br/><br/> 　　“二物不来，汝自嗅鼻为香为臭？”<br/><br/> 　　如果面前没有伊兰与旃檀木，这香臭二物都不来的时候，你闻闻自己的鼻子看，你的鼻子是香还是臭呢？鼻子哪里会有香有臭？假如没有伊兰与旃檀木，这香臭二种气味根本就不可得。<br/><br/> 　　“臭则非香，香应非臭。”<br/><br/> 　　假设香臭的气味是从你的鼻子生出来的，那么“臭则非香，香应非臭。”如果生出的是臭味，就不应该是香的，假如生出的是香味，也不应该是臭的。可是你现在是既能闻到香，又能闻到臭，这就说明你的鼻子是非香非臭。<br/><br/> 　　“若香臭二，俱能闻者，则汝一人，应有两鼻。”<br/><br/> 　　假如你既能闻香又能闻臭，那么你一个人应该有两个鼻子才对。因为一鼻不能出二气，如果生出了香，就不应该再生出臭；如果生出臭，当然也就不能生出香。属于香的只能闻香，属于臭的只能闻臭，要想同时闻到香臭二气，“则汝一人，应有两鼻。”<br/><br/> 　　“对我问道，有二阿难，谁为汝体？”<br/><br/> 　　我们每个人只能有一套六根，如果有两个鼻子，就应该有两张嘴、两对眼睛、两副耳朵、两个身体，那么现在向我问道的阿难也应该有两个，如此一来“谁为汝体”？ 一个真的，一个假的，哪个才是真正的你呢？<br/><br/> 　　“若鼻是一，香臭无二，臭既为香，香复成臭，二性不有，界从谁立？”<br/><br/> 假如鼻子是一个体，香和臭杂入一鼻，混合在一个鼻子里面，那么应该是一体，而不是二体。如此一来香和臭分不出来，香就变成臭，臭就变成香，香不再是香，臭不再是臭，香臭都不可得，连香臭的二性都没有，那么界从谁立呢？因为没有香与臭这二性，它们是一体，是一样的东西，同样的东西你无法将它分出来，又怎么去立界呢？所以香臭不是从鼻子生。臭从伊兰生，香从旃檀木生，当这两种东西不来的时候，鼻子里面没有香臭。那么这个鼻识是不是从香和臭中生出呢？当然也不是。假如是从香生出来的，鼻识已经属于香了，那么在香之外，就不应该再闻到臭。如果是从臭生出来的，这个鼻识已经是臭了，也不应该闻到香。所以说这个鼻识既不从鼻根生，也不从香臭生，因此证明是不从自生，不从他生。<br/><br/> 　　“若因香生，识因香有。如眼有见，不能观眼。因香有故，应不知香。知即非生，不知非识。香非知有，香界不成。识不知香，因界则非从香建立。”<br/><br/> 　　“若因香生，识因香有”，假如鼻识是从香气生出来的，那么这个鼻识应该同于香，和香气应该是一样的。<br/><br/> 　　“如眼有见，不能观眼。因香有故，应不知香”。就象我眼睛有见性，这个见性只能观物，不能观眼，那么因香而有的鼻识，也应该不闻香。这里用眼睛做比喻，因为眼睛不能看见眼睛，那么香生出来的鼻识也应该不闻到香。<br/><br/> 　　“知即非生”，既然是香所生就不应闻到香，而你现在能闻到香，那么这个鼻识就不是香所生。<br/><br/> 　　“不知非识”，因为识是了别，应该有知觉，假如你不知道，闻不出味道，就是没有知觉，没有知觉怎么能叫做识呢？如果没有了别、感受味道的能力，就不能称之为鼻识。<br/><br/> 　　“香非知有，香界不成”，假如这个香非鼻识所知，而是鼻识之外有香，不被我的鼻识所知，那么这个香与我的鼻子没有关系，于是生不出香界。界就是界限，由内根外尘合起来，生出当中的鼻识，这个鼻识就是界，现在这个香在我的鼻识之外，与我的鼻识不相干，那么这个界就没有了，所以说香界不成。<br/><br/> 　　“识不知香，因界则非从香建立”。因香所生之识界叫因界，如果这个鼻识不能知香，而是在香之外有识，那么你所说的因香所生之识界，就不能从这个香而建立。既然识不知道香，那么因香所生的识界，从什么地方建立呢？鼻识的识界是因香所生，如果你的识不知道香，而是香外有识，那么这个香外之识又何关于香呢？如此一来因香所生的这个识即不能成立，识外有香，香外有识也都是不可能的，从而证明这个鼻识不从香尘所生。<br/><br/> 　　“既无中间，不成内外。彼诸闻性，毕竟虚妄。”<br/><br/> 　　有了两边才有中间，因为两边皆没有生识之义，就是从鼻根和香尘都不能生出识，那么中间鼻识这个界即不能成立。反过来如果没有中间，也构不成内外两边，没有中间的鼻识，内根外尘当然也就不能成立。离开内根、外尘，“彼诸闻性，毕竟虚妄”。如果没有根、没有体，能生出个什么东西来呢？你那个闻性根本就是虚妄嘛！所以你闻到什么香啊臭的，都是假的，都是虚妄不实的，根本就不可得，不要去执著它<br/><br/> 　　“是故当知，鼻香为缘，生鼻识界，三处都无。则鼻与香及香界三，本非因缘、非自然性。”<br/><br/> 　　所以应该知道，鼻根以香尘为缘，生出鼻识界，这根、尘、识三处都不可得。如此一来，“则鼻与香及香界三，本非因缘、非自然性”。鼻根与香尘，乃至于鼻识这三处，都不是因缘，也不是自然。我们上面说过，不自生、不他生、不共生是非因缘性，不无因生是非自然性。现在这三种都不可得，都是虚妄的，这就证明它的本体是真如佛性，所以我们处处不要着相，应该见性！释迦佛苦口婆心，为我们一处一处地破下来，每破一处就破掉一根，这样六根都解开了，这十八界都破掉了，你没有什么可以执著的，那岂不是时时刻刻都见性了吗？既然时时刻刻见性，岂不是大家都成佛了吗？《楞严经》妙就妙在这里，用不着你吭吭吱吱地去做早晚课，不需要你去参禅、念佛、修密，更不需要你去修什么有为的功德，你只要一切放下就可以了，因为你时时刻刻见性啊！这样修行多么轻松！多么潇洒！多么省力！所以修学佛法是很省力、很自在的事情，不需要那么拘谨，假如一定要花费多少力气，就不对了，那是徒自辛劳。你过去不懂这个道理，著相而修，以为要做多少功德，念多少遍佛才能成就，好比肩上挑着千斤重担。现在你懂了道理，知道自心本来是佛，灵明觉性本自天成，不须造作，不假修为，千斤重担一时放下，该有多么轻松愉快！禅宗有个公案，有一个和尚问赵州：“一物不将来时如何”？我们众生个个都是肩挑重担，妻财子禄、金银财宝、饮食起居，样样东西都压在身上，压得你透不过气来。那么我现在一物不将来，统统都放下，如何呀？这话看起来问得不错，能这样很好嘛，其实话里还有问题。赵州和尚很慈悲，于是对他说：“放下着”。既然已经一物不将来了，为什么还要让他放下呢？因为他还有一个一物不将来在，他还有一个东西，就象二乘一样，在破有之后又着在空上，还有个空在呀！这个一物不将来还是执著，还是病，所以赵州和尚让他连这个也放下。可是那僧到此还不惺惺，反而问：“即是一物不将来，放下个什么”？我这里一样东西都没有，还放下个什么呢？赵州看正面不行，于是用反激法，说道：“放不下，担起去”！你放不下，说明你心里还是有东西，那你就担起去。这句话讲得真好，就象是个双刃剑，一面是杀，一面是活，不愧为画龙点睛之笔。既然讲到放，就要放到无处可放的地步，不能有别的东西，那才是你的本来面目。这个一物不将来，看起来好象是什么东西都没有，其实还是有，因为还有个一物不将来，要把这个一物不将来也放下才行。就象梵志外道去见佛，他拿鲜花来供养释迦佛，佛说：“放下着”。梵志本来是用两只手拿花的，听到佛让他放下，于是把一只手上的花放下了，佛接着说：“放下着”。于是他又把另一只手上的花放下来，佛还在说：“放下着”。梵志说：“我的花都放完了，还放什么呀？”佛说：“吾非教汝放舍其花，汝当放舍外六尘、内六根、中六识。一时舍却，无可舍处，是汝免生死处。”梵志于言下悟无生忍。佛不是让他放下手里的花，而是让他放下心中的执著，要连这个放下也放下才行。<br/><br/> 　　释迦佛在这里连续讲六入、十二处、十八界，处处都是在破你的执著，这个破也就是放，放是为了叫你见性。等你放下一切颠倒妄想，妙明真心自然就现前了。<br/><br/> 　　下面接着讲舌识：<br/><br/> 　　（四）舌、味、舌界，三处都无<br/><br/> 　　“阿难，又汝所明，舌味为缘，生于舌识。此识为复因舌所生，以舌为界？因味所生，以味为界？”<br/><br/> 　　就如你所知道的，舌头与外面的味尘为因缘，生出我们的味觉来。那么这个舌识是舌头所生，以舌为界呢？还是味道所生，以味尘为界呢？如果是从舌生出来，舌头所生的东西应当同于舌头，对舌之外的东西就一无所知，所以叫以舌为界。假设是从味生出来，那么舌识应该同于味道，叫做以味为界。味道有酸、甜、苦、辣等许多种，但是你只能同于一种味道，如果同于酸即不知甜苦，同于苦即不知酸辣，那么究竟应该同于哪一种味道呢？<br/><br/> 　　“阿难，若因舌生，则诸世间甘蔗、乌梅、黄连、食盐、细辛、姜桂……都无有味。汝自尝舌，为甜为苦？若舌性苦，谁来尝舌？舌不自尝，孰为知觉？舌性非苦，味自不生，云何立界？”<br/><br/> 　　阿难，假如你这个舌识是从舌所生，“则诸世间甘蔗、乌梅、黄连、食盐、细辛、姜桂……都无有味”。我们知道甘蔗是甜的，乌梅是酸的，黄连是苦的，食盐是咸的，细辛、姜桂是辛辣的，如果舌识是舌头所生，这个味道来自于舌头，那么这些世间上的东西都应该没有味道，你也不用通过品尝它们来知道各种味道。酸、甜、苦、咸、辛这五味是正味，分别代表五方之味，其中甜表中央之味，酸表东方之味，苦表南方之味，咸表北方之味，辛表西方之味，由这五味可以和合出许许多多的味道。假如是你的舌头能生出味道，而不需要这些东西，那么“汝自尝舌，为甜为苦”？你尝尝自己的舌头，看看是甜还是苦呀？舌头是用来品尝别的东西的，通过接触物体而感觉出味道，是盐觉得咸，是黄连知道苦，如果没有别的物体，你的舌头能有什么味道呢？这就证明你这个舌识，不是从你的舌头生的。“若舌性苦，谁来尝舌”？假如舌头是苦的，那么舌已变成苦味了，什么来尝你这个苦味呢？谁知道你嘴里舌头是苦的呢？就好比说黄连是苦的，那么黄连能说自己是苦吗？它并不知自己苦，要你的舌头去尝才行。假如你的舌头是苦的，那么你的舌头就如同黄连，谁又来尝你这个象黄连一样的舌头呢？所以说“舌不自尝，孰为知觉”？舌头不能自己尝自己，这样就变成没有知觉了，那么是谁知道味道呢？假如这个舌头是苦味，那么舌头已变成一种尘相，变成一种东西了，一定要别人的舌头来尝你的舌头，才能生出味来。现在是你自己嘴里知道味道，不是别人的舌头尝了你的舌头以后生出的味道，这个知道味道的又是谁呢？<br/><br/> 　　接下来“舌性非苦，味自不生”。前面说你的舌性不是苦味，如果是苦味就无法尝味，味道也不能自己生出来。如果没有味尘，没有上面说的梅子、黄连这些东西的时候，酸、甜、苦、咸、辛这些味道也不能自己生出来。舌头自己生不出味道，按照前面经文说的，舌头不尝东西的时候是淡味，也就是没有味道，既然没有味道，那么云何立界呢？要有味道才能立界，比如这个是酸，那个是甜，根据味道的不同立出个界。现在根本就没有味道，你拿什么立界呢？<br/><br/> 　　“若因味生，识自为味，同于舌根，应不自尝。云何识知，是味非味？”<br/><br/> 　　假如你的舌识是从味道生出来的，那么这个识就变成味道了。因为彼此同性，味道生出来的东西，应该同于味道。就如前面所说的舌根一样，舌头不能自己尝自己，如果舌根是苦的，谁来尝这个舌根呢？同样道理，这个识既然已经变成味道了，因为味也不能尝味，谁又来尝你这个识呢？所以说“同于舌根，应不自尝”，自己不能去尝自己。如果是味道生出的识，识的本体是味道，它就不应该知道味道，就象黄连不知道自己是苦，梅子不知道自己是酸，那么“云何识知，是味非味”？舌识既然已经变成味道，它自己不能尝自己，那你如何知道有味还是没味？是酸味还是甜味、苦味呢？你现在能尝出味道，对酸、甜、苦、辣分得清清楚楚，并不是浑然无知，也不是把各种味道混同一个味道，所以就证明这个舌识不是从味道生出来的。<br/><br/> 　　“又一切味，非一物生，味既多生，识应多体。”<br/><br/> 　　再说呢，这酸、甜、苦、辣等种种味道，并非一物所生，象上面举的五味就分别属于甘蔗、乌梅、黄连、食盐、细辛，是各自从不同的东西生出来的了。那么“味既多生，识应多体”。因为识从味生，那么有一个味道就应该生一个识，如此则苦味生苦识，甜味生甜识，咸味生咸识，有多少味道，这个识就应该有多少体。因此说：<br/><br/> 　　“识体若一，体必味生。咸淡甘辛，和合俱生。诸变异相，同为一味，应无分别。”<br/><br/> 　　假如识体是一个、识体是味生的，那就会：“咸淡甘辛，和合俱生。”和合就是用几种味调和出一种新的味，比如我们烧菜要放好多佐料，最后出来是一个味。俱生就是把几种味道混合在一起，而又保持各自以前的味道，比如五味子就有五种味道，你吃的时候原来的味都还在里边。我们尝东西的时候，不但咸淡甘辛的味道你能尝出来，就是和合俱生的味道你也能尝出来。如果这个识体只能是一个，那么你尝了甜就不能尝咸，尝了酸就不能尝辣。“诸变异相，同为一体，应无分别”。因为你的舌体只有一个，那么不管尝什么都是一个味道，当然就分辨不出酸、甜、苦、辣种种味道了。<br/><br/> 　　“分别既无，则不名识，云何复名，舌味识界？”<br/><br/> 　　识就是分别和了别，如果没有分别，那么就不应该叫做识。你现在一点分别也没有，尝什么都是一个味，怎么能够称为舌识呢？既然不成为舌识，为何还要叫它舌味识界呢？你为什么说舌头与味道合起来生这个舌识，把它分成这三种界限呢？　　<br/><br/> 　　“不应虚空，生汝心识。”<br/><br/> 　　我们说舌根、味道和舌识这三种都是虚妄，那么离开这三者，还有什么能生你的心识呢？总不应说是虚空生出这个心识，因为虚空生不出东西来。这就证明你的心识既不从舌根生，也不从味尘生，内根外尘都不能生。下面再就和合而做论说：　　<br/><br/> 　　“舌味和合，即于是中，元无自性，云何界生？”<br/><br/> 　　舌根与味尘和合起来是共生，假如由二者的和合生出这个舌识界呢？“即于是中，元无自性，云何界生？”共生的前提是内根外尘要有自性，确实有各自的实体，前面已经证明了根尘本来没有自性，没有一个真正的实体，那么这个共生也是不可得的。既然没有共生，又怎么生出这个识界呢？我们说这个识界就是舌根所生的味觉，由作为内根的舌头，与作为外尘的味道，相互接触而生出的味觉。要有内外两边，才有当中的识界，现在两边根本就没有，那么这个当中也就不能成立。反过来说，既然没有当中，又哪里会有两边呢？由于根尘识这三处都没有自性，这个和合的共生根本不可得，舌识界如何能生得出来呢？<br/><br/> 　　“是故当知，舌味为缘，生舌识界，三处都无。则舌与味及舌界三，本非因缘、非自然性。”<br/><br/> 　　所以应该知道，舌根与味尘为缘，生出舌识界来，是不可能的，因为这三处都不是真有。既然三处都没有，所以说舌根、味尘及舌识界，“本非因缘、非自然性”。因为不自生、不它生、不共生，所以非因缘性。又因为不无因生，所以非自然性，根本都不可得。<br/><br/> 　　下面要讲身识了：<br/><br/> 　　（五）身、触、身界，三处都无<br/><br/> 　　“阿难，又汝所明：身触为缘，生于身识。此识为复因身所生，以身为界？因触所生，以触为界？”<br/><br/> 　　“身触为缘，生于身识。此识为复因身所生，以身为界？因触所生，以触为界？”由身体与外缘的接触，生出身识，那么这个身识是从身体生出来，以身体为界呢？还是从触生出来，以触为界呢？这个句子与前面一样，就是身体生出来的东西应该属于身体，对身体以外就不知道了。同样，由触生出来的东西应该属于触，对触之外就没有知觉了。现在问你是以触为界，还是以身为界？你看这个身识是从哪一面生的呢？<br/><br/> 　　“阿难，若因身生，必无合离二觉观缘，身何所识？”<br/><br/> 　　“若因身生，必无合离二觉观缘”。假如这个身识是由身根所生，那么就一定不需要合与离二种觉观，才能成触。觉观就是识别，有东西碰在我身上叫合，碰的东西离开了叫离，由身体与物体的合离而生出觉观。别的东西碰在我的身体上，我感觉到了，这样就成为触觉，假如没有东西碰在我身上，怎么会有触觉呢？所以这个触觉不能离开合与离。假如身识是身根生出来的，身体自己能生这个触觉，那么就不需要合与离这两种觉观。可是离开合与离这两种觉观之外，身何所识呢？没有外面物体的接触，离开了合与离，身根就没有知觉，你怎么能有触觉呢？触觉不能离开触尘，一定要有东西碰上去，由物体的合与离才知道是触，一直离开固然不能成触，一直合着也不能成触。假如离开触尘的离与合这两种缘，你就没有觉观，如果没有知觉了，你的身识又去识个什么呢？因而证明这个触并不是身根所生。<br/><br/> 　　“若因触生，必无汝身，谁有非身，知合离者？”<br/><br/> 　　假如触觉不是从身根所生，而是从触尘生出来的，与你的身体没关系，那么就不需要你的身体，即使没有身体也可以有触觉。但是“谁有非身，知合离者”？谁能够没有身体而知道离合呢？没有身体就没有身根，那么谁知道有东西碰过来了，谁又知道东西拿开去了？知道离合是因为有身体，没有身体就绝对不知道离合，如果没有身体，那么物体来来回回都碰到虚空去了，虚空又怎么知道是触呢？既然没有身根就没有触觉，这就证明触觉不是从触所生。<br/><br/> 　　“阿难，物不触知，身知有触。”<br/><br/> 　　物不触知是倒装笔法，就是物不知触，物体不知道有触，而是身知有触。　　<br/><br/> 　　“知身即触，知触即身。”<br/><br/> 　　这里说明身与触相辅相成。“知身即触”，知道身体就是触，你必须能够感知身体，才能生起触觉，因为没有身体是不知道触的。“知触即身”，你能够知道触，当然是因为有身体了，没有身体即不能生出触觉。所以，身即是触，触即是身，离身则无触，离触亦无身，这是互生，说明触与身是相应而成。那么下面：<br/><br/> 　　“即触非身，即身非触。”<br/><br/> 　　上面讲身即是触、触即是身，下面接着又说：“即触非身，即身非触”，触不是身，身不是触，前后意思是互相否定的。这是怎么回事呢？刚才讲的是互生，身与触互为所依，这里讲的是互夺，彼此夺掉对方存在的条件。譬如一物不能有二名，只应该有一名，假如说是身体，就不应该说是触，假如说是触，就不应该说是身体。刚才说身就是触，触就是身，一个东西变成有两个名字，两个名字讲的应该是两样事情，一个东西变成两样事情当然不对。互夺就是要互相夺去，那么夺去什么呢？就是证明两个东西根本没有。不但佛经上在讲夺，禅宗更是喜欢用夺的方法来接引人，叫“驱耕夫之牛，夺饥人之食”。农民种田要用牛来耕地，那么我就把你的牛赶走；你这个人饿得不得了，已经饥不择食，见什么东西都想吃，我就偏要抢走你手中的食物。为什么要这样呢？因为你平时著相惯了，假如不著东西你就不知该如何是好，那么我就要把你执著的东西都夺走，叫你在一物都没有的时候见到本性。禅宗接引人的手段就是这样活泼，这样绝妙。<br/><br/> 　　因为一物不能有二名，说触就不应说身，说身就不应说触，所以说“即触非身，即身非触”。身与触彼此互夺，说触就不是身，说身就不是触，如此一来就触也不可得，身也不可得，既然两面都不可得，所以：<br/><br/> 　　“身触二相，元无处所。”<br/><br/> 　　由于身和触二者都不可得，因此说“身触二相，元无处所”。所以身也好、触也好，这二者都是妄相，根本没有地方，没有所在。<br/><br/> 　　“合身即为身自体性，离身即是虚空等相。内外不成，中云何立？中不复立，内外性空，即汝识生，从谁立界？”<br/><br/> 　　什么是“合身即为身自体性”呢？就是这个经上所说的：阿难，你自己以手摩头，那么在摩头的时候，手和头合为一体，就是能触与所触合为一体，既然合为一体了，哪里还有能触与所触呢？但是同一个东西又是无法成触的。比如我要拍手，一只手拍不响，要两只手才拍得响。那么离身会怎么样呢？离身即是虚空等相。假设离开了我的头与手，离开了这个身体，根本没有东西，那么就是虚空了。<br/><br/> 　　如果是合身，能触与所触变为一体，一体之后就无能所；如果是离身，离身因为没有东西，就变成为虚空。由于合与离都不可得，那么“内外不成，中云何立？”既无内里的身根，亦无外面的触尘，内外都没有，那么当中的这个触觉，这个身识从什么地方建立呢？所以接下来问：“中不复立，内外性空，即汝识生，从谁立界？”没有当中自然就没有内外，既然内外都空了，那么你所生的身识，从什么地方立界限呢？这里的识属于身根之识，不属于耳根之识，耳根的识是听觉，身根的识是触觉。立界限一定要有内外方所，如果一定有里边的身根和外面的触尘，可以说生出了当中的身识，但是现在既没有两边，也没有当中，那么如何成这个界呢？因而证明这个界不可得。<br/><br/> 　　“是故当知，身触为缘，生身识界，三处都无。则身与触及身界三，本非因缘、非自然性。”<br/><br/> 　　所以你应该知道，以身根与触尘为因缘，生出这个身识界，因为这三处都没有，所以是不可能的。既然都没有，所以说身根、触尘及你的身识这三样东西，都非因缘，也非自然，因缘与自然都不可得。因为都不可得，所以都是空；因为都是空，所以这个六识都是虚妄；再因为都是虚妄，所以就证明它是真如佛性，在你的真如佛性之外是没有东西的。所以你不要迷惑，不要着相，不要执著你的身体，执著你的触识，这个身体与识都不可得。人都是执著有我，有这个身体，所以这个我执顶厉害，死去的人为什么有中阴身呢？就是因为这个我执太坚固了，死掉这个身体之后，还坚持认为一定有个我，一定有我的身体，所以现出一个中阴身。中阴身属于色身，与鬼魂一样，都是有形质的，只是非常淡薄，不象我们现在这个色身那样浓重。因为他们的形体非常清淡，不是每个人都能看得见，功夫做得好的人能看见，也有个别普通人看得见。这个执著真的很厉害，你活在这个世界上时执著的东西，在死了以后现出中阴身的时候，还会接着去执著。发愿生西方极乐世界的人，必须把一切放下才能往生，如果放不下就绝对不能去，根本生不了。假如你现在心粘着得不得了，那么到中阴阶段还是粘着得不得了，心里空不掉怎么能往生呢？所以你要空就得现在空、要放就得现在放，现在如果不肯空、不肯放，到中阴阶段就更加放不下了。我不是在吓唬你们，从前上海有个徐蔚如先生，是修净土宗的大居士，帮着印光法师一起弘法，鼎鼎大名，当时的人都知道他。后来他圆寂了，大家想，这样一位大居士总该生西方极乐世界了，为了验证他往生了没有，就做法来看一看。怎么验证呢？就是试试他有没有中阴身，因为生西方极乐世界的人没有中阴身，没有往生的人才有中阴身。要想知道有没有中阴身有很多法门，其中有种勾召法厉害得很，只要使用这个法，非但中阴身，连生人的魂也能勾召得来，这个可是真的，不是假的。大家用这个法一试，没招来，于是大家就想，看来他的功夫不错，已经往生西方极乐世界了。可是再仔细一想，这个徐蔚如居士以前是银行经理，他的保险箱里藏着许多宝贝，包括金条、宝石、地契、股票等等，很多很多，他的心会不会心粘在这个地方呀？那就再找找看，结果一召，果然没错，原来在保险箱里变成了个守财鬼，他不但没能生到西方极乐世界，反而落到鬼道里去了。所以说往生净土并不是一件简单事，你要放得下才能走得了，如果放不下就走不了。有人说我就这样马马虎虎念佛，只要能往生就行，所以用不着什么一心不乱。假如你真能够死心踏地念佛，心里一点也不粘着这个世界，不管能不能达到一心不乱，一直勇往直前地念下去，这样做当然很好。念佛有理一心，有事一心，理一心的境界很高，我们并不要求一定要做到理一心，只要能做到事一心就行。那什么是事一心呢？就是只有一个忆佛念佛的心，没有其他二心，除了忆佛念佛之外，不再挂念妻子儿女，不再想着金银财宝、房屋田产，你如果一门心思只想着佛，心就不会乱了，这就叫一心不乱，我们只要这样念，就能生到西方。但是假如你说：“不需要！不需要！我就这么马马虎虎地随便念念。只要相信有西方极乐世界，相信阿弥陀佛迟早要接引我们，只需把早晚功课一做，其他事情不用再管，其他佛法不用再修，尽管去做你的世法，临终的时候就能生西方极乐世界。”你要这样想就错了。你看徐蔚如大居士，他帮助印光法师弘扬净土法门，做过很多善事，写过很多文章，就因为留恋保险箱里的财宝，结果做了守财鬼，没有生到西方，后来还要再用密法来超度他。所以说大家修法不要贪图便宜，以为马马虎虎不要紧。我郑重相告：马马虎虎是绝对不行的！你的心一定要放下，你这里如果放不下，那里就肯定去不了。佛菩萨为什么对我们众生反复讲：没有啊！没有啊！你们不要执着啊！不要执着啊！告诉我们一切东西都是没有的，都是空的，就是要我们把一切放下，只有放下了才能往生啊！所以你们不要总是粘着在这个世界上面，一点都不肯放，不肯放就不能走。大家都知道六波罗密中以布施为第一，施就是舍，让你布施就是叫你学会能舍，要舍得掉才行。你如果总粘着在妻财子禄、名利得失上，这样修法是绝对不行的！<br/><br/> 　　下面要讲意识了，我们现在已经讲到十八界当中最后一个，也就是意识界。十八界就是六根、六尘加六识，三六等于十八。讲这个十八界是为了破界，要破界就得破识，因为有识之故才有界。识就是妄心，因为妄心一来之后，六根就不能互用，所以有了界限。比如眼睛只能看，不能听；耳朵只能听，不能看。假如把界限打破，六根就能互用，因为这六根本来是一精明，都是同一真心所起的作用。我们破这个界，就是要明白根本没有界，这个界限是我们的妄心执着出来的。经上现在要告诉我们，应该怎样破这个意识界：</p><p style=\"text-align: justify;\">　　（六）意、法、意界，三处都无<br/><br/> 　　“阿难，又汝所明：意法为缘，生于意识。此识为复因意所生，以意为界？因法所生，以法为界？”<br/><br/> 　　这里的讲法与前面一样，用的是同样句式：就如你平时所认为的，以意根和法尘为缘，生出意识。那么“此识为复因意所生，以意为界？因法所生，以法为界？”假如说这个意识是从意生出的，就不能超出意根的范围，要以意根为界。假如这个意识是从法尘生出的，就不能越出法尘的范围，应该以法尘为界。那么你现在究竟认为是从意根生的，以意为界？还是从法尘生的，以法为界？<br/><br/> 　　说到这里，有一些东西要对大家稍微讲一讲。对于这个意法，我们前面说的十二处里叫意处，这个意处所识的法，在相宗里讲有五种色法。第一种色法叫极迥色，为什么叫极迥色呢？这个迥是迥远、迥少，就是迥无所有的意思。譬如鸟在天上飞，当它飞得远了，看不见了，连个相都没有了，但是在我的意识当中还有个影子，这个若有若无的影子就是极迥色。第二个叫极略色，略就是非常微小，小得可以忽略，譬如你把色尘分析得小、小、小，一直到小无小处，小得没有了，但是还落个影相，这就是极略色。第三个叫定所生自在色，就是当我们入定的时候，所出现的定中境界。每个人打坐用功，定中都有境界，上次说过有境界就是有消息，叫得到一点消息，有的人坐来坐去一点境界都没有，这说明你还不曾上路。净土宗的人如果能象大势至菩萨所说的，把六根都摄在这一句佛号上，他一定会有境界，假如是散心念佛，念得乱七八糟的，就没有境界。禅宗不修这个境界，而净土宗是修境界的，他的心静下来之后，自然有境界。但是对这种境界也不能住，不能粘着，一住之后就不能前进，一粘着之后就要着魔。因为此时的境界比较自在，所以叫定所生自在色。第四个叫受所引色。受就是接受，由受所引起来的色，这个色是怎么引起来的呢？在戒坛上受戒的时候，你见到这种庄严法坛，听到羯摩师唱羯摩文，于是在心里面引生出一个戒体，叫无作戒体。你看这个经上讲，当阿难被摩登伽女摄了去，因为有这个戒体，所以他身体虽然被摩登伽女用先梵天咒所摄，但是内心不受摩登伽女的引诱，不去与她同房，这就是无作戒体的力量，所以叫受所引色。第五个是遍计所执色，这个遍计所执，就是三性当中的遍计所执性，因为我们的心把一切东西都给著牢了，所以叫遍计所执。相宗说这五种色是为意识所缘，所以讲到意识，就要讲到这个意识所缘。<br/><br/> 　　有位法师要破这个意识所缘，破相宗五种色的说法，他讲得倒是有点道理，我来说给大家听听。他是怎么破这个极迥色的呢？他说这个鸟飞得远了，远得看不见了，既然你不知道了，那么应该是无相，等于虚空了，你能缘虚空去吗？因为虚空没有东西，没有东西你怎么去缘呢？假设看得见就是有相，那么这个鸟是飞得高还是飞得低？或者是飞得停下来休息？不管它怎么飞，你应该能看得见。这个相是眼所见，应该属于眼识，而不是意识。假如飞得远了、没有了，变成空了，空里没有东西，你又如何去缘呢？所以他说相宗讲得没道理，这是第一点。对第二个极略色，他说你不是往小里分析吗？那么分到看不见，小得没有了，既然是没有了，就是没有处所，没有处所应该等于空。假如小了还有处所，那这个处所在什么地方呢？说到缘色就应该有所缘的色尘，假如能缘色，那么等于前面一样，还是属于眼识。他说其实极迥和极略这两种色，都是属于意识，极略色就是意识思想过去的境，极迥色就是意识能缘过去的境。一个是意识所缘过去的境，一个是意识思想过去的境，二者有这样的分别。那么定所生自在色又怎样呢？这个定所生自在色，根本不是意所缘，因为在意能缘的时候就不能入定，他讲得倒是蛮有道理。意识假设不停息下来，还在那里活动和思想，你就不能入定，入定的人一定是意识已经停止了。比如我们修净土宗，念佛念到啥也不想，只专注在一句佛号上，那么到了妄心不动的时候，能念的心和所念的佛就脱落了，这个时候意识已经不动了，如果意识不动，又怎么能缘这个定境呢？所以定境所显的境界，不是意识能缘的，因为意识已经停下来不动了。假设在打坐的时候能够现出定境，这个定境也不是意识看见，还是眼睛看见。譬如我们睡觉的时候会做梦，我们正做梦的时候眼根不动，耳根也不动，但是梦中所现出来的境界，还是用眼睛看见东西，用耳朵听到声音。说到定境显现的境界，假设这个境界是有相的话，用的还是眼根，不是属于意识的能缘，这是讲第三种定所生自在色。对于第四种受所引色，他说这个因受戒生起的无作戒体，也不是意识能缘的境界，这个戒体是在受戒的时候，由戒所引生出来的，是心而非色。因为心不能缘心，只能缘境，既然这个无作戒体是一种心，所以说也不可能被意识所缘。至于第五种遍计所执色，因为一切东西都是前五识所缘的境界，我们计较长短方圆、青黄赤白、大小高低，这也不是意识所缘之境。为什么要这样说？这里有什么差别呢？从相宗来说，我们眼见色境的时候，是第六识跟着眼识一起跑去的，所以意识也缘外境。但是经文上说，意识不缘外境，不跟着眼、耳、鼻、舌、身跑，意识只内缘法尘，它缘的是前五识落谢的影子。在前五识中，眼睛缘色尘，耳朵缘声尘，舌头缘味尘，鼻子缘香尘，身体缘触尘，当前面五识把外尘的影子吸收进去，意识缘的是这个落谢的影子。这个又叫识处所摄色，识是我们的第六意识，处是上面说的十二处，由识和处所摄的就有这样五种色，这五种色，与法相宗讲的有点区别。由于意根不缘外尘，所以外面的色境不是意识所缘，这样一来，《楞严经》的观点与相宗就有纷争了，所以相宗里有人要破坏这个经，这一点要对大家讲清楚。接着看下文：<br/><br/> 　　“阿难，若因意生，于汝意中必有所思，发明汝意。若无前法，意无所生。离缘无形，识将何用？”<br/><br/> 　　什么是“若因意生，于汝意中必有所思，发明汝意”呢？假如意识是意根生的，那么在你的意识当中必定是有所思想的，如果没有思想，就不是意识了。如果说意识不需要外面的色尘，是从意根单独生的，那么离开前面五识落谢的影子，离开法尘，你的意识怎么能够思想呢？因为意根要与法尘相对才能起作用，假如没有眼、耳、鼻、舌、身所缘的色、声、香、味、触这些外尘，没有前面五根所接受五尘的影子，你这个意根就生不出意识来，所以说“若无前法，意无所生”。如果意根不对外尘，那么“离缘无形，识将何用？”我们说过识是了别、识别，要通过内根吸取外尘才能起作用。识不能缘无形，不能缘空，如果离开前五识落谢的影子，没有了法尘，意根根本就不能发生任何作用，即使有个意识，这个意识又有什么用呢？<br/><br/> 　　“阿难，若因意生，于汝意中，必有所思，发明汝意。”<br/><br/> 　　世尊告诉阿难：假如意识是意根所生，那么意根生了意识之后，在意识当中必定有所思想。如果意识有所思考，有所思虑，那么这个思虑也一定要有形状的。比如眼睛看色，看录音机就有录音机的形象；耳朵听声，能听到音乐声、唱戏声、车马声等种种声音。假如你的意识是由意根生的，那么这个意识是什么形状或者形象呢？<br/><br/> 　　“若无前法，意无所生。”<br/><br/> 　　我们知道意根所缘的是法尘，法尘是什么呢？就是我们的眼、耳、鼻、舌、身这五根，缘外面的色、声、香、味、触五尘，所留下的影像。色、声、香、味、触都是有相的，意根缘的是前五尘落谢的影子，有相才有影子，没有相是没有影子的。所谓“若无前法，意无所生。”就是假如没有前五根缘外五尘，吸收五尘落谢的影子，就没有作为内尘的法尘，你的意识就生不出来。<br/><br/> 　　“离缘无形，识将何用？”<br/><br/> 　　法尘是外五尘的影子，离开所缘的法尘，离开外面五尘的影子，你这里即空无所有。我们说过识是用来分别的，专门分别各种形态，假如你这里什么形状都没有，那么这个识有什么作用？你能用来分别什么东西呢？<br/><br/> 　　“又汝识心，与诸思量，兼了别性，为同为异？”<br/><br/> 　　这里提出三样东西：识心、思量和了别性。识心就是我们的识性；思量就是我们的末那识，是意根；了别性就是意识。现在我问你心、意、识这三样东西，为同为异？它们是彼此相同呢？还是有所分别呢？<br/><br/> 　　“同意即意，云何所生？”<br/><br/> 　　假若意根与意识相同，意根就是意识，意识就是意根。既然是一样的东西，又那里有能生与所生呢？<br/><br/> 　　“异意不同，应无所识。”<br/><br/> 　　假如意根与意识不同，是有分别的，那么就不应该有意识。前面说假如意根有识，就应该同于意根，若同于意根，即无能生所生。现在说假设意根与意识有所差别，有所不同，就不应该有所识，意识就不会生出来了。<br/><br/> 　　“若无所识，云何意生？”<br/><br/> 　　假如你没有意识，不能了别，没有分别，连意识所应具备的起码作用都没有，还怎么能说从意根生出意识呢？<br/><br/> 　　“若有所识，云何识意？”<br/><br/> 　　如果说意根有所识，那怎么来识别这个意根呢？如果意根有所识、有所分别，那么这二者还有什么不同，还有什么差别呢？自然没有差别了。<br/><br/> 　　假如意与识不同，不同就无所识 ；假如意与识相同，同就是一体，就没有差别。这样一来不管同与不同，都没有界限。实际上本来没有同与不同，同也不可得，异也不可得，一切界限其实根本就没有。<br/><br/> 　　“唯同与异，二性无成，界云何立？”<br/><br/> 　　由于同与异两样性体根本就不成立，那么意与识不管说同还是说异，只要落在两边就都不对。如果说同就不应有界，既然意与识是一个东西，一个东西哪会有界呢？只有两样不同的东西之间才有界。如果说异，把意与识作为两样，当然也不对。同不可得，异也不可得，都是妄心的分别，并非实有。既然二性无成，两边都不可得，那么“界云何立？”同与异都是虚妄，都没有自体，当中的界限怎么来立呢？自然就没有了。这就说明我们的意识是虚妄不实的，不能把它执著为实有，因为它没有生处。<br/><br/> 　　假如说有所识，意根与意识就变成二个东西，意根同意识实际上不是两个东西，所以不应有所识。假如说无所识，无所识则同于外尘，你的意根不晓得有意识，意识也不晓得有意根，这不等于是眼睛所看的外面尘劳一样的东西吗？你这个意识又怎么能起作用呢？这样一来，说是意根所生的不对，说不是意根所生的也不对，由于两边都不可得，就证明这个意识根本就是虚妄的。<br/><br/> 　　“若因法生，世间诸法，不离五尘。汝观色法，及诸声法、香法、味法，及与触法，相状分明，以对五根，非意所摄。”<br/><br/> 　　前面的经文说得很明白，内意根不摄外面的五尘，外面的色、声、香、味、触五尘由我们的眼、耳、鼻、舌、身五根所摄。假如说意识因法所生，就是由法尘所生，那么世间诸法本来是不离五尘的，你看看那五种尘法，它们的相状都很分明，分别对着五根，并非由意根所摄的。五尘就是色法、声法、香法、味法和触法，色法是一切色相和事物，声法是各种声音，香法是香、臭这些气味，味法是酸、甜、苦、辣等种种味道，触法是所接触到的冷、暖、滑、涩等感觉。这五种尘法都有实相，都有实体，比如色不同声，香不同味，彼此的特征清晰明了，相状分明，不相混淆。色、声、香、味、触五尘，分别对着眼、耳、鼻、舌、身五根，各有其所归摄，没有一个直接对着意根，前面说过，意根只能摄取由五根所吸进去的外尘的影子，而不能直接摄取外面的五尘，这是《楞严经》与法相宗不同的地方。在法相宗里讲到意识的时候，说意识是跟着前五识一起跑的，比如眼根缘色尘时意识也跟着眼识出去，耳根缘声尘时意识也跟着耳根出去。现在《楞严经》上说，外五尘分别由前五根所摄，而不归第六意根，与相宗的说法有点抵触，所以相宗里有人毁谤《楞严经》，说这部经书是伪造的。<br/><br/> 　　“汝识决定依于法生，今汝谛观法法何状？”<br/><br/> 　　法法就是法尘之法。假如你的意识一定是依法尘所生，那么你仔细看看这个法尘是何形状呢？上面说的色法、声法、香法、味法、触法都有实体，那么意根所摄的法尘之法是什么形状呢？法法并不是没有形状，它有个虚假的影子。因为色、声、香、味、触这五种法都是有实物，有形象的，有相则必定有影，有影也必定有相。这个法法因为是前面五尘的影子，所以它是有相的，若光有影子没有相，影子从何而来呢？只不过因为是虚假的影子，不是实物，所以你拿不出来罢了。<br/><br/> 　　“若离色空、动静、通塞、合离、生灭，越此诸相，终无所得。”<br/><br/> 　　假如离开色空、动静、通塞、合离、生灭这些现象，你能有意识吗？当然没有！比如离开眼根所对的色法与空法，你就不能起眼的知觉。因色才显空、因空才显色，非空即不能显色、非色亦不能显空。色与空要相对而有。由色空的种种变化，色法也会有千变万化的相貌。下面的动静、通塞、合离、生灭，也是这个道理。动静就是声尘，一会儿有声音，一会儿又没有声音。声音中也会有高低、大小、急缓等种种变化。通塞讲的是嗅觉，鼻子通了就可以闻到香臭等种种气味，塞了之后就闻不到气味了。合离讲的是触觉，手触在身上就可以知道是冷了还是暖了，是涩了还是滑了，如果没有合离，触觉就没有了，这即是合离的作用。生灭是靠前面这几种现象而生出来的，由于色空、动静、通塞、合离等变化，而有生、住、异、灭的情况发生。因为别的现象的去来，而有这种起灭的变化，这叫依法所缘。比如某个法生起来了，就有个影子来了，当这个法灭掉了，那个影子也就消灭了。象这种依法所缘的，就是法法。所以说“越此诸相，终无所得。”离开了这些相，连影子都没有，你还有什么东西呢？当然没有了。<br/><br/> 　　“生则色空诸法等生，灭则色空诸法等灭。”<br/><br/> 　　这里的色空等诸法，既代表眼根所缘，也包含下面的耳根、鼻根、舌根及身根所缘。你这个意识实际上是没有的，因为生灭的是色空等诸法。“生则色空诸法等生，”当色空、动静等诸法生起之后，因为有了外尘落谢的影子，你的意识可以缘这种法尘而起。“灭则色空诸法等灭，”当色空等诸法灭掉的时候，因为没有了外尘落谢的影子，你的意识也就随着法尘而灭。生与灭都是意根所缘，必须依靠色、声、香、味、触才能起作用，如果离开色、声、香、味、触，哪里还有生灭可言呢？当色、声、香、味、触生的时候，就有个影子生出，当色、声、香、味、触灭的时候，这个影子也就灭掉了。所以说法法实际上是没有的，它依靠的是前面五尘落谢的影子。<br/><br/> 　　“所因既无，因生有识，作何形相？”<br/><br/> 　　这里的所因，是识所依之因，就是识所依靠、所借助而生起来的因，因为识不能孤起，要依靠一个体才能生起来。在这里因即是体，如果所因既无，连这个所依之体都没有，那么因生而有的识，又该作何形相呢？既然没有体，哪里会有能生呢？既然没有能生，又哪里有所生呢？既然根本就没有东西，哪还有什么形状可言呢？<br/><br/> 　　“相状不有，界云何生？”<br/><br/> 　　由于根本没有形状，根本就是一个大空，还有什么界可言呢？既然是空无一物，又怎么能定界呢？空没有界限，所谓空中的界限，都是要比照实体来划的。现在各个国家的领空，都是要按照在地面上的国界来划分，比如说从亚洲的某某经纬度，到某某经纬度，是我们国家的领空，那么离开这个范围以外的，就是印度、蒙古、俄罗斯等国家的领空。天空根本没有界，都是由地面上的人，依照自己的国界划出的界，所以这些界限都是虚妄的，根本没有的。意识的出生离不开两边，一边是法生，一边是根生。我们已经论述过了，意根不能生意识，法法也不能生意识，既然两边都没有，当中自然更没有，那么还有什么地方能生意识呢？所以说在把两边破掉之后，中道就显现出来了。其实中道也是假名，因为两边不可得，所以中间也不可得。天台宗讲空、假、中三观，把空假两边都破掉以后，连中道也不立。如果有个立处，就不是真正证道，真正证道者连这个中也没有。既然中间和两边都没有，说明所谓的意识根本就是妄想，都是前面色、声、香、味、触的影子。执著这些虚假的影子为实有，无异于痴人说梦。<br/><br/> 　　“是故当知，意法为缘，生意识界，三处都无。则意与法及意界三，本非因缘、非自然性。”<br/><br/> 　　这里与前面所总结的一样，你以意根和法尘为缘，以为能生出这个意识界，根本就是不可能的。因为意根、法尘和意识这三处，本来都是没有的。既然这三处什么都没有，“则意与法及意界三，本非因缘、非自然性。”不自生、不他生、不共生，叫非因缘性；不无因生，叫非自然性。<br/><br/> 　　以意、法为缘，生出意识，这是照普通人的说法来讲的。世人执著有，认为意根与法尘因缘和合，生出来这个意识，实际上在佛眼看来，根尘识这三样一切皆无，根本不可得。通过消掉两边，来破除中间，这是双遣法。这个十八界与前面的十二处、六入及五蕴，合起来叫作四科，这个经上讲四科的段落都是在遣，就是把两边都遣除、都摈除，由于两边都不可得，方显示出中道之义。破除两边即是无所生，无所生并不是空无所有，我们现在还是有啊！那么这个有是什么呢？这个有就是真如实性的妙用啊！这个有不要执著为实有，执著即是妄想，不执著就是妙用。世尊讲四科是遣两边、破内外，叫我们见到妙用，见到实相体。前面的四科是讲空，遣除两边之后，才能显出中道真如法性，后面的七大则是讲有，通过妙有显出法法都是周遍法界，法法都是圆满无缺。所以合起来讲，前面七处徵心是破妄有以显真空，说明蕴、界、处等皆不可得，是空如来藏。后面十番显见是说妙有，叫你不要执在空的一边，因为真空中有我们的能见之性，有我们的灵明妙体，是不空如来藏。现在把四科与下面的七大合起来，就是空不空如来藏，你片面执著空不对，片面执著有也不对，要把有与空都放弃，因为这两边都不可得，真如法性才能圆满无缺，才能周遍法界。<br/><br/> 　　凡夫都是著有的，站在世间法的立场上说，一切东西都是有：有妻子儿女，有金银财宝，有饮食起居，样样都有，这是凡夫境界。小乘境界是偏空，凡夫所执著的事相他都没有，既没有这，也没有那，看起来好象都空掉了，实际上还是著有，有什么呢？有意身！他空的是色身，以为色身不可得，而意身是有的，因为他有生死可了，有涅槃可证。在大乘佛法讲，小乘还是执有，不过他的有不同于凡夫之有。所以不但有不能执，空也不能执。当两边都不执的时候，这个真空不空的妙有实相就现前了。因此说把四科与七大合起来讲，就是空不空如来藏，现在这个四科专遣两边，下面七大就专显法法都是周遍法界。<br/><br/> 　　五蕴、六入、十二处、十八界到这里就结束了，现在我们来做个小结。色、受、想、行、识这五蕴，我们要颠倒过来看，就是要把识放在前头，这个识就是了别，是我们众生的生起之缘。我们的无明是从哪里来的呢？就因为一念不觉之故，在那个原清净体上起了一个念头：我这里能觉、能分别。这一能觉、能分别的念头就是识心，是无明生起的主因，由于一念不觉，因而无明妄动，于是在觉明空昧中，觉得自己有知有觉，这样识蕴就生起来了。有了识蕴以后，接着会“识蕴趣境。”因为有能觉之后就有所觉，这是什么东西，那是什么东西，这地方是有，那地方是空。看见有的时候以为是有相，看见空的时候以为是空相，这样就着相了。趣境就是往境上跑，由于识蕴趣境，于是就生起了第二个蕴，就是行蕴。有了行蕴以后就要住境而想，境落于心上就成想蕴。积想成识，积想成根，变成根识之后，就是受蕴。因为有了识，有了根之后，识就要粘着前境，要接受了，所以叫受蕴。受蕴将所对的色，输送给我们的了别识，这样色相就对着我们的意识，这个相对的东西就是色蕴。色、受、想、行、识倒过来说，就是识、行、想、受、色，这是我们众生生起之缘，众生就是从这里生起的，所以我们说能够破五蕴就能成佛。我们修行也要倒过来修，比如说在五蕴之后有六入，六入之后有十二处，十二处之后有十八界，那么破的时候也倒过来破。就是先破十八界，次破十二处，再破六入，再破五蕴。这就象穿衣裳，穿的时候都是先穿里面，再穿外面，一件件穿上去。脱的时候也一定是从外向里，先脱最外面一件，再脱外面第二件，最后才脱到里面贴身的布衫。贴身的布衫好比是五蕴，最外面的衣裳好比是十八界，所以破的时候也要先从外面的十八界破起。<br/><br/> 　　五蕴讲的是心识和色法，由心与色和合成功。在相宗说，五蕴是开心合色，把心开为四，前面的色属于色法，后面的受、想、行、识属于心法，由四个心法合一个色法。实际上色与识固然可以分别说是色法和心法，而当中的受、想、行则既是色法，也是心法。没有色蕴你怎么受？你能受空吗？没有声音你怎么听？没有听你怎么接受？这个声音好听，我喜欢，那个声音不好听，我讨厌。不管喜欢也好，讨厌也罢，一定要有声音你才能生起觉受。所以受、想、行既是心法，也是色法，这里的心色合说是个中相，是我们的生起之因。<br/><br/> 　　六入专门讲开心，把心一开为六，用六根对六尘，把尘境摄受进来，所以完全是心境。接下来的十二处是开色。前面讲六根对六尘是为了突出摄受，所以是开心；这里讲六根与六尘是为了强调色境，所以是开色。十八界则是把心与色混合在一起说，叫心色互开。我们要见性首先就要除这个十八界，十八界里最要紧的是六识，这里面有竖说与横说的讲法。竖说好比修禅宗，要从上到下彻底打破，笔直出来，所以叫竖出，这是禅的修法。横说等于修净土宗，好比一根竹子，用不着竖着节节穿过，我只要横着打个洞就走出去了，叫横超三界。所以不管横也好、竖也好，一定要破了五蕴才能成佛。罗汉看起来好象已经破了五蕴，实际上并没有破，为什么呢？因为他只破了色蕴，不再着这个色身，但是还执著意身，只了人我，没了法我，所以并不是真破。他所破的只是十八界中的六识，如果能再破六根之相（六根之相是空相，不破空相也不行的），明白六根之相根本不可得，就能回小向大。如果连六根的有无之相都不可得，那么五蕴就不破而自破了。因为五蕴是依靠这个根，由六根对四大的执著而来的。在我们的八个识中，执着四大的是第七识，它取八识的见分以为根，取八识的相分以为四大种，由执著四大的本能生起六根。于是六识缘外尘而起分别，所以六识是分别心。<br/><br/> 　　因为六根、六尘、六识这十八界根本就不可得，所以《楞严经》说五蕴、六入、十二处、十八界都是空的，这一点与相宗不同。相宗建立十八界之后，说一切都是有，所以相宗讲的是有法，与《楞严经》有抵触。我们若能够破掉六识，就可以转凡夫为小乘。再灭掉六根，就可以转小乘到大乘。再灭五蕴就转众生而成佛了。这就是竖说而行。横说就是众生是有，二乘是空，菩萨是不有不空。《楞严经》是专门讲大乘道理的，所以说不有不空，在这里我们把楞严和法相的道理稍微说一下。相宗建立十八界以为法相，说一切都是有的，对名相分别得很详细。而此经说一切皆空，都不可得，将十八界彻底打破。这样一来把相宗的观点都破掉了，所以他们说这个经是伪造的。</p><p style=\"text-align: justify;\"><br/><br/></p><p style=\"text-align: justify;\"> </p><p><br/><br/></p></p></div>"
},{
    "title": "壹、见道分——七大本真",
    "author": "元音老人",
    "date": "",
    "html": "<div class=\"B1_text\"><p><p style=\"text-align: justify;\">　　下面接着要讲七大了，七大是什么东西呢？就是地、水、火、风、空、见、识这七大种性，种性又称为大种。我们前面讲过五根都是大种，就是由这几大种性生起我们眼、耳、鼻、舌、身等外五根。相宗说大种初成时叫净色根，就是由无明粘着妙湛不动的真实心，与外面的尘劳相结合，将色、声、香、味、触转成的一种根。眼耳鼻舌身是浮尘根。大种性是最重要的，下面佛就要逐一说明七大种究竟是怎么回事。请看经文：<br/><br/> 　　七、七大本真</p><p style=\"text-align: justify;\">             （一）地大性色真空，性空真色<br/><br/>　　　　（二）火大性火真空，性空真火<br/><br/>　　　　（三）水大性水真空，性空真水<br/><br/>　　　　（四）风大性风真空，性空真风<br/><br/>　　　　（五）空大性觉真空，性空真觉<br/><br/>　　　　（六）见大性见觉明，觉精明见<br/><br/>　　　　（七）识大性识明知，觉明真识 </p><p style=\"text-align: justify;\"><br/><br/></p><p style=\"text-align: justify;\">　　“阿难白佛言：世尊，如来常说和合因缘，一切世间，种种变化，皆因四大和合发明。云何如来因缘、自然二俱排摈？我今不知斯义所属。惟垂哀愍，开示众生，中道了义，无戏论法。” <br/><br/> 　　阿难听了关于四科的介绍之后，心想：佛常常说，一切世间的种种变化，都是四大和合发明的，今天为什么却说既非因缘、也非自然，要把两边都排除掉呢？因为他实在不明白究竟是什么道理，所以要请佛垂哀愍，为大众开示这个中道了义，无戏论的妙法。中道刚才已经讲过，就是不立两边，两边都排除掉。什么是了义？须简单说一下，了义就是要能够明了究竟义理，假如有所执着，就不是了义。具体说就是要知道我们这个佛性，这个经上说的大佛顶如来密因，这个密因是不生不灭、不来不去、不垢不净的，一切都不可得，了解这个成佛的秘密之因，就是了义。假如不知道这个密因，执著有道可修，有佛可成，有生死可了，就是不了义。生死和涅槃就象空中的花，本来没有。生死就是涅槃、涅槃就是生死，生死不在涅槃之外、涅槃也不在生死之外。明白这个道理之后，就不再有生、住、异、灭等种种戏论。现在讲的色、声、香、味、触，讲的眼、耳、鼻、舌、身，这些东西都是没有的，讨论来讨论去，其实都是戏论之法。阿难因为一向听佛说和合因缘，所以认为和合因缘是真有的，比如我们穿的衣裳，和我们人本身，不都是因缘生的吗？人是以自己的心为因，父母为缘生出来的，这难道不是因缘生吗？衣裳也是先用棉花或羊毛纺成线，再织纱成布，最后由布裁剪缝纫而成的，不也都是因缘所生吗？在这里因是能生义，缘是助生义，和合就是因缘，不和合就是自然。因与缘和合起来，就可以生出一切世间种种变化。不但男女老少、饮食起居是这样来的，连高楼大厦、飞机火车也是这样来的，离开和合因缘还有这种种变化吗？所以我们说一切变化，皆因四大和合而发明，哪一样东西不是地、水、火、风呢？在我们的身体里面，肌肉、皮肤、骨骼等是地大，血液、涎唾、小便等是水大，身上的热度（每个人都是三十七度体温）是火大，呼吸以及血液循环、消化循环是风大，每个人都是由四大和合而成的嘛！阿难以前都是这样理解的，现在听到如来又说既非因缘、也非自然，就是既不是和合生，也不是不和合生，那么这样一来不等于是自相矛盾吗？阿难因为弄不懂其中的道理，所以要请佛再做开示。实际上阿难不晓得，排除两边为的是显出中道之义，对你讲本非因缘、亦非自然，就是教你不要执著因缘所生之体，因为只有这样才能见到非因缘、非自然的佛性。这个佛性本自清净，既没有生也没有灭，是本来就有的东西，你只要离开内外两边，破掉因缘和合的假象，就可以见到了。你如果还在坚持因缘和合，执著那个幻生幻有，就不明白其中的道理。就象阿难，从前听佛说因缘和合能生种种变化，现在又听佛说既非因缘、亦非自然，如果因缘与自然两边都不可得，那不是变成断灭空了吗？他因为在这里起疑惑了，所以要请世尊开示中道了义、不落两边的无戏论法。 <br/><br/> 　　“尔时，世尊告阿难言：汝先厌离声闻、缘觉诸小乘法，发心勤求无上菩提，故我今时为汝开示第一义谛。如何复将世间戏论、妄想因缘，而自缠绕？汝虽多闻，如说药人，真药现前，不能分别。如来说为，真可怜愍。” <br/><br/> 　　佛对阿难说：你先前厌离小乘，不想修声闻缘觉的法，发心要学大乘，要求至高无上的正觉菩提道，所以我就给你讲第一义谛。在讲这个第一义谛之前，我们先要明白什么是圣谛，什么是俗谛。圣谛讲非有，非有即是无，就象我们前面讲四科时的五蕴、六入、十二处、十八界，这些都是没有的。俗谛讲非无，非无即是有，世俗人认为一切都是有，好比我们眼前有这有那。圣谛和俗谛一个讲真，一个讲俗，各偏重一方，如果把两个结合在一起，就是真俗不二。所谓真俗不二，就是非无而非有，非有而非无，这个就是第一义谛。第一义谛在教下说是最高的法，属于最高一层，因为真俗不二，一体圆融，完全平等了，所以超出其他一切教理之上。<br/><br/> 　　当初梁武帝见达摩祖师的时候，曾经问到这个问题：“如何是圣谛第一义？”在他的问话中，这个圣谛第一义谛就是真俗不二。武帝问的不是寻常的问题，而是教内最高的第一义谛。达摩为了不辜负他，于是回答“廓然无圣！”廓然这两个字很要紧，就是空旷、辽阔、清虚一气，就象是万里无云的晴空，这个虚明廓澈的晴空，既无圣也无凡，既不是无，也不是有。达摩在这里对武帝直面相呈，给他点出要紧的地方，告诉他这万里无云的晴空，就是你的真如佛性。可惜梁武帝当面错过，他只听到无圣，而不晓得廓然。所以后来雪窦禅师颂此公案云：“圣谛廓然，何当辨的？”你不能光知道没有圣，还要知道什么是廓然，那么晓得廓然的是谁呢？又是谁在这里辨别呢？就象禅宗参念佛是谁一样，这个廓然是谁呀？就是你自己的本来面目嘛，你怎么不识得呢？这个第一义谛就有这样妙，我给你开示第一义谛，就是要让你从这里悟入，直下得见你的真如佛性。达摩对武帝讲“廓然无圣”，这是给他讲无，在无当中显出妙有，因为两边都打破之后，中道妙理就现前了。梁武帝这时候还不惺惺，他想自己造过许多佛寺，度过许多人出家做和尚，功德一定很大，于是问达摩我这样做有没有功德呀？他这是住功德相，不晓得明心见性才是真功德，以为造寺度僧是功德，想听达摩来夸奖自己，没想到达摩迎头泼来一盆冷水：“并无功德”。唉！其实达摩不是在泼冷水，这是叫他不要热衷于有为法，不要执著在事相上，你做的那些善行是福报，不是功德，真正的功德是见性成佛。求福报只能感应出世间的荣华富贵，要知道财宝再多也有享用完的时候，最后还是要死的，靠福报不能了生死。要了生死必须要见性，见性是法财，得了菩提道以后，你与虚空同为一体，十方世界一切东西都是你所有的。既无一物可取，亦无一物可舍，因为你这个万能体能生够出一切，到此时虽不求了生死，而生死自然得了。比如西方极乐世界以黄金为地，那里有七宝莲池、八功德水，以及无量无边的胜妙景象，这些东西从哪里来呢？都是阿弥陀佛的净愿所生，也就是从这个自性本具的万能体上生出，如果不是万能体哪能生出这些东西来呢？你如果心量广大，那么尽虚空遍法界都归你所有，都是你的家财，就不再局限这么一个小小国度了。梁武帝生活在南北朝时期，他是南朝皇帝，国土在长江以南的部分地区，不象我们现在统一后的中国这样大。达摩这样回答，是要他得大财，不要贪小财。<br/><br/> 　　世尊告诉阿难：我给你开示第一义谛，你“如何复将世间戏论、妄想因缘，而自缠绕”呢？你在这里喋喋不休，说什么和合就是因缘，不和合就是自然，这些都是世间的戏论。讲因缘讲和合是两边话，两边话就是戏论，因为你在这里妄生分别，所以不但因缘和合生是妄想，非因缘的自然生也是妄想。本来我已经给你开示了中道妙义，把第一义谛已经告诉你了，是你自己不理解、不明白。你拿这些妄想执著缠绕自己，覆盖你的自性，使你的自性不能放光，所以不能悟入无上妙理。佛接着斥责他：“汝虽多闻，如说药人，真药现前，不能分别。”你虽然听闻了很多佛法，但你没有契入这个妙理，而是执著了文字相，就好比空口讲说药材的人，他听别人介绍过药材的情况，于是也会象模象样地说上几句，可是当你把真药拿到他面前给他看的时候，他却不认识了。哪个是黄连、甘草？他不知道；哪个是真药、假药？他也分不出来。现在外面卖假药的人很多，可是大家由于不会辨认，常常会吃亏。比如有的人本来想买天麻的，结果买回来一看，其实是洋山芋，因为不识货，所以上了人家的当。如来说你们这种人，实在是可怜可悲啊！佛不光是在说阿难，也是在说我们。我们有的人一天到晚佛法长、佛法短的，说这部经我已经念了多少遍了，那部经我又抄了多少，以为自己对佛法懂得不少了，其实都是在著文字相。在他看来只有朝暮课诵、敲敲打打才是佛法，当你对他讲说真正的佛法，他反倒接受不了。你如果告诉他一切不著、万缘放下就是佛的境界，他反而害怕：哎呀！那怎么会是佛法呢、那是断灭空！他不晓得自己整天敲敲打打、念来念去，是在做死人的活计，与真正的佛法不相干哟！我们学佛是要了生死的，佛法是积极的、入世的，你一天到晚专门同死人打交道，让人家看起来那样消极、消沉，那么别人对佛教只会躲得远远的。所以说如此修学佛法，其实是在玷污佛法。学佛首先要学会做人，每个佛子都应该做榜样给人家看，你只有做人做得好，人们才会相信佛法，才会承认佛法真有道理。假如学佛的人不讲做人的道理，不讲做人的人格，甚至品格还不如普通人，人家又怎么会信服你呢？有的人只看重事相，不懂得从心地上用功，比如说信佛要吃素，那么不但肉他不吃，就连炒过荤菜的锅铲都不能用，一定要买新的，看上去好象持戒持得很好，其实心底里有这么清爽洒脱吗？外表执著得越厉害的人，背地里倒反而会做些坏事。我给你们讲一件真实的事情，有一个吃素多年的老居士，去杭州虎跑吃茶，他看到茶室的杯子很好，于是问人家：“你这个杯子能卖一只给我吗？”人家说：“不卖！不卖！杯子我们要留着自己用，怎么能卖给你呢？”他想买，人家不卖，可他对这只杯子又实在喜欢得不行，怎么办呢？那就偷一只吧。你看！这样一个吃素多年的老居士，结果偷了人家的东西，这不是犯戒吗？还有人讲，偷私人的东西不好，那么我不偷私人，我偷公家的不要紧吧？也不行啊！你这样做不但自己落因果，而且还给人家留下一个坏印象。有人说“要看黑心人，吃素道里寻。”这都是那些所谓“不拘小节”的人，给别人留下的坏印象。我们要提倡积极做人，从一言一行上给群众做表率、做榜样，就象孔夫子所说的：要“非礼勿视，非礼勿听，非礼勿言，非礼勿行。”不是我应该做的，我坚决不做；不是我应该取的，我坚决不取。修行人还要多布施，要锻练舍心，舍得把自己的东西布施给别人，那么人家看到后会说：还是佛教好，你看佛教徒的人格多么高尚！这样做无形中就是最好的宣传，能够使人们对佛教生出恭敬心和信仰心。出家僧众为什么要讲四威仪呢？就是给大家一个好印象，使人们生起恭敬心，人家看到你举止符合威仪，会心生欢喜；如果你没有威仪，人家会想，你这个出家人不怎么样！人家污辱你、诽谤你，是要造罪的，他的罪是因你而起，那么也就是你的罪。所以说修行人的言行举止非常要紧，一定要认认真真地做好。你们不但要多听多闻，还要身体力行，否则理论与实际对不上号，真东西到了你面前你反而不识。<br/><br/> 　　“如来说为，真可怜愍。”我现在对你讲说真实法门，叫你修真实行，你既不能相信，也不能接受，这真是再可怜不过了！ <br/><br/> 　　“汝今谛听，吾当为汝分别开示，亦令当来修大乘者，通达实相。阿难默然，承佛圣旨。” <br/><br/> 　　谛听就是把妄心息下来，诚心诚意地听。一面起妄心，一面听讲是不行的，那样吸收不进去。佛对阿难说，下面我把七大种性分开来，给你详详细细地讲。我这个道理不光是讲给你一个人知道，也不光是讲给今天在座的大众知道，而且也要讲给以后的人，“亦令当来修大乘者，通达实相。”佛是要我们今天在座的人，乃至于再后来的人，看了这个经文，能够通达上面所开示的大乘义理。所谓通达实相，就是要懂得真如实相，明白实相是无相而无不相的道理。实相是大乘的境界，大乘就是要真正成佛，不是成个罗汉就算数的。阿难听到佛又要接着做开示，于是默然诚听，以秉承佛的旨意。 <br/><br/> 　　“阿难，如汝所言，四大和合，发明世间种种变化。” <br/><br/> 　　这是引用阿难说的话。就象你刚才说的，世间种种变化，都是四大和合而发明的。 <br/><br/> 　　“阿难，若彼大性，体非和合，则不能与诸大杂和。犹如虚空，不和诸色。” <br/><br/> 　　引用完了他的话以后，再来分析他的说法对不对。因为你刚才说，世间上种种变化，都是地、水、火、风四大和合成功的，由四大和合成的东西，就会有生、住、异、灭等种种变化。这一句和合是总起来讲的，就是把地、水、火、风、空、见、识这七大种，合在一起讲的，叫总说，下面是分说。那么现在我再问你，这个七大之性，“体非和合，则不能与诸大杂和，犹如虚空，不和诸色。”这七个种性为什么称为大呢？因为它的体周遍一切法界，它的量包容所有虚空，既无边际，也无始终，能够包含一切东西，能够生起一切东西。一切东西都是它，所以叫大种性。<br/><br/> 　　世界上的人都以为是七大和合在一起，万物才能够生长，如果七大分散了，万物就消灭了。其实不然，为什么呢？因为这个七大之体不能真的和合。譬如虚空里没有东西，虚空怎么能与别的东西和合在一起呢？既然是不和合，那么就不能与万物杂和在一起生长。因此说七大是非和合、非不和合。讲非和合，就象这虚空一样，因为虚空不能与一切色相和合在一起，所以是不和合，如此则七大就不能杂和成万物。假如是和合又怎么样呢？ <br/><br/> 　　“若和合者，同于变化，始终相成，生灭相续。生死死生，生生死死，如旋火轮，未有休息。” <br/><br/> 　　你看这世界上所有的东西，哪一样没有生、住、异、灭？你再看我们人，哪一个没有生、老、病、死？人出生以后都要经历由少而老、由病而死的过程，这个生、老、病、死就是生、住、异、灭，生、住、异、灭也就是诸行无常，一切事物都跳不出这个规律。七大如果能够和合，就应该同于万法的变化，也有生、住、异、灭，可是七大种事实上没有生、住、异、灭，所以它并不是和合。<br/><br/> 　　在一个生、住、异、灭之后，又会接着有新的生、住、异、灭，永远没有了期，所以叫“始终相成”。前一个生、住、异、灭终了之后，又有新的法生起，生生灭灭周而复始，永远不停息，所以叫“生灭相续”。生了又死，死了又生，就象一只旋转的火轮，始终转个不停，永远没有休息的时光。 <br/><br/> 　　“阿难，如水成冰，冰还成水。” <br/><br/> 　　譬如说水吧，天冷了结成冰，天热了又化成水，就是这样不断地由水成冰，冰还成水，周而复始，永无止息。所以这七大种性总起来说，就是非和合、非不和合。你说和合吧，它无生、住、异、灭。你说不和合吧，它能够生起万物，不是象虚空那样不能生万物。这就叫做生而无生、无生而生。也就是说在体上没有生灭，在相用上不无生灭。相用是假的，不是实体。体虽然是无生，但是它能起用，所以是无生而生，七大种性就可以起这样的妙用。我们以前举过这样的例子，用黄金可以打成簪子、耳环等首饰，假如你把这些首饰熔化掉，它的相虽然消失了，但体并没有消灭，金子还是金子。我们不能执著簪子、耳环的外相，而要认识金子的性体。又比如天上的一朵白云，可以随风变作狮子、猫、狗等不同的相，不管它变出什么相，它还是云，而不是狮子或者猫、狗。不论外相如何变化，云的本体并没有变。这个生就是不生，生的是幻象，不生的是性体。那么什么是不生而生呢？就是云的本体虽然没有改变，但它还是可以变现出猫、狗等种种相来，这个假象并不是没有，它还是有的！生而不生，讲的是性体；不生而生，说的是相用。所以你不能说它是和合，若和合它就应该有生灭相；你也不能说它不和合，不和合它就等于虚空，就不能合成万物。总起来说七大的体、相、用就是这个样子。<br/><br/> 　　前面四科讲的是因缘和合性，而七大就讲自然不和合性。和合是因缘的现象，因为和合之故，就显出相来；因缘是和合的种性，没有因缘，哪里能显出相来？所以和合是因缘的相，因缘是和合的性，也就是体。自然是不和合的种性，因为自然它是有自体的，它不需要因缘和合，不和合是自然的现象。比如水稻和小麦，你把它们的种子拿来，如果有水分、有土地做外缘，就可以生根发芽。在这里种子是自然性，是不和合相，而发出的芽就是因缘性，是和合相，因为它是由和合以后生出来的。所以和合与因缘、不和合与自然，是各自有其用意的。下面就要解释这个道理，这里先顺便说一下。七大与四科讲的是不一样的，四科讲的是因缘性，是和合相；七大讲的是自然性，是不和合相。其实这些东西都是一念不觉而有的，都不是实有的，后面的经文就把七大分开来，一个一个地讲给我们。现在看下文： <br/><br/> <strong>　　（一）地大 性色真空，性空真色 </strong><br/><br/> 　　“汝观地性，粗为大地，细为微尘，至邻虚尘。析彼极微色边际相，七分所成。更析邻虚，即实空性。” <br/><br/> 　　现在分开来讲，先讲地大。你看这个地大的性体，粗大的是大地，细小的是微尘，而顶顶细小的微尘叫邻虚尘。邻虚是什么意思呢？就是邻近于虚空，虚空是没东西的，邻者就是与虚空相邻，因为小得不能再小了，所以叫邻虚。邻虚尘是佛经里讲的最小最小的东西，那么它是怎样分出来的呢？就是“析彼极微色边际相，七分所成。”比如我们拿一块土，把它分成七份，七份中拿一块出来再分成七份，七份中再拿出一块又分成七份，就这样一级级地分下去，分到微尘以后，再将一微尘分成七份，就变成邻虚尘了。好比我们先把它分成牛毛大小，象牛毛头那样粗，牛毛头再分成七份，就变成羊毛头那样粗，羊毛头再分成七份，成为兔毛头那样粗。兔毛比羊毛细，羊毛又比牛毛细，那么这个象兔毛尖一样大的微尘再分成七份，就到了邻近于虚空，就是邻虚尘。我们也可以拿一本书做比喻，先把它分成七块，拿一块出来再分成七块，再拿一块出来又分成七块，一级、一级分下去，越分越小，分到最后就邻近于虚空了，所以叫做七分所成。到了邻虚以后如果再分会怎么样呢？“更析邻虚，即实空性。”邻虚尘再分，就什么都没有了，就变成空性，变成虚空之体了。 <br/><br/> 　　“阿难，若此邻虚析成虚空，当知虚空出生色相。” <br/><br/> 　　这句话怎么解释呢？就是假设这个邻虚再分下去，分析得没有了，分析成为虚空。既然虚空是由色尘分出来的，那么反过来也可以说，色相是由虚空生出来的。实际上是不是因为把邻虚尘分析得没有了之后，才有这个虚空。或者说，这个虚空是不是因为我们把色相分得没有了，才生出来的呢？不是的呀！对于虚空我们刚才说过，空是对色而说的，因为有色相做对比之故，所以显出虚空，假如没有色相，就显不出虚空。那么同样的道理，因空之故，所以显出色相，假如没空也就显不出色相。所以是对空说色、对色说空，空与色两样东西要相对才能成立，假如不相对就不成立。虚空本来就是这个样子，本来就是空无所有，并不是我们把东西分光了，分析到最后变得什么都没有了，才是虚空。既然这虚空不是因为分析色尘而有的，那么说由虚空生出色相也就不能成立了。把色尘分析成虚空，再由虚空合起来成为色相，这就是前面讲的和合。既然虚空不由分析而来，那么虚空也不能和合成色相，所以是非和合。七大种性不是和合成的，比如虚空和合能够生出东西来吗？不可能的。下面就要分析为什么虚空不能生出色相，为什么色相不能分析成虚空。虚空生不出来色相，人人都容易明白，用容易明白的东西来说明不容易明白的东西，可以帮助你理解其中的道理。上面这句就是不容易明白的：如果能够把色尘分析成虚空，那么虚空也应该能够生出色相。事实上虚空本来就是虚空，不是由色尘分析来的，那么虚空也就生不出色相。 <br/><br/> 　　“汝今问言：由和合故，出生世间诸变化相。汝且观此一邻虚尘，用几虚空和合而有？不应邻虚，合成邻虚。” <br/><br/> 　　这句话本来是阿难问世尊的，他说由于因缘和合的缘故，从而生出这个世间一切诸变化相。现在世尊反过来问阿难：“汝且观此一邻虚尘，用几虚空，和合而有？”你看一个邻虚尘，要用几分虚空才能和合出来呢？为什么要用虚空来比方呢？因为我们说过性色是真空，性空是真色，这个地大本来就是空性，所以地大种性就等于是虚空，那么虚空能合成东西吗？你看看这个邻虚尘，也就是这种最为细小的东西，是用多少虚空和合而有的？邻虚尘是由虚空合成功的吗？不是的。因为虚空不能和合出另外一个东西，必须由物体与物体相合，才能和合成别的东西。譬如我们大家坐在这里，由一个个不同的人，组成一个整体，你看这里男是男，女是女，张三是张三，李四是李四，每个人都不同。那么虚空能合起来吗？虚空是无形，无形不能和合为有形。如果虚空不能合为邻虚尘，那它是什么东西和合出来的？总不应该由两个邻虚合成邻虚吧？因为邻虚尘是最小的东西，世间的物质只能是以小合成大，以少合成多。邻虚合邻虚是以小变成大，就算是能够和合成功，也不应该再成为邻虚了。所以邻虚与邻虚相合，应该成为一种新的东西。我们以前讲过，绿颜色加上红颜色，和合以后就变成紫颜色，这就是以小合成大，以少合成多。邻虚假如是由别的东西合成的，那么这个东西一定要比邻虚更小，才能合成功。就象原子不能合成原子，只能由原子里的质子、电子和中子才能合成原子，原子与原子只能合成分子。金子与铜、铁不同，是由于它的质地细密，它们的原子结构不同。原子弹之所以有那么大威力，是由于原子有核裂变作用，这个裂变作用是怎么发现的呢？最初是因为搞这个研究的人想发财，他想通过改变原子结构，把其他物质的密度改变一下，使铜、铁变成金子，这样他就可以发财了。我们知道原子里面有原子核和电子，原子核里又有质子和中子等，如果原子核改变了，物质就改变了。若改变得好，铜、铁就可以变成金。然而，有的原子核裂变的时候，会造成物质湮灭，从而产生极大的能量。后来根据这种核裂变原理，人类发明了原子弹。我们介绍一点物理知识，是为了帮助大家搞清楚佛经上的道理。现在我们说邻虚是最微细的东西，是最微小的物体，还有什么东西能合成它呢？当然不可能有了。经上为什么要这样辩论呢？就是让我们知道，所谓因缘和合都是虚假的，都是妄想执著，并不是真有这么回事。 <br/><br/> 　　“又邻虚尘析入空者，用几色相合成虚空？” <br/><br/> 　　刚才讲的是虚空为什么不能合成邻虚，现在讲邻虚为什么不能合成虚空。佛反过来又问阿难：如果邻虚尘能够析入虚空，那么要用多少色相，才能合成虚空呢？因为邻虚尘是最细微的色尘，假如说虚空是由邻虚尘分析得没有了而变出的，那么我们现在所面对的是一个无边无际的虚空，这样的大空，要有多少色相才能合成呢？<br/><br/> 　　空是相对色讲的，如果没有色，根本就没有空，如果没有空，也就不会有色。色与空就如同有与无，色即是有，空即是无，有是相对无讲的，无也是相对有讲的。因为有了有，所以才有无，假设没有有，也就无所谓无。比如我现在喝一声，声音在的时候是有，声音过后喝声没有了，就是无了。无不是从有来的，有也不是从无来的，假如没有我刚才这一喝，也就谈不上有无，所以这二者是相对讲的。同样的道理，色不从空出，空也不从色出，所以这个虚空不是色相合成的，色与空不过是相对而言罢了。既然虚空不是由色相合成的，那么无合之故就无析，无析之故也就无合。这个世间所有的东西，不外乎就是色与空两种，这个色与空是既非和合、亦非不和合，从而证明阿难所问的世间变化，都是妄计，都不可得。<br/><br/> 　　“若色合时，合色非空；若空合时，合空非色。色犹可析，空云何合？” <br/><br/> 　　色与色本来是不可合的，譬如邻虚不能合成邻虚。纵使可合，也只能合色成色，就是由小合成大，由少合成多，而决没有合色成空之理。既然以色只能合成色，而合不出空，所以说合色非空。同样，空与空也不可合。就算是可以合，也只能以空合成空，而绝无合空成色之理。空和色怎么能合到一起去呢？所以说“若空合时，合空非色。”本来空与空、色与色，都是不可合的，这两句分别从两面做假设，假如空可以合，只能是以空合空，而合不出色。假设色可以合，也只能是以色合色，而合不出空。<br/><br/> 　　色法虽然不能合，但是还可以拆析，还可以把它分析成没有，那么空可析吗？空是不可析的，本来没有东西，你怎么能把它拆开呢？空既然不可析，又怎么可以合在一起呢？色本来也是不可合的，因为可以分析，假设还可以合。空连分析都不可能，既然不可析嘛，当然就更加不可合了。既然这个所谓的合是虚假的，那么反过来就说明以色合色，而起种种变化，都是虚妄计度，都是不真实的。为什么会有这种妄计呢？就是因为无明妄动，因为有这个无明之业的缘故。下面要讲这个业的道理。<br/><br/> 　　“汝元不知，如来藏中，性色真空，性空真色，清净本然，周遍法界，随众生心，应所知量，循业发现。” <br/><br/> 　　这句话最重要，是画龙点睛之笔。前面说了那么多的空、那么多的有，就是为了讲这个真色性。你执著世界上一切色相是有，以为它们起种种变化，是因为你不知道如来藏中“性色真空，性空真色”的道理。所谓性色者，性表示离相，离相就是无形无相，色表示地大，比如我们这个肉体就是地大，外面的一切色相也都是地大，所以地大就是色。为什么要称这个色为性色呢？因为一切色都是我们自性的作用，离开自性根本就没有色，所以说色的本性是真空的，是离相的，因此叫性色真空。你不要去执著世界上的色相，你所着的相都是妄相，因为本来没有这些形相，所以是妄计。<br/><br/> 　　所谓性空者，这个空不是空无一物、空无所有，而是说诸法的性体本来就是空的，这个空性是真如法性的本性。只有空性所显的色才是真色，有形有相的色都是妄计，因而是妄色，而不是真色。我们眼见耳闻的都是妄相、妄色，真正的性色是没有形相的。我们的真如佛性是无相的，正是由于无相之故，它才能生出种种形相，假如是有相的，就生不出形相了。譬如我面前的这只杯子，你叫它生出别的东西，它就生不出来，因为它有形相啊！它的形体已经做成这个样子了，所以生不出别的东西。如果是无形相的事物就不一样，譬如一朵白云，它本身没有固定的形相，因而可以化成一只猫，或者化成一只狗、一只狮子、一只老虎。假如这朵云本身是个猫的形象，你叫它化成狗，化成狮子、老虎，它就化不成功。由于无形相之故，能够随心而现形，所以叫做性空真色。<br/><br/> 　　我们说性色真空，这个性是有色的，不是无色，那么什么是性的色呢？真空是性的色！这个无形相之色，就是真色。<br/><br/> 　　“世间无知，惑为因缘及自然性，皆是识心分别计度。但有言说，都无实义。” <br/><br/> 　　刚才我们讲到“性色真空，性空真色”，现在从“根尘七家，执为身体”讲起。真如佛性没有形相，无来无去，不生不灭，不动不摇，所以叫如来藏。因为迷而不觉之故，生起妄动，就变成阿赖耶识了。阿赖耶识实际上就是如来藏，如来藏也就是阿赖耶识。很多解释《楞严经》的人，说阿赖耶识和如来藏是两回事，这种说法不对。后面要讲到根大，在地、水、火、风、空、见、识这七大种里面，其中的见就是根，有的人在讲到根大的时候，就说它是属于阿赖耶识，不属于如来藏。佛经上明明说它是如来藏啊！如来藏和阿赖耶识不是两回事，是一回事，就象一个人如果正直，就是君子；如果行为不端正，那就是小人。由于无明之故，就使我们一真法界如来藏心变成阿赖耶识。因为如来藏变成阿赖耶识，所以灵明真空就变成顽空，阿赖耶识就有生灭之形夹在里面。如来藏本来是灵明真空，不是顽空；本来觉观分明，不是无明；它本来就有地、水、火、风的能量，具有这个性能。这个性能无色相，没有青黄赤白、长宽方圆这些相，它就是虚空，它就是灵明真空。当如来藏变成阿赖耶识之后，由于无明的力量，灵明真空变成顽空，凝结成四大妄色。<br/><br/> 　　在这四大妄色中，火性是明，地、水、风是暗。明、暗二种妄尘，也就是四大妄色，它生起以后，就把我们的真知变成妄知妄见。妄见一生，就有了能见和所见，四大妄色成为所见境，如此一来就有色相了。最初的时候只是明、暗，在顽空当中只有明暗二尘，动得久了，因妄见久的缘故，就执著少分的四大妄色为自身，多分的四大妄色就变成山河大地、日月星辰……。由于执着为我的缘故，妄见就托在这少分的四大妄色里生根。地、水、火、风本来无知无觉，是无情，因为我们的真心被无明封固了，无明把它裹牢了，潜在这身根里头，执取少分四大为身根，就象潜水人一样，潜进去藏在里面了，所以这个身根有知觉。因为这个真知在里面，被无明封固了，就象本来是流动的水，遇冷之后变成冰，就不再流动了。这个灵知本来尽虚空、遍法界，无所不知，无处不在，现在只认这个身体里有的一点知觉，把广大无边的灵知变成小东西，锁在这个身体里面。本来它能大能小，化大了尽虚空、遍法界，化小了，退藏于密，乃至比一毛端还小。我们人有灵性，身体有知觉，外面的山河大地没有知觉，这种有情与无情的分别，是因为无明封固的缘故，把灵性封存到身体的里面去了。假如把寒气消除，冰就可以又化成水，把封固你灵知的无明消除，我们的灵明觉性就可以恢复本来面目。所谓修行就是修复本来面目，不是必须做什么功课，用个什么方法去增加点功德，而只是恢复本来面目而已。<br/><br/> 　　“性色真空，性空真色”，旨在使我们悟得这个性色本来没有形相，没有青黄赤白，没有长宽方圆，是无时不有，无处不在，不垢不净，恒常不变的。现在要讲的是色身由于无明之故，妄执四大，托为身根。因为明、暗两个妄尘，发见粘住了，使本来应该不动不摇、不来不去的妙明真心，被无明裹牢，发生了妄见。“见精应色”，就是妄见再反过来取四大妄色，作为所见。“积色成根”，就是把四大妄色积成我们的身根，身根就是由四大妄色这样积聚而成的。“识是妄想，想象为身”，在上面讲过，本来灵明的真心被无明封固了，变成妄知、妄见，裹在里面，合在妄知、妄见、妄心当中，想象成身体。身根就是这样来的。<br/><br/> 　　我们今天修行，就是要反其道而行之。《楞严经》讲的是大乘圆顿法门，一针见血，不需要做什么功夫、用什么方法，不用专门去念佛、参禅、修密，这些都不要！只要你明白这个道理：性色是没有形相的，它是真空的，不是顽空。顽空是个虚空，冥顽而无知；真空虽空，空中有不空，有灵知在，叫灵明真空。性空真色，真正的色大，不是有色相的色，是真空。什么东西都没有，才是真色。我们要透过形相认识本性，实相是无相之相，所以不要执著有相。举个例子：白云被风吹起来，可以显现猫相、狗相、狮子相、山相等种种形相，但它本身还是白云，我们不能只见这个幻相，而要见白云。再比如金子，可以打成杯子、镯子、盘子、戒指等各种器皿，但你不能只见这个器皿，要透过这些差别的相而见到金子。我们今天就是要明白这点，知道“性色真空”，并非是有个形相。见性其实并不难，我们的自性是灵明真空，不是顽空，也不是妄色，你能做到这一步，就时时刻刻见性了，那就无处不有你的自性。所以说桌子是佛、椅子是佛、杯子是佛……，一切的一切都是佛，都是真心所显现。《金刚经》说：“若见诸相非相，即见如来”。若已见如来，还做什么功夫呀？还用得着念佛、参禅、修密吗？所以说无修之修，才是真修。，“唯此一真实，余二皆非真”，只有这个是真的，除此以外再没有第二个。知道一切都是虚假不实的，只有这自性是真的，是一真法界，顿时一切放下，就可“放下屠刀，立地成佛”。能做到时时处处只见性，不见相，你就从根本上改变了。<br/><br/> 　　以前说过，我们众生见大地是沙、是土、是泥；罗汉、辟支佛见大地是虚空，没有东西，因为他偏空，还有个空相没破；菩萨见大地是七宝所成，象西方极乐世界一样，黄金铺地，一切楼台殿阁都是七宝所成。经上说：“随众生心，应所知量”，就是随大家的心量不同，所见也不同。佛更超过菩萨，见大地不是境界。为啥不是境界呢？因为一真法界，本来就是一尘不染。可是世上的这些凡夫，偏偏执著有这个大地，有这个所见。凡夫因执著之故，业力不可思议，佛也不能将它带走，所以叫不思议境界。十法界由于心量不同之故，所见也不同，这些都是幻相，都是假的。<br/><br/> 　　“世间无知，惑为因缘及自然性，皆是识心分别计度。”世间人无知啊，对这些幻相产生了疑惑，有的认为是因缘所生，有的认为是自然本有。这都是意识分别妄计的结果，是测度出来的道理。其实是“性色真空，性空真色”。妄相不实，既非因缘、也非自然。<br/><br/> 　　空不空如来藏是和盘托出、离言说相的。我在这里讲，是为了让你契入实义。粘着到语言上就不对了，“但有言说，都无实义”啊！<br/><br/> 　　前面讲的是地大，现在讲火大。 <br/><br/> <strong>　　（二）火大 性火真空，性空真火 </strong><br/><br/> 　　“阿难，火性无我，寄於诸缘。汝观城中未食之家，欲炊爨时，手执阳燧，日前求火。” <br/><br/> 　　“火性无我”，这里的我是主宰的意思，就是我有、我知、我是主宰之意。我们众生时时刻刻执著这个我，我是主宰，一切都要听我的命令，我要怎么做就怎么做。火性无我，就是火没有自立之地，火是要缘于柴、缘于点火的器具，要借助于助缘才能够燃烧起来。其实非但是火，一切东西也都是要因缘和合才能成功的。取火的方法有很多种，以前是钻木或用火石、火刀取火，现在用的是火柴或者打火机取火。这里讲的是用玻璃镜子映日光取火。这些方法全是助缘。没有因缘和合，火自己是燃不起来的。<br/><br/> 　　佛告诉阿难：你看看城里那些还没吃饭的人家，当要烧火煮饭的时候（爨就是炉灶，在炉灶里烧火煮饭），“手执阳燧，日前求火”。阳燧就是凸的玻璃镜子，拿它在太阳下照着，把太阳光聚集到一点，就可以把媒子点着了。从太阳取火，说明火性没有自力，没有主宰，是因缘所生的。“因缘所生法，我说即是空”，因缘所生的东西就是无生，就是没有，假如说有，为啥还要借助因缘呢？这就说明本来没有。 <br/><br/> 　　“阿难，名和合者，如我与汝，一千二百五十比丘，今为一众。众虽为一，诘其根本，各各有身，皆有所生氏族名字。如舍利弗，婆罗门种；优楼频螺，迦叶波种……乃至阿难，瞿昙种姓。” <br/><br/> 　　这里又举了一个例子，什么叫和合呢？比如我和你，还有一千二百五十名比丘，在祗桓精舍里说法听法，大家合起来成为一体，成为一众，和合僧即是众。就象我们现在房间里面自（已，大众集为一体，合起来为一众，成为一个小团体。“众虽为一，诘其根本，各各有身，皆有所生氏族名字”。这个众虽然是一个，但是一众的成员是各人有各人的身体，身体之外还有各自的姓氏、名字，这一众是由多人和合而成的。上次说到原子，它是由原子核、电子等合起来构成的，不可能原子自己合成为原子，电子自己合成为电子。每一个小的单位都是由更小的单位和合起来的，自己不可能合成一个自己出来。<br/><br/> 　　因此我们当前这个众，不是自己合成自己，而是由各个不同的人合起来的。比如舍利弗，又叫舍利子，他是婆罗门出身，是印度四大种姓中的高贵种族，是修道的，叫清净种姓。优楼频螺也是一个人的名字，翻译为磨菇，他象个磨菇的样子。迦叶波是大龟的意思，我们现在把乌龟当作是个龌龊名字，实际上龟在古时是上等的灵物，是龟、麟、龙、凤四大灵性之一。<br/><br/> 　　“乃至阿难，瞿昙种姓”，阿难姓瞿昙，翻译过来就是最胜，与佛同姓，是释迦佛的堂兄弟，也是同一个种姓。这些人都有各自的名字、各自的自体，彼此都不相同，这样许多人合起来才为众。假如火是和合而成的，那么请问：火是怎么和合成功的呢？这里就一个一个地破： <br/><br/> 　　“阿难，若此火性因和合有，彼手执镜，於日求火。此火为从镜中而生？为从艾出？为於日来？” <br/><br/> 　　假如这火是由镜子、太阳、艾绒（用艾绒搓成媒子，点火用）和合而有的，这火是从什么地方来的呢？假设火是和合而生的，那就是共生；假设不是和合而生的，离开两边，那就是清净本然。假设离开太阳、镜子和艾绒，这火也是有的，那就表明这火性是清净本然，就是如来藏性。如果是合和生出来的，那就不是如来藏性，而是别样东西。那么究竟火是从什么地方生出来的呢？<br/><br/> 　　“阿难，若日来者，自能烧汝手中之艾，来处林木，皆应受焚。” <br/><br/> 　　佛进一步问阿难：火是从太阳来的吗？它既然能烧你手中的艾绒，应该也能燃烧林木。太阳也能照到树林，树林就应该统统燃烧起来。既然树林没有燃烧起来，这说明火不从太阳来。若从太阳来，怎么会只烧你手中的艾，却没烧着它所能照到的树林呢？<br/><br/> 　　“若镜中出，自能於镜出燃於艾，镜何不鎔？纡当手执，尚无热相，云何融泮？” <br/><br/> 　　假如火是从镜中出来的，它既然能够使艾绒燃烧起来，为什么镜子自己不熔化呢？镜子若能出火，那么这个火不但能烧艾绒，也应该先烧镜子嘛。“纡当手执，尚无热相”，用手拿着镜子柄，手也没感到热。“云何融泮”？ 泮是流动的液体，就是说为何没把镜子烧熔化呢？就算不能一下子烧化，慢慢地也会熔化，手应该感到有热气呀。现在手抓住镜子，一点热气也没有，这怎么可能会把镜子熔化成液体呢？所以说火不从镜出，如果说火从镜出，无有是处。再进一步：<br/><br/> 　　“若生於艾，何藉日镜光明相接，然后火生。” <br/><br/> 　　假如火是从艾生出来的，那为什么要把太阳和镜子对照起来，光明相接之后，艾绒才能着火呢？说明火也不是从艾生出来的。要借助镜子之力，把太阳光聚集成一点，才能使艾绒烧起来。假如把月亮光聚集成一点，这个点不热，也烧不起来。<br/><br/> 　　“汝又谛观，镜因手执，日从天来，艾本地生，火从何方游历於此？日镜相远，非和非合，不应火光无从自有。”<br/><br/> 　　你再仔细思索一下看：镜子是手拿着的，太阳光是从天上下来的，艾是从地上生长出来的，这三样东西本不在一处。而当这三样东西聚到一起，在太阳光下拿镜子一照，艾就着了，这火究竟是从什么地方游历到艾绒上的呢？“日镜相远，非和非合”，太阳和镜子，二者各自有体，太阳是太阳，镜子是镜子，两者原非一体，互相离得很远，“非和非合”，不是合在一起就变成别的东西了。前面讲过，和合是互相融合，函盖相投为合，象这样离得很远，是无法和合的。虽然不从艾生、也不从镜子出、也不从太阳来，但是这火不应该是没有来路而自己有的，它自己不可能生出自己，也就是不自生。就象我们这个身体是父母所生，不可能自己生自己。<br/><br/> 　　上面说了三种情况：不自生、不他生、不共生，这三种情况都不可得。此外还有一个不无因生：因为现在火还是有的，那就说明非不和合。非和合属于非因缘，非不和合属于非自然。既然非因缘、非自然，两面俱非，这就证明它是如来藏性。这火性本来是无处不有的，只因我人妄执之故，执著假相之火，结果有的地方有火，有的地方没火。实际上性火象虚空一样，无处不在、无时不有。下面就讲到：<br/><br/> 　　“汝犹不知，如来藏中，性火真空，性空真火，清净本然，周徧法界，随众生心，应所知量。”<br/><br/> 　　因为无明之故，你还不知道如来藏中“性火真空，性空真火”，这两句和我们上面所讲“性色真空，性空真色”的道理一样。性火是如来藏中本有的能量，如来藏就是清净法界，也就是一真法界。我们的如来藏中本来就有地、水、火、风四大，它们是无处不在的。火性就是灵明真空，它没形相，但无处不在。如果看到有形相的火才是火，那都是由妄执而起的，世间的人习惯于假相，叫他不着相不行，一定要有相他才相信。由于着相之故，这个假相就掩没真性之光。因此要把这个相打破，不要粘着在这个相上。所谓破相并不是要把这个相去掉，不要这个相了。前面讲过，妄相不可怕，妄相正是真心所显现，相就是性，性就是相。众生因为执相之故，迷失了真性，如果能明白相就是性，那么当下就是佛，并不是有个别的什么东西是佛，这就是教我们别执着。有形相的火是妄火，无形相的火才是真火，叫做性火真空。有形象的空是顽空，没有形相的空才是真空，顽空是冥顽不灵，真空是迥脱根尘。“性空真火”，性空不是妄火，而是真火，不要执著有相之火才是火，其实真空就是火。这个灵明真空，就是我们的真如佛性，所以它清净本然，离一切相。不住相叫清净，它能生一切相而不染。本然就是不自生、不他生、不共生、不无因生，就是非因缘、非自然，本来如此。周遍法界就是无处不在、无时不有。众生执着这里有火，那里没有火；或者那里有火，这里没有火。这是众生的分别，妄执火相。<br/><br/> 　　“随众生心，应所知量”，众生的心量有限。十法界众生，四圣六凡，心量各各不同，见的火相也各各不同，这就是应所知量啊！比如黄河，我们看见的是水，而地狱饿鬼看见的却是火，他和我们所见的火相就不同。如果我们真的成道了，火就烧不着我们的身体。为什么呢？因为性火真空啊！性火无形，哪里有火？不象山上森林烧起的大火，一烧就是很长时间，要想办法扑灭。由于真火是性空的，真火无形，哪里有火相？所以对于火相不能执著，大火能生也就能灭，到后来就灭掉了。如果认定烧起来的才是火，那就执著了。假如我们时时刻刻只见性，而忘记相，果真如此就是真修，就到家了。真能这样，此地就是极乐世界，不是等死了以后才生西方极乐世界。前面讲地大的时候说过，我们看这个地球是泥土、沙石，菩萨看起来是七宝所成。西方极乐世界就是七宝所成，所以娑婆就是极乐。这些都是在随我们心量的改变而改变。<br/><br/> 　　“随众生心，应所知量”，你的心量有多大，所见到的相也就有多大。量大法大，这句话大家要明白，心量大了法就大，心量小法也就小了。心量大了，因不见相之故，凝固你真心的无明就打破了。无明打破就等于寒气消退，寒气消失冰就重新融化成水，它就流通而不再壅堵。那么水是怎么结成冰的呢？这就是因为妄见，是我们众生的妄想心结成的。所以要用各种法门：念佛、参禅、修密来融化它，用般若火来把它烧化。我们念佛的时候：“阿弥陀佛、阿弥陀佛……”，这一句句的佛号就是般若火焰。假如现在一点之下，“啪！”地明白了，无明的寒冰当下就化了，那就是大般若火聚，你就成道了。成道这件事情说起来需要三大阿僧祗劫，其实三大劫不是固定有几千年几万年，它是三个不可知的时间。这个时间可快可慢，可长可短，不是固定的，所以不可固执一定要念多少佛，一定要修多长时间的法才能成就，那是死执。悟道要懂得妙悟，悟道就是见性，见性就开了法眼，不会再执著在相里面。<br/><br/> 　　“阿难，当知世人，一处执镜，一处火生；徧法界执，满世间起。起徧世间，宁有方所？”<br/><br/> 　　“当知世人，一处执镜，一处火生”。并不是只有这里拿镜子照太阳可以生火，别的地方拿镜子照太阳火也一样能生起来，因为真火是尽虚空、遍法界的，它无处不有、无处不在。你这边执镜照艾绒，你这里有火；他那边执镜照艾绒，他那里也有火，所以“遍法界执，满世间起”。若整个法界都执镜照艾，那么满世间就都是火。“起遍世间，宁有方所？”从这个地方来，到那个地方去，这都是方所。性火尽虚空、遍法界，灵明真知哪里有方所？《楞严经》是大乘经典，它好就好在直接指示，不要你去参。当下领会就是，还参个什么？从前禅宗也是直指的，你看六祖指示惠明：不思善、不思恶，都放下！因为我们的思想总是落在两边，一边好、一边坏，现在你好也不想，坏也不想，一念无思的时候是个什么？“惠明良久”，这句话很要紧，不要滑过去，这是一念不生时，六祖就指点他：正与么时，那个就是本来面目。一念不生而了了分明，非同木石，不是你本来面目是什么？从前的人只用直指，不用参话头，那个了了分明的悟境经师父一指点就知，认得后再不放下，绵密保任，不随习气流浪。现在的人根基浅，就要多吃苦头，叫你参念佛是谁，兜几十年的圈子，真是冤枉！为什么要这样呢？因为明白告诉你，你不希罕，当成儿戏了。哎哟！这么容易呀，没什么稀奇的嘛！等于把祖传的财产给了你，你不知来处艰辛，把钞票拿去乱花乱用。乱花乱用就等于不打扫习气，境界一来就还会跟着跑，只要你继续随相流浪，就是生死依然未了。所以是有心叫你兜兜圈子，让你知道来得不易。<br/><br/> 　　大慧杲祖师就是看众生根基差，才提倡参话头，这是祖师的苦心啊，不要弄错了。你们诸位若承当得起，这个就是！若承当不起，那也不可气馁，要去念佛、要去参禅、要去修密。这个事情是最要紧的，修行法门没有定法，不是必须修哪个才行。密宗讲大圆满、大手印的时候，都是直接了当指示。为什么呢？因为密宗是先修显教，再修生起次第和圆满次第的密法，等到传大圆满、大手印的时候，他已经修几十年了，有这个基础。<br/><br/> 　　“循业发现。”<br/><br/> 　　什么叫“循业发现”呢？比如我们上海的人家，用火的方法并不是一样的，有的人家烧煤气，有的人家烧电炉，有的人家烧煤饼，有的人家烧火油，这就是“业”不同啊！有了世间相，这种比喻就好懂。这个“循业发现”，讲的是三细的落处，所谓三细就是无明业相、能见相、境界相。真如佛性本来没有相，是当体清净的，由于无明不觉，生起能觉所觉，业相就起了。“无明为因生三细”，这是《起信论》讲的，这三细也叫业相、转相、现相。现相就是境界相，转相就是能见相。由于它去攀缘现相，故称转相。真如佛性本来无相，因为无明妄动了，在无相当中转成有相，就生起这个业。由于业不同之故，十法界众生所见的火相也各不相同，别相当中有同相，就是同分妄见，我们人类看见的火相是一样的。我们刚才讲过：地狱、饿鬼看见水是火，与人类所见不同，这就是各自的别相。假设我们的业消了，火相也就消了。业起了，则火相就起。刚才讲的森林之火的例子，就是如此。“性火真空”，哪里有火相？心如果真空了火就烧不到你。你的心量不空，火就能烧起来，就可以把你烧死。这些都是“循业发现”的，由于业力不同之故，所见的火相也不同。<br/><br/> 　　“世间无知，惑为因缘及自然性，皆是识心分别计度。但有言说，都无实义。”<br/><br/> 　　“世间无知，惑为因缘及自然性”，这世间人不知不识，都迷惑了。说这个是因缘生、说那个是自然生。其实这都是妄想。原本是非因缘、非自然，原本是清净本然。清净本然不是自然，也不是因缘。<br/><br/> 　　“皆是识心分别计度”，这个识心很坏，是五蕴的根子，因为念念起觉，所谓能觉、所觉。能觉这个觉就是识，识心趋境就变成影子，形影成相。妄相现前，对着这个识，识就相应。所以说识是根本，识最坏，都是它在分别计度。这些都是假象啊！<br/><br/> 　　“但有言说，都无实义”。我们见到真性，言语道断、心行路绝，无可开口，开口即非。<br/><br/> 　　下面讲“水大”：<br/><br/> <strong>　　（三）水大 性水真空，性空真水</strong><br/><br/> 　　“阿难，水性不定，流息无恒。如室罗城迦毗罗仙、斫迦罗仙及钵头摩、诃萨多等诸大幻师，求太阴精，用和幻药。是诸师等，於白月昼，手执方诸，承月中水。”<br/><br/> 　　水的性质是不定的，遇热的时候就变成水蒸气上升，水蒸气遇冷的时候，又结成水下降；处在高的地方就往低处流，到了低的地方就会停下不动，这就叫做“水性不定，流息无恒”。它的特性就是从高处流向低处，从江河流向大海，流到低处就会停息下来，流也好息也好，不会永恒不变。<br/><br/> 　　佛下面用室罗筏城（室罗城是佛讲经的地方）里的迦毗罗仙、斫迦罗仙、钵头摩、诃萨多，等诸大幻师来举例子。仙人指的是修得超尘脱俗，已经得了神通的修道人。他们的名字翻译过来，迦毗罗就是金色的头，也就是黄头发；斫迦罗就是车的轮子，表示他讲的道理很圆满，无论任何人都考不倒他；钵头摩是红莲花，表示他住的地方有很多莲花；诃萨多就是大海的水，因为他住的地方靠近海边。这些大幻师以自己的特征或住的地方而得名。因为他们是外道，没有证到真如佛性，所有的神通、幻术都不是真的。这个道理我们以前讲过，只有见到真性之后，才有真正的神通妙用。没见到真性，这些东西还是生灭法，生灭就等于幻术。他们在这里求太阴精，什么是太阴呢？我们以前讲过，月亮是太阴，日头是太阳。求太阴的精水，就是把月亮的精水求出来。这种事情不光印度有，我们中国也有。据说从前有个方法，可以求月亮里的水。怎么求呢？就是用东南西北中这五方的石头，挑选阴历十一月的壬子日，半夜里跑到北方来烧炼，制成象杯子的形状，煅炼出来后，用它向月亮求水，月亮上的水就可以流进这个杯子里去。这是我们中国的说法，经上讲的是印度的求水方法。印度的幻士求月亮上的精水来和幻药，幻药就象我们中国道教的丹砂，丹砂是一种矿物的东西，用死人的什么东西与水银等合制而成。服食丹砂不得法，会中毒死亡的。诸大幻师求太阴的精水来合成幻药，在印度大概是取物精、人精来制作的。人的精华如道教讲的采阴补阳、采紫河车、采婴胎等。道教的丹药有很多种，主要是两类：一种是内丹，一种是外丹，外丹就象幻药一样。<br/><br/> 　　“是诸师等，於白月昼”，白月就是满月，阴历三十天的大月称白月，白月昼就是月亮在中天，满月的夜晚。“手执方诸，承月中水”。前面说过用阳燧取太阳精。这里说的方诸，是取太阴精的器物，究竟是什么样我们没见过，书中描绘的是孤形，象珠子的形状。月亮的水流下，用方诸承接，可以用方诸向月亮求水。<br/><br/> 　　“此水为复从珠中出、空中自有、为从月来？”<br/><br/> 　　就象前面讨论来处一样，现在四大幻师手执方诸向月亮求水，月亮的水流出来了，那么这个水从什么地方来的呢？是从月亮里出来，是珠子上有的，还是自己生出来的？<br/><br/> 　　“阿难，若从月来，尚能远方令珠出水，所经林木，皆应吐流。流则何待方诸所出？不流明水非从月降。”<br/><br/> 　　和前面问火的道理一样，月亮、太阳都在天上，不在我们人间，不象身边的东西可以拿来看、用手摸的。假如水是从月亮生出来的，它既然能让这远方的珠子出水，那么月亮所照到的林木也应该流出水来才对。前面讲太阳的时候说，如果火从太阳出来，它照到树林的时候，应该把林木也都烧着了。<br/><br/> 　　假设月亮能够出水，何须方诸照着月亮之后，才能出水呢？假如没有方诸，这个水就流不出来，那就证明水不是从月亮上流下来的。<br/><br/> 　　“若从珠出，则此珠中常应流水，何待中宵，承白月昼？”<br/><br/> 　　假如是从珠子流出来的，那么这个珠子应该常常在流水，为什么非要等到白月昼，要月亮照到这个珠子，才能出水呢？这证明水不从珠子出，也不从月亮出。<br/><br/> 　　“若从空生，空性无边，水当无际。从人洎天，皆同滔溺，云何复有水陆空行？”<br/><br/> 　　假如水从空中出来，这空没有边际，看不到头，那么所生之水也应该无边无际，整个太空全都是水了。假如从人间到天上到处都是水，哪里还会有现在的水、陆、天空？人畜鸟类都要溺死、饿死了。所以空不能生水。<br/><br/> 　　“汝更谛观：月从天陟，珠因手持，承珠水盘，本人敷设。水从何方流注於此？月珠相远，非和非合。不应水精无从自有。” <br/><br/> 　　“汝更谛观”，你再仔细地看看，再详细审察审察。首先“月从天陟“，月亮在天上走；其次“珠因手持”，珠子在手里拿着；第三“承珠水盘，本人敷设”，承珠的水盘是人端来的。“水从何方流注於此”？水什么地方流来的呢？既然不是从月出，不是从珠出，也不是从空出，但是水并不是没有，已经流到了这个盘子里，你说水从什么地方来的呢？“月珠相远，非和非合，不应水精，无从自有”。月亮和珠子相距很远，二者并不和合，也就是不因和合而有，可是这个水精也不应该是从无到有自己变出来的，因为自己不可能生自己。所以说“不自生、不他生、不共生、不无因生”，那么它不是如来藏又是什么呢？如来藏清净本然，本来具足一切种性，只要你不执著，尽虚空遍法界都是水，因为水性无形，真水无相。你们执著之后，这水就有方所和相貌了，于是有些地方有水，有些地方没水。因为如来藏本来没有形相，无明就象楼梯一样，一层一层积成妄色。我们平时看到的是妄色，无明之故。所以要用功打破这个无明，才能破相见性。天台宗把无明分成好几类：见惑、思惑、尘沙惑、无明惑，分了很多。而在宗下讲起来，不分这么细，直接打破无明，这个楼梯消殒了，相就不可得了。<br/><br/> 　　“汝尚不知，如来藏中，性水真空，性空真水。清净本然，周遍法界。随众生心，应所知量。一处执珠，一处水出。遍法界执，满法界生。生满世间，宁有方所？”<br/><br/> 　　这里和前面讲地大、火大是一样的。因为无明迷障了你的真心，你不知道这如来藏中“性水真空”。性水是无形无相的，是真空，你看到有形相的水，那是幻相，不是真水。“性空真水”，无形无相的水，才是真水。真空就表明不是顽空，性水就表明不是幻相之水。性水是无形的，有形相的是幻相。由于彼此业力不同，各人所见也不同，我们看到是水，而地狱恶鬼看到的是火。<br/><br/> 　　“清净本然，周遍法界”。如来藏尽管显一切相、生一切法，但生而无生，显而未显，所以它是清净的。不自生、不他生、不共生、不无因生，所以说本来无生，周遍法界，无处不在，无处不有。<br/><br/> 　　“随众生心，应所知量”。因十法界众生心量各各不同，因而所见也各各不同。江河大海，我们看到的是水，天人看到的是琉璃，鱼龙虾蟹看到的却是房屋。由于众生的心量不同，所见也不同啊！<br/><br/> 　　“一处执珠，一处水出，遍法界执，满法界生”。因为你执著这个作用，你用方诸照着月亮，你这里得水；他那里用方诸照着月亮，他也得水。并不是水到你这里来，他那里就没有了，因为性水是尽虚空、遍法界，无处不在的。所以“一处执珠，一处水出。遍法界执，满法界生。”整个法界到处都有真水，随便在哪里执珠，都会有水流出。<br/><br/> 　　“生满世间，宁有方所？”因为性水是充满一切世间的，哪里还有方所？哪里还有来去？六祖见性的时候说：“何期自性本自清净；何期自性本不生灭；何期自性本自具足；何期自性本无动摇；何期自性能生万法。”这就直下见性了。我们今天也应该如此，把这个假相打破了：噢！这个真心原来是无形无相的。既然见不到形相，你想还有什么可证之物？既然根本就没有形相，又哪里有心去求这求那？有个所求的心，就会不停地追求各种欲望，满足欲望就开心，不满足欲望就烦恼。欲望一个接着一个，哪有满足的时候？<br/><br/> 　　最近报上登了一个案子：有个副厂长，自己生活很俭朴，在食堂里吃最便宜的菜，衣裳补了又补，样样事都带头。因为他表现得很积极，看上去没有什么欲望，所以得到领导的重视，升他做了厂长。谁知他其实贪欲很大，天天想着出成绩，心里痛苦得不得了，就抢单身女职工，抢多了总会暴露的。“要想人不知，除非己莫为”。这个人内心光想往上爬，戴着个假面具做人，欲望不可能得到满足。所以我们要打破妄想执著，识得本来面目，你还有什么值得追求、还有什么放不下呢？能够做到这些就见道了，能够永远不执相就成道了，你不要把这个做等闲看啊！我现在问你：“你能放下这些吗？”有的人会说：“我还没有发神通啊！”神通和见性不相干，你不要执著神通，须一切放下才行。你们不是没有神通，是你的习气把神通盖住了，现在粗的烦恼还没断，神通一时还出不来，等无明习气消除了，到时不求通而自然得通。<br/><br/> 　　在这里我给大家简单讲一下五盖：五盖就是“财、色、食、名、睡”。财就是贪财之心，金银珠宝钞票都是财；色为美女之色，声色犬马之好，这都是色；食者就是饮食，要有好吃、好味；名就是名誉、美名，受到别人恭维就开心得不得了，说一声不对马上要发火。有个法师经讲得很好，有一次到一个地方去讲经，刚下火车，另一个地方的人送上个纸条给他，说您的经讲得怎么怎么好，请到我们那里去讲，他一听，那就赶快去吧。这还是好名，所以善名也是盖，都是人的习气。睡就是睡眠，你们听到睡眠也是一盖，那以后睡眠也不要了，晚上就专门打坐，来个不倒单。不要弄错了，这样不行！为什么呢？因为不倒单有两种，一种是座上打瞌睡，坐在那里呼噜呼噜地睡。你取个坐相，不躺着睡，还是在执相。要怎样做才行呢？睡就尽管睡，虽然睡而没有睡，也就是不昏沉。讲个故事给大家听：从前禅宗四祖道信禅师，去牛头山要度懒融禅师。到了晚上，道信禅师躺下来蒙头就睡，在那里呼噜、呼噜地鼻息大震。懒融禅师则在那里打座，他要修不倒单。天亮了，懒融禅师说：哎哟！你昨天晚上睡得好香呀！你呼噜声大得不得了，吵得我一夜没睡着。道信禅师说：嗨！你身上两个虱子打架，有一个把大腿折断了，在那里“痛啊！痛啊！”地叫，吵得我一夜没睡。懒融禅师说：有这事吗？我坐在这里只听到你酣声大作，别的声音可是一点也没听到。脱下衣服一看，拎起一只白虱来，大腿果然断了。道信禅师酣声大作，而能听到虱子打架，他这才是真正的不倒单，虽然睡而神志清醒。懒融禅师坐在那里一夜不倒，反而一点也没听到。所以用功夫不能执著在那个坐相上。六祖说：“生来坐不卧，死去卧不坐，一具臭骨头，何为立功课。”禅宗的人不讲这种死功夫，你如果真会用功夫，就是困了睡倒也是在坐；若没有功夫，虽然坐在那里也是犯困。我们要真了，就不能着在这个相上。临济祖师开悟后，有一天他师父黄檗过来巡房，他本来是躺着睡觉的，见师父来了依然倒头大睡，而其他人都在那里坐禅。黄檗一看，说：你们这些人在这里装模作样，还不及临济睡着会用功夫。<br/><br/> 　　所以修行是在内心，不在外表，我们悟道以后的修行才是真修，真修是除自己的习气。悟后知道什么是性、什么是相，知道万法都是自己的作用，才能如实如理而修，你如果不悟，不管修什么法都是盲修瞎练。有的人念了多少遍佛，要记个数；读了多少遍经，也要记个数。哎呀！阿弥陀佛让我捎个话给你，佛说有个人怎么怎么样，有个地方怎么怎么样，佛又说我们应该做个什么场子……。这哪里是见佛，这是见鬼了！真正悟道不是这样，既没有相，也没有方所，连个佛的影子也不可得。<br/><br/> 　　“循业发现。世间无知，惑为因缘及自然性，皆是识心分别计度。但有言说，都无实义。”<br/><br/> 　　这里和前面讲的一样。这些水相都是随众生业的不同，所以有各种差别。你看有些地方发大水，受洪涝灾害，这就是业；有的地方总不下雨，旱得没有水吃，这也是业。这些旱涝之相都是众生共业所感。现在经济发展了，各地盲目办的工厂太多，废水到处都在污染，这也是共业所成。这些都是“循业发现”。众生的业不同，所见的水相也不同。“世间无知，惑为因缘及自性”，世上没有知识的人，对此迷惑不解，纷纷讨论这些现象是由于因缘或自然而生成的，就象梦中说梦，永远也解不清楚。这都是妄心、妄识在分别，但有言说，都无实义。<br/><br/> 　<strong>　（四）风大 性风真空，性空真风</strong><br/><br/> 　　“阿难，风性无体，动静不常。汝常整衣，入於大众，僧伽梨角，动及傍人，则有微风，拂彼人面。”<br/><br/> 　　现在讲风大。“风性无体，动静不常”，风本来是没有体性的。风是什么？风是空气在流动，它没有滞碍之性，因而没有所在。如果是水，你可以拿东西搅动它；如果是火，你可以拿来燃烧；但是风却无处可以捞摸，没有滞碍之体，故说“风性无体，动静不常”。因为它时有时无，一动之后就有风，一止之后风就停了，忽起忽停，所以说动静不常。<br/><br/> 　　“汝常整衣，入於大众”，你经常是把衣服整理好，到大众中去。“僧伽梨角，动及旁人”，僧伽梨就是和尚穿在外面的大衣，又称杂碎衣。我在云居寺见过虚云大师穿过的衣裳，那件布衫一条条的，有红、黄、白、兰、黑各种颜色，这就是杂碎衣，也叫僧伽梨。你穿衣服的时候，衣角一动，就会动及旁人，就有风拂到别人的面孔上去。这风是从哪里起来的呢？那是你衣裳动的时候，空气流动，于是把风带了起来。<br/><br/> 　　“此风为复出袈裟角、发於虚空、生彼人面？”<br/><br/> 　　那么这风是袈裟角生出来的、是虚空生出来的、还是从人的面孔上生出来的？世尊在这里向阿难问这个风的来处，为什么要问来处？因为有来处，才会有风，没有来处，就是没有风。<br/><br/> 　　“阿难，此风若复出袈裟角，汝乃披风。其衣飞摇，应离汝体。”<br/><br/> 　　假如这风是袈裟角生出来的，那么你穿衣裳就等于穿着个风了。“其衣飞摇，应离汝体”，风是摇动的，那么你的衣服就应该穿不住，会象风一样飘离你的身体。这样一来你穿的就是风，而不是衣裳了。<br/><br/> 　　“我今说法，会中垂衣。汝看我衣，风何所在？不应衣中，有藏风地。”<br/><br/> 　　佛说，我现在正在这里说法，会中大众的衣服都下垂着。衣角垂在下面不动不摇，证明里面没有风。如果有风，这个衣裳就会随时飘动。“汝看我衣，风何所在？”你看我的衣裳藏着风吗？风在什么地方呢？你不能说我衣裳里有藏风的地方。这就说明风不是从袈裟生出来的。下面再说虚空：<br/><br/> 　　“若生虚空，汝衣不动，何因无拂？”<br/><br/> 　　假如风是虚空生出来的，那么你衣裳不动的时候，为什么看不见风呢？为什么要衣裳动的时候，才有风拂人面孔呢？<br/><br/> 　　“空性常住，风应常生，若无风时，虚空当灭。灭风可见，灭空何状？”<br/><br/> 　　虚空常在，不会断灭，那么风也应该一直在吹，没有断续之相。假如是虚空生出来的风，那么当风停了的时候，虚空也应该消灭了。风虽然没有形相，但是我们能感觉到它的来去，在风停了的时候，还有各种形状的东西可以看见（比如：树枝不动了）。如果虚空灭掉了该是什么状况呢？所谓虚空正是因为它本身没有东西，既然没有东西也就没生灭，所以说虚空不可能灭掉。<br/><br/> 　　“若有生灭，不名虚空。名为虚空，云何风出？”<br/><br/> 　　假如有生有灭，就不能叫虚空。因为有生有灭，就说明有事物、有物体、有东西，当然就不叫虚空。没有东西才没有生灭，没有生灭才是虚空。既然虚空没有东西，又怎么能生出别的东西来呢？所以说风从空出也不可能。那么既然不从衣出，不从空出，是不是从面孔出的呢？请看下面：<br/><br/> 　　“若风自生被拂之面，从彼面生，当应拂汝。自汝整衣，云何倒拂？”<br/><br/> 　　“若风生自被拂之面，从彼面生，当应拂汝”。假如说这个风是从他面孔上生出来的，应该吹到你，而不应该吹到他自己的面孔上。东风应该向西吹，北风应该向南刮。从我面孔上生出的风，应该吹你，而不是吹我。假如不吹你，而吹到我自己的面孔上来，那就是倒拂。“自汝整衣，云何倒拂？”你在这里整衣，风从他面孔上生，又吹到他面孔上了，怎么会这样倒拂呢？所以说这风不是从他脸上生的，若从他脸上生出来，不应该吹到他自己呀。<br/><br/> 　　“汝审谛观，整衣在汝，面属彼人，虚空寂然，不参流动，风自谁方，鼓动来此？风空性隔，非和非合。不应风性，无从自有。”<br/><br/> 　　你仔细思量审查，整理衣服的是你，面孔是别人的，虚空则是寂然不动，不参流动的，那么“风自谁方鼓动来此”呢？这风不是从衣上生的，不是从空中生的，也不是从面生的，既然不从这三处生，它是从什么地方鼓动而来的呢？<br/><br/> 　　“风空性隔，非和非合”。风是流动的，虚空是寂然不动的，它们两个一个是动，一个是不动。动与不动非一之故，性体不一样，不能和合在一起。<br/><br/> 　　“不应风性，无从自有”，不应该说这风没有方所，是自己生出来的。因为任何东西都不能自己生自己，火不能生火，水不能生水，风当然也不能生风。既然不他生、不共生、不自生，那就证明这风性本来就是如来藏妙真如性，没有来去，清净本然。 <br/><br/> 　　“汝宛不知，如来藏中，性风真空，性空真风。清净本然，周遍法界。随众生心，应所知量。”<br/><br/> 　　这是在斥责阿难：你完全不知道，“如来藏中，性风真空，性空真风”。 性风真空，就是说这性风连风的分别都不可得，它的性体本空，不要执着妄空妄动。风虽然是动的，但性风并没有动。性空真风，由于真空之中没有形状，没有动摇，所以说这个风才是真风。有形状、有动摇、有触觉，那就不是真风。性空是真风，它是生而不生，不生而生，清净本然，周遍法界的，不是什么“自生、他生、共生”。既然周遍法界，那就无时不有，无时不在，无处不有，无所不在。“随众生心，应所知量。”和前面说的一样，由于众生心量不同，所知道的风相也就各各不同。<br/><br/> 　　“阿难，如汝一人，微动服衣，有微风出。遍法界拂，满国土生。周遍世间，宁有方所？”<br/><br/> 　　“阿难，如汝一人，微动服衣，有微风出”。象你一个人动一动衣服，微风就出来了。“遍法界拂，满国土生。”如果整个法界都在拂衣服，到处都会有风生出来，所以“周遍世间，宁有方所”。世间无所不在，无所不有，到处都周遍，那里有一个专门的地方呢？不是你这里摇动就有风，他那里摇动就没有风。因为性风就是真空，它周遍一切世间，不是从我们妄想执著中生的。世上的人就是这样无知，在那里妄想执著，把这个真空的性风割裂了，这都是妄想成执啊！因为执著之故，于是就见到有的地方有风，有的地方没有风，实际上性风无所不在。<br/><br/> 　　“循业发现。世间无知，惑为因缘及自然性，皆是识心分别计度。但有言说，都无实义。”<br/><br/> 　　“循业发现。”由于各自业不相同，所见也就不同。世间上的人没有知识，对这个风的来历迷惑不解，或者认为是因缘生，或者认为是自然生。因缘就是和合而生，自然就是非和非合而生。事实上和合也好，非和非合也好，都不可得。因缘与自然，都是识心分别。“但有言说，都无实义。”能言说的都是假的，都是假相。现在有人讨论这个问题时，都在说什么一元、二元、唯心、唯物，其实都讨论不到真实之处，要理解真如实相，只有佛法才做得到。对这个时空你执著生灭有无，就只能见妄相。只有理解了性空的道理，一点也不执著，才能见到真如实相。<br/><br/> 　　地、水、火、风这四大已经讲完了，下面讲空大：<br/><br/> <strong>　　（五）空大 性觉真空，性空真觉</strong><br/><br/> 　　“阿难，空性无形，因色显发。如室罗城，去河遥处，诸刹利种及婆罗门、毗舍、首陀兼颇罗堕、旃陀罗等，新立安居，凿井求水。出土一尺，於中则有一尺虚空。如是乃至出土一丈，中间还得一丈虚空。虚空浅深，随出多少。”<br/><br/> 　　现在讲空大。什么是空性呢？长短、方圆、大小、高低都是空。空是没有形相的，叫“空性无形”。我们所见的空相，是因色显发的，有色相的地方因为有东西，不成其为空。没有色相的地方就是空。所以空是相对而言的，空因色显，需要借助色才能显发出空。“如室罗城，去河遥处”，室罗城就是世尊讲法的地方，离恒河还是挺远的。“诸刹利种及婆罗门”，古印度有四大种族：刹利种，是王公贵族；婆罗门是清净的修道人，古印度有婆罗门教；毗舍是做生意的人，首陀罗是耕田的农民。此外还有颇罗堕和旃陀罗，颇罗堕做雕刻、绘画艺术性的工作；旃陀罗的地位最低，只能从事屠夫和妓院这些最下贱的工作。古印度做这些下等生意的人，要挂个旗子作为招牌，他们都被人看不起，被称为恶人，不能和其他种性的人在一起。上面这些人因为离河远，不能直接到河边挑水吃。怎么解决吃水问题呢？于是“新立安居，凿井求水”。人没有水不行，所以立家安居首先就要解决吃水问题，吃不到河水就要打一口井。打井的时候，“出土一尺，於中则得一尺虚空”。每挖出一尺土，在原来的土的地方就有一尺空间。因为空以色显，没有色的地方自然就是空了。“如是乃至，出土一丈，中间还得一丈虚空。”挖土一尺，就有一尺的虚空，那么挖土一丈，当然就有一丈的虚空。“虚空浅深，随出多少。”虚空的深浅取决于出土的多少，挖出来的越多，空就越深；挖出来的越少，空就越浅。空与色是相对而有的，不是绝对有。绝对有的是真心，相对有的东西都是虚妄不实的，从而证明这个虚空是虚妄不实的，只在色尘相对中才有的。<br/><br/> 　　“此空为当因土所出、因凿所有、无因自生？”<br/><br/> 　　这个空是因为挖出土来而有的、还是钻井凿出来的、或者是自己生出来的呢？没有来由而生叫无因自生。这空从什么地方来的？假如空无所来处，就是虚妄。<br/><br/> 　　“阿难，若复此空无因自生，未凿土前，何不无碍？唯见大地，迥无通达。”<br/><br/> 　　假设这个虚空是自己生的，叫无因自生。那么没有凿井之前，土没有挖出来之前，何不无碍呢？空是无碍的，有碍就不是空。假如没有挖土的时候，它没有一点妨碍，就证明空是无所不在的，并没有妨碍。如果有土的时候就有碍，有东西挡在那里，那就不是空。因此，在土没有挖出来之前，就“唯见大地，迥无通达”。我们眼前只见大地，并没有看见通达无碍的空相，不见空相就是有妨碍，说明这个空不是自己生出来的。<br/><br/> 　　“若因土出，则土出时，应见空入。若土先出，无空入者，云何虚空因土而出？若无出入，则应空土元无异因。无异则同，则土出时，空何不出？”<br/><br/> 　　“若因土出，则土出时，应见空入”。上面说空不自生，如果是因为要把土挖出来之后才成空。那么土出来时，应该看见空跑进去了，可是我们并没有看见空跑进去，这就证明不是土挖出来之后才成这个空的。“若土先出，无空入者，云何虚空因土而出？”假如说土取出来了，没看见空跑进去，为什么要说这个虚空是因土挖出来才有呢？这样一来，说虚空是因土挖出来才有的论断，就不能成立了。<br/><br/> 　　“若无出入，则应空土，元无异因”。若无出入，就是假如土也不出，空也不入，那么空即是土、土即是空，空和土就混成一体了。如果说空就是土，土就是空， “无异则同”，。既然不异就应该相同，二者就是一个体性。那么，“则土出时，空何不出？”把土挖出来时，空也被挖了出来，为什么不见空出来呢？这样一来，说同也不对，说异也不对。异就是挖土出来的时候，没见空进去；同就是土挖出来的时候，空为什么不出来。既然同和异都不对，就说明这个空并不是因土挖出来才有的。挖土出来时不见空出，就是非同；挖土出来时不见空入，就是非异。这就证明空与土既不同也不异，这个空不是因土而生的。比如水和波是同体的，有水才能起波浪，去波就是去水、去水就是去波。假如用水比喻土、波比喻空，应该去土就是去空。可现在实际上去土不是去空，所以土、空不是同体。既然不是同体，就应该是一个出、一个入，土出来、空进去。实际上我们只看见土挖出来，不见空进去。如此证明这个空不是从土生。<br/><br/> 　　“若因凿出，则凿出空，应非出土。不因凿出，凿自出土，云何见空？”<br/><br/> 　　假如这个空是因为开凿而生出来的，既然凿所生出来的是空，就不应该把土凿出来。凿既然出空，就不应出土呀。“不因凿出，凿自出土，云何见空”？如果不是因为凿生的空，那么把泥土凿出去之后，为什么又看见这个空显出来了呢？这和上面讲的一样，上面是同体也不对、异体也不对，这里是凿出也不对、凿不出也不对，出与不出两边都不对。因为凿子把土一挖之后，虚空就显出来，假如凿子能够出空，它直接把空生出来好了，而不应该把土挖出去。由于两边都不对，所以就是不从凿出。<br/><br/> 　　通过以上的分析，就证明虚空不自生、不他生、不共生、不无因生。不自生、不他生、不共生，就是非因缘性；不无因生，就是非自然性。既非因缘，又非自然，就证明这是如来藏妙真如性。<br/><br/> 　　“汝更审谛，谛审谛观：凿从人手，随方运转，土因地移。如是虚空，因何所出？凿空虚实，不相为用，非和非合。不应虚空，无从自出。”<br/><br/> 　　“汝更审谛，谛审谛观”，你再格外仔细地审察审察看。谛是真谛，要明白真实道理，如实地看看真理在什么地方。“凿从人手”，这个凿子在人手上；“随方运转”， 随你的需要，你要怎么转就怎么转；“土因地移”，土是从你挖出来的地方移走的。“如是虚空，因何所出？”凿子在人手上，土移动了地方，这个虚空是从什么地方来的呢？“凿空虚实，不相为用”。凿子是实的，空是虚的，无自体、无长短方圆，这两样不和不合，不相为用。“不应虚空，无从自出”，虚空不应该自己生出来呀。它即不是合和生，也不是自生。既然“不自生、不他生、不共生、不无因生”，这空是从什么地方来的呢？如果没有来处，岂不就是清净本然嘛！岂不就是如来藏妙真如性嘛！通过多方面反复的推拶，都找不到一个来处，因而证明这个空大就是我们的如来藏妙真如性。<br/><br/> 　　“若此虚空，性圆周遍，本不动摇。当知现前，地水火风，均名五大，性真圆融，皆如来藏，本无生灭。”<br/><br/> 　　这里点出来了，这虚空在天地之间是圆满周遍、无欠无余的。虚空怎么会欠缺？什么地方没有虚空啊？本不动摇者，虚空中没有东西，没东西怎么会动摇呢？假如有东西，就不成其为虚空了。比如一个瓶子，装满了水它就不会动摇，如果是半瓶水，它就会在里面晃荡。因此只有当圆满周遍、无欠无余，才不会动摇。“当知现前，地水火风”，就是前面讲过的地、水、火、风四大，加上现在这个空大， “均名五大，性真圆融”，这五大都是如来藏妙真如性，真实不虚，无欠无余，周遍法界，互不妨碍。圆融就是能融和一处，地、水、火、风、空互不妨碍，合在一道。因和合之故，能成万物，若不和合，就不能成万物。“皆如来藏，本无生灭。”这个本来就没有生灭的，就是我们的如来藏妙真如性。如来藏本来是没有生灭的。由于我们无明妄动之故，把如来藏变成阿赖耶识。阿赖耶识里有生有灭，使我们枉受冤苦。<br/><br/> 　　“阿难，汝心昏迷，不悟四大元如来藏，当观虚空为出为入，为非出入？”<br/><br/> 　　这里用虚空与地水火风之色做比较，因为地水火风有动摇、有来去、有形相、有生灭，说它空不太容易理解。用虚空做比较是因为它与我们的空性比较相近，比四大妄色容易懂。<br/><br/> 　　佛说：阿难，你是因执着色相之故，为色相所转，所以心里昏迷，认为物质实有，拼命追逐物质（虚幻的妄相）。于是不识真心，只识得外界的妄相，跟着虚假的幻象跑，造业受报，因而六道轮回。此为昏迷，因为昏之故，就见不到真心；因为迷之故，真的假的就分辨不出来。不知道什么是真心，只看到假相，所以“不悟四大元如来藏”。地水火风这四大不是别的东西，就是我们的如来藏妙真如性，就是我们的本来面目，就是我们的真如佛性。前面我们讲过，这叫“性色真空，性空真色”；接下来就是“性火真空，性空真火”……。这些东西本来都是真空无相，无形无相的东西才是真实的，有形有相的东西都是虚假的。这个虚假和真实是对众生来说的，在佛菩萨的份上来讲，是非真非假，真也不可得，假也不可得，假就是真，真就是假。因为一切色相都是真心的妙用，佛菩萨不会执著在这上面，不看见有这些东西。就象我们看到天空的云彩，云可以变现出象狮子、老虎一样的形状，我们知道这不是真的狮子、老虎，而是空中的云。所以真就是假，假也就是真。因为根本没有这些东西，因此不会粘着在上面。但在众生份上来说，就必须要分清楚真假，否则就会认假迷真。众生因为迷而不觉之故，不知道四大本来周遍法界，圆融无碍，尽管生一切法，起一切用，都是自己本体，而不是另有别物。如果不懂得这个道理，就会着相，而忘记了本体。本来这个地水火风就是自己，因为不认识，反而去认假相，就好象天上的云所现的狮子相、老虎相，只看见狮子和老虎，而忘记它的本体是云。见性并不是要废掉相，这个相还是有的，不是离开相另有一个性，我们错就错在这一点，误以为修法就是要把一切相都去掉。不是这样的，离开这个相，真如也就没有啦，这就好比水上起的波浪，若把波浪都取消不要了，那么水也就没有了。因此要透过相，而不要执着相，知道一切相是真心的显现，是真心的妙用，这样才能随缘起用。因为真心贵在能够随缘起用，就象天空中的云，本来没有固定的形状，但可以任意变现各种各样的形状。识得真心之后，就可以妙用无边，若不识得真心，执著这个色相，那就是滞碍，就死在这个相上，自己造业受报，随业轮转，而不能自主。<br/><br/> 　　因你昏迷之故，不悟四大本是如来藏妙真如性，那么你看看这个虚空（佛在这里用虚空来做比喻）。这个虚空是顽空，没有东西，因而冥顽不灵；而性空是寂净的，是灵明真空，灵明真空是有知的，就象镜子一样，可以照出物体的影子。两者就差在这一点上。虚空是有相的，有个空相，而灵明真空是无相的。我们不要执着这个虚空，因为它是顽空，而要知道什么是灵明真空。现在是用虚空做个比方，比喻如来藏妙真如性，为什么用虚空呢？由于虚空没有东西，比用地水火风四大做比方，容易理解。你看虚空有出有入、有生有灭吗？它既无出无入，也无生无灭。那么这是非出非入，还是非不出入呢？用这两面做比较，有出有入还是不出不入呢？说有出入不对，讲不出入也不对，因为说不出入还有个不出入在。我们的灵明真心是清净本然，本来如此，既没有出入，也没有不出入。有出入是和合相，也就是因缘；不出入是非和合相，也就是自然。既没有出入，也没有不出入，也就是非因缘、非自然。既然非因缘、非自然之故，所以这是如来藏妙真如性。之所以用虚空来比，因为虚空不动摇，没有生灭，我们的如来藏妙真如性是如此，地水火风亦复如是，也没出入。我们见到地水火风所现的各种相，都是随缘起现的，就象云因为风吹而变现出各种形象。我们的真如佛性是个摩尼宝，能生万法，能随缘起现各种事物，千变万化都是这一心。这就叫不变随缘、随缘不变，尽管起现山河大地、草木丛林、男女老少等各种相，但是这个心是不变的，亘古至今恒常如此。假如不能随缘起现，死在那里不动，那就不成为如来藏妙真如性了。<br/><br/> 　　西方极乐世界也是这样子，极乐圣境是阿弥陀佛真如佛性所生起的妙用，是阿弥陀佛的净愿所成。凡是能够生到西方的众生，都是清净众生。内心龌龊的众生就生不到，因为你与阿弥陀佛的净愿不相应。十方国土不离一念心，我们住在娑婆世界的人，假如内心都清净了，秽土就可以转成净土。秽土是由我们的秽心所现的。心就是土、土就是心，人心不空，相就不空。若心存龌龊，现的境也龌龊。假如你的心清净了，土也就清净了。你那里就是净土，并不是要死后生净土。所以说“随其心净，即佛土净”。在这里是用虚空来比喻这个道理。<br/><br/> 　　“汝全不知，如来藏中，性觉真空，性空真觉，清净本然，周遍法界，随众生心，应所知量。”<br/><br/> 　　和前面所讲的虚空、四大一样，你也不理解灵明觉性是真空性。这个灵明觉性，不是有什么形相，有什么事物，它是真空性。刚才讲了顽空与真空是有所区别的，顽空是冥顽不灵，真空有个灵明觉性在，它的性体是空灵的，容不得有个形有个相。因为真空没有形相，它是灵明无住的，所以才能生起万法，因此说性觉真空。假如它不是真的“倾家荡产”，而是有了形相，那就被固定住了，固定之后就不能生出别的相。真正的大觉之觉，就是我们的本性，这个本然真空，不是由妄知妄见而生出的顽空。由于性觉本性灵明，所以说“性觉真空，性空真觉”。真性是空，并不是有事物，并不是有形象，这样的空性，才是我们真正的觉体。<br/><br/> 　　“清净本然，周遍法界”。因为性觉是本体空净的，所以尽管生起相，尽管起妙用，它既不会改变，也不会污染，是当体清净的。本然就是本来如此，法尔如是，不是因缘生，不是自然生，叫非自然、非因缘。这就表示性觉不同于幻妄的知觉，我们的妄觉总是要与色相对而生，由根对尘，根尘相缘之后，才有的这个知觉。而现在这个觉不是因相对才有的，它是灵明的真空，没有任何东西，是本来就有的。因为灵明真空之故，能现一切相、起一切妙用，所以说周遍法界。空大是真空，与我们上面讲的地水火风四大，不相妨碍，互摄互用，周遍法界，是一样的道理。<br/><br/> 　　“随众生心，应所知量”，随着众生心量的广大或者狭小，你的真觉所起的觉知作用也就能大能小。人有什么样的心量，真觉就能起什么样的作用。由于众生的内心是龌龊和烦恼的，所以现出的世界也都充满了龌龊烦恼。假如众生的心都清净了，世界马上就转了。在《六祖坛经》上，六祖大师说：我为诸人把西方极乐世界移到我们面前好吗？众人忙说：好啊！好啊！都在等着看慧能大师在大家面前变戏法、显神通，把西方极乐世界移到众人面前来，其实不相干。因为是“随众生心，应所知量”，他在教你转心，提醒你的心不要污染、不要着相、不要龌龊，只要心清净了，极乐世界马上就在你的面前了。我们上面说过，佛菩萨看这个世界，与我们所见的不一样，是不思议境界。所谓不可思议者，佛看起来是觉观、是真空，没有东西。菩萨看这个世界是七宝所成。阿罗汉看这个世界是空。而众生看这个世界是泥土。众生的业力同样不可思议，因为各自的业力不同，所起现的境缘、障碍也就不同。有共业、别业、同分共业、同分别业等等。我们地上人所看见的水，天人看见是琉璃，鱼龙看见是屋子，饿鬼看见是大火。由于心量不同，所见的境界也不同。<br/><br/> 　　我们所看到的虚空是顽空，是因为着在空相上去了。佛看则没有什么顽空不顽空，他看这个空就是我们的灵明真空，我们的妙明觉性本来就是如此。所见不同，是因为各个心量不同。我们修行就是要修自己的心，不是修那些外在的、表面的东西。不管是念佛、参禅、修密，都是为了转这个心。念佛就是用一句阿弥陀佛的万德洪名，把凡夫心转为佛心。能够转为佛心，当下就是净土。参禅也是这样，用疑情割断妄情，妄念就生不起来，待时节因缘到来，“囫”地一声桶底脱落，就见到清净本然的本来面目。修密更是如此，由于仗佛菩萨三密加被之力，比禅宗和净土宗更加容易成就些。<br/><br/> 　　佛在《楞严经》上慈悲地直接指示我们：你们每个人都有灵明真心，不要去执著外相，外面的一切相都是妄相，你执著相就不能见性。但是要见性也不能离开这些妄相。离开妄，真也就没有了。我们要离开的是妄心。离开了分别心，你的心自然就清净，这个相就转了。所以真见性人看见一切都是佛，不但桌子是佛、杯子是佛，山河大地、草木丛林，一切的一切都是佛。假设我们明白这个道理之后，一下子彻底放下，“囫”地脱落，那么你还修个什么行？因为你已经证到了妙明真心。假如不能顿然放下，那就应该回过头来找个当机的法门好好去修，这件事光靠嘴说是不行的，一定要在境界上透得过才行。如果嘴上说一套，碰到境界仍然透不过，在那里烦恼依旧，那你学佛就不得受用。我们学佛是要得真正解脱，得真实受用，不要只是糊里糊涂地求神拜佛，烧烧香，求佛赐给我点什么好处，达到个什么目的，而是要真正了脱生死。假设能够明白各有各的因缘，一脱到底，一切放下，那么行住坐卧总是见性，不见有相可得，不会再在相上打转转。如果粘滞在相上，跟着相走，那就被相转了，做了相的奴隶。我们要做相的主人，要能转相，只有这样才能离相见性，超脱生死。<br/><br/> 　　“阿难，如一井空，空生一井。十方虚空，亦复如是。圆满十方，宁有方所。”<br/><br/> 　　“阿难，如一井空，空生一井。”挖出一口井，把泥凿出来，就会看到这个井里面是空的。“十方虚空，亦复如是。”十方的虚空也是这个道理。因为十方的土都不可得，它本来就是虚空，并不是要把这个土都挖出来才是真空。佛这样讲是让我们的心脱离尘境。根是心、境是尘，心根与境尘脱开，不再粘着，十方虚空就会当下消殒，一切都不可得。此番功夫就是根尘脱落，在禅宗说是虚空粉碎，大地平沉。念佛之人亦复如是，当念到能念之心所念之佛一时脱落，也是这般光景。印光大师有一篇文章，叫《念佛三昧摸象记》，他所描述的情景就是这个样子。密宗证到的境界也是如此，与禅净没有两样。所以说归元无二路，方便有多门。下手的门径虽然多种多样，所到达的目的地都是一样的。<br/><br/> 　　“圆满十方，宁有方所？”我们的心空净了，那么尽虚空、遍法界都在我心中，这就叫心包太虚。到这时哪里还有什么方所？所谓十方就是东西南北上下和四隅，这十方的空本来没有，都是由我们的识心分别出来的，所以说根本就没有这个方所。<br/><br/> 　　“循业发现，世间无知，惑为因缘及自然性。皆是识心分别计度。但有言说，都无实义。”<br/><br/> 　　你们对眼前所见的一切相，分好分坏，分东分西，这都是业障现前使然。业障有三细相：业相、转相、现相，“无明为因生三细”，业生之后就要认取这个相。业有共业和别业的划分，由别业生成每一个个别的众生，同分别业形成某一类众生，同分共业合起来就感应出我们现在所生活的世界。所以说六道都是从业来的：地狱是业，饿鬼是业，畜牲也是业……。因为各各业障不同，看见的境界也就不同，地水火风空在不同的众生看来都是不一样的。这世界上没有知识的人就会迷惑不解，认为这个是因缘合成的，那个是自然生成的，就象鸟鸦黑、鸽子白、松树直、荆棘曲，都是自然而成、不加造作的。这就是色、受、想、行、识五蕴中的那个识心，这个识心就是无明，认为自己真的能生起念头，认为自己有知觉、能够思想，这些都是妄觉，都是识心分别计度的结果。假如不去分别计度，根本就没有山河大地、男女老少、日月星辰，一切都没有。所以说五蕴是个很坏的东西，我们要成佛，就必须破除五蕴。把这个识心打破就好了，就见到我们的灵明觉性了。真如就是真空佛性。真如不守自性，就是渗漏。由渗漏之故，以觉明空，于是生起这个世界和我们的身体。所以说“但有言说，都无实义”。由于大家都是在妄生分别，搞什么唯心唯物、一元二元，无论怎样讲也认识不到这个实相，说不到这个真心，说不到真如佛性，所以都无实义。<br/><br/> 　　以上讲的是空大，接下来讲见大：<br/><br/> <strong>　　（六）见大 性见觉明，觉精明见</strong><br/><br/> 　　“阿难，见觉无知，因色空有。如汝今者，在祗陀林，朝明夕昏。设居中宵，白月则光，黑月便暗。则明暗等，因见分析。”<br/><br/> 　　这个见就是我们的根，因为根能生见。有很多的经教家说，见大就是根大。这个见不光说眼睛看见的见，而应色括六根，由根尘相对才起这个见觉。假如没有尘，根就无知；假如没有根，尘就无相。尘是有相的，比如桌子有高有低，凳子有方有圆，镜子摆在什么地方，录音机是什么样子等等。尘之所以成为色相，是因为我们有根能知之觉之。例如白云显出的狮子相、老虎相，这些形状、相貌的变化，就是由根来觉之，根尘相对而有的。所以古书上都是先告诉你，根与尘这两样东西只有并在一起才能生出来，单独一个根或单独一个尘都不可得，所以说“心本无生因境有，境本无生因心有”。境跟心本是一个东西，这就是“见觉无知，因色空有”。见觉本身实际是无知的，因色相之故才得以显发，发出个见觉。尘境既有色也有空，色就是因为明而发现的种种形相，色与空都是相。<br/><br/> 　　“如汝今者，在祗陀林，朝明夕昏。设居中宵，白月则光，黑月便暗。则明暗等，因见分析”。那个知觉是虚妄之相，它是因为根尘相对而有的，相对而有的东西都不可得。譬如现在来到祗陀林下，“朝明夕昏”，早晨太阳升起来天就亮了，就有光明；夜里太阳落山，天就黑了。“设居中宵，白月则光，黑月则暗”。假设在夜晚，白月就是有月亮的时候，因为有月光所以有光明；黑月就是没有月亮时，没有月光当然就是黑暗。“则明暗等，因见分析”，明暗两个色尘，是你因为见而起的分析和判断才有的，如果你没有见、没有分析，怎么会知道明与暗？又怎么会知道明暗之相是从什么地方来的呢？是因为你有这个见，是因为你的分析才有的，其实根本都不可得嘛！下面我们就来看一看，这个见到底是从什么地方产生的呢？<br/><br/> 　　这里要仔细推敲，请看经文：<br/><br/> 　　“此见为复与明暗相，并太虚空，为同一体，为非一体？或同非同，或异非异？”<br/><br/> 　　这个见是什么地方来的呢？因为你有见才能分析明暗，如果没有见当然就分不出明暗。这个见是从明、暗或者太虚空来的吗？或者说见与明、暗、太虚空是一体吗？你这个见和这三样东西究竟是一样、还是不一样呢？或者是同而不同？或者是异而不异？为什么这样说呢？因为一体、不一体、同而不同、异而不异，这四种说法也叫四个原则，所有的事物都不能离开这四个原则。如果离开这四个原则，任何事物都不能成立，也就说明这个东西根本不存在。是一体还是不一体；是同而不同（同非同），也就是同中有不同；还是异而不异（异非异），异中亦有不异。佛所以举出这四个原则，就是要用来推敲论证，看看这个见对明、暗、虚空，究竟哪种结合能成功。<br/><br/> 　　“阿难，此见若复与明与暗及与虚空元一体者，则明与暗，二体相亡。”<br/><br/> 　　先说一体。假如这个见与明、暗、虚空是一体，既然是一样东西，“则明与暗，二体相亡”。为什么呢？因为明与暗不是一体，说明时则非暗，说暗时则非明。比如现在有亮光的时候，怎么居于暗呢？太阳下山光明没有了，这时候是暗，又怎么能居于明呢？明与暗不是一体，二者是相对的。如果见与明、暗、虚空是一体，那么明即不明、暗也不暗，明暗二相就都不可得了。再说明与暗是完全相反的，两个体相不能同时成立，所以说见与明、暗、虚空是一体，这种说法不对。<br/><br/> 　　“暗时无明，明时非暗，若与暗一，明则见亡。”<br/><br/> 　　这是说明暗是相对、相反的。明亮的时候就不是黑暗，黑暗的时候就不明亮。刚才是把明、暗、虚空与见，四样东西合并在一起来说的，现在是分开来说。“若与暗一”， 假如这个见与暗合在一起，那么明亮来时暗就没有了。既然暗没有了，那么见也应该没有了，所以说“明则见亡”。<br/><br/> 　　“必一於明，暗时当灭。”<br/><br/> 　　假如一定与明合为一体，那么暗来时明应该没有了。既然没有明当然也就没有见，所以说“暗时当灭”。<br/><br/> 　　“灭者云何见明与暗？”<br/><br/> 　　暗来时去明，明来时灭暗，这个见根本就生不出来，当然也就见不到明暗。如果这个见灭掉了，那么究竟是什么东西能见明、暗，而又没有灭呢？<br/><br/> 　　“若明暗殊，见无生灭。一云何成？”<br/><br/> 　　见与明暗性体相殊，因为明暗有生灭，而见无生灭，“一云何成”？怎么可能合成一体呢？若是一体，见就有生灭了，所以说不与明、暗、虚空合成一体。这是破一体。<br/><br/> 　　下面讲的不是一体，而是二体，看看离开明暗是否有见。其实离开明、暗、虚空，并没有见，所以又叫破非一体。<br/><br/> 　　“若此见精，与暗与明，非一体者，汝离明暗及与虚空，分析见元，作何形相？”<br/><br/> 　　假如这个见与明、暗、虚空不是一体的，离开明、暗、虚空以外有个见，那么你分析一下这个见的本体，是个什么样子？见元就是见的根本、见的性体，问他见的根本是什么形相、是什么东西呀？<br/><br/> 　　“离明离暗及离虚空，是见元同龟毛兔角。”<br/><br/> 　　离开明暗及虚空，这个见象龟毛兔角一样，根本就不存在。刚才讲过，离开色相就没有见，离开见也没有色相，要根与尘合起来才能生出这个见。所以这个见是妄见，而不是真见，就象龟没生毛、兔未生角一样，是根本就没有的。<br/><br/> 　　“明暗虚空，三事俱异，从何立见？”<br/><br/> 　　明暗虚空这三样东西各不相同，那么见是从什么地方生起来的呢？既然离开明暗虚空，见根本就不可得，这就是说一体、非一体都不可能。这样一来，四个原则的前两个就被破掉了。<br/><br/> 　　“明暗相背，云何或同？离三元无，云何或异？”<br/><br/> 　　明暗之相是相互背离、互相对立的，不能合为一体。因为明来了则没有暗，暗来了则没有明，它怎么会相同呢？“离三元无，云何或异”？离开虚空，离开明暗，见就没有了，又哪里会有这个异呢？所以说同也不可得，异也不可得。离开这个明暗虚空，连这个相都没有，又哪里有见？所以不是同，也不是不同，同与不同都不可得。这些道理我们在前面十番显见时都讲过，叫做不即不离，既不是这个色相，也不离开这个色相。离开色相哪还会有见？所以同与非同都不可得。<br/><br/> 　　下面我们破异非异：<br/><br/> 　　“分空分见，本无边畔，云何非同？见暗见明，性非迁改，云沙非异？”<br/><br/> 　　我们在这个见与空的界限上分分看，哪里的边界是属于见，哪里的边界是属于空，你能分得开吗？见与空有边界可分吗？因为见与空分不开，是合二为一的，所以不能说是不同。 “见明见暗，性非迁改，云何非异”？看见明暗的时候，暗和明不是一体的，二者是相违背的，明没有变成暗，暗没有变成明。既然是相违背的，“云何非异”，它又怎么会非异（非异就是相同），本来就是不一样的嘛。<br/><br/> 　　经过以上分析，证明不但“一体、不一体” 不可得，“同非同、异非异”也不可得。由于四个原则都形不成这个见，就证明这个见是虚妄不实的，是本来没有的。因为这个见是根尘相对时才有，是因缘所生，“因缘所生法，我说即是空”。外道说因缘时执为实有，佛说因缘时根本就无实体，是生而无生的。<br/><br/> 　　“汝更细审，微细审详，审谛审观。明从太阳，暗随黑月，通属虚空，壅归大地。如是见精，因何所出？见觉、空顽，非和非合。不应见精，无从自出。”<br/><br/> 　　前面说的是“不他生、不共生”。见精既不是从空、暗、明中生出来的（不他生），也不是和合明暗虚空一起生出来的（不共生）。这里接着讲“不自生”： 你仔细看看，即微细审详；还要极微细极微细地推敲、审察，即审谛审观。审察又审察，思考又思考，为的是要弄明白：明是什么地方来的？明是从太阳来的；暗是从什么地方来的？暗随黑月，没有月亮的时候是暗；通属虚空，没有东西阻碍是虚空；壅归大地，壅就是阻碍，大地的特性是阻碍。这明、暗、通、塞几种相各有出处，“如是见精，因何所出”？这个见精是从什么地方来的？是从明暗通塞中来的吗？不是的。<br/><br/> 　　见觉和空顽是什么意思？见是我们的觉明心，这个见性是能够知觉、能够明了一切事物的。所以见是我们的心，它是灵明不昧的知觉。见觉就是我们能见的觉体。空顽就是顽空，空而不灵，冥顽无知。一个是有情的知觉，一个是无情的冥顽不灵，有情和无情这二者当然不可能和合在一起，所以说是非和非合。既然见精不是和合生，那么是不是自己生的呢？“不应见精，无从自出”。在这部《楞严经》上，世尊反复讲述过，任何东西自己不可能生自己，而要与别的东西和合以后才能生出来，所以不可能“无从自出”。<br/><br/> 　　接下来的意思就是，既然见精“不自生、不他生、不共生”，当然也是 “不无因生”，因为我们还是有这个能见、能知的作用。刚才讲过，这个见不仅仅指眼睛能看，而是把六根的觉知性全包括在里面，我们能见、能闻、能嗅、能尝、能觉、能思的作用一应俱全，毫不紊乱，不是没有原因的呀，这叫“不无因生”。<br/><br/> 　　“不自生，不他生，不共生，不无因生”，这不是真如佛性是什么？把虚妄破尽，真实就显现出来了，从而证明这根大就是我们的真如佛性。<br/><br/> 　　“若见闻知，性圆周遍，本不动摇。当知无边不动虚空，并其动摇地水火风，均名六大。性真圆融，皆如来藏，本无生灭。” <br/><br/> 　　见闻觉知合起来，就是六根的根大。见性与色空、明暗是非同非异，你说同它也不同，你说异它也不异，因为离开色相就没有见。比如我们耳朵离开声尘就没有闻性，舌头离开酸甜苦辣的味道就没有味觉。因为离开了就没有，所以说不异。可如果要说同吧，也并不是与它一体。上面讲过明暗一体是不可能的，若与明一体则暗来时应不见，若与暗一体则明来时应不见。我们听声音，既能听东又能听西；我们看东西，既能见明又能见暗；我们尝味，既能觉苦又能觉甜，这即是非同非异。因非同非异、圆融无碍之故，所以叫性圆周遍。见闻觉知是性，互不妨碍叫圆，周遍是无处不在、无时不有，在在处处都是我的心，不管什么情况都不间断。真性哪里有来去相、生灭相呢？这就叫“性圆周遍，本不动摇”。<br/><br/> 　　“当知无边不动虚空，并其动摇地水火风”。虚空是看不见边界的，这表示我们的空性是不动的。地水火风则是有生灭的四种相，这样东西生起，那样东西灭掉，因为有生有灭，所以它是动摇的。性圆周遍、本不动摇的见闻觉知，无边不动的虚空，动摇的地水火风，“均名六大”。六大就是地、水、火、风，加上空大和根大，它们本体上没有生灭、相对、来去之相，所以是妙明真心。六大是性真圆融的，它们彼此互现，互不妨碍，因此都是真如佛性，“皆如来藏，本无生灭”。为什么能够互相圆融？因为这是如来藏妙真如性的本具功能，如来藏本来就有这个能量。如来藏本来就是没有生灭的，所以六大同样没有生灭。 <br/><br/> 　　“阿难，汝性沉沦。不悟汝之见闻觉知，本如来藏。汝当观此见闻觉知，为生为灭、为同为异、为非生灭、为非同异？”<br/><br/> 　　因为事相把我们众生迷惑住了，大家都跟着相跑，要这样要那样，心中的欲望永远填不满。你看那些经济发达的国家，尽管物质非常丰富，但是人们的精神很空虚，虽然吃得好、穿得好，可精神上没有寄托。人总是首先满足物质上的需要，随后还得满足精神上的需要，因为人们的精神是要有寄托的，如果精神没有寄托就太空虚了。所以佛法讲：人们都是迷惑在事相上，都在追逐物欲，物欲愈高涨，就会愈发地执着，所以犯罪率就越来越高。物欲愈多，精神愈空虚；物欲越增长，犯罪也就越多。人类乃至六道众生，都是为事相所迷，在声色当中分别取舍，而淹没了自己的本心。所以他们才会将宗教做为自己精神上的寄托，很多人在接触了佛法以后说：佛教讲得很对，非常适合我们的需要。<br/><br/> 　　所以佛对阿难讲：“汝性沉伦，不悟汝之见闻觉知，本如来藏”。不光是阿难，我们每一个人都是沉沦在生死当中，不知道我们的本来面目，所以不能觉悟。你没有领悟到你的见闻觉知就是如来藏，见闻觉知这六根，都是如来藏妙真如性，不是别的东西。如来藏因为有了无明，就变成阿赖耶识，就变成第八识。阿赖耶识有见、相二分，也就是从自证分生起的见分和相分，所以阿赖耶识能够生起见闻觉知。眼耳鼻舌身意这六根，都是由阿赖耶识来的。阿赖耶识就是我们见闻觉知心的所依之处，这个所依的地方就是识大，识是意识的识，识别的识。尘根既然能照境，能产生识别，那么这个根就是心，所以六根既是心、又是尘。因为有这个既是心又是尘之理，所以有人说《楞严经》义见不圆，其实讲到后面大家就明白，原来六根本来就是如来藏心。<br/><br/> 　　“汝当观此见闻觉知，为生为灭、为同为异？为非生灭、为非同异？”你应当仔细看看，这个见闻觉知是生还是灭，是同还是异？或是非不生灭，或是非不同异？为什么要这样说呢？因为见闻觉知看起来好象不同：眼能见、耳能闻、鼻能嗅、舌能尝、身能触、意能知，它们所缘之尘境不同，看起来应该是异。但是它们又同是一识，同是一个分别心，因为随便你怎么看、怎么听，怎么嗅香、尝味、觉知、思量，最后都要归到分别认识，所以六根所生起的识是一个识心，这个识心元是一体。说它是同，同中有异，因为缘的境不同；说它是异，异中有同，因他们同是一体。因此你看这六根，是不是生灭的因缘心呢？是不是同异的和合心呢？<br/><br/> 　　“汝曾不知，如来藏中，性见觉明，觉精明见，清净本然，周遍法界，随众生心，应所知量。如一见根，周遍法界，听嗅尝触、觉触觉知，妙德莹然，遍周法界，圆满十虚。宁有方所！”<br/><br/> 　　你还不知道，如来藏的本来佛性中，有真正知见，叫“性见觉明”。觉明是正觉，有它心体的光明，能明了一切东西。这里所说的性见觉明，就是见生于觉。我们能见到一切东西，都是从觉体上生起来的。这个本体觉是妙明的，能见一切东西，而不为一切东西所掩，就象莲花一样，出污泥而不为污泥所染。这个见本来就是从觉所生，因此叫觉精明见。觉的精体就是真如佛性，它是有妙明之用的。上面讲的是见从觉生，下面讲的是识见归于觉，把这个见摄归于觉体。将识见归于觉，就是你能见、闻、觉、知的一切东西，都离不开我的觉体，所以叫觉精明见。“清净本然，周遍法界”，虽然生一切法，见一切物，尽管起见、闻、觉、知的妙用，但是它不污染，所以叫清静。“本然”者，本来就如此，不是因缘，不是自然，不是和合，也不是不和合，一切都不可得，所以才能周遍法界。因为我们的觉心是个真如妙体，它无处不有、无时不在，整个法界都在这一心当中，所以叫周遍。十法界离不开如来藏，如来藏中具足一切山河大地、蠢动含灵，上从佛界，下至三途统统包含在内，假如有一物不具，那就不叫周遍。<br/><br/> 　　“随众生心，应所知量”。前面讲过，由于众生的心量不同，发出来的见、闻、觉、知也不同，有人喜欢听这种声音，有人喜欢看那种颜色，没有一定的标准，都在随你的业流转。 “如一见根，周遍法界，”这里以见根来作比方，就象这个见根可以周遍法界一样。下面的“听嗅尝触、觉触觉知”，这里的听是耳根，嗅是鼻根；尝触指的是舌根，因为尝味道一定要有东西碰到舌头才行；觉触是身根，要有东西碰到身体才有觉；觉知就是我们的意根，这六根都是“妙德莹然”。所谓妙德者，就是说六根各有各的功用：耳朵听见动静声音，眼睛看到色空的形象，舌头尝出各种味道，鼻子闻到香臭之味，触觉可知一切冷、暖、滑、涩。至于意根更是灵敏得不得了，一切东西它都知道，因为它是六尘落谢的影子。这六根各具各的功用，一点都不紊乱，所以叫妙德。莹然是光明、清净的意思，清净而光明，就是莹然。<br/><br/> 　　“遍周法界，圆满十虚”。这根大遍诸一切法界，在十法界当中无处不有，没有一个法界没根大。十虚就是东南西北四维上下，是虚空的标志。这个虚空本来就在我们的真如佛性当中，如来藏是涵盖十方、遍及一切的，所以它能够圆满十虚。“宁有方所”？哪里有什么固定的地方呢？不是说这里有，那里就没有；也不是说那里有，这里就没有。所以周遍法界，圆满十虚，无所不在。<br/><br/> 　　“循业发现。世间无知，惑为因缘及自然性，皆是识心分别计度。但有言说，都无实义。”<br/><br/> 　　就象上面所说的，一切东西都是众生的业，连这个地、水、火、风、空、见也是业。因为众生的业不同，所现出来的境相、所受的遭遇也不同。假如我们的心彻底放下，完全空净了，那么不但地、水、火、风、空可以改变，连根大也会转变。比如在欲界里，我们需要眼、耳、鼻、舌、身、意六根，到色界就不同了，他不需要吃东西，鼻、舌两根就没有了，这就是循业发现。因为心空之故，淫欲心没有了，就升到色界，那么再往上去会更加清爽，六根就都没有了。没有六根并不是瞎子、聋子，并不是不见，他有妙根，不同于我们的六根。所以这个根，乃至于所现的一切色尘，都是随我们的业转，我们只有放下一切，真正修行才能成就。假设我们还挂着名利得失，一边修行心里还在那里思来想去，计算怎样才能多挣点钞票，我的家庭怎样才能发达，自己儿孙怎样才能前途光明，这是在做大梦。你不要光惦记着自己的家庭，而应该多关心关心众生，想想怎样才能使众生都幸福美满、生活向上、超出尘劳、了脱生死，就象后面阿难所发的心那样。这样我们的心量就转过来了，和以前就不同了。现在的人都是私心重重，佛教徒当中也不纯洁，很多的坏事都是自己人做出来的，所以叫人家看不起。我们要感到惭愧，要真正发心修行，从我入手，先革自己的命，革贪、嗔、痴、凡夫之命，进而再革小乘法见之命，进而再革菩萨之命，把无明统统打破，让它彻底消亡，最后还要革佛的命，真成佛了连个佛也不可得。假如你还有一个佛念、佛见可得，就不能成佛，所以要认真做功夫。<br/><br/> 　　“循业发现。世间无知，惑为因缘及自然性。”这世间上的人因为没知识，都迷惑不解，认为这是因缘，那是自然，都是识心在妄动分别，所以但有言说，都无实义。<br/><br/> 　　这里有必要把根大再讲一讲，我们说过，根大既可以说之为心，也可以说之为尘，若按法相宗的分法，那就分别属于心法、色法。因为根大既可以说是心、又可以说是色，大家就在那里分别计度，说根大不应该摄在如来藏里，只能归入阿赖耶识。为什么呢？因为若把根大归入心法，那就是八识的见分；归入色法呢，那就是八识的相分。既然见分是根、相分是尘，那么不管把根大做为见分也好、做为相分也好，都属于阿赖耶识。所以应该把根大摄归到第八识，而不应该摄归到如来藏。因为有这个分别，所以历来纷争很多。还有的人说六根都有浮尘根与胜义根。浮尘根属于相分，为色法所摄。但是，意根的胜义根是心法，归识大所摄。这个识是认识的识，也就是把意根的胜义根，摄归到“地、水、火、风、空、根、识”中的识大里去了。其余的十一根，就是眼、耳、鼻、舌，身这五根的浮尘根与胜义根，加上这个第六意根的浮尘根，统统摄归色法。因为属于色法，所以不归阿赖耶识，应当摄归如来藏。唉！纷争多着呢。还可以作这样一个解释：就算是色法，色法也是阿赖耶识的相分啊，不也应该摄归阿赖耶识、而不应该摄归如来藏么！<br/><br/> 　　其实这是没有把如来藏心和阿赖耶识的道理搞清楚。交光大师所著的《楞严正脉疏》讲到这里的时候，也把根大摄归第八识。实际上这个第八阿赖耶识就是如来藏妙真如性，如来藏就是阿赖耶识。我们以前讲过，如来藏没有生灭，阿赖耶识有生灭和合。这里一个生灭，一个不生灭，怎么会是一个东西呢？这是因为如来藏性沾染了无明之故，就象一个人本来是清醒的人，喝醉酒的时候就变得迷糊了。如来藏性是清醒的时候，阿赖耶识是喝醉酒以后。虽然有清醒有迷糊，但他还是这一个人，不是两个人。他现在之所以有阿赖耶识，是因为他有六根，他的眼、耳、鼻、舌、身、意六根对尘会生起识。假如没有六根，就不叫阿赖耶识，而成为如来藏性。我们今天讲的这些道理，为的就是破这六根，把这六根摄归本来，摄归如来藏。六根摄得没有了，那么阿赖耶识也就没有了。好比原来喝醉酒的人，他清醒以后还是以前的那个人。阿赖耶识醒悟了就是如来藏，道理是一样的。我们上次还作过一个比喻：一个人品行端正，就是正人君子；如果沾染了坏习惯，走上邪道，那就成了小人。假如他去恶向善、改过自新，小人就可以重新变成君子。不管是小人还是君子，他始终是一个人，不是两个人。阿赖耶识和如来藏也是这个道理，阿赖耶识就是如来藏，如来藏就是阿赖耶识，不是两个东西。所以你说它是相分也好、见分也好，都是属于六根。不管六根是见分、相分，最后都摄归如来藏。六根是因为生起妄想才有的，由于积识成根，无明封固了真心，潜入六根当中，执著六根以做为我的根身。今天把这六根打破，六根如果破了，那么阿赖耶识也就破了，六根不可得，阿赖耶识也不可得。当小人把为非作歹的坏习惯都改掉了，不就变成正人君子了吗！所以，即使是阿赖耶识本身，也应该摄归到如来藏。<br/><br/> 　　我们用喝醉酒和君子小人来做比喻，有的人可能会疑惑：清醒的人喝了酒会变糊涂，那么正人君子还会再变为小人么？佛菩萨还会再成为众生么？对此大家可以尽管放心。这个问题《圆觉经》上讲得很清楚，说我们见性除习“如销金矿，金非矿有，既已成金，不重为矿，经无穷时，金性不坏。”金矿里面既有金子，也有杂质，从形成矿以来，就一直是这样的，不是先有金子再掺入杂质，也不是先有杂质再掺入金子。矿石经过冶炼，金子纯净了，从此金子是金子、杂质是杂质，金子就不会再熔进杂质里去了。同样，当我们识得真如佛性后，真如就不再是无明，“既已成金，不重为矿，经无穷时，金性不坏”。既然我已经清醒了，知道喝酒能乱性，只要我以后不喝，就不会再糊涂。同样道理，既然已经知道做小人不好，那么改过自新，以后不再生龌龊的想法，不再做龌龊的事情，就不会再成为小人。当然，长期饮酒会成瘾，小人做久了也会养成坏习惯，改起来不是一朝一夕可以成功的，要经过多次的反反复复，才能慢慢改正过来。我们见性以后，无始以来的习气也不可能一下子改掉，所以还要认真做功夫，把习气打磨净尽才行。就象知道酒能乱性，今天不喝今天就清醒，明天禁不住诱惑，再喝又会犯迷糊。悟后保任除习是一个漫长的过程，粗的习气消除了，还有细的、微细的和极微细的，因而要有持久的恒心和坚强的毅力才能成功。<br/><br/> 　　讲完了如来藏和阿赖耶识，这里再简单说一下胜义根与净色根，很多人认为胜义根与净色根不同。<br/><br/> 　　他们说净色根是净色根，浮尘根是浮尘根，这样前五根就变成十个根，再加上一个意识的浮尘根，十一个根统统归色所摄。如果眼、耳、鼻、舌、身这五根是浮尘根，那么净色根在什么地方呢？实际上浮尘根与净色根是不能分开的。不能这样分啊。<br/><br/> 　　浮尘根就象是照物的镜子，而能够起照物之用的是胜义根，也就是表面上的根是浮尘，能见的根是胜义，合在一起才成五根之根。所以胜义根与浮尘根也是合在一起的，只有见与根合、见与色合，才能成根，假如分开来就不成根。我们这个见就是大无明，就是第七识。胜义根究竟在什么地方？历来没有统一的说法，许多人为此纷纷辩论。浮尘根在外面，是表面的作用，能够看得见，胜义根因为是见性（能见之性），眼睛看不见，有的人就讲是我们的神经。说胜义根是神经也不对，因为神经有末梢，我们以前讨论唯识学的时候，曾经为大家讲过，把神经当作胜义根并不成立。浮尘根和胜义根是分不开的，如果硬要分开，六根就变成了十二根，其中有十一个属色大，一个属识大。解释《楞严经》的人有多种门派，就是因为对这样一些问题看法不同，而分出来的。憨山大师讲，胜义根就是无明壳，因为结成无明了，因此封固在那里。既然经里面分明说是摄归如来藏，所以这样讲是不会错的。有的人在做解释的时候违背经文，说不摄归如来藏，而是摄归第八识。那为什么经上在讲根大的时候，不说七说八，而只是说到这六根呢？因为六根生六识，七识、八识也包括在里面了，这个道理待下面说到识大时再进一步讲清楚。<br/><br/> 　　接下来就讲识大：<br/><br/> <strong>　　（七）识大 性识明知，觉明真识</strong><br/><br/> 　　“阿难，识性无源，因于六种根尘妄出。汝今遍观此会圣众，用目循历，其目周视，但如镜中，无别分析。汝识于中，次第标指：此是文殊，此富楼那，此目犍连，此须菩提，此舍利弗。”<br/><br/> 　　这一段讲明了根与识的分别。前面讲的是根，根能照境，照境之后要起识，就是六根对六尘要生起六识。识没有自体，都是从缘生的，也就是以根尘为缘，生出这个识来，所以说“识性无源”。因为从缘生的东西都是幻化不实的，不是实有的，所以说它没有本源，“因于六种根尘妄出”。也就是眼、耳、鼻、舌、身、意这六根，攀缘色、声、香、味、触、法这六尘，由根尘相对而幻化出来眼识、耳识、鼻识、舌识、身识、意识这六识。“汝今遍观，此会圣众，用目循历。”你用眼睛来回周遍看看在会上的大众，你看的时候，“其目周视，但如镜中，无别分析”。就是你的眼根对色尘的时候，就象镜子对着影子一样，只有照了而无分别。无分别叫了取，也叫总相，就是直接映照色尘的总相。见就是象镜子照物，但取个总相，而不起别相。如果是镜子在了别照出的影子，这叫辨别，好比你在分别这是什么东西，那是什么东西，这样认取别相，就是起识了。别相就是分别这是手表，那是录音机，从差别上来区别一切色相。也就是说只取总相的是见，对总相加以分别，从中执取别相的是识，见与识有这种区别。你取个总相，只是在那里照，“但如镜中，无别分析”， 就象镜子照影子一样，没有加以分析，这个见就是根大。那么识大是怎么分别的呢？“汝识于中，次弟标指”，你的眼识在那里分别，把看见的东西依次标明出来：这个是文殊菩萨，那个是富楼那，还有目犍连、须菩提、舍利弗。就象我们现在分别这屋里的东西一样：这里有毛巾、镜子、床、桌子等等，还有我们这些人，这是张三，那是李四，每个人都不相同。你这样分别就叫别相，这个别相就是识。所以说取总相的是见，取别相的是识。见大就是根大，与识大是不一样的。<br/><br/> 　　“此识了知，为生于见？为生于相？为生虚空？为无所因，突然而出？”<br/><br/> 　　这一句在追问阿难识从何来：你这个能够辨别、了知的识，是从什么地方来的？是从见生出来的吗？因为你要看见以后才能分别。还是生于相呢？从我们看见的相上生出来。或者从虚空中生出来？更或者是本无所因，没有原因，突然生出来的？<br/><br/> 　　“阿难，若汝识性生于见中，如无明暗及与色空，四种必无，元无汝见。见性尚无，从何发识？”<br/><br/> 　　假如识性是从见生出来的，如果没有明暗、色空这四种尘相，也根本就没有你的见。刚才我们说过，一定要相对根，也就是尘对根之后，才能有见。假如不是根尘相对，就不能生起见。离开明、暗、色、空，你连见都没有，这个识又是从什么地方来的？也就是没有体怎么能生出用呢？根本不可能嘛。所以说“见性尚无，从何发识”？没有见性就发不出这个识。<br/><br/> 　　“若汝识性，生于相中，不从见生。既不见明，亦不见暗。”<br/><br/> 　　假如你的识性不是从见生出来，而是从相生出来。那么既不见明，也不见暗。<br/><br/> 　　“明暗不瞩，即无色空。”<br/><br/> 　　“明暗不瞩”就是既没看见明，也没有看见暗，明暗都无所见。因为是从相生，不从见生，你当然看不到了，所以不晓得有明有暗。既然你没见嘛，“即无色空”。没有见色空自然也就不可得。刚才我们讲过，没有见是不能成相的，因为这个相不能自己成相。如果只有相没有见，你看不见明暗，那么色空也就无法安立。<br/><br/> 　　“彼相尚无，识从何发？”<br/><br/> 　　连这个相都没有，那么这个了别的识又是从哪里来的呢？<br/><br/> 　　“若生于空，非相非见。非见无辨，自不能知明暗色空；非相灭缘，见闻觉知无处安立。”<br/><br/> 　　假如说这个识不从见生，不从相生，而是生于空，从虚空生出来，那么“非相非见”，既没有相又没有见。“非见无辨”，没有看见你又怎么能够分析辨别呢？你必须先看见，然后才能辨别事物，这个长、那个短，这是红、那是白。如果你没看见，当然无法做这些辨别，所以叫做“非见无辨，自不能知，明暗色空”。<br/><br/> 　　“非相灭缘，见闻觉知无处安立。”这里所说的“灭缘”，即无所缘之境，把所缘的境灭掉之后，这就是非相。把所缘的境都灭了，那么见闻觉知从什么地方安立？见、闻、觉、知一定要有所缘的境，才能生出来，如果所缘的境没有了，它们自然无处生起。这句话的意思再强调一遍，就是没有相、没有见的时候，就不能辨别，不能辨别就不能知道明、暗、色、空，哪里还会有识呢？所以：<br/><br/> 　　“处此二非，空非同无，有非同物。”<br/><br/> 　　这句话在不同的版本上有点不同，“空非同无”有的本子上是“空则同无”，宋朝以后的本子是空非同无。“空非同无”要更讲得通，比“空则同无”容易理解。讲到空大家就会认为是什么都没有了，其实不对，“处此二非，空非同无，有非同物”。 这句话是相对于两个方面来讲的，你的这个识性既不是见，又不是相，就是非相、非见，你说这识性是两面都没有的空性，这个二非的空性，就是空非同无。这个空非同于有无之空，也就是不同于有东西或者没东西的那个空。不是“空则同无”，空了以后就什么都没有了。因为性空的空，不等于事物有无的空，不是说东西摆在这里的时候不空，把它拿掉以后是空。“空非同无”，因为性空不同于有无，与相的生灭去来没关系，所以见与相也都是空的，都没有了。空性虽然不等于事物之有无，但它并不是空无，而是妙“有”， 就是“有非同物”。所以空之有，不等于物之有；空之空，不等于无之空。<br/><br/> 　　空性的空，实际上是识性之空，离此二非，就是离开非相，离开非见。如果没有相、没有见，还有识性，那么这个识性是空还是有呢？“空非同无”之空，就是不同于事物有无之空； “有非同物”之有，就是不同于事物有无之有。你的识性不是某个东西，有东西当然看得见，而识性你是看不见的。说有不同于物之有，说空不同于无之空，所以“有非同物”与“空非同无”是相对的，不应该是“空则同无”。如果是“空则同无”，这个空就变成有无之无，那么同下面的“有非同物”就相矛盾了。<br/><br/> 　　“纵发汝识，欲何分别？”<br/><br/> 　　纵然你说识性是有，就算它是有，这样的识有什么用处呢？既没有见，又没有相，你的这个识能分别什么东西呢？识是用来了别、分别事物的，有见有相才能分别东西，如果没有见和相，没有东西可以分别，你的识就派不上用场。所以有也不对，没有也不对，有与无都不可能。<br/><br/> 　　“若无所因，突然而出，何不日中，别识明月！”<br/><br/> 　　这是整个一段的最后一句。每样事物的生起都有来由，识也不会没有来由地突然生出来。我们所看见的每样东西，都是因为有这样东西，有个原因和理由才能看见。比如因为有录音机，才能看见录音机；因为有太阳，才能见到太阳。假如某个东西可以突然而来，不要有什么来由就可以看见的话，那你怎么不在太阳底下看见月亮啊！--“何不日中，别识明月！”因为太阳底下没有月亮，就只看得见太阳。如果能够无所因而起，“突然而出”，太阳底下也应该可以出现月亮嘛。可事实上你现在所看见的月亮，并不是“若无所因，突然而出”，是因为本来就有月亮的缘故。既然有月亮，是为有所因，所以是不无因生。说来说去这个识性是不自生、不他生、不共生、不无因生，也就是非自然、非因缘。既然非自然、非因缘，它就是我们的如来藏心。下面接着说：<br/><br/> 　　“汝更细详，微细详审：见托汝睛，相推前境，可状成有，不相成无。如是识缘，因何所出？识动见澄，非和非合。闻听觉知，亦复如是。不应识缘，无从自出。”<br/><br/> 　　你再更加详细地看看，微细地考察考察。“见托汝睛，相推前境，可状成有”。你这个能看见的见，托在你的眼睛，就也是眼根上。面前所对的色尘，都是有形有相，可以看得见、摸得着的。“不相成无”，假如没有相，看不见、摸不着，面前就只能成无，只有空。“如是识缘，从何而出”？你仔细推敲、推敲看，你这个识缘是从哪个地方来的呢？因为上面讲了，它不从根生，不从相生，也不从空生，空、见、相都不可得，那么这个识缘是从什么地方来的呢？“识动见澄”，这个识就是我们的知识、了别识，“识动”是说它可以动来动去，一会儿缘这，一会儿缘那，在六根那里随意变动。“见澄”的意思就是见是澄寂不动的，比如眼根照境时就象镜子照物一样，它并没有动，在那里分别好坏，动来动去的是了别识，而见（也就是根）则是不动摇的。“非和非合”，识和见一个在动，一个不动，哪能会和合成功呢？因为同体才能和合，不同体的不能和合。“闻听觉知，亦复如是”，不但见是如此，闻、听、觉、知等其他的几根，也同这个见一样，都是识动根澄。“不应识缘，无从自出。”因为这些都没有，所以不能说这个识是自己跑出来的，就是不自生。<br/><br/> 　　“若此识心本无所从，当应了别，见闻觉知，圆满湛然，性非从所。兼彼虚空，地水火风，均名七大。性真圆融，皆如来藏，本无生灭。”<br/><br/> 　　这个识心无所从来，无所从生，本来就不是从什么地方生来的。“当应了别，见闻觉知，圆满湛然，性非从所”，你应该知道，见闻觉知，都是圆满湛然，无欠无余的。样样都能见，样样都能闻，样样都能触，样样都能知，所以叫圆满。所谓湛然，指的是这个见闻觉知的根性，也就是如来藏，是湛然不动，不生不灭的。“性非从所”，它的性体是清静湛然，本来就有，本来如此的，不是从哪个地方生起来的。“兼彼虚空，地水火风”，怎么兼彼呢？就是兼前面所说的虚空和地水火风，因为它们都没有一个来处，都不可得。既然都不可得，所以都是如来藏妙真如性。 “均名七大，性真圆融，皆如来藏，本无生灭”。 地水火风空这五大，加上根大和识大，合起来“均名七大”，一共有七大种性。它们的本性，或者说本体、性体，是真实不虚，圆满无缺，互相融摄，没有妨碍的。因为都是如来藏，哪里有生灭，哪有去来呢？<br/><br/> 　　“阿难，汝心粗浮，不悟见闻，发明了知，本如来藏。汝应观此六处识心，为同为异，为空为有，为非同异，为非空有。”<br/><br/> 　　与前面问根大差不多。世尊说：阿难你的心太粗了，不能细察这根大、识大。因为心浮而不实的缘故，所以你不能从见闻觉知中悟出这个道理，没有发现和明白它们都是如来藏心。假如不是如来藏心的话，你应该看看这眼、耳、鼻、舌、身、意六处识心，各有所缘之境，就是眼缘色尘、耳缘声尘、鼻缘香尘、舌缘味尘、身缘触尘、意缘法尘。因为各有各的缘处、各有各的缘境，那么这六处识心，是同还是异呢？你若说同它有异，若说异它有同。如果说异，它们是同一识性，虽然眼、耳、鼻、舌、身、意是六个识，但 “本是一精明，分为六和合”，本来是一个精明，也就是一个体。如果说同却又彼此相异，因为各个缘境不同。我们众生的识心都有界限，眼只能看而不能听说，耳只能听而不能嗅尝，受各自功能的限制，不能六根互用。所以它们彼此是同中有异、异中有同，那么究竟是“为空为有”？这个六识是空还是有呢？你说它空，它能起这个用，你说它有，它的本体却无，所以是非空非有。“为非同异，为非空有”，如果说它非同，非同就是异，就是不同，它又不异，因为它的识是一体。你说它非异，非异就是同，它又不同，因为所缘的境不同，所以它是非同非异。又因为它的体是无、用是有，既非空又非有，所以说是“为非空有”。非空就是有，非有就是空。它的相用不无，这是非空；而性体没有，这是非有。所以亦非空有。因为它不落四边，所以就是如来藏心。<br/><br/> 　　识大虽然没有性体，但它并不是空无所有，它还是有的，因为它的妙用不无。我们的见闻觉知能够认识了别各种事物，就是这个识在起作用，这个识神就是如来藏心。说起识神，玄沙禅师说过一句话：“学道之人不识真，只为从来认识神，无量劫来生死本，痴人唤作本来人”。把识神这个痴子当作是本来人，这就是我们沦落生死的根本。大家听了这段话，提起识神都怕得不得了。其实你不用这么害怕，这个识神就是如来藏，它们是一体，不是两个东西。玄沙那么讲，是怕我们只认得识神，而不认如来藏。识神从如来藏生起，是如来藏的妙用，就象水起的波浪一样，离开了波水也就没有了。真如本体就是这样子，假如没有识神，我们大家都是痴子、呆子，我们学道的人如果只知做死功夫，把识神都压死了，还怎么起妙用，得到真实受用呢？所以我们不能这样，我们学道的人首先要认得本体，认得这个如来藏性，知道识神的一切作用都是如来藏性的妙用。因此我们既不能执着这个相，也不要执着这个用，懂得在在处处都是如来藏随缘的妙用，尽管起用而毫无住着，如此即可顺逆无拘，纵横自在。但是反过来说，你假如稍微有点粘滞，执著在相上面，那就坏了，那就是生死。所以差之毫厘，谬以千里，哪怕是毫厘大小的过失，也会有天地悬隔的差别。宗下再三这样说，就是要我们认得这个如来藏性，明白识神只是它的作用，只有这个如来藏心才是我们的主人公。<br/><br/> 　　在密宗里也是这样讲的，大圆满和大手印的书里面，就告诉我们要“拿到不管”，很多人都感到难以理解，不知道该怎么去解释，为什么拿到了就不要去管？所谓“拿到”就是“识得它”，不是让你拿个什么东西在手里，而是要你认得它。识得这个如来藏心，就是“不可得中只么得”，在无可得处才是真得。你识得这个本来面目，就不要再去管它了。一切都是我的妙用，不要再去着相，不要再去着知见。你可不能生这样的知见：“唉呀！我开悟了！我见性了！我已经成功了”！“你们都是众生，我是佛了”，这种知见要不得。你不要理睬它，因为一切都是如来藏的妙用，一切都不可得嘛，所以尽管随缘起妙用，而不要去管它。不要管什么呢？不要管它神通不神通。众生对神通都看得很重，以为有个神通就不得了啦，这个执著最要命。神通这个东西，你越求反而越得不到，你有这么个求神通的心，不但得不到神通，最后倒有可能变成个魔王。所以对神通就是有了也不能粘着，我只管随缘起用，用了等于没用，有也等于没有一样。<br/><br/> 　　见性了不等于大事了毕，还要参访善知识，去印证自己的见地是否已经透脱了。就象赵州老和尚，开悟以后还要到各处参访，“赵州八十犹行脚，只为心中未悄然”，因为心里虽然是悟了，还未太平无事，还有些微细的东西在。宗下有这样一个公案，南泉、归宗、麻谷几位大德已经开悟了，有一次他们约好了去拜访径山禅师，走到一个地方，大家口渴了，看见路边有个老婆婆在卖茶。这几位禅师走过去向老婆婆讨碗茶喝，老婆婆一看，问他们：“你们几位大和尚要到什么地方去呀”？他们赶忙说：“我们是出来行脚的，因为天热口渴，希望您老能赐碗茶喝”。老婆婆沏好茶以后对他们说：“吃我的茶有个规矩，有神通的免费供养，没神通的就对不起了，请到别处找水喝吧。”。这几位行脚僧一听就呆了，大家你看看我，我看看你，因为谁都没有神通，这个茶怎么喝呢？老婆婆一看哈哈大笑：“你们这几个呆鸟，看老婆子逞神通吃茶。”说着拿起茶杯，咕嘟咕嘟一饮而尽。几位禅师一看恍然大悟：“唉！我们都在执著神通，把它当成神奇玄妙的事，其实这个饮水吃茶不就是神通吗”？因为穿衣吃饭、举手投足，都是自性的妙用，我们每个人本来就神用无边，还向外找什么？所以诸位菩萨一定不要执著，如果执著神通可就大错了。<br/><br/> 　　“汝元不知，如来藏中，性识明知，觉明真识，妙觉湛然，遍周法界，含吐十虚，宁有方所！”　　<br/><br/> 　　讲到这里识大就要结束了，这是再给识大做个总结。因为如来藏是个妙觉本体，一切东西都出自我们的如来藏心，所以叫“无不从此法界流，无不归还此法界”。从如来藏中流出的万千诸法，最后还要统统归到这个如来藏中去。你以前不知道，如来藏的性识，就是真性，这个性中之识，不同于木石那般顽冥不灵。性识是明知，是了了分明的常知。在没有同外界接触，没有发生了别识的时候，它无多无少，离能离所，没有对待，是绝对的真知，所以叫“性识明知”。<br/><br/> 　　“觉明真识”，我们这个如来藏是个明觉体，觉体的明知才是我们真正的识，而不是根尘所生的妄识，妄识是相对而有的。我们知道东南西北、长短方圆、青黄赤白，这些都是相对而有，而不是真知。真知实际上是无所知，所以叫般若无知。有能有所不是真知，而是妄知。所以这个觉明之体是真识，它无能知、无所知，本身就是一个知。后面在解释其余疑问的时候，说到了明有觉、觉有明，那就坏了。觉有明就因明立所，这个所明就是我们三细中的业相，所以说是妄。觉体本身是明，明本身也是觉，觉之与明，明之与觉，没有两个东西。如果在觉之外有明，明之外有觉，那就变成妄觉了，这就是无明。讲到真识，这个真识觉体之明，是既无能明，也无所明，因而能够无所不明。<br/><br/> 　　“妙觉湛然，周遍法界”。妙觉是觉无所觉，无所不觉，虽然无所不能，但却不立能所。一切法从它生起，它又不住着生起的三相，所以是妙觉。湛然即是不动、不起波澜，不象水要起波浪，因为是不动的，是无所不知、无处不在、无处不有之故，所以它周遍法界。十法界当中，随便你在哪个法界，都不能没有它。所谓 “含吐十方”，虚空本来没有东南西北、四维上下的划分，这十方是我们识神分别出来的。我们取日出之处是东，日落之处为西，那么两相对面就是南北方，实际上虚空本来是一体，并没有什么东西南北，这是由我们妄识起来之后，而分别出来的。含就是含进去，如来藏的性体上没有这些虚假的相，去掉方所即可返为一体，就是把虚空灭掉，东南西北上下都没有，那么这个方所就灭掉了。吐就是吐出来，怎么个吐法呢？就是十方虚空又不妨有东南西北、四维上下，因为真空不碍妙有，起妙用的时候可以波澜壮阔。比如这水，如果不流动，不起波浪，那只是死水。每年人们去海宁观潮，因为那里海浪大，波澜壮阔，气势磅礴，景致特别，所以大家都跑去看。假如海水一直静止不动，风平浪静，波澜不惊，还有什么好看的呢？我们的真如佛性如果一点不动，光是一天到晚守着本体，个个都似死人一样，那就生不起妙用，就象守着万贯家财的守财奴，钱再多也没有用。我们要学会生龙活虎，能够随缘应大机、起大用，只有学会掌握了大机大用，这样的佛法才是积极的，才有价值。所以说识神就是我们真如的妙用，我们认得这个识神的本体之后，还要懂得利用这个识神。怎么利用识神？就是在如来藏的性体上尽可享用万千妙用，不妨去分别东南西北、四维上下，不妨有山河大地、日月星辰、青黄赤白、男女老幼，也不妨有学习、工作、事业、家庭，所以叫做吐。吐即是生也，十方虚空又生出来了。你可以尽管含、尽管吐，因为十方都属于我，我的性体周遍圆满这个法界。含也好，吐也好，哪里有个一定的方所呢？没有方所才会无处不在，无处不有，这就是我们灵知的妙用。识得这个灵知之后，我们就要好好起用，不要守在那里不动。守在那里不动，禅宗叫做圣堕，就是堕在窠臼里面，这还是生死，叫做生死不了。真正了生死者，虽在生死当中而无生死可了，尽管生生死死，尽管六道里头出头没，而没有生死可得，如此才是真了生死。小乘人是偏真、偏空的，他所证的那个真，是相对于凡夫来说的，由于不懂得真空不二的道理，所以叫偏真。因为偏真，他又执在了空上，以为六道轮回是生死，是凡夫俗子的事情，脱离六道是解脱，是圣人所享有的果德。他们认为有生死可了，有涅槃可证，以自己所证为究竟，所以才会说自己“我已经成圣了，我已经了生死了”。小乘人把生死和解脱隔为两端，偏到空上去了，所以还是法执。因为有这个法执，于是法我不忘，不能了变易生死，也不能起无边妙用。真正成道的人，他是既不落有，也不取空，不堕生死，不取泥垣。不取泥垣者，就是成道以后不是死坐在那里，只管享受而不做事情。而是尽管做事情，尽管做一切度生的事业，虽然做了很多事情，而心无所住，叫“无心而行”。我只要无心，一切事情都可以做，做过了以后，心里面没有任何痕迹，没有任何挂碍。关于这个无心，个别人好象有些误会。我听有的人在说：你的心空了，这个事情可不要做，让我来做，你不要管我。这样就错了，我们所说的心空不是这个空法，如果这样子叫心空，那我们大家都不要做事情好了，一个个坐在这里不动，象泥塑木雕一样，那怎么行呢？所谓心空者，乃心不住相也，工作尽管干，事情尽管做，这个相不要粘着在心里面。噢！我心空了，就可以把什么事情都推给别人做，你这个事情做得不对我不管，你要去犯罪我也不管，这样不对！假如你做错了事情我要规劝你，教你改正错误，悔过自新，哪能放任不管，随你去算了？真悟道的人，喜、笑、怒、骂皆是佛法，我跟你不是冤家，我不是恨你，我打你骂你，是叫你改过自新，叫你不要再犯错误，叫你超出这个生死轮回。所以你不要把这个当做是打，当做是骂。我们做任何事情都应该这样，做的时候只管认认真真去做，做完以后心里不留一点粘着，就象别人做的一样，这就是空。这个空并不是要把事情拿掉，什么都不管的那个空，是做而不着方为空。《金刚经》讲“应无所住而生其心”，就是随缘应付一切事物，内心都无所住。我们讲空心不是不生心，不生心那是死人。因为空心，所以要生心，生一个灵活妙用之心，生一个六度万行之心。 <br/><br/> 　　“循业发现。世间无知，惑为因缘及自然性，皆是识心，分别计度。但有言说，都无实义。”<br/><br/> 　　我们所经历的一切事情，都是由业感应来的，根据业障的深浅、厚薄，而有种种不同，在共业之中有别业，别业之中有共业。在座的各位都生活在同一个社会里，这是共业，虽然是同一个社会，但各自的遭遇不同，家庭环境不同，这是别业。一切事情都是业引发的，饮食起居，家庭环境，乃至我们的国家，这整个世界都是业。这个业是虚假的、不真实的，它只是个因缘和合的假象，本来是没有的。有人曾经问我，怎样才能了定业？他认为这个业是定下来的，是固定死了的，只要造了业，就一定要有这么个业境出现。就是不管业在那里，我都一定要偿还掉，就象欠你的债，必须要还这个债一样，他这是把业执为实有了。假如说真的有这个业，它在什么地方，你能拿出来看看吗？实际上业根本就不可得。你因为有心之故，那么心生业就生，你如果心空了业也就没有了。有的人说我的业太重了，我要忏悔，怎么忏呢？我就念地藏经，或者念个什么咒，来消这个业，忏除自己的罪障。实际上不是这么回事，为什么呢？因为业从心生，还从心灭，你如果心不空，就是再诵什么经，再念什么咒，也消不掉，因为你有这个心在。你应该把心空下来，明白一切东西都是幻影，一切业都虚假不实，《金刚经》上说：“一切有为法，如梦幻泡影”。什么是有为呢？我们的妄心在那里一念萌动，无明生起，就是有为。不是说只要做事情，就是有为。有心去做才是有为，我们心空了不管做什么事情，都是无为。心动之后妄念生起了，那么所做的事情就是有为法，这些有为法都是梦幻泡影。我们从前所犯的罪，所造的恶业，都是梦幻泡影，都不可得。你只要识得它，把心空下来，那么这些罪也好、业也好，就象梦幻泡影一样，根本就是空的、假的，当下就不可得，你还执着它干什么？认为定业实有，定业不可转，这也不能全怪他，因为小乘里是这样讲的，说定业不可转，定业一定要酬报。但是大乘里不这样讲，大乘法说定业可以转。我来给大家打几个比方，说明定业为什么可以转：首先我们可以把业比喻成无形中的影子，这个影子就象空中的电波，你这个人就好比是一台收音机，收音机如果不打开，就接收不到电波，它就不会响。如果收音机一开，接受这个电波，就会响起来。你如果心不空，就象收音机收到了电波，当然要去还他的夙债；你这个心真的空了，随便什么人来寻你，他也寻你不着，因为你根本就没有那个影子，就象收音机没有打开，他到哪里去找你？所以没有什么定业不定业。当年达摩大师传法给二祖慧可，对他讲：你原来欠别人的命债，因为传持正法之故，因而可以不还。假如定业不可转的话，那是一定要还的。对他说可以不还，是因为如果还了这个债，被人家杀头，恐怕别人会诽谤我的正法。他们都有宿命通，知道过去世的事情，你杀过人所以就要被人杀。可是他说你可以不还，为什么就可以不还呢？那就是我的心空，我的心不动啊！不管做什么事情，都是假的，我只是随缘应付，心里一点不粘著，他根本就寻不着我。心空业自然就消除，所以这个业就了啦。<br/><br/> 　　其次，有的大祖师把这个业比喻成冰，水就好比是我们的真如自性，它没有形状，通行无碍，而水结成冰以后，就有形状、有阻碍了。如果冰遇到热气，或经太阳一晒，或被热水一浇，就又化成水了。我们的业就象这冰一样，用般若火焰一烧，它当下就化开、熄灭了。当你悟道了，证得了般若智慧，知道这一切东西都是假的，都不可得，心彻底空掉了，往昔的业障一下就消光了，还有什么定业不定业呢？还说什么酬报不酬报呢？这也是一种比方。<br/><br/> 　　还有一种比喻，比如你现在地位显赫，做了一个国家的元首，或者总统，你从前欠了人家几百元钱，人家不好意思问你讨还：唉！他的地位这么高，这点小债就算了吧。人家自己就把债务勾销了，那么你欠的债无形中就没有了。所以没有什么一定的业，这个业能不能转，全在你自己，只要你时时心空，一切都不可得，那么以前的业就象热汤销冰一样，当下就化解了。所以永嘉禅师《证道歌》上说：“证实相、无人法，刹那灭却阿鼻业”，只要心空无住，再大的定业也会刹那灭除，不是一定要修个什么法来消业。<br/><br/> 　　那么念经、持咒究竟有没有作用呢？念经、持咒是在消你的妄心，就是把你的妄心转过来，因为你平日里著相惯了，总在那里张三如何、李四怎样，这个事情长，那个事情短，心老是着在这些境上。你在念经或者持咒的时候，这个心就被摄到经文或是咒语上，那么妄心慢慢地转化掉，业自然也就消了。所谓念经、持咒可以消业，其实就是这个道理，你懂得了这个道理以后，心念一转，当下空净，一了百了，这个业自然就转了。所以说一切东西都是循业发现，不能把它执着为实有。“世间无知，惑为因缘，及自然性”。世上无知的人，因为不懂这个道理，以为这个事情是因缘生起，或是自然有的，在那里分别来、分别去。 “皆是识心，分别计度”，这都是我们的识心，执着识神的功用，在那里分别计度，所以才有一大堆是非出来。其实都是些梦幻泡影，哪里有什么是，哪里有什么非，所以“但有言说，都无实义”。我们嘴巴所讲的东西，都无真实意义，因为这个真实的觉体，它 “言语道断，心行路绝”，不是言语所能表述，思量所能测度的。<br/><br/> 　　关于识大，有几个问题还需要再明确一下：<br/><br/> 　　第一点，因为这个识是从根大生出来的，由六根对六尘生六识，前面的眼、耳、鼻、舌、身五根，对外面的色、声、香、味、触五尘，生起眼、耳、鼻、舌、身五识，再由意根对法尘生意识。《楞严经》对这个问题讲得比较清楚，跟相宗的讲法有些抵触。相宗把这个第六识叫五聚意识，说意识是跟着眼、耳、鼻、舌、身一起转的。就象眼睛看到外境的时候，只是取个总相，所谓总相就是对色尘只显了，而不加分别。比如我们到这房间里一看，有这么多的人，至于谁是张三、谁是李四，则根本不去管他，这就是总相。而意识的作用，就是当根尘相对的时候，把五根吸收的色相进行归类、分辨，比如这是张三、那是李四，认取这些别相，相宗对识大是这样讲的。我们来看一下《楞严经》和法相宗有什么不同：《楞严经》里讲，根尘相对就象镜子照物，对于吸收的色尘，前五识本身就有了别的作用。法相认为前五识只摄取总相，而意识缘的是前五根落下的影子。它缘这个内尘，也就是法尘，在那里思量分别，识取别相。由于这里面有些出入。所以有些相宗的人诽谤《楞严经》，说《楞严经》是伪经，他们有很多非议，下面还要讲到。<br/><br/> 　　第二点，由于是根大对尘之后生起识大，那么应该把这个识大摄归根大才对，为什么要说识大摄归如来藏性呢？表面看起来这个识好象是从根大生出来的，比如眼根见色生眼识，鼻根嗅味生鼻识等等，实际上根大也好、识大也好，都是如来藏性。譬如一棵大树，从根生出树干，由树干生出树枝，再由树枝长出叶子，这叶子看起来是从树枝生出来的，但实际上离不开树根，一定要从树根上吸取养份之后，树枝才能长出树叶。假如离开树根，我把这树枝砍下来让它生叶子，它还能生出叶子来吗？我们众生的根大就是如来藏性，不管根大还是识大，都来自如来藏性，所以也都要摄归如来藏性。<br/><br/> 　　第三点，在识大这部分，经上只讲了眼、耳、鼻、舌、身、意六识，而没有讲七识和八识，是不是《楞严经》把七、八两个识漏掉了呢？对这个问题有几种说法，一个是《楞严正脉疏》上讲的，第六意识的意根是第七识，根大是第八识，讲了前六识，那么七识、八识就都包含在里面了。以前我们讲过，根大有两种说法：从根能照境来说，根大是心法；从识所依之处，例如眼识依于眼根，耳识依耳根，根大是色法。因为根大本身既包含心法，也包含色法，心法是八识的见分，色法是八识的相分，见分和相分都是由第八阿赖耶识生出来的，所以说根大属于第八识。第二个是《天台文句》讲的，说七、八这两个识都为意根所摄，没有说第八识就是根大，与交光大师的《楞严正脉疏》有出入。此外还有的人说七、八识是属于识大的，不属于根大，在这个疏钞里有许多区别。<br/><br/> 　　实际上第八识既不属于根大，也不属于识大，为什么呢？我们以前讲过，这个第八识是阿赖耶识，阿赖耶识就是如来藏性，本来是一个东西，不是两个东西。因为有了无明、有了生灭，如来藏性于是变为阿赖耶识，这就好比一个人本来是清醒的，由于喝醉了酒，他的大脑就昏沉迷糊了。其实清醒也好，糊涂也好，他始终是同一个人。如果我们把这个根和识都灭掉了，悟到根与识本来都不可得，那么这个阿赖耶识也一样不可得，阿赖耶识也就转为如来藏性。现在之所以有阿赖耶识，就是因为有六根六识，既然我们明白六根不可得，那么六识也不可得，根与识打破之后，阿赖耶识也就跟着转摄为如来藏性。所以第八识不属于识大，也不属于根大，而是属于如来藏性。因此在《楞严经》讲识大的时候，根本就不管第八识。那么第七识呢？第七识就是六根与六识，因为这个六识是七识所生，七识是它的根子，没有七识就生不出六识来，所以说六识就是七识，因为第七识已经包括在六识之内，所以没有另外再讲。<br/><br/> 　　到现在为止，四科七大已经全部讲过了，我们从中得到了些什么启发呢？首先它使我们懂得，世间的一切法都如梦幻泡影，皆是虚幻不实的。我们众生因为妄想执着，把一切幻象执为实有，所以造业受报，沉沦六道。但是返过来说，这个事事物物又是法法皆真。因为一切法、一切物，都是如来藏性的映现，当体就是我们的真如佛性。只要不粘著色相，心空无住，当下就可全幻即真；如果粘著尘境，迷相逐物，那么就是全真即幻。迷与悟其实就差这么一点，所以修行修行，就修这么一点东西，不是另外再修一个别的什么东西。在心地上用功夫，保养这个真性，这就是佛法。如果离开这个性体，以有所得之心去修法，都是外道。你随便搞些气在身体里转，通什么小周天、大周天，乃至于出了阳神。因为你没有识得这个真性，还是不究竟。你出的那个阳神是意生身，是第七识的影子，是生灭法，纵然飞升自在，也依然是在有为法里打转转。你们要识得如来藏性这个根本，它是妙明真心，能生一切法，起一切用，你如果不识得这个本性，而去迷情逐物，那么就坏了。如来藏性离一切相，而又即一切相的，我们证体以后还要起用，一切相都是如来藏性的妙用，没有相就不能起这个用。讲四科七大就是破有无两边，把两边都破了之后，一切都不可得，从而显现出人人本具的如来藏性。我们认得这个如来藏性之后，就知道一切法、一切色尘、一切物境，都是它所起的妙用，所以说法法皆真，这个叫空不空如来藏。先空者就是要先破掉两边，因为一切事物，包括明暗、大小、色空、长短等等，都是相对而来的，破掉两边就可以明了这些东西皆不可得。先由前面的七处征心，破除妄想以显发真空，叫空如来藏。破除两边，明白一切不可得，为的是将一切法摄归如来藏性，从而显现这个离执的中道之义，这又是不空。接下来是十番显见，不是破完了以后就什么都没有了，因为我们的真如佛性既是真空，也是妙有，所以是不空如来藏。讲空是非空非有，讲有是即空即有，既不能偏真，也不能偏假，所以叫空不空如来藏。<br/><br/> 　　这里是分三段讲的，首先要空诸所有，一切事物、一切法都没有自体；然后还要懂得真性不空，我们的真性能生万法，能起妙用，一切形象、一切色尘，都是我们真心所生的妙用。有人说《金刚经》同《弥陀经》很矛盾，《金刚经》讲一切都空，《弥陀经》讲一切都有，这是因为你不知道真空就是妙有。《金刚经》讲的空是真空，是妙明真心的体。《弥陀经》讲的有是妙有，是妙明真心的用。由真空之故，因而能显妙用；由妙用之故，所以能显真空。没有事即无以显其理，没有理也不能成其事，即事即理，即理即事，才能理事圆融。所以《金刚经》就是《弥陀经》，由真空而生妙有；《弥陀经》就是《金刚经》，假妙有以显真空。由于我们时时处处都不能离相，所以修行不一定在深山里，躲在山林里修。没有各种环境的磨练，你就不能离开相。表面看起来很自在洒脱，其实遇事还是过不去。在闹市里修行成就，才是真成道。只有对着各种顺逆的环境都不动心了，才能真了。但是话又说回来，能够不为外境所移，能够不为这个花花世界所动摇，这是大力量、大定力。我们开始的时候没有这个力量，先找个安静的地方修会比较好一些，但是不能老躲在清静处。如果有个境界来了，你的心还在动，这就不行。仅仅在清净处透得过还不行，要在闹市里透得过，才是真了。<br/><br/> 　　道教里也是这样讲，说是有个人修成了，升到天上，看到有个天女特别漂亮，他一动心，就被王母赶到下界去了。他一天到晚在深山里不见人修道，到天上看天女这么漂亮，就透不过了。这是道教的故事，我们借来用用。是想说明，并不是仅在深山中修就能够了道的，也不是坐在那里不动就能成功的。我们应该动而不动，因为这世界上的东西没有不动的。我们动就是不动，不要把动与不动打成两截。不二法门，动就是不动，不动就是动，动静不二，这样才能成道。<br/><br/> 　　佛这样开示了空如来藏、不空如来藏、空不空如来藏。这样开示之后，与会大众都了悟了。请看下文：<br/><br/> 　　</p></p></div>"
},{
    "title": "壹、见道分——妙心不灭",
    "author": "元音老人",
    "date": "",
    "html": "<div class=\"B1_text\"><p><p style=\"text-align: justify;\">八、妙心不灭 <br/><br/> 　　“尔时阿难及诸大众，蒙佛如来微妙开示，身心荡然，得无挂碍。是诸大众，各各自知，心遍十方。”<br/><br/> 　　“尔时阿难及诸大众，蒙佛如来微妙开示”佛用世间法不厌其烦地一遍遍宣讲，来说明佛法，叫做微妙开示。因为你对这个世间的执着实在是太深了，如果不用世间法来说明这个佛法，你就听不懂。承蒙佛的一番慈悲开示，阿难和与会大众都开悟了，于是大家“身心荡然，得无挂碍”。听了世尊的开示，这个色身与妄心，都消融了，都没有了。因为有心所以有挂碍，如果身心都不可得，也就是你的心真空了，哪里还会有挂碍呢？<br/><br/> 　　对这个挂碍我们再解释一下，因为有些人修行时是在做死功夫，他总是说：一切东西都是空的，我不能挂碍。有个作母亲的在用功的时候，别人来告诉她：哎呀！不好了，你儿子掉到水里去了。她在那里讲：我无挂碍，我什么地方有儿子？坐在那里照样不动。你们说她这样对不对？她看上去蛮有定力、蛮洒脱的，看起来是真的心无挂碍啊！天下的儿子娘最疼，母子之心，血肉相连，别人要是听到自己的儿子掉进水里，会心痛得不得了，马上会一下子蹦起来，她却能坐在那里不动，多好的功夫呀，其实不对！我们要做的不是这种死功夫。你儿子掉到水里去了，为什么不设法救他，难度让他死掉就说明你心空了、没有挂碍了吗？这是在执著死法，不是真空。我们说真空不空，虽然是真空，还要照样设法去救他，只是不能从心里过分粘着，救得起来固然好，即使救不起来，我也心安理得，因为我已经尽了我的力量。你假如不去救他，不管他的死活，那跟死人有什么分别？既然你连自己儿子的死活都可以不管，那么佛菩萨也可以不要来救度众生了，佛菩萨会说：你们在六道里尽管轮回好了，你们受苦又不关我的事情，反正我这里空了，什么都没有。所以说他是会错意了，我们修行要修真实法，要开般若智慧，不能去执那个死法。你们看《心经》上第一句就讲：“观自在菩萨，行深般若波罗密多”。行深般若波罗密多，就是要开你的智慧，要有般若才能渡到生死彼岸啊！这个般若波罗密多是大智慧，你那个死执法，是什么智慧呀？不要说自己的儿子，就是别人你也应该去救他，我们空的是你那个妄相执著，不是叫你把慈悲心也不要了。<br/><br/> 　　从前有个修行人，也是同样的问题。别人告诉他：你家里着火了，快回去救火！他说：让它着好了，我不能去，我要在这里打坐用功。这都是死执法，火还是要救的，只是你心中不要慌乱，要镇定。先看清火源在什么地方，怎么起的火，用什么办法来救，如果慌乱那就是被相转了。世上的人就不是这个样子，一看到火起，马上就心慌意乱，“哎呀！我小孩在屋里呐！”这个做母亲的赶紧跑进房间去，抓住个布包又急忙跑出来，结果一看是个枕头，她这一急心神早就乱了，把个枕头当小孩抱了出来。等回过头一看，房子已经完全烧毁，孩子再也救不出来了。她为什么慌乱呢？就是因为著相，所以我们反复讲不要着相。不着相不是去守那个死空，死空没有东西，不能起妙用。我们讲的空是真空，真空不住相，尽管去做各种事情，这样才叫“得无挂碍”。所以修行要懂得决窍，不能由着死理瞎来，真正的“得无挂碍” 就是心不住相，并不是一点事情都不管叫得无挂碍。 我们成佛是要成活佛，不是要成个死佛，死在那里不动，就象一潭死水一样没有用。<br/><br/> 　　“是诸大众，各各自知，心遍十方”。与会大众都已经开悟，知道自己的真心尽虚空、遍法界，无所不在，无时不有。非但与会大众，我们每个人的真心都是如此，所以识得真心之后，用功才好上路。《楞严经》好就好在这里，释迦佛在这里为我们层层剖析，微妙开示，不象其他的经那样，笼统地说上一句，大家不容易懂。你看这个经说得有多么详细：从五阴、六入、十二处、十八界，到地、水、火、风、空、根、识七大，一桩桩、一件件，从内到外、由表及里、深入浅出，把我们无始以来的生死根由，讲得一清二楚。由于《楞严经》开示得这样清楚，所以大众都在感念释迦佛的恩德，赞叹世尊“开我迷云，令我得入”，打开我的迷云，让我得入妙明真心的本体。<br/><br/> 　　“见十方空，如观手中所持叶物。一切世间诸所有物，皆是菩提妙明元心，心精遍圆，含裹十方。”<br/><br/> 　　“见十方空，如观手中所持叶物”，开悟以后再看这东南西北，四维上下的虚空，就象看手中拿着的一片树叶，或者一件小小的东西一样清楚。为什么会这样呢？我们前面讲过，一切相都是循业发现的，以前由于无明遮障，不知道所有色相皆为妙明真心中物，见什么东西都执为实有，在那里分好分坏，分东分西。而今一旦觉悟，当下无明打破，业识冰消，心中所见与以往自然不同。见性的人看十方虚空都是妙明真心中物，一切色相和空相都是如来藏性的灵明妙用，真空不碍妙有，妙有不妨真空，心量自然就广大了。因为他看这些东西都不可得，尽虚空大地无一物可取，亦无一物可舍，所以不象我们凡夫心量狭劣，迷情逐物，遇事粘滞。一个人当他体证到自心本具的真如佛性后，明了一切欲望和贪念都不可得，心量广大可以包容太虚，连十方虚空都在我的心里，看太虚就象看手中的一片树叶。所以《华严经》上说，小中可以现大，大中可以现小，无边刹土不隔于毫端，十世古今不离于当念。我们的如来藏性本来就具有这样无边的妙用。你一著相之后，就有大小、长短、远近、方圆等种种隔碍了。本来小就是大，大就是小，小可摄大，大可入小，因为你着相的缘故，这个小就不能再摄大，大也不能再入小。比如这个杯子是小，那个录音机是大，当你在执著这个相的时候，那么小和大是有分别的。如果你的心空，一切相都不可得，什么地方还有这个大和小？大小、长短、方圆都不可得，统统销归于色大，因为同是性空之故，因此彼此互摄无碍。所以说“一切世间诸所有物，皆即菩提妙明元心”，世间万法，都是我们如来藏性所显现，所以一切事物都是佛。就象我们再三说的，这个屋子里的桌子是佛、凳子是佛，杯子等都是佛，屋子外面的山河大地、日月星辰等等，也无一不是佛，因为都是我们这个妙明真心的影子。菩提是正觉，妙明真心就是相用，由正觉而起现相用，由相用而体悟正觉。<br/><br/> 　　“心精遍圆，含裹十方”。我们的真觉妙体是圆满无碍的，它极大、互摄、互用，没有妨碍，能够遍满十方，遍满十界。无所不有，无所不容，所以叫遍圆。“含裹十方”，十方虚空都在我的真心里面，不在真心以外，众生因为有妄心之故，所以会分别出种种不同的东西。比如说这个水，它受到太阳的照射而有热度，温度升高了就会变成水蒸汽，水蒸汽到了天上又变成云，所以云其实就是水。云遇到冷空气，就会凝结成水滴落下来，如果天气暖，落下来的是雨，假如天气冷的时候，就变成雪、霜或者是冰。霜、雪、云、雨、冰等都是水的变化。凡俗之人就执着这种变化相：这是雨、这是霜、这是雪、这是冰、这是云，不知道这些都是由水变化来的。我们认识这个真心之后，就知道一切事物都是真心的变化，所见到的相都是自性的影子、自性的妙用，那么看到相其实也就是见到性。就好比知道了水与霜、雪、云、雨、冰的关系以后，再看见这些东西的时候，就会知道它们都是由水变化来的，那么你就会认识水，而不会只认雨、雪、冰、霜。你既然懂得了这个道理，就不要再去分什么男女相，不要再去理会吃的东西怎么样，穿得好不好，要时时刻刻见性，而不要时时刻刻著相。修行人就是要透过相见性，如此则可心量广大，观十方虚空如掌中之叶，看得清清楚楚。现在我们的眼睛只能看到面前几丈远，就是因为心量不大，心有执着之故。心量大了，以后可以证得天眼通，看再远的地方也只如近在目前。<br/><br/> 　　修行第一要识得这个真心。识得真心之后，还要绵密保任，要把你的习气都消除净尽，才能最后成就。不是识得真心就到家了，你此时还差得远，还是凡夫地位，才刚刚开头，前面还有很长的路要走。讲到习气，不光贪、嗔、痴、慢、疑是习气，你现在说有这个空、有这个色，就是习气。因为根本就没有空、没有色，你说空说色，就是落入了两边，根本原因还是在于著相。我们前面讲过，财、色、名、食、睡这五盖，是最重的习气。把这五盖打掉，你不要求发神通，而神通自发。因为“循业发现”嘛，你的心量大了，各种功用会自然而然生出来。你看这与会的大众，“见十方空，如观手中所持叶物”。他们蒙佛慈悲开示，悟到了这个自心本具的真如佛性，心量大了，眼界自然也就大了。<br/><br/> 　　“反观父母所生之身，犹彼十方虚空之中吹一微尘，若存若亡。如湛巨海，流一浮沤，起灭无从。”<br/><br/> 　　前面说看到十方虚空，就象看我们手中的树叶一样。那么回过头来再看我们父母所生的身体，就好比虚空中吹起的一个灰尘一样，“若存若亡”。怎么若存若亡呢？因为这个身体不无，肉体还在这里，故“若存”；身体本来并没有，它只是个假相，根本不可得，所以“若亡”。其实你说它存，或者你说它亡，都是你的分别心，它是存而无存，不存而存，不是真存，也不是真亡。譬如灰尘被风一吹，就随风飘荡起来，就等于父母生出了我们的色身，有一个身体在那里，这就是存。那么风停了以后，这个灰尘又飘落下来，就等于我们这个色身死了，这就是亡。实际上这不过是一个灰尘的起灭而已，真心是不动的，并没有起灭存亡。这个真心不因我们色身的出生而生，也不因我们色身死了而灭，它没有生灭，所以是“若存若亡”。相虽然有生灭，但真心没有存亡。这个色身的幻生幻灭，“如湛巨海，流一浮沤”，“浮沤”就是水泡，就象一个不动的大海，流淌起来的一个水泡泡。“起灭无从”，这个泡泡不是自己起的，它是海水生起的，这个泡泡也不是自己灭的，是海水使它灭的。起灭都是海水，这个泡泡只是假相，这就是起灭无从。所以这个水泡既没有起，也没有灭，因为水泡起时，海水不少一点，水泡灭时，海水也不多一点，始终不增不减。海水比喻我们的真如佛性，泡泡比喻我们虚幻的色身，它尽管幻生幻灭，而真如佛性则一直是不增不减。由自性的不增不减，可以清楚地看到我们的色身和妄心，就象虚空中的一粒浮尘，大海里的一个水泡，生的时候虽然有这么个相，实际上没有生；死的时候好象灭掉了这个相，实际上也没有灭。明白这个道理就是悟道，悟道人看一切生灭起无的现象，都不可得。<br/><br/> 　　“了然自知，获本妙心，常住不灭。”<br/><br/> 　　他们一切都当下了然，与会大众都知道这个本妙心，就是我们这个真如佛性、如来藏性，是本来不生不灭的，本来常住不动的，不象前面的客尘烦恼，在那里有来有去。凡有生灭来去的，都是妄想，都是凡心，不是真心。这个妄心和虚幻身，我们如果说给一般人听，告诉他这个身心本来没有，没有人肯相信。要真正开悟了才相信：噢！原来这个妄心和幻身是真的不可得啊！在这个楞严会上，阿难和其他与会者，因为佛的慈悲开示，大家都开悟了，真见到了如来藏性，明白妄心、幻身皆不可得，惟有如来藏性不生不灭。懂得这个道理就是见道位，就是开悟，但是这样见一下子是否就真实证道了呢？也不是。为什么不是呢？因为这是借佛的慈悲开示，在世尊的指点之下悟出了这个道理，在场的众人实际上没有真正证到这个地位，这一关对我们修行人是非常重要的。譬如参禅、念佛或者修密法的人，他的功夫到了与佛相应的时候，“啪”地一下打开，立时虚空粉碎，大地平沉，见到自己的本性，这就是见道位。但是此番光景也就那么昙花一现，一转眼就失掉了，再想找这个境界而不可得，还是原来那个凡夫身，不是真功夫。宗下谓之“盲眼乌龟钻木孔”，一只瞎眼乌龟钻到木孔里，偶然碰到一下，你再叫他去碰，他就碰不着了。所以这个不是真功夫。要活泼泼地证体起用，才是真功夫。要怎样才能起用呢？就是要在事上、在境界上反复磨炼。有的人刚刚见到一下，就狂妄得不得了：啊！我见到自性了，我开悟了。他是不是见到呢？是见到了。可这只是偶然碰着的，不能时时如此，还不能算是真的见到。你不仅要见到那么一下子，还要时时如此，在应缘接物的时候，尽管去做各种事物，而无物可接，无缘可应，这个真心本性一点都不动摇，才算是略有相应。<br/><br/> 　　阿难以前自恃是佛堂弟，又是佛的侍者，虽然博学强记，见多识广，但是不重实修，没有真实的证悟和定力。因为他总有个依赖心，想着佛什么时候给他个三昧，直到遇着摩登伽女，几乎被外道邪咒毁坏戒体，才痛悟前非。释迦佛具大慈悲心，他看阿难过去总是只重多闻，不务实修，未能体解大道，于是想尽办法逼拶他悟道，就象禅宗的大祖师，逼着自己的徒弟：“速道！速道！”<br/><br/> 　　船子和尚接引夹山善会禅师就是这样。船子德诚和尚与云岩、道悟都是药山禅师的弟子。船子和尚悟道以后来到一处河边撑船摆渡，嘱咐二位师兄如遇到根器伶俐的后生，为他推荐一个半个，以报师恩，他要在这里等有缘人。道悟后来看到夹山善会禅师堪为法器，于是指点他去参访船子和尚。船子和尚就对夹山讲：“垂丝千尺，意在金鳞。离钩三寸，子何不道？”我在这里垂着千尺丝线，为的是要钓大金鳞、钓巨鳌，意思是我要接引大根器的人。现在离开钩子三寸，你给我说说看？夹山才要开口讲，就被船子和尚啪地一篙杆打到水里去了。夹山刚从水里冒出头来，船子马上用篙杆指着他说：“道！道！”也就是“快说！快说！”不给他喘息的机会，也就是不要他从情识意解上找答案，哪知夹山未曾领会，正待再要开口时，又被啪地一篙打了下去。如是者三，连着打下去三次，夹山终于醒悟了，把头一点。船子和尚看他这回真的明白了，这才把夹山拉了上来。祖师们就是用这种逼拶的手段，逼着你见性，因为知道你开口即错，所以才有言说，就劈面打去。我们的绝待真心离言绝虑，非可思量，非可言说，要“言语道断，心行路绝”才能略识门径。就是不要你去搞那个多闻，学什么虚头语，装一肚子的概念和知见，要见真性。<br/><br/> 　　阿难也是在世尊反复开示、拶逼锤捋之下，方体悟到自心本具的真如佛性。他见虽然是见到了，但心里面还有余惑未解，还有习气未除。我们做功夫也是这样子，经过念佛、参禅或者修密，有这个境界现前，啪的一下脱开，妄想执著刹那之间消于无形。假如只是偶尔一次，以后又不行了，那就不是真功夫。所以我们见到以后，还要好好做功夫，要真正打成一片，做到行住坐卧、顺逆动静都是一如。不管环境顺也好逆也好，不管是在动中或者是静中，都是如此。要做到如此境地，才是真了。现在有些人很狂妄，不过是偶尔碰到一次，就认为自己已经到家了，在那里骄傲得不得了，旧的习气还没了，又加上新的习气。不是说你一点没见到，那不过是偶尔碰到一次，因为习气还没有除掉，境界来了仍旧摇摆不定，在事上还是透不过。你不知道一切事情都是虚假的，境界来了你还是在那里著相，当做实有其事，那么这个功夫就不到家，怎么能得受用呢？我们的妙明真体不来不去，不动不摇，一切境界尽管来，我只是随缘应对，无一物可取，亦无一物可舍，什么都不可得，自然不会再着相，能这样活泼自在，即是妙用当前。阿难及大众虽然已经开悟，但是多生历劫以来熏染的习气还没有消除。现在虽能见道，但只是始觉光明，还差得很远。<br/><br/> 　　“礼佛合掌，得未曾有。于如来前，说偈赞佛：”<br/><br/> 　　他们要感谢佛的慈悲。佛这样子苦口婆心，为我们微妙开示，使得大众能开悟。这样殊胜的教导以前未曾有过，所以要合掌礼佛，叩谢恩德。“于如来前，说偈赞佛”，偈子就是颂，用词颂称赞佛的功德，表示谢意。<br/><br/> 　　“妙湛总持不动尊，首楞严王世希有。销我亿劫颠倒想，不历僧祗获法身。”<br/><br/> 　　偈子通常是每四句为一颂，就象我们做诗一样，有一定的韵律。“妙湛总持不动尊”，“妙湛”我们曾经讲过，湛就是清澈的水，不动摇也不起波澜，用以表示佛性。这是称赞释迦佛已经断了分段和变易这二重生死。这个性体虽然不来不去，不起波澜，但是不妨现身六道，在十方世界中度众生，尽管在三界里随类现身，妙明觉性并无丝毫改易，动而未动，所以说是妙湛。“总持”即是总一切法、持无量义，是说释迦牟尼佛对一切世出世间法，无不洞悉，无不通达，就象大地能总持万物，一切动植物都生于大地一样。“不动”是说，佛虽然显一切身，度一切生，而不见有一物可得，不见有一生可度。正象《金刚经》上说的：“如是灭度无量无数无边众生，实无众生得灭度者”，这就是真不动，我尽管在六道里头出头没，而没有生死，没有动过。所谓“尊”者，因为佛乃十法界之首，在一切众中最为尊贵。“妙湛总持不动尊”，这是在赞叹佛的果德，“妙湛”表相大，“总持”表用大，“不动”表体大。因为体、相、用圆满具足，所以称之为尊。<br/><br/> 　　“首楞严王世希有”，首楞严翻译过来是一切事相究竟坚固，因为此三昧能摄一切三昧，一切三昧无有超其上者，所以此楞严大定被称为三昧中王。释迦佛也是因为证得这个首楞严定之故，才得以成佛度生，这个首楞严是体，上面的“妙湛总持不动”是用，由证究竟坚固的性体，而起无边恒沙的妙用，这是世上最为希有难得的。<br/><br/> 　　“销我亿劫颠倒想”，一旦证得这个楞严大定，无量劫以来的颠倒妄想当下消亡，就象一灯能灭千年暗，开悟以后无明有如热汤销冰，马上就消了。诸位不要看轻自己，我们能听到这个楞严经，不是一世二世三世福德因缘所修来的，象《金刚经》所说：“当知是人，不于一佛二佛、三四五佛而种善根，已于无量千万佛所，种诸善根”。不是靠有限的那点善根，而是多生历劫跟着佛学法，才积累了听闻《楞严经》的福德因缘。所以说佛果不是一生两生即可修成的，释迦佛是经过尘点劫以来的勤苦修行才成道的，阿难与释迦佛同时发心学佛，就因为他崇尚多闻，不务实修，所以释迦佛已成果地佛了，阿难还没有开悟，你看相差得有多远！何谓“颠倒想”呢？没有成佛都是颠倒，哪个不颠倒呢？因为都不悟如来藏性，都在着相啊！本来一切相都是虚假的，可大家偏要把它当真，以假做真岂不是颠倒？如来藏本来是真的，可是它看不见摸不着，你对别人讲讲，看有谁能相信？为什么会这样呢？因为假的东西它的相用不无啊！比如这个苹果是有的，这个饭菜也是有的，吃了可以填饱肚子。那么如来藏呢？它无形无相，不可以当饭吃，也不可以当衣穿，所以大家不信，把它当做是假的。假做真是颠倒，真做假更是颠倒，六道众生无不是在颠倒里。我们学佛修行，为的是了生脱死，要想修行成功，就要纠正这个颠倒心，净土宗也是这么说，《阿弥陀经》上告诉我们：“是人终时，心不颠倒，即得往生阿弥陀佛极乐国土”。所以我们欲生西方要心不颠倒、意不散乱，假如你心颠倒了，纵然信佛念佛也难成就。有人说，念佛的时候心里散乱不要紧，到时候佛会来接引我的。你平时念佛的时候马马虎虎，心粘在世法上，这就是颠倒，因为你并没有真念佛，与阿弥陀佛的本愿不相应，这样怎么能往生呢？世间法是虚幻不实的，是不可得的，只有你念佛是真实的，佛是什么？就是你们人人心中的如来藏性！念佛就是念自心，只有你的真心才是真实不虚的。念佛的时候心不恳切，马马虎虎，平时都在这里颠三倒四，到临命终时想不颠倒就更是难上难了。还有的人说大话，他讲现在马马虎虎不要紧，等到要死的时候，给我一个礼拜，我拼命地念“阿弥陀佛”，往生一定能成功的。这真是痴人说梦！你现在无病无痛的时候，还不能专心致志念佛，等到临命终时大病当前，痛苦得要死，再叫你念佛，你还哪里念得出来？这些人都是颠倒，实在是愚痴啊！所以阿难和大众要礼敬赞叹：世尊您真的是大慈悲，开我迷云，令我得入，证到这个真如佛性，把我们亿劫颠倒之想都消除了。<br/><br/> 　　“不历僧祗获法身”。“僧祗”就是阿僧祗，是一个大得无法计数的数字，用来表示从最初发心到最后成佛，所要经历的漫长时间。我们平时说的“三大阿僧祗劫”，是指修行过程中所经过的三个阶段，第一大劫证初地，是为见道位；第二大劫证八地，是为修道位；第三大劫证佛果，是为证道位。所以说成佛不是一件轻而易举的事，不知道要经过多少漫长劫数。三大劫不是固定死的时间，比如说释迦佛因地上发心比弥勒菩萨晚，因为他精进不懈，反而比弥勒菩萨早成佛。“不历僧祗”，不是一定要经过一个阿僧祗劫，才能获得法身，而是马上就获得法身。法身就是自性，就是我们的如来藏性，所谓获法身，就是开悟了，见到了我们自己的心性。所以我们修行要懂得诀窍，要明白真理，你不明白真理，不管修什么都是盲修瞎炼。不要说那些弄识神的外道，就是进了佛门的人，他如果不明白真理，也一样是外道，因为他也是在那里心外取法。我们说过声闻，乃至缘觉都是外道，因为他心外有法，法执未忘，没有证得这个如来密因，没有识得如来藏性，所以《楞严经》上将他们划入五十阴魔。阿难他们现在就是识得了如来密因，所以获得了法身，你如果不得法身，那么不管修什么都是梦中的佛事。所以不论从哪一门下手，都要在性上用功。修得这个心性，才是真用功，才是成佛的正途。其余都是外围的功夫，与法身都不相干。<br/><br/> 　　“愿今得果成宝王，还度如是恒沙众。将此深心奉尘刹，是则名为报佛恩。”<br/><br/> 　　知恩就要报恩。你看他只不过是用嘴巴说说而已，好象没什么大不了。殊不知这个嘴所发的愿事关重大，可以发明你的菩提根，把你的菩提正觉引发出来。我们实证菩提正觉以后，还要好好用功，做好保任功夫，因为它可以使你成道，使你了脱生死，这是我们人生的头等大事。不仅是我们学佛的人知道生死是大事，那些世间上有学识的人也知道生死是大事。象那个写《兰亭集序》的王羲之，他就感叹：“生死亦大矣”！秦始皇得了皇位之后，他还想成仙、成神，因为他知道这个皇位是昙花一现，死了以后就得不到了，一切荣华都享受不着了，得了皇位他还想长生不老，所以说生死才是人生的第一大事。<br/><br/> 　　要报恩首先要知恩，经过世尊这么一番慈悲开示，阿难及大众悟得真心，领佛深恩，思欲图报，于是赞叹说：“愿今得果成宝王”。我如今在佛的点化下开悟了，见到这个妙明真心，但是我无始以来的习气未消，我要消尽自己的习气，要得成宝王，成就正果。我们的涅槃妙心就是正法眼藏，能雨众宝，世上的一切东西都从它而生，在一切宝物中最尊最贵。因为世间的宝贝能得即能失，皇帝九五之尊，只是昙花一现，荣华富贵也不能长久，只有这个真心亘古长存，不变不灭，所以最为宝贵。阿难及大众在佛前发愿，要证成正果，得成宝王。那么成就了以后又当如何呢？“还度如是恒沙众”。不但要了我们自己的生死，登上解脱的彼岸，还要救度在苦海中沉沦的众生，帮助众生了脱生死，非但自觉，还要觉他。菩萨看到众生受苦，胜过自己受苦，当自己解脱之后，就会毫不犹豫去帮助、解救众生。自己得度了，自己上岸了，看到别人在苦海中受苦，无动于衷，心安理得，坐在那里不闻不问，这是自了汉。我们刚才讲过，比如有人掉到水里了，你不去救他，不管他的死活，以此来证明我心空，我可以不动心，这是不对的呀！我们能够觉悟，能够解脱，靠的是佛菩萨对我们的慈悲关爱，人应该懂得知恩图报，怎么报恩呢？就是“还度如是恒沙众”。佛是福慧两足尊，他早已空一切相，不会贪求你的供养，回过头来救度众生，就是最好的报佛恩。我们去救度众生，不仅仅是在帮助别人，更是在帮助你自己，不度众生你就不能成佛。有人说我不度众生也没什么嘛，自己解脱不是蛮好的吗？他不知道，不度众生，自己就不能成道。为什么呢？因为无明分为好几等，有见惑、思惑、尘沙惑、无明惑等。这其中的尘沙惑很微细，多得象灰尘一样，平时潜藏得很深，不度众生你就不能发现它，当然也就不能消灭它。众生的脾气、习惯各各不同，为了救度他们，你就得深入地了解他们，要掌握一切接引教育的方法，要随顺众生的习性。在度众生的过程中，你自己的习气、惑业才能彻底消灭。因为众生有无明，有颠倒妄想，他不会老老实实地听你的话，跟着你走。当他顶撞你，违背你的心愿时，你能开心吗？这样一来你的习气就暴露出来了。我们平时自己一个人独处，没有人来招你惹你，你会感到很自在、很安祥，以为习气都没有了，都消光了，其实大量的习气就象沉在水底的泥沙，你轻轻拨动表层的水，它根本就翻不起来，只有往底下使劲搅动，才能将下面的泥沙翻上来。你不要以为只是你在度众生，事实上众生也是在度你，是他们使你意识到自己还有那么多的习气，那么多的惑业，你才知道应该从什么地方下手。从前我在金山寺看见有个人，他的神通蛮大的，因此认为自己很不错，很了不起。听到人家说，他还有佛法在，就是心里还有东西在，他就不高兴了。只用一句话，习气就冒出来了。这是我亲眼目睹的。所以尘沙惑一定要在度众生的过程中才能了。因为众生的知见、习气不同，根基不同，你必须了解他们的差别，因人施教，用不同的方法接引不同的众生，这样才能除灭你的微细惑。<br/><br/> 　　断惑是度生的第一个方面，另一个方面是培植福德。佛是两足尊，非但智慧圆满俱足，福德也要圆满具足。你见性只是成就素法身，如果不度众生，没有对大众做什么事情，你的福德无从建立。如何能圆满具足？做了好事才有福德。如果你一点事也不做，能得到吗？如果不度众生，你的功德、福德从哪里圆满呢？当然圆不起来。不管是西方的极乐世界，还是我们欲界的兜率天宫，都是靠功德圆满积累起来的，所以《阿弥陀经》上说：“不可以少善根福德因缘，得生彼国”。念佛是福德因缘，度生更是福德因缘，你没福德，净业就难以成功。过去有句话，叫做“修慧不修福，罗汉托空钵”。阿罗汉因为所见不圆，偏到空上去了，他认为有这个慧就行了，所以他不知修福。既然你不为众生做事情，你没有培植福德，虽然你贵为阿罗汉，也不会有人来供养你。我们现在广结善缘，做一切好事，度一切众生，积累功德，一方面了微细的惑业，这是证智。另一方面培植福德，就是积福，要福德和智慧二者具足，才能最后成佛。成佛必须度众生，不度众生即不能成佛。<br/><br/> 　　“将此深心奉尘刹，是则名为报佛恩”。我们要发这样的誓愿，我要把自己救度大众的深心，奉献给无边刹土的所有诸佛。深心就是深埋在自己的心田里，不是浮浅的，不是随便说说的。什么叫“奉尘刹”呢？就是我用这个度生的心，来供养十方象微尘一样多世界的佛，我们知道，讲到报恩，就要用这个人最欢喜的事情来报答。因为佛已经证到法性尽地，一切福慧圆满具足，就象六祖说的：“何期自性本自清净，何期自性本不生灭，何期自性本自具足，何期自性本无动摇，何期自性能生万法。”佛样样都有，什么东西都不缺，他不需要你供养饮食衣服卧具医药，也不需要你来歌功颂德。佛视众生皆如父母，最欢喜的是度众生。我们发救度一切众生的誓愿，也发象地藏王菩萨“众生度尽，方证菩提；地狱不空，誓不成佛”那样的大愿，这就是对佛恩最好的报答。能够发这样的大心，能够行这样的愿行，那么“是则名为报佛恩”。<br/><br/> 　　“伏请世尊为证明，五浊恶世誓先入。如一众生未成佛，终不于此取泥洹。”<br/><br/> 　　我发了这样的深心，请你世尊来给我做个证明，为什么要证明呢？这里有很大的关系。譬如我私下发个愿，要去做某件事情，因为没人知道我曾发过什么愿，那么我做也好，不做也好，反正人家不知道，所以没有办法监督检查。如果你现在是对大众公开发愿，明天要为张家做个什么事情，后天要为李家做个什么事情，这等于是让大众一起来监督你，你既然发过这个愿，就要去履行自己的诺言。你发过愿而不去做，那就是个空愿，不但违背了自己的诺言，而且也对不起大众对你的监督。那么为什么要请世尊来证明呢？因为佛为众中之尊，请佛证明最为庄重。再说我这个愿不是只发给这一生，而是尽未来际的，如果请别人做证明，这一生他知道我发过愿，他可以监督我，等到下一生大家随业漂流，各奔东西，我到哪里找他做证明呢？而世尊不仅今生可以为我们证明，就是今后不管过了多长的世间，不管我们投生到哪方国土、哪个世界，只要是我们发过的愿，他都记得，都可以为我们证明，所以阿难和大众要“伏请世尊为证明”，我要用救度众生的实际行动，来报佛恩。<br/><br/> 　　“五浊恶世誓先入”，我们这个娑婆世界是五浊恶世，所谓劫浊、见浊、烦恼浊、众生浊、命浊，这样污浊的恶世连阿罗汉看见了都害怕，他都不愿意来。但是这样的五浊恶世我要先入，我第一个先来，这就是大乘和小乘的区别，菩萨不畏艰难，不怕险阻，偏要向异类中行。人道还不是最苦的，不光在人间度生，还要到畜牲道里走走；畜牲道里走走不算数，还要到地狱道里走走，这才是苦难的地方。因为你有深心，你有悲愿，所以不畏任何艰难险阻。实际上你真成道之后，既没有苦，也没有乐，因为苦与乐都是我们的心在分别，因为有乐必有苦，没有苦哪来的乐呢？如果你的心空了，那么一切相亦空，也就无所谓苦，无所谓乐，所以我们说极乐世界连乐也不可得，有乐即不能称为极乐。你的心真空了，就是到了地狱里也不觉得苦，非但地藏王菩萨在地狱不苦，乃至于调达在地狱里也如享三禅天之乐。调达是魔王，是害释迦佛的，他在地狱里还是快乐得很，象三禅天的快乐一样，不是初禅、二禅所能比拟的，因为他心空之故，所以有这个定力。只是他不究竟，而佛是究竟的，所以业都是随心量而发现。你的心里如果有十分的执着，对障缘就有十分的痛苦，每去掉一分执著，就会减少一分痛苦，调达没有去掉十分，但是去掉了七、八分，所以到了地狱里也不感到痛苦。《法华经》上说，调达（也叫提婆达多）是大菩萨，他做魔王来害释迦佛，是大权示现的。因为业随心变，我们众生有十分的执着，在你的心上就会感应十分的业果。你的心空业就空，业不能拘，天上人间随意自在，如果心不空，业即不空，不管到哪里都会如影相随般跟着你。<br/><br/> 　　“如一众生未成佛，终不于此取泥洹”。我发誓：假如这个五浊恶世里，还有一个众生未成佛，我都不会逍遥于外，去安住无为，在那里享福。“泥垣”就是涅槃，不取泥垣并非没有证到涅槃，实际上早证到了涅槃，但是不取这个入涅槃的相。就象地藏王菩萨，他说不取佛位，并不是说没证到佛位，他就是因为已经证到佛位了，才有这个大力量、大功能。我们说过大乘的涅槃是无住涅槃，虽然亲证无为，而不安住无为，如果安住在无为里不动了，那么就变得象小乘一样了。你看观世音菩萨已经证到佛位之后，还倒驾慈航，再现菩萨身，来普度众生。非但观音，十方三世一切佛，佛佛都是如此。所以你不要看释迦牟尼佛在我们这里涅槃了，他在《法华经》里说，我没有入涅槃，因为在你们这个世界上度生的缘了了，给你示现个涅槃的样子，其实我没有离开这个世界，这个世界上法眼清净的人都能见到我，就是在其他世界里，我也依然在随缘现身。所以不于此取泥垣，不是不证果位，而是说如果还有一个众生未成佛的话，我都不会安闲无事，不会安住无为。<br/><br/> 　　“大雄大力大慈悲，希更审除微细惑。令我早登无上觉，于十方界坐道场。”<br/><br/> 　　我们看到所有的寺庙里，都有大雄宝殿。“大雄”是生死不能及，不管是分段生死还是变易生死，都不可得；“大力”是魔外不能挠，一切邪魔外道的力量，都无法破坏扰乱。佛要成道的时候，有那么多的魔王、魔女，现身来扰乱佛，想把佛从菩提座上拉下来，佛巍然不动。据说后来魔王没办法了，把浴巾布一洒，生出烟叶来，说既然你入不了魔道，我就用烟叶把你将来的佛子佛孙们熏倒，要拖他们下水。所以现在人们所吸的烟叶，就是魔王的浴巾所现。有人说抽烟不要紧，因为五戒里只说不准吃酒，没有说不让抽烟，其实这个烟也不能抽。有的人到庙里去，散香烟给和尚吃，我非常反对，你们这是在助长他们的坏习气。这个烟不能抽，它是魔王的浴巾变来的，要熏倒你的菩提根，想叫你们佛的子孙不能绵延下去。魔外所以不能扰乱佛，是因为佛有这个大力。“大慈悲”大家都知道，予乐为慈，拔苦为悲，佛菩萨始终在慈悲救度六道众生，予我们众生快乐，拔我们众生之苦。比如我们有什么痛苦，都会求观世音菩萨把我的痛苦去掉，有什么需要了，也会想起观世音菩萨，你求菩萨赐一个儿子，果然就生个大胖儿子，想要菩萨赐个女儿，就真得个千金小姐，真是大慈大悲。有人说了，观世音菩萨以前对我灵感得不得了，不过后来这灵感比以前差了，是什么缘故呢？这是有道理的，因为佛菩萨都是“先以欲钩牵，后令入佛智”。先满足众生的愿望，使你们生起信根来，待信根坚固之后，还要叫你们入佛智，开佛的智慧。开智慧就是证得空性，叫你明白一切都虚幻不实，既然一切都不可得，你就不要再求了，在满足你的愿望时就会不比从前，后来比较差一点，就是这个道理。“后令入佛智”，这是佛的慈悲心，先满足你的愿望，让你生出信心，待你信心具足不会动摇了，再引导你开佛的智慧。如果过分地满足众生的欲望，会使众生的贪欲越来越大，你这也想要，那也想要，那么出离心和解脱心就会日益淡薄。你已经开了智慧，就不要再求了，慢慢地打消掉你的欲望，这是佛菩萨的大慈悲。<br/><br/> 　　“希更审除微细惑”，就是粗妄断了以后，微细妄还未曾了，习气还在那里。这个习气真要命，好比一个臭马桶，由于用的年代太久了，臭气已经深入到木板里，你把粪倒掉了，但是木头里的臭气还在，你就是反复洗呀刷呀，再一闻还是臭的。我们的习气都是多生累劫熏染下来的，自然也不是一生一世能够消除的。那些粗的习气我们能发现，微细的则很难观察到，所以说“六粗易断，三细难除”。“希更审除微细惑”，于是阿难和大众再次请求世尊：大雄、大力、大悲的佛啊！请您帮助我们“审除微细惑”吧。“审除”就是帮助我们指出不对的地方，把迷惑的地方列举出来。因为微细之惑我们自己一时还不能发现，要您告诉我们什么地方不对，什么地方错了，我们才知道应该怎样去除惑。六粗的惑业容易断，我们只要知道一切东西都虚幻不实，一切色相都是假的，当下就打破了。但是微细之惑很难断，所谓三细就是业相、转相和异相，这个是无明惑，也叫俱生惑，就象我们穿在身上的贴体汗衫，一时脱不下来，所以要请佛来慈悲开示，指出一个消除的法子。<br/><br/> 　　“令我早登无上觉”，希望使得我们及早地登上无上觉。“无上”就是没有比它更高的，这个无上的觉道，就是成就究竟佛果。“于十方界坐道场”，每个人都象释迦牟尼佛一样，在十方世界示现成佛，安坐道场说法度生。释迦牟尼佛不仅在我们娑婆世界示现八相成道，而且同时在十方世界坐道场，广度众生，《法华经》上对此讲得很清楚。观世音菩萨也是一样，他不仅是西方极乐世界的上首菩萨，在极乐国土协助阿弥陀佛教化众生，还在十方世界寻声救苦，与我们娑婆世界的众生，特别是妇女，最为有缘。观世音菩萨在佛法中代表慈悲，因此常常现女身。许多人都很迷惑，以为菩萨真的是女身，喊什么观音娘娘，其实佛菩萨都是诸漏已尽，不受一切身，为了救度众生的缘故，而随类示现各种身相。我们要成就无上正觉，真正证到佛的果位，就必须把这些微细的妄想都消除才行。除习气有一个从粗到细、到极微细的过程。比如说念佛的人，先除什么样的粗妄呢？先要知道这个世间一切相都是假的，妻子、儿女、家庭等等皆不可得，要放得下这个虚妄之身，放得下一切虚幻之物，不粘着是非得失，粗妄即除了。什么是细妄呢？放下这个念头之后，习气还要时时来侵犯你，它在里面扑腾扑腾地一个接着一个往外翻，这种念头来得快，去得也快，是从里面向外翻出来的，这是细妄。对这种细妄，我们可以用佛号来化除它，妄念一起一句阿弥陀佛，妄念再一起，又一句阿弥陀佛，久而久之它就不动了。细妄如果打消了，那么你念佛之心就不可得了。假如你还有能念佛的心在那里，就是还有妄想存在。妄想如果消亡了，你那个能念的心和所念的佛也就脱落了。妄想没有的时候，念佛的心也就止息了。假如你在念佛的时候，放不下其他的事情，还在那儿挂念着儿女，惦记着家庭，那么你念佛就不容易入定。所以不管选修何法，都要先断粗妄，要万缘放下才好入道，随便你参禅，随便你修密，都是如此。功夫再进一步，到根尘脱落，身心世界都不可得，叫离心意识，你假如不离，封闭着真心的那道门打不开，如何能破参呢？达摩大师再三关照，告诉我们用功的第一句就是“外息诸缘”，你外面的各种事缘如果放不下，哪里能够安下心来用功呢？因为这些细妄以自己的能力观察不到，所以阿难他们才要求佛来帮助审除这个微细之惑，要等除掉细妄之后，才能登上无上宝觉，才能在十方界坐道场度众生。阿难说这个偈子，看起来是为自己，实际上是为大众，为了利益当时以及将来的大众。在佛跟你讲了这个道理以后，你识得这个本性了，这是理悟、理解，道理虽然懂了，但是没有大力量，大慧杲说这是药水汞，碰到境界就飞掉了。因为你定力不够，顺逆境界一来，你要么欢喜，要么烦恼。八风一动，人就跟着跑了。要除微细惑，就必须好好做功夫。我们再三说，这个真如佛性非同木石，它是个离一切诸相的了了灵知。见到这个本来，把得定，承当得起，这就是开悟，随便你怎么做功夫，所证的道理都是这样子。但是光承当不算数，要做功夫，要绵密保任，要在事境上时时刻刻同自己的妄念，同自己的习气做斗争。你要时时刻刻见性，不要去着相。刚刚着了相要赶快凛觉，或者念佛，或者持咒，或者凛然一觉，把它化空。要绵绵密密做好保任功夫。绵密两个字你不要小看，它非常要紧，现在很多修外道的人，他们做起功夫来，比我们认真多了，他那叫做假法真修。我昨天碰到一个人，他告诉我说一天能做七、八个小时的功夫，不管早、中、晚，只要有时间就用来练功，坐着、立着、睡着，都在做气功。“哎哟！我这套气功好得不得了，周天都通了。”他在这个色身上用功，在气上用功，可见走错了路。但是，他假法能真修，他肯这样用功，这就是在绵密做功夫。假如他能修真法，在性上用功就好了。反过来说，我们这里修真法的人，却不肯这样用功，在真法假修。我反复说，你见了性之后要绵密保任，时时刻刻不要着相，但他非要着相，拼命跟着境界跑，在那里儿子长女儿短，张三是李四非，驴事未去马事又来，这样功夫怎么能成片呢？假如你在二六时中能够绵密保任，时时刻刻都是这样子修，那么三年保任功夫下来，如果不发神通，你来打我。但是对神通也不能执着，有也等于无，都不可得，执着神通是要着魔的。因为我这个真如性体无有形象可得。你认识到这个觉体，就要好好地用功夫保护它，象这样子用功夫，决计不会不成就，那些错的人都是错在假法真修，或是真法假修，真是可悲可叹啊！<br/><br/> 　　为了证明自己信心之坚定，愿力坚固，所以阿难最后二句说：<br/><br/> 　　“舜若多性可销亡，铄迦罗心无动转。”<br/><br/> 　　“舜若多”是空性，要佛光照耀才现身，佛光不照耀是没有形象的。“铄迦罗”是坚固心，它不会改变，无法毁坏。他的意思是说，即使这个舜若多性销亡了，我这个坚固的愿心也不会动摇，一定不会退转。我们知道空性根本不可能销亡，因为有东西才可以销亡，空性当体即是佛的身心，这个没有东西的绝对真空怎么能消亡呢？那么纵然这个无可变异的空性也能够销亡，我的铄迦罗心也无动转，这就表示我这个愿力无比坚固，无比深厚，不管遇到什么样的困难和障碍，我决不退失这个菩提心。我们学佛的人都知道要发菩提心，可如果要问什么叫菩提心，有的人就答不上来了。简单地说：上求佛道，下度众生，这就是菩提心。要是展开了讲，就是讲上几天也讲不完。 </p></p></div>"
},{
    "title": "壹、见道分——三种相续",
    "author": "元音老人",
    "date": "",
    "html": "<div class=\"B1_text\"><p><p style=\"text-align: justify;\">　九、三种相续</p><p style=\"text-align: justify;\">　　　　（一）世界相续<br/><br/>　　　　（二）众生相续<br/><br/>　　　　（三）业果相续</p><p style=\"text-align: justify;\">　　“尔时，富楼那弥多罗尼子，在大众中，即从座起，偏袒右肩，右膝著地，合掌恭敬，而白佛言：大威德世尊，善为众生敷演如来第一义谛。” <br/><br/> 　　阿难说完赞佛偈，发过愿之后，富楼那弥多罗尼子又站出来提问了。富楼那弥多罗尼子翻译过来是“满慈子”，其中“富楼那”是满，那是爷爷或者父亲，“弥多罗”是慈，“尼”是母亲，合起来就是满慈的儿子，所以叫满慈子。富楼那“在大众中，即从座起”， 从座上起立，他要为大众来发问了。 “偏袒右肩，右膝着地”，这是印度的一种问法的仪式，把右肩露出来，左腿弯曲，右膝跪在地上。“合掌恭敬，而白佛言”，两掌合十以表恭敬，对佛讲话是以下对上，所以叫告白。“大威德世尊”，我们上面讲过大雄大力，因为释迦佛具有大雄大力，生死不能牵，魔外不能坏，在一切众中最为尊贵，所以叫大威德。“善为众生，敷演如来第一义谛。”就是您释迦牟尼佛出于大慈悲，善于用种种的比喻，用通俗易懂的方法，为我们大众开示演说微妙的佛法，使我们得以开悟，识得这个如来藏性，通达第一义谛。“第一义谛”就是圣谛、俗谛不二，在二谛中圣谛是说无，也就是非有，俗谛是讲有，也就是非无。一个非有，一个非无，就是非有非无不二，所以说是第一义谛。<br/><br/> 　　“世尊常推，说法人中，我为第一。今闻如来微妙法音，犹如聋人，逾百步外聆于蚊蚋，本所不见，何况得闻。佛虽宣明，令我除惑，今犹未详斯义究竟无疑惑地。世尊，如阿难辈，虽则开悟，习漏未除。我等会中登无漏者，虽尽诸漏，今闻如来所说法音，尚纡疑悔。” <br/><br/> 　　富楼那这是要请佛再做开示，因为佛这样讲了以后他还有疑惑，余疑犹在，所以请佛来帮助破除。在佛的大弟子之中，每个人都有一样第一，比如目犍连是神通第一，须菩提是解空第一，舍利弗是智慧第一，而满慈子是说法第一，“世尊常推，说法人中，我为第一”。能说法的人一定能听法，能解法，就是你讲的法我必须能够接受，能够理解，才能给人讲说。现在说法第一的满慈子来向佛请教，连这个最能听法，最能解法的人还有疑惑，那么其他的人自然也都不无疑惑。所以满慈子是代表自己和众人共同请问，因为在位众人，都有和我一样的疑问。我今天听到如来的微妙法音，您用种种譬喻，把第一义谛描绘得这么清楚，这么透彻，使我们大众能够得到真实义谛，但是您讲的我们只能懂个大概而已。他这里打了个比方，您说的这些甚深道理，在我们听来“犹如聋人，于百步外，闻于蚊蚋”，就象聋子听百步以外蚊子的叫声。聋子在很近的地方，如果你大声说话，他也许能听到一点点，在百步之外蚊子的声音，连不聋的人都听不见，聋子当然就更听不见了。所以你老人家说的这个微妙菩提大法，在我们一般人听来，就象聋子听百步之外的蚊子声一样，“本所不见，何况得闻”呢？连见都没见过，连听都没听过，所以不能够真实了解，我哪里能知道妙用何在？“佛虽宣明，令我除惑，今犹未详斯义”。虽然您释迦佛再三用各种比方来说明七大根性的道理，使得我们破除迷惑，真正见到这个如来藏性，但是我现在还没有真正地了解这个第一义谛的真义，我内心还有疑惑。有疑惑就障住我的智慧，不能深入第一义谛，因此无法到达“究竟无疑惑地”。<br/><br/> 　　“如阿难辈，虽则开悟，习漏未除。”譬如象阿难这样的人，他虽然开悟了，虽然悟到这个如来藏性，但是习漏未除，他的习气还没有除掉。漏尽通是四果阿罗汉的境界，阿难才是初果罗汉，后面还有三级果位，才到漏尽的地位。因为他没有证到漏尽通，他没有进入四果，所以他还有习气在，他还有渗漏，他还差得远。其实阿罗汉虽然已经证得漏尽通，也依然还有习气，因为他还有法执，这个法执也是习气，他的习气没有真正除净，虽然能了分段生死，但是变易生死还在。“我等会中，登无漏者”，就是四果阿罗汉，见惑、思惑已经了了，已经登了无漏位了。我们与会的四果阿罗汉，还有辟支佛，已经到了无漏的境界。漏就是烦恼，惑就是迷惑，小乘所说的烦恼指的是见惑和思惑，我们这个世界上的人都在烦恼中，所以都是渗漏，证得“无漏”就可以断见、思惑，了分段生死。“虽尽诸漏，今闻如来，所说法音，尚纡疑悔。”我们这些已经证得漏尽通，了了分段生死的阿罗汉和辟支佛，虽然见、思二惑已尽，一切烦恼都没有，但是听了您老人家所说的法，也不是丝毫不疑，心里还是有疑惑。因为阿罗汉法执犹在，他还有这个习气在那里，所以见地不是完全真实，虽然听懂这个意思，但是没有真正证到这地步，因此还有疑惑。<br/><br/> 　　这个“纡”字呢，我们上次已经讲过了，就是把手指屈起来。纡者曲折也，就是这个道理不是完全明白，听了您老人家讲的无上甚深微妙之法，还不无疑惑，不能真正究竟了解。“悔”是悔自己听得不深切，悟得不透彻，悔自己错过机会了，是自悔，不是让别人悔。就是说佛所讲的这个极为微妙之法，我今天没有完全得到，因为没有真正理解，没有彻底了解，还有疑惑，内心颇为自悔，所以叫尚纡疑悔。<br/><br/> 　　“世尊，若复世间一切根、尘、阴、处、界等，皆如来藏，清净本然，云何忽生山河大地，诸有为相，次第迁流，终而复始。”<br/><br/> 　　上面说自己心中还有疑，现在就要提问题了。“若复世间一切根、尘、阴、处、界等，皆如来藏，清净本然”。根尘就是我们的六根对六尘，阴是色、受、想、行、识这五阴，十二处是六根加六尘，这根尘相对各有处所，十八界就是六根、六尘，再加上六识，一共是十八界。假如象您世尊所说，这一切根、尘、阴、处、界统统都是如来藏性，都是清净本然，都不污染。因为本来就有，本自具足，既不是因缘所生，也不是自然所生，那么“云何忽生山河大地”？既然都是清净本然，为什么忽然之间生出山河大地？山河大地是从什么地方来的呢？“诸有为相”就是一切有为之相，一念无明所生出来的法，叫诸有为相。《金刚经》说：“一切有为法，如梦幻泡影”，就是说一切有形色和无形色，包括那些抽象的东西和概念，都是有为之法，都是从你的妄念生出来的。“次第迁流，终而复始”，这些有为法都在生住异灭、成住坏空里兜圈子，循环往复，周而复始。生了之后灭掉，灭了之后又再生，就这样生住异灭，成住坏空，循环不已，无有了期。这是什么道理呢？如来藏性是清净本然，不应该有生有灭，如果是无生无灭，山河大地又怎么生起来呢？他因为不明白，所以提出这样的疑问。下面还有一个问题：<br/><br/> 　　“又，如来说地水火风，本性圆融，周遍法界，湛然常住。世尊，若地性遍，云何容水；水性周遍，火则不生。复云何明，水火二性，俱遍虚空不相陵灭。世尊，地性障碍，空性虚通，云何二俱周遍法界，而我不知是义攸往。”<br/><br/> 　　这是第二个问题，刚刚问的是“云何忽生山河大地？”一切有为相，为何周而复始？那么现在的问题是，佛说地水火风这四大，本来都是圆融无碍的，各各互摄互遍，不相妨碍，湛然常住，不变不移。如果互摄互遍的话，“若地性遍，云何容水？”假如这个地性遍一切处，为何能容水呢？我们知道有大陆的地方就没有海水，有海洋的地方就没有大陆，因为地性与水性互不相容，如果地性遍及虚空，那就不应该有水啦。“水性周遍，火则不生”，地克水，水又克火，假如水性周遍一切处，那么火就应该不能生，因为水火是相克的，如果哪里起火了，我们浇上一桶水就灭了。假设水性周遍的话，尽虚空、遍法界到处都是水，就不应该有火。<br/><br/> 　　“复云何明，水火二性，俱遍虚空”？因为这二个东西是相克的嘛，前面是地同水不相容，这里水同火又不相容，那么有它就不能有我，有我就不能有它，两个不相容的东西不应该同时周遍法界。如果水火二性，能够同时俱遍虚空，那么它们彼此必须不相陵夺，不相陵灭，这个水不应该灭火，火也不应该灭水。可现在的实际情况是，水火从来都是互相陵灭，互相陵夺的，假如水的势力大，火就灭掉了，如果火的热量大，水也就被烧干了，明明在互相陵灭，那么这个俱遍虚空的道理，我实在是不明白。不但地与水、水与火分别是一对矛盾，这地性和空性也是一对矛盾，“地性障碍，空性虚通，云何二俱周遍法界”？因为通则不实，实即不通，如果地性周遍法界，就不应该有空性，如果空性周遍法界，就不应该有地性，它们根本就是相陵相夺的，为什么要说这二者能够同时周遍法界呢？因为地、水、火、风、空五大是有障碍的，彼此互不相容，说它们能够同时周遍法界，这个道理实在是讲不通。<br/><br/> 　　“而我不知是义攸往”，“攸往”者所归也，我实在不明白这个意义归到什么地方去，这七大种性怎么可能都是周遍圆融，彼此互不妨碍呢？实际上他是不明白前面所说的“性色真空，性空真色”的道理。既然说“性色真空”，那么这地水火风空五大的性色本来就是空的，它不是有相的。你现在讲的是有相的东西，有相之水，有相之火，有相之空，你着在这个空里面，空是暗相，说到底也是相，而真空连暗相也不可得。后面讲到 “空所空灭”，连这个空也要灭掉，因为有个空相也不对，所以说富楼那是着相了。说到地大有妄土之相，火大有妄火之相，水大有妄水之相，因为凡所有相皆是虚妄，你有分别心，你要执著这些虚假的东西，所以就障碍难行，就不能互摄互遍。譬如我们前面说过的，大可以容小，小也可以容大，只要你完全空掉相，大和小即可以互容互摄，如果要著相就有妨碍了。所以吕纯阳祖师见黄龙时说：“一粒粟中藏世界，半升铛内煮江山”。一粒米怎么把世界藏进去，你帮我藏藏看，象我多了不起，我懂得这个道理了。其实他并没有真懂这个道理，他不知道一粒米不但能藏这个世界，而且十方世界都藏在里面，因为它们都是空性，都不可得。你只要不着相，一切事物本来都没有妨碍，富楼那因为着相之故，所以才会有碍。<br/><br/> 　　“惟愿如来，宣流大慈，开我迷云，及诸大众。作是语己，五体投地，钦渴如来，无上慈诲。”<br/><br/> 　　因为我还有这两个问题，提出来要请你老人家解释。“惟愿如来，宣流大慈”，您讲的道理我不完全明白，但我知道佛是真语者、实语者、如语者、不诳语者、不异语者，不会胡说八道，所以请您慈悲，“开我迷云，及诸大众”。不是我一个人迷惑不解，这与会的大众他们也不理解，乃至于将来的众生，都不能够理解，所以要请佛慈悲再做开示。<br/><br/> 　　“作是语己，五体投地”，这番话讲完之后，对佛五体投地，以表无上钦敬之心。“钦渴如来，无上慈诲”，钦是仰慕，象渴极了的人急着要喝水一样，急切盼望如来赶紧开示无上慈诲，使得我们打开迷云，得见真道。<br/><br/> 　　“尔时，世尊告富楼那，及诸会中漏尽无学诸阿罗汉，如来今日，普为此会宣胜义中真胜义性。令汝会中定性声闻，及诸一切未得二空，回向上乘，阿罗汉等，皆获一乘寂灭场地，真阿练若，正修行处。汝今谛听，当为汝说。富楼那等，钦佛法音，默然承听。”<br/><br/> 　　世尊果然不负众望，看到大家这样焦渴，等着听闻无上教诲，于是“告富楼那，及诸会中漏尽无学诸阿罗汉，如来今日普为此会，宣胜义中真胜义性”。佛对大众讲，今天我要为富楼那，及法会中漏尽无学的大阿罗汉们，宣说胜义中真胜义的道理。“漏尽无学”，我们刚才讲过，漏尽就是断了见、思惑，已超三界，已了分段生死；无学就是四谛十二因缘的道理他都已经懂得，声闻、缘觉的道果他已经证到，不需要再学什么东西，所以叫漏尽无学。那么什么叫胜义中真胜义呢？“胜义”是对世法说的，世法是俗谛，不能超越生死，胜义就是离开世法，寻求出世间、了生死的解脱法，因为只能使自己了脱，所以是小乘法。小乘法对世法来说，已经是胜义了，但还不是上乘法。因为佛法分为三乘，声闻是第三乘，缘觉是第二乘，菩萨是一乘。“胜义中真胜义”就是说的这个一乘法，也叫上乘法或大乘法。大乘法非但能了你那个分段生死，而且可以了变易生死，所以它是胜义中的真胜义。今天我说的是大乘法，不是小乘法，我讲这个真胜义性，为的是要使你们法会中的定性声闻，明白我法二空之理，弃小向大，得入最上一乘。<br/><br/> 　　“令汝会中定性声闻”，所谓定性声闻，就是乘空自救。因听闻小乘法，悟偏真法性，得有余涅槃，于是就安住在那里，不想去度生，心甘情愿做自了汉。因为他们心量狭小，没有发过度生大愿，由听闻而解脱，不再求上进，这就是定性声闻。“及诸一切未得二空”，二空就是人我空和法我空，声闻和缘觉人我已空，但是法我还没有空，我虽然没有了，可还有法在，在他们看来还有生死可了，还有涅槃可证。小乘人还有这个生死之见，他看众生都在生死当中，而我自己已经了脱生死，证入涅槃，这都是法见。因为还有这个法见，只能了分段生死，不能了变易生死，所以叫未得二空。我们讲到修行，都是先空人，后空法。佛说法四十九年，实际上就是在讲这个二空之理，告诉大家人和法都是空的，都不可得。“回向上乘”，《楞严经》讲的是一乘法，佛告诉这些定性声闻，你们还没有悟到这个我法二空的道理，今天我要为你们讲说大乘法，使你们明白什么叫我法二空，都能够舍弃小法，不要再安住在偏小的位置上，要回到大乘的路子上来，所以叫做回向上乘。<br/><br/> 　　“阿罗汉等，皆获一乘，寂灭场地”。使你们阿罗汉都能获得一乘法，真正得到寂灭场地，这个寂灭场地就是佛地，不是小乘的那个偏真寂灭。我们说要真正证到这个二空的地位，因为人法二空就是不生不灭的寂灭地，就可了变易生死，所以说一乘寂灭场地就是佛地。“真阿练若，正修行处”。“阿练若”就是清静地，按照一般的说法，指的是寺院里面。“真阿练若”就是真正清静地，这个真正的清净地无处不清，无处不净，没有浑浊。我们平时的清静是相对污浊聩闹而有的。因为是相对的，那么就不是真阿练若。有的人说到山林里去好，山林里多清静啊，城市里面不好，城市里太喧闹了，这就不是真阿练若。真阿练若没有什么清静的分别，因为有清静，有不清静，这是我们的分别心，有这些分别说明你还着相。这个真阿练若是当体清净，没有分别的，所以是正修行处，就是修大法、修正法，不是修偏狭的小法。修行方法正确与否，关系非常重大，如果修行的方向不对，用功的方法不正确，就会出偏差。这个经后面讲到的十二类生，其中就有土木金石类，这个土木金石看起来同我们无关，其实有的就是修行人变的，那些人做死功夫，使劲压自己的念头，结果压得像木头、石头一样。假如我们修行的方法不对，就有可能变成魔王。魔王也曾经是修行人，他做过功夫，所以有力量，也有福报，就是因为方法不得当，由于著相而走入邪路，变成魔王。所以修行方法很重要，你要是不注意的话，一偏空就跑到了二乘里，死压念头会变成土木金石。如果是著相为神通而修，就变成魔王。比如现在做气功的，他们也蛮用功的，他练的是这个色身里的气，引着气在身体里面跑，让它打通我的三关和大小周天，慢慢地还可以出阳神。就算练出阳神了，因为你没有识得这个真性，不懂“性色真空，性空真色”的道理，执牢这个有相之身，所以还是不究竟，叫“依旧落空亡”，修不成正果。所以说修行的法门很重要，如果不得正确的修行法门，就不能称为正修行路。我今天要告诉你们的就是真正的修行法门。“汝今谛听，当为汝说”，你们现在要诚心诚意地听，把一切妄念都放下来，我要为你们讲说正确的修行方法。“富楼那等，钦佛法音”，富楼那和大众象聆听圣旨一样，恭敬得不得了。“默然承听”，大家都不再喧哗，不讲闲话了，静静地听佛说法。<br/><br/> 　　修行就应该从性起修，从我们的真性上用功夫，才是真正修行，离开性不论怎样去修都不对。我们必须时时刻刻明白什么是性，什么是相，对一切相都了了分明，知道一切男女老少、山河大地、日月星辰，都是我们性体所生，都是我们自性的妙用。要透过相来见性，识得这个性以后，就不要再从相上去分别，那么这样就叫真修行。你见性之后，才知道怎样去真正用功，如果不见性，任修何法都是盲修瞎练。因为你不知道什么为性，为什么会显现出这个相，那就免不了要跟着相跑。真正用功必须明心见性，就是这个道理。佛再三对大家讲，这个五阴、六入、十二处、十八界，乃至这个七大种性，都是我们的如来藏性，就是叫我们识得这个本性，不要再去着相。但是人们著相惯了，性与相的道理虽然懂一些，可遇到事情还是透不过，只要一开口就着相。比如有的人讲：哎呀！我这个业重啊！我这个业还没有消啊！这就是着相。什么地方来的业呢？根本就是你的妄念嘛。一切有为法皆不可得，既没有我这个人，也没有身，更没有物，那么这个业是从什么地方出来的呢？你执著业是由于不肯空这个相，因为着相的念头太坚固了，空不掉，所以时时处处固执有这个业，这也是业障，那也是业障，实际上根本就没有业，一切都没有啊。我们反复说不要执著那个业，你只管随缘应用，一切业障自然消陨。既然讲到缘，那么每个人的缘都不同，既有爱恨情仇，也有聚散离别，你如果把它执为实有，那么这里就有业，这个彼此互相牵绕的网就叫业缘。只要你万事随缘，无心于事，无事于心，不但这个缘不可得，连这个业也根本不可得。如果你一切不著，那么这个心就真空净了，它一尘不染，光明透脱，灵光独耀，迥脱根尘，虽不求神通，而神通自现。<br/><br/> 　　我们现在之所以生不出神通，是因为无明遮住了妙明真心，错认这个五阴、六入、十二处、十八界为实有，把本来无拘无束，神用无边的性体，封固在这么狭小的范围里。前面我们讲过这个十八界，所谓界限都是我们的妄想执著出来的，其实这个界限根本就不可得。只要你把妄想拿掉，界限拆除了，那么神通自然就来了，就象一望无际的旷野，本来没有什么界限，你树起篱笆墙才有长短方圆的界限，如果把篱笆墙撤掉，界限就没有了。神通也是这个道理，它本来是一精明，具足一切神用，你被妄想障住了，它就不能发通，你把这个妄想打破之后，封固它的界限没有了，这个神通不用求它自己就来了。所以只要时时心空，自然就会有神通，但是虽然有而亦无可住、亦无可执，因为我本来就是如此，那些神用都是我本有的家珍，不是从外面得来的，有什么值得炫耀的呢？从前因为妄想执著，覆盖了它的光明，现在妄想破掉了，光明又重新放射出来了。所以说以前神用不通，是因为错认妄相，有界限的遮障，今天我识得这个本性之后，不再著一切相，这个界就没有了。接下来还要进一步消除我们的习气，多生历劫的习气非消灭不可，所以见性之后回过头来用功，就省劲多了。你识得本性之后再念佛，跟从前就不一样，以前念佛是盲修，不知这个佛号落在什么地方，一句一句的“阿弥陀佛”，不知念的是什么。有的人是执著功德，我每天要念多少遍佛，这样我就可以积累多少功德；有的人是执著钞票，我念阿弥陀佛可以为我消灾，可以保佑我发财。都有住着，都有所求，其实不相干。你见性之后念阿弥陀佛，可以打扫自己的妄想，把习气消灭，使妄心变成佛心。如此则行住坐卧当中，自可打成一片。这样用功才得力，这样用功才是真正用功，才是正修行路。<br/><br/> 　<strong>　（一）世界相续</strong><br/><br/> 　　“佛言，富楼那，如汝所言：清净本然，云何忽生山河大地？汝常不闻如来宣说，性觉妙明，本觉明妙？”<br/><br/> 　　佛对富楼那讲，你问我这个清净本然，为什么忽然生出山河大地来，你应该经常听我讲到“性觉妙明，本觉明妙”。怎么叫“性觉妙明，本觉明妙”呢？这个“性觉”指性中之觉，整个性体就是觉，觉就是这个性体，不是两样东西。“妙明”者，它本来能够了了分明，无所不知，无所不了，这个明就是觉，觉就是明。这个妙明虽然是无所不了，无所不知，而实无所了，实无所知，既无所执，亦无所住，故称之为妙。因为这个性觉能生起无尽妙用，所以叫做性觉妙明。那什么是“本觉明妙”呢？这里的本觉是妄觉，无明就是不知不觉，因为是妄觉明妙，把它颠倒过来了。什么是明妙呢？这个妙是妙体，就是个觉体，觉得有个觉体，有个东西为我所明。因为这个时候还没有山河大地，无明妄动的时候，我在这里不动，但是觉得有个东西，把妙觉之体当作一样东西来所明。就好比这个录音机，它能录音能放音，于是把妙觉之体当作一个录音机来为我所明，“我有个录音机在这里，我有个灵觉在这里”。这又叫觉明空昧，他自己固执他的觉，这就是头上加头，在觉外有明，明外有觉，把觉和明分开来，那么觉就不是明，明也不是觉了。本觉是妄的根本，由妄之根本的觉，来明这个妙体，把这个觉体作为所明，如此就有能明与所明，就有能所相对。能所相对有两个东西在里边，凡相对而有的东西都是虚妄不实的，不是真正实有的，这两句话很重要，弄懂了之后才能接着往下讲。<br/><br/> 　　这里的“性觉妙明，本觉明妙”，性觉妙明是本性之觉，这个妙明就是无所不明，无所不了，但是亦无所明、无所了，不着明与不明、了与不了的相，是没有能所的。换一句话来讲，这个性觉妙明也可以说：明就是觉，觉就是明。下面一句“本觉明妙”，就是觉外有明，明外有觉，觉能生明，明能够把觉作为所明，这样一来明和觉就变成两个东西了。前后两句有这样的差别，我们把这里的意思搞懂，后面讲的就容易理解了。<br/><br/> 　　“富楼那言：唯然，世尊，我常闻佛宣说斯义。”<br/><br/> 　　富楼那讲：是的，是的，我常常听你老人家讲这个性觉妙明，本觉明妙。那么接下来佛要问他了。<br/><br/> 　　“佛言：汝称觉明，为复性明称名为觉，为觉不明称为明觉？”<br/><br/> 　　既然你说常常听我讲这个意思，那么我来问你，你所说的这个觉明，是把性明称名为觉呢？还是把无所明称为明觉呢？性明就是有所明，是将有所明称名为觉，还是将觉不明称名为明觉。这里是在问他，一个有所明，一个无所明，这两个你认为哪个称名为觉。这里问他的两句话，不管是有所明，还是无所明，答哪句都不对。因为有所明是妄觉，无所明是不觉，不觉便是无明，妄觉和无明皆非正觉。因为富楼那不明白这层意义，同凡夫的见解一样，在这里执著，要有所明，所以他接着讲了：<br/><br/> 　　“富楼那言：若此不明名为觉者，则无所明。”<br/><br/> 　　富楼那说：假如这个不明能够称为觉，那么这个觉就变成无明了，“则无所明”，就不会有他的所明，觉如果不能有所明，即不能称之为觉。这个意思反过来说就是应该有所明，因为有所明才为觉嘛。在这里富楼那同我们凡夫一样执著，他认为所谓觉者是应该有所明的，不是无所明，如果觉无所明，便是不觉了。既然不觉，便是一点知觉都没有，没有知觉还有什么觉不觉呢？所以他的意思是说，既然称之为觉，就应该是有所明。<br/><br/> 　　“佛言：若无所明，则无明觉。有所非觉，无所非明，无明又非觉湛明性。”<br/><br/> 　　佛在这里对他讲，假如没有所明，当然也没有明觉。那么我要告诉你：“有所非觉”，因为这个觉不同于物体，我们的知觉不是所看到的东西，不是外面有相的物体，这个觉不是有相之物。假如觉有所明，那它就是个东西，是个物体，是个事物了。如果是个事物，怎么能称之为觉呢？所以说“有所非觉”，既然有个所，当然就不是觉了。因为这个知觉的觉，不同于事物，与外面的事物是有差别的，你有所明，你把这个觉当成你的所明，这个觉已经变成个事物，所以就不能再称之为觉了。这就是有所非觉的意思。那什么是“无所非明”呢？所谓明是对外界事物的认识、分析和了别，因此有东西才有明，没东西就不能称之为明。譬如外面有张三、李四坐在那里，我知道这是张三，那是李四，这就是因为有了所（张三、李四）才有的明。如果外面没有张三、李四，怎么能称之为明呢？你明了个什么东西呢？你只能明个空，空无所有不能叫明，所以说无所非明，没有所就不是明了。如此一来有所无所都不对。那么你也许会说，我可以明个无明呀？假如你明了个无明，“无明又非觉湛明性”。我们说过这个觉湛明性中的湛，是不动摇的意思，因为我们的明性是了了分明，了了常知的，它没有断处，具足一切，能生万法，不同于木石般无知无觉。如果你以这个无明为觉，无明黑暗一片，里面没有东西，那你就不是觉湛明性，不是觉体，所以不但说有所非所都不对，说无明更加不对。否定有所、无所和无明，为的是打破你的妄想，使你明白这个觉之外没有明，明之外没有觉。你如果觉外有明，明外有觉，就有能所的对立，我们说过由能所对立，妄念就会发动，那么山河大地就生起来了。你要问山河大地是怎样生起的呢？《楞严经》告诉你就是这样生起的。当你妄念动了以后，那个一念无明就把你这个觉体，这个妙湛之体当作你的所明，因为有能有所，你妄动得就更加厉害，所以这个有明实在是妄明之本。大家不懂得这个道理，都以心思活泛、头脑机灵为好，总在羡慕别人：哎呀！这个人真聪明，什么事情都知道，样样知识一学就会。不知道越聪明越坏，因为知见越多，执著和挂碍就越多，这叫世智辨聪，都是所知障，能障碍我们的正觉之道。因为大家都不觉，都以这个有明为觉，所以赵州老和尚说：“老僧不在明白里”，为什么呢？因为你的有明其实都是无明、妄明。你以为自己精明得不得了，样样事情都要精打细算，算得比谁都厉害，不知道这都是生死的根本，都是妄念啊！所以说不但是普通人，不但是阿难这些未尽无漏的初果罗汉，不懂得这个道理，就连富楼那等漏尽无学的大阿罗汉，亦复如是，都在这里以明为觉，把这个有所明当成是觉。有所明实际上是妄想、妄影，因为认取这个影子，那么山河大地等就生起来了。<br/><br/> 　　“性觉必明，妄为明觉。”<br/><br/> 　　这两句也很重要，前面讲你认取的这个是无明，非觉湛明性，因为性觉这个湛然之体非如木石，它是了了常知，没有间断。它既无能知，亦无所知，觉就是明，明就是觉，所以说“性觉必明”。性觉不要觉外生明，也不要明外生觉，它是一个东西，如果你把它当作两个东西，那么就有能有所，因为有能所之故，就“妄为明觉”。你认为有个能觉，认为自己有所觉悟，如此即生出能与所的对立，我们说过相对的东西都是虚幻的，所以说般若无知。般若的性体是无能知，无所知的，有能有所是妄觉，而非真正的性觉。禅宗为什么要参话头呢？他给你一个无意义的话头，叫你参“念佛是谁”，就是要把你的妄想全打光，使你的性觉从妄想中超脱出来。平时我们都是有所明，你静下来好好看看自己的内心，都有东西在那里，整天想着张三怎样，李四如何，所以宗下说“驴事未了，马事又来”，混乱得不得了，都是因为有所明，所以才会想那些乱七八糟的东西。因为般若无知，既无能也无所，当你参到能所双亡，根尘啪地脱开时，离能离所的绝对真心即会灼然而出。<br/><br/> 　　佛知道你这个是无明妄动，因为你有能有所，所以都是妄想。讲到真正的妙觉明性，实际上根本就无可言说，非但小乘的声闻、缘觉，和大乘的菩萨无法开口，就连三世诸佛也无开口处。因为开口即非，开口就不是，开口就有能所。所以宗下讲到末后一句，最后一着，都是无言而归方丈，因为实在没办法说了。象傅大士讲《金刚经》，才上法座用戒尺在桌子上拍一下，随即下座，宝志公于是说：“大士讲经竟”。傅大士为你们讲这个《金刚经》，他已经讲完了，因为这个妙觉明体，无法用语言文字来形容表述，“开口即非，拟议即乖”，连圣贤亦无开口处。但是反过来说，我们要的是活法，不是死法，我们既要认得离言绝虑的性体，也要现种种形，现种种相，起无边妙用。那么既然要起妙用，要现种种形、种种相，为什么还要我们脱开这个相呢？因为脱开相之后，才能见到这个本性。所以必须先识得本性，识得这个本性之后，回过来再起妙用，如此才能超脱分段和变易二生死。由证体再起用，就知道所有一切世间之物，都是我这个真心，真心即是法界，法界即是真心，所以“无不从此法界流，无不还归此法界”。一切山河大地，一切鸟语花香，尽是法界宣流，所以统统归到这个法界里面。你如果只知空不知有，只认性体不起妙用，说明你还有住着，还住在偏真的窠臼里。所以大乘佛法是积极入世，不是消极遁世的，假如死守着空，不敢到五浊恶世救度众生，那是小乘自了汉，因为他偏到空里，不是空有不二。我们懂得这个道理之后，就明白性与相的关系，就象镜子与影子一样，镜子可以照物，有镜子必然有影子，假如没有影子即不成为镜子。我们的真如佛性也是这样，因为性空所以能现一切相，因为出生一切相所以性体必然是空的，真如佛性不但空灵寂静，还能生出万千妙用，假如不能生出万法来起用，则不能称为真如佛性。这一句中同时包括了体相用，如同《金刚经》所说：“所谓佛法者，既非佛法，是名佛法”。<br/><br/> 　　“性觉必明，妄为明觉”，这个性觉不是死的，是了了常知，是无所不明的，在这里明就是觉，觉就是明。假如你把它分开来，有觉有明，或者觉为明所明，或者明为觉所觉，那就分明着在相里了。<br/><br/> 　　“觉非所明，因明立所。所既妄立，生汝妄能。”<br/><br/> 　　“觉非所明”，我们刚刚讲了，觉就是觉体，这个觉体不是你明的对象，不是你明所明的那个觉，这个觉跟明是相对的。因为觉体本非所明，你将性觉错认为明，就是把你的真如妙体作为明的所明，成为所明的对象，这就是“因明立所”。因为你的明要有对象，他的对象就是所明，于是“因明立所”，在觉外又生出明。这个明是妄明，妄明就是所明，以所明为觉，觉就是所明，所以说是因明立所。“所既妄立，生汝妄能”，既然有所明之物，当然有能明之心，有能明的妄境，就有所明的妄心，心境的这种相对，就生出《大乘起信论》所说的“业相、转相、现相”这三种细相。我们动了心，在觉之外有了明，这个明就是无明，就是业相，业相就是这么起的。业相起来之后，生出能明、所明，这就是转相，转向虚妄，钻到有相里面跑了。我们说本来是无相，本来没有山河大地，就是因为这个无明妄动，自己以为有个能觉：我能感觉到有那些东西，我明明是有觉的嘛。这样一来觉同明就分开来，变成两个东西，生出了《起信论》所讲的“三细”，再由细相生起粗相，于是山河大地等就立起来了。所以：<br/><br/> 　　“无同异中，炽然成异。”<br/><br/> 　　所谓“无同异中”，是说在念未生之前，我们这个真如佛性，既没有同，也没有异，当体就是一真法界，所以根本无所谓同异。但是，因为在无同异中，生出同异之见，于是“炽然成异”。什么是同异之见呢？就是觉外有明，明外有觉。有个觉体为你所明，那么在无同异中，就分出来个异。“炽然”就是动得更加厉害，更加猛烈，就象火烧起来以后，烧得越来越旺，在生出同异之后，再异上加异，这就是炽然成异。因为动得越来越厉害，在异上又加异，这时候地、水、火、风等几大种性依次现形、现相，我们刚才说三细是业相、转相、现相，现在这个虚幻的相要转为现相了。种性一起，就会生出分别，我们开始分别这是什么，那是什么，这就是现相，现相之后就要分别。懂得了这个道理，就知道山河大地都是由妄动动出来的，如果不妄动，就没有这些事情，这个叫做觉明空昧。在你有了觉之后，蹲在里面往前看，这个时候虽然没有眼睛，没有根尘，但是有一个要看的念头。比如我们做梦的时候，虽然感觉不到这个身体，但还是感觉到自己在看，这个能看、想看的知觉性并没有消失。 <br/><br/> 　　(异彼所异，因异立同。同异发明，因此复立无同无异。如是扰乱，相待生劳。劳久发尘，自相浑浊。由是引起尘劳烦恼。起为世界，静成虚空。虚空为同，世界为异。彼无同异，真有为法。觉明空昧，相待成摇，故有风轮执持世界。因空生摇，坚明立碍，彼金宝者明觉立坚，故有金轮保持国土。坚觉宝成，摇明风出，风金相摩，故有火光为变化性。宝明生润，火光上蒸，故有水轮含十方界。) <br/><br/> 　　…………<br/><br/> 　　觉之外有明，明之外有觉，这就是妄觉，由能所对立而起动摇，再因动摇之故生出五大种性，这即是无明三细中的现相。有幻动才生幻相，若五大种性不生出，就没有世界生起。反过来说，这些相就是实相，对于处处执着的凡夫来说，那是幻相；而佛菩萨是应缘起妙用，那么就是真实相，这就是性体的光明。一个真、一个妄，就在你转念之间，不在所对的境上。如果你执着，这就是妄；你不执着，这就是真，这就是见性，你只管随缘起用好了。一真一妄都是你自己的分别，不在物体，跟外面的事物没有关系。<br/><br/> 　　“火腾水降，交发立坚。湿为巨海，干为洲潬。以是义故，彼大海中火光常起；彼洲潬中；江河常注。水势劣火，结为高山。是故山石，击则成焰，融则成水。土势劣水，抽为草木。是故林薮，遇烧成土，因绞成水。”<br/><br/> 　　这里开始讲由水火的各种变化，如何生出山河大地、草木万物。“火腾水降”，火性向上飞升，所以叫火腾；水性向下流注，所以叫水降。水火之性是一个升腾，一个下降。“交发立坚”，交发是互相帮助、互相资助的意思，立坚是成就坚固的陆地，要水与火互相资助才有陆地。在我们这个地球上，潮湿的部分是大海，“湿为巨海”。干燥的部分是陆地，“干为洲潬”。在四面海水中，大的陆地是洲，比如亚洲、非洲、欧洲、美洲。小的陆地是潬，比如台湾、海南岛等大小岛屿。我们这个世界不光有陆地，不光有海水，还有火，要水火交织而成陆地。“以是义故，彼大海中，火光常起”。因为水火是互相资助的，所以大海之中常有火光。你们不要以为大海里面没有火，是真的有火，报上都登过的。“彼洲潬中，江河常注”，在大陆和海岛上，常有江河流注。比如我们中国有黄河、长江，还有其他大小河流，江河竞注，最后都要流入大海。水与火不但相克，而且还可以互相资助，就是火里有水，水里也有火，所以火性才能周遍。科学家也在研究，为什么海里有大火升起来，他们经过调查，认为是由海底的火山爆发，所以喷发出大火。<br/><br/> 　　“水势劣火，结为高山”， 因为水与火相合而成土，如果水的势力小于火，就是火多水少，那么就拔起来成为高山。“是故山石，击则成焰，融则成水。”如果用石头互相击打，就会有火星冒出来，我们叫击石取火。那么石头融则成水，比如下大雨山洪爆发了，土石随水而下，叫泥石流。“土势劣水，抽为草木”，如果地大的势力小于水大，就是水势多、土势少，土势劣水，那就抽为草木了，所以草木是由水势多而成的。“是故林薮，遇烧成土”，所以草木一烧就变成了灰，灰尘就是土。“因绞成水”，绞就是挤榨，草木一绞就变成水了。<br/><br/> 　　这个世界上的东西，都是互相资助而成的，比如草木丛林就是由水土交资而成，它遇烧成土，因绞成水，离开水土即无草木。那么非但草木，就是洲潬、江河等等，也都是相互资助而成。世界上一切东西，包括我们人，都是四大和合成功的。地球是地、水、火、风，地上的东西也是地、水、火、风。象这个山林树木，如果不是四大和合，就不能生出。我们现在被法见束缚了，只看见物体的表面现象，识不透内里四大的关系，以为火就是火，水就是水，土就是土，风就是风，彼此互相克制、互相隔碍，不知道它们其实是相互依存、相辅相成的。比如这个树林，不但有水土，也有火风，我们钻木可以取火，树里面包含火好理解，那么风和树木又是什么关系呢？风是循环流动的意思，树木能够吸水份，把水从地下吸到枝叶上去，这循环就是风。还有我们人体里面的呼吸，和血液、消化这两个循环也都是风。再有风吹到树木，树会跟着摇摆，这也是风啊。所以一切东西都是由四大和合而成，四大因为变化的不同，当中哪一样多一些，哪一样少一些，就导致事物有种种千变万化。<br/><br/> 　　“交妄发生，递相为种。以是因缘，世界相续。”<br/><br/> 　　上面答复了富楼那所问世界如何形成的问题，这里回答世界为什么会相续不断。“交妄发生，递相为种”，四大本来都是妄想出来的，它们彼此再互相资助，由这种幻动促成山河大地、草木丛林等种种不同的东西。这些事物递相为种，彼此互相为因、互相为果。这一切幻境都由幻动而来。我们刚才讲过，因为执著取相之后，就会生起业相。有了业之后于是业系苦相。造业之后要受报，过去所种的因，到现在就变成果，有了现在的果又要去造未来的因，这因因果果变化无穷，永不停息。我们常说：“欲知前世因，今生受者是”，你前世做了什么事情，看看你今生的遭遇就知道了，你今生如果享福，说明前世曾经修善积德；今生如果受苦，说明前世曾经做恶造罪。“欲知将来果，今生做者是”，想知道将来会怎么样，只看你今生做得如何，所谓“种瓜得瓜，种豆得豆”，因果就是这样准确无误。“交妄发生”，就是彼此交错着，由因感果，果再生因，因再变果，因因果果彼此交妄，于是“递相为种”。就象一个转动的车轮，下面可以变到上面，上面也可以转到下面，因可以变成果，果又会再变成因，所以说是递相为种。我们八识田里历劫多生以来，含藏了各种各样的种子，遇到缘就会生成为果，果又会变成因，感应出新的种子，这就是递相为种，因因果果永无止息。第八识之所以又叫藏识，就是因为有这个含藏种子的能力。世界为什么能够相续不断，在成住异灭之后，又接着成住异灭，就是由于这个因缘，因为因能生果，果又能生因，象个轮子一样可以永远转下去。<br/><br/> 　　佛经讲地、水、火、风四大种性，如果再加上空大，有五大种。而我们中国人古时候习惯讲金木水火土这五行，包括道教里也是讲这个五行，五行顺则相生、逆则相克。四大与五行有相似的地方，五行中的金摄在四大的地大里面，四大中虽然没有木大，但是也说木是由水土互相资助而成。所以有的人讲《楞严经》的时候，就配合我们中国人的金、木、水、火、土这五行来解释，其实这样讲也不是不可以，只要能够帮助我们理解经上的意思，都可以拿来借用。比如释迦佛在世时也常借用外道的东西，佛有许多咒是外道和魔王供养的，外道魔王因为著相之故，这些咒在他那里就是邪法，而佛空一切相，随取何物皆是称性而用，那么邪咒也可变为正法。法本身并无邪正之分，要看是谁在用，魔王献给佛的咒，佛用起来就是佛咒，就不能再说是魔咒。佛讲法的时候，总是在随顺众生的习惯，四大是古印度人对物质本源理解的产物，和我们中国人所说的五行是一样的道理，在佛降生以前就有了。释迦佛讲四大种性是在随顺众生的机宜，类似的情况还有很多。我们可以利用五行相生相克的道理来帮助理解《楞严经》，但是不能够说《楞严经》就是讲五行的。假如说《楞严经》是讲五行生克，那么法相宗的人就要发难了，因为印度人不讲五行，这个五行是中国人讲的。如果这个《楞严经》真是佛说的，是从印度翻译来的，应当没有五行相生相克，你现在讲了五行，那么显然是中国人伪造的。自从《楞严经》传到中土，怀疑否定的声音就从来没有断过，法相宗就有不少这样的人，日本也有很多这样的人。</p><p style=\"text-align: justify;\"><strong>（二）众生相续</strong><br/><br/> 　　“复次，富楼那，明妄非他，觉明为咎，所妄既立，明理不踰。以是因缘，听不出声，见不超色，色香味触，六妄成就。由是分开，见、觉、闻、知。” 　　<br/><br/> 　　这是在讲六根不能互用的原因。“明妄非他，觉明为咎”，这个妄就是无明，告诉你这个明妄不是别的原因，就是认明为觉的过错。我们认明为觉，把觉与明分开，在明外有觉，觉外有明，所以叫觉明为咎。这个无明不是从别的地方来的，因为你在觉外立明，明外立觉，于是才生起这种明妄的过错。“所妄既立，明理不踰”，你有能有所，有能明有所明，有能明之心和所明之境，你固定了这个能所的境。在着这个境之后，你所明白的道理就不出这个范围之外，你认为只有这个眼能够看得见，眼睛只能看而不能闻，离开眼睛你就无所见了。因为你执着所见之境，这个界限就固定了，那么眼根的作用就不能超出这个范围，所以“明理不踰”。你所明之理是这能明的心与所明之境相合而成的，不能超出你所明的范围。<br/><br/> 　　“以是因缘，听不出声，见不超色”。因为这个缘故，你的耳朵只能听声音，它的作用不能超过声音之外；你的眼睛只能见色相，它的作用也不能超出色相之外。就是眼不能听声，耳不能见色，眼耳的功能被你隔开来，给它立了个界限，这就是妄觉。因为觉外有明，有能明就有所明，根尘相对，这个根只能明了这个尘，其它尘就不能明了，所以六根就隔开来不能互用了。“色香味触，六妄成就。”六根分开以后，由眼耳鼻舌身意这六根，对色声香味触法六尘，六种虚妄之心就生起来了。<br/><br/> 　　“由是分开，见觉闻知”，我们的如来藏性本来是一精明，没有界限没有隔碍，是一体相通的，现在这样一分，就有了界限和隔碍。见觉闻知就是我们的六根，见是眼根，闻是耳根，觉是鼻、舌、身三根，知是意根。由于你有执著，一精明就被分出这样的界限，于是六根的功能各有局限，不能互用了。这是我们自己妄生分别，因为执著这个相分的缘故，所以“由是分开，见觉闻知”。<br/><br/> 　　“同业相缠，合离成化。见明色发，明见想成，异见成憎，同想成爱，流爱为种，纳想成胎，交遘发生，吸引同业。故有因缘，生羯罗蓝、遏蒲昙等。”<br/><br/> 　　上面讲六根是怎么分开的，这里讲胎卵湿化四生是怎么形成的。我们说过众生的业有共业与别业之分，由同分、别业两种妄见，分别形成共业和别业。“同业相缠”，就是大家的业是差不多一样的，由这样同一类型的众生缠绕在一起，形成共同的一类，彼此分不开。比如我们常说的天、人、修罗、畜生、恶鬼、地狱，这六道各有各的业。修十善者可以升天，随善业之多少有三重二十八层的分别；做恶多者则会下堕，因三毒之轻重而有畜生、恶鬼、地狱这三途；善恶相杂是为人类，而人中亦有上、中、下等的差别。所以业一样的总要互相缠绕在一起，比如儿子同爹娘都是同一个业，才来到同一个家庭，如果业不同则不共处一室。“合离成化”讲的是离与合之关系，交往不多的就是离，执着在交互上的就是合。天地化育之功种种不同，是在合离上区分的。<br/><br/> 　　“见明色发”，这里的明就是光明，这个光明就是业缘。我们举例来说，比如某个人死了，他的识神已经离开了原来的身体，后面的身体还没有成，当中这个身体叫中阴身，就是我们普通所说的鬼魂。这个鬼魂在中阴境界里，当他的业缘发了，于是有亮光照出来，他会看见与自己有缘的父母在同房，假如这个缘没有发的时候，就是一团黑，什么都看不见，所以叫做见明色发。这个色就是同房的父母，他看见父母在那里同房，他的心就跟着动了，因为这里是欲界，是淫欲世界。这个世界上的人要了生死，必须先要了这个淫欲心，淫心不除，尘不可出。有人要问：夫妻之间是正淫，是不是可以维持？不行，不能维持。因为你这个淫欲心不了，总要藏在八识田里，一旦到了中阴境界，见了境界这个淫欲心就在动了，又要投胎而去，所以生死不能了。假如你淫欲心真正都消光了，那么即使漂亮的美色当前，即使在你面前交遘转淫，你都不动心。密宗里有欢喜佛，有双身法，那是无上密乘中的大法，必须要离欲以后才能修。但是现在的人糊里糊涂，什么都不懂就瞎来，随随便便就要修双身法，他自己的淫欲心还未曾了，就去修什么双身法，两个人都下地狱有份。淫欲心真了的人，他对这个事情一点都不动心，什么样的美色当前他都视如未见，要这样才行。<br/><br/> 　　禅宗有个婆子烧庵的公案，那个婆子供养一个和尚二十年，每天都叫个大姑娘到草庵去送饭。后来这个婆子想，我供养他这么多年，要看看他修得怎么样，于是对送饭的姑娘说，你明天把饭送给他以后，上去抱住他，问问他是什么感觉。第二天那个大姑娘果然依婆子所嘱，把饭菜往地上一放，抱住庵主问他感觉如何？那和尚回答：“枯木依寒岩，三冬无暖气”。就象死树靠在寒冷的岩石上，一点感觉也没有。好功夫哇！美色当前不是人人可以做得到的。哪知婆子听到汇报，反而骂道：“二十年来只供养了个俗汉”！于是放火烧了他的庵。这个和尚是在死执法，那个大姑娘抱着他，他能不动心，看起来是好功夫，实际上做的是死功夫，这样不行啊！你要真能够不动，必须在事上不动，做到随意自在才算数。<br/><br/> 　　我们以前讲过的宝志公和老古椎的故事，粱武帝为了比比他们谁的功夫好，于是找些宫女陪二人洗澡。宝志公是真功夫，与裸女嬉笑追逐，一点事也没有，而那个罗汉开始时还能应付，过一会就受不了啦，把眼睛闭了起来，到后来实在把持不住，赶紧起身逃走了。所以死压念头不行，要真有这种本事才算数。<br/><br/> 　　因为这个“见明色发”，于是“明见想成，异见成憎，同想成爱”。什么是明见想成呢？就是由于你的无明妄见，见到这个相之后心动了，想要加入进去。为什么是想成呢？因为中阴身没有肉体，这个时候他想象自己有个身体，于是跑上前去。“异见成憎，同想成爱”。为什么会有异见呢？他如果觉得自己是个男人，就欢喜这个女人，因为是一男一女二人同房，他讨厌这个男的，要把这个男人拉开，叫“异见成憎”。假如他觉得自己是个女人，就会欢喜这个男的，而讨厌那个女的。讨厌那个和自己性别一样的人，嫌他在这里碍事，心里面憎恨，就叫“异见成憎”。那么反过来就是“同想成爱”，他如果觉得自己是个男的，就欢喜这个女人，假如觉得自己是个女的，也会欢喜这个男人，男爱女、女爱男，所以叫同想成爱。他喜欢谁就会去抱着谁，而用背对着他讨厌的人。我们到妇产科去看看，男孩子生出来的时候，都是面孔朝里，面向着母亲，女孩子生出来的时候，都是面孔朝外，背对着母亲。我问过几个妇产科医生，他们说确实是这个样子。所以佛经上讲的都是真事。佛具五眼，在肉眼以外还有天眼、慧眼、法眼、佛眼。你是怎么样入胎、成胎的，他都看得清清楚楚。中阴身有神足通，不管千里万里，只要念头一动就到了。中阴身就是这个这样子，因为喜欢异性，异性之间是同想，讨厌同性，同性之间是异见，所以说“异见成憎，同想成爱”。<br/><br/> 　　“流爱为种，纳想为胎”。流是流精，男的到这个时候精液射出来了，他觉得是自己在行房事，“流爱为种”，流出精液成为入胎的种子。“纳想成胎”，他以为是自己在同那个女子同房，跟着所想象的景象，跑到女人的子宫里面蹲着，于是就成胎胞了。“交遘发生，吸引同业，故有因缘，生羯罗蓝，遏蒲昙等”。所以胞胎都是……<br/><br/> 　　“胎卵湿化，随其所应。卵惟想生，胎因情有，湿以合感，化以离应。情想合离，更相变易。所有受业，逐其飞沉。以是因缘，众生相续。”<br/><br/> <strong>　　（三）业果相续 </strong><br/><br/> 　　………… <br/><br/> 贰、修道分 <br/><br/> 　　………… <br/><br/> 　　　　　　　　 《楞严经》卷第五<br/><br/> 　　　　　　　　 《楞严经》卷第六<br/><br/> 叁、证道分 <br/><br/> 　　　　　　　　 《楞严经》卷第七<br/><br/> 　　　　　　　　 《楞严经》卷第八 <br/><br/> 肆、精研七趣五阴 中中流入大圆觉海 <br/><br/> 　　　　　　　　 《楞严经》卷第九<br/><br/> 　　　　　　　　 《楞严经》卷第十</p><p style=\"text-align: justify;\"> </p><p><br/><br/></p></p></div>"
}]