[{
    "title": "【大佛顶首楞严经卷一】",
    "author": "净慧大师",
    "date": "",
    "html": "<div class=\"B1_text\"><p style=\"text-align: center\"><img alt=\"&#x51C0;&#x6167;&#x6CD5;&#x5E08;&#x300A;&#x695E;&#x4E25;&#x7ECF;&#x300B;&#x6D45;&#x8BD1;\" src=\"https://www.hrfjw.com/uploadfile/2016/0711/20160711113401244.jpeg\" style=\"width: 363px; height: 225px\" title=\"&#x51C0;&#x6167;&#x6CD5;&#x5E08;&#x300A;&#x695E;&#x4E25;&#x7ECF;&#x300B;&#x6D45;&#x8BD1;\" /></p><p><strong>　　(注：此法师非净慧长老，而是东北的<a href=\"/fjrw/hcrw/jhfs/\" class=\"keylink\" target=\"_blank\">净慧法师</a>)</strong></p><p>　　诸山长老，诸位仁者：南无本师释迦牟尼佛（三称）</p><p>　　今天，经诸位请求，我们共同读诵、<a href=\"/remen/shouchi.html\" class=\"keylink\" target=\"_blank\">受持</a>《大佛顶首<a href=\"/fojing/lengyanjing/quanwen.html\" class=\"keylink\" target=\"_blank\">楞严经</a>》，也是讲这部经的缘起！这部经非常重要，不论声闻、缘觉还是行<a href=\"/remen/pusadao.html\" class=\"keylink\" target=\"_blank\">菩萨道</a>的人，不读诵这部经<a href=\"/remen/zhihui.html\" class=\"keylink\" target=\"_blank\">智慧</a>不开、智慧不足，在<a href=\"/remen/xiuxing.html\" class=\"keylink\" target=\"_blank\">修行</a>过程中遇见一些境界处理不了，在弘法过程中一些义理释解不了。这部经是佛入<a href=\"/remen/niepan.html\" class=\"keylink\" target=\"_blank\">涅槃</a>后，阿难尊者记录；在古印度曾被视为国宝，不准带出本国。在唐玄奘法师取经前，印度僧人般刺密谛法师观察到<a href=\"/remen/zhengfa.html\" class=\"keylink\" target=\"_blank\">正法</a>在印度兴盛，像法与末法将在震旦（即现在的中国）光大，誓愿一定要将这部经带到那里。但那个时候边境检查严格，他就将自己的肋部割开，把经书藏在肋下的皮肉里带入震旦并译。当时，这部经非常珍贵。</p><p>　　这部经重要之处还在于，此经住世，魔王就不能在这个世界上横行。这部经是<a href=\"/\" class=\"keylink\" target=\"_blank\">佛教</a>大乘经典中，于末法后世，将要最先陨落的一部经；因为这部经透露一些天地运转秘密，魔王最恨这部经，也最怕这部经。现在就有人说这部经是伪经，不是佛说，是古人模仿说。宣化法师讲，“我保证这部经是真经，如不是佛说的，我愿堕<a href=\"/remen/diyu.html\" class=\"keylink\" target=\"_blank\">地狱</a>。”我相信他，因为他是释迦牟尼佛当初的一位大<a href=\"/remen/dizi.html\" class=\"keylink\" target=\"_blank\">弟子</a>，乘愿再来，到这个世界上就是来弘法的，他说的是准确的。我再跟诸位讲，我亲自见证这部经是真经。我第一次讲这部经时，满室清香，有一些祥瑞；嗅到清香的不光我一人，道场听法者也嗅得到，在座诸位当中就有当时嗅到的人。听经的一位<a href=\"/wenda/jushi/\" class=\"keylink\" target=\"_blank\">居士</a>回到家里，家人也能嗅到其身上香味，这种香不是<a href=\"/remen/shijian.html\" class=\"keylink\" target=\"_blank\">世间</a>的香，一个多小时不散失。我现在在经书上就可见<a href=\"/remen/sheli.html\" class=\"keylink\" target=\"_blank\">舍利</a>。我在咸阳博物馆瞻仰佛的真身舍利时，右绕三匝，立即感到力量无穷，身体像宇宙那么大。当时有人怀疑，这是不是佛的真身舍利。我说这是佛的真身舍利，一点不谬，因为我<a href=\"/remen/ganying.html\" class=\"keylink\" target=\"_blank\">感应</a>有种无穷无尽的力量。一旁的解说员说，“您是第二位敢这么肯定的人，第一位是一位台湾来的老和尚，为了辨明是不是佛真身舍利，四天四夜就跪在这里，不吃不喝，最后他说这是真的。你用这么短的时间就辨明是佛真身舍利，真不可思议。”佛教就是这样，至尊至贵的法宝，感应也特别强烈。我与诸位交待清楚，这部经的来历、这部经的重要性、这部经不是伪经，请不要起疑惑心。还要知这是一部佛教正修正行的经典，对指导修行人信、解、行、证，非常重要。</p><p>　　这部经的经名可总称为，大佛顶、如来密因、<a href=\"/remen/xiuzheng.html\" class=\"keylink\" target=\"_blank\">修证</a>了义、诸菩萨万行、首楞严经；可理解为“大<a href=\"/remen/yinguo.html\" class=\"keylink\" target=\"_blank\">因果</a>、大义行，定成就佛无上正等正觉的了义究竟坚固之经。”从经名可以看出，这部经是世间人修证声闻、缘觉、菩萨果位必读之经、必持之经。只有大<a href=\"/remen/yinyuan1.html\" class=\"keylink\" target=\"_blank\">因缘</a><a href=\"/remen/guobao.html\" class=\"keylink\" target=\"_blank\">果报</a>的人，才能听闻、受持、奉行、弘传此经。下面，开始讲经正文。</p><h2>【大佛顶首楞严经卷一】</h2><p>　　<a href=\"/fojing/\" class=\"keylink\" target=\"_blank\">佛经</a>开头都是“如是我闻”， 为释疑并与外道有所区别。《<a href=\"/fojing/xinjing/\" class=\"keylink\" target=\"_blank\">般若波罗蜜多心经</a>》没有这四个字，但也是佛教经典，那是<a href=\"/remen/gsyps.html\" class=\"keylink\" target=\"_blank\">观世音菩萨</a><a href=\"/remen/huashen.html\" class=\"keylink\" target=\"_blank\">化身</a>所说，诸位知道就可以。“一时”，因为古印度日历无法确定准确时间，又怕未来世一些人用分别心去鉴别；所以，哪部经都用一时，没有哪年哪月的具体时间。</p><p>　　什么是“精舍”？人的<a href=\"/remen/xinshi.html&#9;\" class=\"keylink\" target=\"_blank\">心识</a>比作精真，心识是在人体内非常准确真实的存在为“精”；“舍”是佛<a href=\"/remen/shuofa.html\" class=\"keylink\" target=\"_blank\">说法</a>的地方；也可称法堂或道场是在精美的房子处，名为精舍。佛住世初期没有庙宇，只有佛说法精舍等；中后期，才逐渐修建庙宇，供僧人安居下来清净修行。佛的一千二百五十位弟子在佛说法时都来闻法；佛不说法时，这些弟子就各处乞食与修行，住山林树下。虽然那时是修行十人，十人成就，证道的多；但也要知修行人非常艰苦。那时的<a href=\"/remen/biqiu.html\" class=\"keylink\" target=\"_blank\">比丘</a>在一处最多住三宿，就要换地方住。既怕<a href=\"/remen/zhongsheng.html\" class=\"keylink\" target=\"_blank\">众生</a>起攀缘心，都来<a href=\"/remen/gongyang.html\" class=\"keylink\" target=\"_blank\">供养</a>；又怕供养的人多，而不能坚固道心。<a href=\"/remen/huayuan.html\" class=\"keylink\" target=\"_blank\">化缘</a>一次，最多化七家，化不到食物就不再用斋了，大比丘就是这么修行的。为什么住在山林的坟冢间？一是可以经常观察到人世间<a href=\"/remen/wuchang.html\" class=\"keylink\" target=\"_blank\">无常</a>，而提醒自己，我的身体也可变成一堆骨头，只是时间问题。知人世无常，才可以在无常中<a href=\"/remen/jingjin.html\" class=\"keylink\" target=\"_blank\">精进</a>修行，起到激励自我的作用。二是当时跟随佛<a href=\"/remen/chujia.html\" class=\"keylink\" target=\"_blank\">出家</a>的多数是年轻人，年轻人修行多有淫欲心。怎么销除？观坟里骷髅。修行能不能修到<a href=\"/remen/baiguguan.html\" class=\"keylink\" target=\"_blank\">白骨观</a>？过去的出家人能修行到。我在十五年前修过白骨观，一闭眼路上行人就是一副副骷髅；后来我把白骨观空掉。以正法住世修行的人精神可嘉，但对治的法也非常“残酷”，在一定<a href=\"/remen/chanding.html\" class=\"keylink\" target=\"_blank\">禅定</a>功夫的基础上，还要有正心才行。</p><p>　　“皆是四果无漏大阿罗汉。”无漏之人对世间任何事相，心平等无差别贪著；对世间各个方面的物相，心平等无差别贪爱，平常人做不到心行于诸法无漏。平常人见到顺逆就动念，而大阿罗汉却一念不起；如对世间的金银财宝、酒色财气等没有丝毫欲望。心无杂念，只有<a href=\"/remen/nianfo.html\" class=\"keylink\" target=\"_blank\">念佛</a>的音声，已发<a href=\"/remen/putixin.html\" class=\"keylink\" target=\"_blank\">菩提心</a>。有人来请法时，要观察因缘根基，对根基而讲，不请不讲。不能观察根基，不知习气是什么，想去度人是<a href=\"/remen/shanxin.html\" class=\"keylink\" target=\"_blank\">善心</a>；一旦人起疑惑呢？就不知把人度到哪儿去了。讲法非常难，谁也不爱开口，开口讲了，有因果相随，不讲不是不慈悲。有位居士来到我处，我一观察，这人是一只家养宠物狗转世，前世是听主人念经得福而转入人道，根基如此。所以，我只讲<a href=\"/remen/jingzuo.html\" class=\"keylink\" target=\"_blank\">静坐</a>有利于身体，<a href=\"https://www.guang5.com/sushi/\" class=\"keylink\" target=\"_blank\">素食</a>有利于<a href=\"/remen/jiankang.html\" class=\"keylink\" target=\"_blank\">健康</a>，其它修行方法就不讲了。讲法不要凭个人好恶，这人对我很好，我多给讲点，这不行，<a href=\"/remen/fofa.html\" class=\"keylink\" target=\"_blank\">佛法</a>不是交易。人这一生，解决自己的<a href=\"/remen/shengsi.html\" class=\"keylink\" target=\"_blank\">生死</a>事大；否则，是生死<a href=\"/remen/lunhui.html\" class=\"keylink\" target=\"_blank\">轮回</a>；今生造业，不知下世生往何方。对方要是没有了脱生死的心，给他讲正法，他接受不了；讲世间法，他只种一些善根，还不一定接受。借这个机会我给诸位多讲一点，都引以为鉴。我经常讲，佛度众生，法度众生，愿度众生，缘度众生。有人修行没几天，就忙于去讲法，让世人一见，这<a href=\"/remen/xuefo.html\" class=\"keylink\" target=\"_blank\">学佛</a>的人怎么都像劝道似的。当修行到一定程度时，不说不讲还有人请讲，没到时机，先不要急于讲。要知修行的过程，也是弘法过程；<a href=\"/fjrw/hcrw/dmzs/\" class=\"keylink\" target=\"_blank\">达摩祖师</a>到中国来，在少林寺静坐九年，天天在弘法；这在中国成为佳话，千古流传，坐的本身就在弘法。天天在静坐，按正法精神去静坐，身体健康，言出法随，事事愉快，本身就在弘法，还用嘴去弘吗？不用！以身心正行弘法，比光用嘴弘法强千万倍。</p><p>　　什么人才称得上<a href=\"/remen/fozi.html\" class=\"keylink\" target=\"_blank\">佛子</a>？准确地告诉诸位，从十信菩萨到十地菩萨才称得上佛子。罗汉、辟支佛称不上佛子。<a href=\"/remen/guiyi.html\" class=\"keylink\" target=\"_blank\">皈依</a>佛为“<a href=\"/remen/fodizi.html\" class=\"keylink\" target=\"_blank\">佛弟子</a>”，一个字也简化不得，千万别妄称“我是佛子”。有的人修行很多年，但小乘习气很重，堪称不起佛子，声闻、辟支佛是佛外子。末法时代，佛子乘愿再来，虽现声闻身、白衣身等，实是佛子。</p><p>　　对于“带业<a href=\"/remen/wangsheng.html\" class=\"keylink\" target=\"_blank\">往生</a>”，我准确地讲，往生到<a href=\"/remen/jileshijie.html\" class=\"keylink\" target=\"_blank\">极乐世界</a>边城品就是带业往生。实际是三果罗汉<a href=\"/remen/yuanman.html\" class=\"keylink\" target=\"_blank\">圆满</a>后，才有资格带业往生。往生至边城凡圣杂居地，虽属西方极乐世界却见不了佛。这个世界上有一些声闻、缘觉现世，也有大阿罗汉住世；但大阿罗汉不现世，平常人见不到。佛教称声闻为到达化城品的第一城，由于不发<a href=\"/remen/puti.html\" class=\"keylink\" target=\"_blank\">菩提</a>心的钝根阿罗汉是自了汉，未出<a href=\"/remen/sanjie.html\" class=\"keylink\" target=\"_blank\">三界</a>，经八万四千大劫一个循环，天福享尽，要堕落地狱。因为<a href=\"/remen/dingli.html\" class=\"keylink\" target=\"_blank\">定力</a>销失，五衰现前时谤佛；所以，他们形同非想非非想处天的天仙一样堕入轮回。修行人如愿行菩萨道，现在就须发起菩提心，自利利他，做任何事首先想到利益他人，对他人不利的事不做，对社会不利的事不做，伤害他人的事更不去做，先培育这种善根。</p><p>　　“善超诸有”。善是福德，超是智慧的善巧方便越过，诸有是一切因缘<a href=\"/remen/faxiang.html\" class=\"keylink\" target=\"_blank\">法相</a>。人有身有意有需求，天天在诸有当中打转；饿了要吃，困了要睡，男大当婚，女大当嫁等。六根、六尘是诸有根本。有了这些，就有生死轮回；心不在诸有当中，就能超越轮回。为什么人要淡化名利，淡化诸有？根本就在这里。培育自己，加深修为，等达到超越诸有时，就等于超越三界，菩萨超越诸有。佛住世时，佛的一些大弟子，从实相上讲，都是从兜率内院来的菩萨。虽然示现人身，但超越诸有，不执著诸有；虽然有身体的存在，也示现乞食，但终日用食，未食一粒米；终日穿衣，不着一缕纱。这是什么境界？每天正修、正行，其它的都被空掉；平常人不把诸有空掉，就装入<a href=\"/remen/bashi.html\" class=\"keylink\" target=\"_blank\">八识</a>田中。他们用斋时，对化缘来的食物不论干净与否，都把它食净。乞来的是药食对治我的身病，心要弘法，身随我行；如往昔有一位妇人非常反感出家人，用尿盆盛上饭倒在出家人的钵里，出家人有天眼通已知，但不因为是尿盆盛来的饭而起分别心，照样食净，不起分别心；但这妇人的业报不可思议，时间没过多久，命终后受报<a href=\"/remen/wuliangjie.html\" class=\"keylink\" target=\"_blank\">无量劫</a>；值佛住世时，这位妇人脱生为一只狗，天天围这位乘愿再来的出家人转；出家人观知这个因缘，就代它<a href=\"/remen/chanhui.html\" class=\"keylink\" target=\"_blank\">忏悔</a><a href=\"/remen/yezhang.html\" class=\"keylink\" target=\"_blank\">业障</a>，了业后又转人身皈依了这位出家人。因为人贪著诸有，随诸有造业，对修行人起贡高心、骄慢心，业报不可思议，冥冥之中业报就比别的业重千万倍。所以，不要小瞧诸有，“有我罪即生”，诸有是万恶之源。</p><p>　　佛的弟子到哪里都受人尊重。世间人穿的好，西装领带这不是威仪，这是世间法，是俗知俗见。大<a href=\"/remen/jiaye.html\" class=\"keylink\" target=\"_blank\">迦叶</a>尊者穿粪扫衣，头陀第一。穿的<a href=\"/remen/jiasha.html\" class=\"keylink\" target=\"_blank\">袈裟</a>有百条补丁，但照样威仪，到哪国都受国王接见，不受轻视，那才是威仪。佛弟子的威仪是气质状态，不是表面形式，衣着干净就行。这部经非常难懂，难在平常话中隐藏着无量深义。</p><p>　　从佛转轮。一般人认为随佛弘法就是从佛转轮，这么说是以文解义。实相上说，从兜率内院或他方佛国土乘愿再来，心行出家，随佛受教，弘法利生，这才是从佛转轮。在往昔世修行过程中，生生世世都从佛转轮；佛每说一部经都有嘱累品，佛一有嘱累，菩萨就有愿力；如何行持愿力，深心护持、弘传佛法；佛说什么经典，就拥护道场；佛示现哪一方，就随示现在哪一方修行等等，这是妙堪遗嘱。这“妙”字就不简单，是生生世世，多少劫修行成就。因为成就一尊化身菩萨，要两大阿僧祇劫随佛修行；所以，才有妙字；否则，无妙。只有菩萨才能这样做，生生世世随佛弘法。佛说哪部经菩萨都弘传，包括宣化上人“我生在末法之年，我都要弘法，难懂的《楞严经》我要给讲，难信的《<a href=\"/fojing/miaofalianhuajing/yuanwen.html\" class=\"keylink\" target=\"_blank\">妙法莲华经</a>》我要给讲。”他有资格也有能力说这种话。</p><p>　　没有杂染。菩萨身心行<a href=\"/remen/liudu.html\" class=\"keylink\" target=\"_blank\">六度</a>，不需求回报，<a href=\"/remen/wuwo.html\" class=\"keylink\" target=\"_blank\">无我</a>法二执，离诸有法相，这就是没有杂染的清净行。弘传三界。菩萨的一切身行言说都是弘法，在欲界、<a href=\"/remen/sejie.html\" class=\"keylink\" target=\"_blank\">色界</a>、<a href=\"/remen/wusejie.html\" class=\"keylink\" target=\"_blank\">无色界</a>，都是众生的典范、榜样，这就是在三界弘传佛法。应身无量。是从佛转轮的化身菩萨无量。我讲过，有化身成就的菩萨，方可度人。化身不只是一个，释迦文佛有十方分身；兜率内院在<a href=\"/remen/suoposhijie.html\" class=\"keylink\" target=\"_blank\">娑婆世界</a>也不只一个，也是十方无量，哪个兜率内院都是未来佛在那主持。业重尘累。这个世界众生的苦难，需要菩萨慈悲拔济，就是拔掉苦根，济福增慧。红尘滚滚，众生被红尘所累，天天与各个方面的<a href=\"/remen/fannao.html\" class=\"keylink\" target=\"_blank\">烦恼</a>纠缠不清，想脱也脱不掉，难得清净，非常疲倦。现在人都说自己活的累，科技时代越发达，<a href=\"/remen/shenghuo.html\" class=\"keylink\" target=\"_blank\">生活</a>节奏越快，人越累，都属于尘累。休夏。是佛慈悲众生，戒制比丘在夏季安居法行，又怕踩伤地面上蚂蚁等众生；七月十五日是安居结束，佛的<a href=\"/remen/huanxi.html\" class=\"keylink\" target=\"_blank\">欢喜</a>日。</p><p>　　十方世界的菩萨都向佛请法，解除心中疑问。菩萨喜欢听闻佛法，哪里有佛住世，就去请法、闻法、拥护道场；而且，有机缘时请教心中疑问。什么疑问？密义。佛教的法藏密义，密是义不可公开。不仅凡夫不能知，就连阿罗汉、辟支佛也不能知；一地不知二地菩萨的境界；二地不知三地菩萨的境界；十地菩萨不知佛的境界，这都是法藏密义。所以，佛教的法藏密义太多了，用平常人的思维，永远分辨不清，也无法明白。只有行入深禅次定时，如观世音菩萨行深<a href=\"/remen/banruo.html\" class=\"keylink\" target=\"_blank\">般若</a>波罗蜜多时，才知法藏密义。</p><p>　　这时，佛安乐趺坐于蒲团上，与<a href=\"/remen/fahui.html\" class=\"keylink\" target=\"_blank\">法会</a>大众说，今天法宴清净大众，广说法藏密义。法宴就是请大众闻法，这些弟子非常高兴，愿闻妙音。十方世界的菩萨知佛说密因了义法，都来拥护道场，文殊菩萨而为上首。</p><p>　　文殊菩萨愿力非常大，诸<a href=\"/remen/fozu.html\" class=\"keylink\" target=\"_blank\">佛祖</a>师。这个世界的未来佛，法性身首先要到文殊菩萨的国土去成就，都须拜师，成就智慧。然后法性身再到东方药师佛的国土，成就愿力。但是，文殊菩萨的法性身不在东方药师佛的国土，只能是化身在东方药师佛的国土。文殊菩萨在娑婆世界的北方有自己的佛国土，有自己的法性身、报身，在这个世界的是化身。这时，一位波斯匿王为<a href=\"/remen/chaodu.html\" class=\"keylink\" target=\"_blank\">超度</a>其亡故的父王而积<a href=\"/remen/gongde.html\" class=\"keylink\" target=\"_blank\">功德</a>，宴请佛及大菩萨到王宫偏殿，以珍贵美味食品供养。城中有很多长者居士等在家人也都站立在自家门前，等候供养佛与僧众，佛让诸菩萨代表佛分别带领各位阿罗汉等僧众接受供养。</p><p>　　这些僧众用过斋后都回到了佛的法会上，唯有阿难未归。阿难早时接受单独约请，在远游归途中，未有专门供养，只能在城里挨家乞食。这里能看出，阿难是佛说法的主角，这部经是从一个淫字开始。阿难和摩登伽女都是菩萨示现的，摩登伽女这个反面人物不好当，一生骂名；但是，正是这些谁也不愿意当的角色来成就菩萨的道业，正是通过这些反面人物示现，才使众生得度。阿难乞食时，心知佛曾呵斥小乘阿罗汉心不平等，敬仰佛广开方便而无遮障，避免了众<a href=\"/remen/rensheng.html\" class=\"keylink\" target=\"_blank\">人生</a>疑谤毁，不论供斋者是贫是富，都行平等慈。行平等慈，成就众生的<a href=\"/remen/fubao.html\" class=\"keylink\" target=\"_blank\">福报</a>；不因为富贵或贫穷而不去乞食，而差别行慈。佛住世时，一位老乞婆用卖头发的钱买油灯供养佛，其他人供养的油灯都被魔施妖风吹灭了，唯有她的那盏灯没有被吹灭，贫穷人真诚的心供养才有大福报。否则，用乞求心、攀缘心供养佛福报都小。阿难经城外路入城门，严整威仪，以恭敬心去接受斋供；当经过卖淫的场所时，被摩登伽女利用邪咒幻术摄到淫床，抚摸身体，将毁戒体。出家人和异性同床行淫是毁戒体，而且是毁重戒。出家人<a href=\"/remen/shoujie.html\" class=\"keylink\" target=\"_blank\">受戒</a>的身体是戒体，不可毁戒破体。否则，不只是不能修行，而且有堕地狱的果报。</p><p>　　我一般不给在家人讲这部经，因在家人淫习难断；正如小乘人所讲，“万恶淫为首，百善孝为先。”如在家人修行想成就今生的道业，此经又是必读之经。不读不知怎么修行成道。我为什么不劝人学佛？修行人要想出离这个世界，遇到这个问题不好办，要用一些办法对治；只有走过这条修行路的人，懂得通过这个路径的方式方法，才能成道。但是，非常艰难。在家人修行，也不要害怕，各有各的走法，各有各的因缘。在修行过程中，遇到问题不是本事，能解决问题才是本事。阿育王有嫔妃不也照样即生<a href=\"/remen/chengfo.html\" class=\"keylink\" target=\"_blank\">成佛</a>吗！因缘到时，自有破解之法；既<a href=\"/remen/jiating.html\" class=\"keylink\" target=\"_blank\">家庭</a>圆满，又成就道业。</p><p>　　佛及弟子们回到精舍，还有王宫大臣也随之而来。这时，佛从顶门放白光。卢舍那佛接引众生时也放白光，行菩萨道的人愿意往生卢舍那佛国土的，卢舍那佛用白光接引。释迦牟尼佛的国土也有清净的一面，只是声闻弟子不知而已。这里佛也结跏趺坐，说楞严神咒，让文殊菩萨持咒制住魔咒，把阿难和摩登伽女带到精舍。一些破魔的<a href=\"/remen/zhouyu.html\" class=\"keylink\" target=\"_blank\">咒语</a>静坐念诵或跪地念诵与站着念有很大区别，在自心感应中，威力相差百倍千倍。</p><p>　　阿难见佛<a href=\"/remen/dl.html\" class=\"keylink\" target=\"_blank\">顶礼</a>大哭，恨自己一向多闻，虽知法理很多，但道力不够。修行人不要认为多闻、多知好，还要注重道力。如没有修行道力，碰上妖魔鬼怪，身体就会生病，心情还不好。有的出家人见花花世界的诸有，由于修行的道力不够，而心动犯戒。修行人观见天上的修罗女，要比人间的美女强百倍而不动其心，才是有道力。平时要加倍努力修行，才能证有道力。</p><p>　　阿难反复向佛请求，妙奢摩他、妙三摩、妙禅那三种妙定，要修什么妙定能方便快捷的增强道力呢？道力是果位的神力，遇到魔力，不是人怕它，该是它怕人。所以，修行人增长道力很重要。没有道力，一切免谈，“菩提道上来”，没道什么也没有。有道力的人，说一就是一，无有二语，有佛、菩萨神力加持；平常人说是俗说、凡说，说大了就堕拔舌地狱，就是大<a href=\"/remen/wangyu.html\" class=\"keylink\" target=\"_blank\">妄语</a>成。一些修行人经常与我探讨，修行以什么为本？我说以静坐念佛，都摄六根，证悟为本。</p><p>　　这时，有无量菩萨、十方大阿罗汉、辟支佛等大众，也都企盼佛说法而默然静坐。佛在大众中舒金色臂，摩阿难顶以示慈悲安慰，销除其心里魔障与慌恐；并告大众说，有一种正定名大佛顶首楞严王，究竟坚固而具足一切禅定；十方诸佛皆依此正定一门超出，成就妙有而<a href=\"/remen/zhuangyan.html\" class=\"keylink\" target=\"_blank\">庄严</a>的菩提路。</p><p>　　修行人都离不开这部经；离开这部经无法行做，声闻、缘觉修行与行菩萨道的人，救度众生都离不开这部经。这部经从淫字引出修行戒、定、慧中的正定。破淫习气要靠持戒、靠禅定、靠智慧，拔淫习之根还要靠修行正定生出的智慧。若修白骨观，不从心里破除淫习、拔出淫根，看见白骨也风流。</p><p>　　佛说，阿难，你我同宗天伦，当初在佛法中你见到什么殊胜法相，才舍了世间父母深恩和<a href=\"/remen/fuqi.html\" class=\"keylink\" target=\"_blank\">夫妻</a>重爱，而随佛出家为僧呢？ 阿难说，我当初见佛三十二相，特别殊胜，琉璃透明，思维人体肉身，怎么会这样殊胜妙明而具紫色金光，渴望也能得这样法相而让人仰慕，才随佛出家为僧。</p><p>　　这是身见，也是色见。用身见见佛，说明没有道力。真佛<a href=\"/remen/wuxiang.html\" class=\"keylink\" target=\"_blank\">无相</a>，不是见到那样。如没有真智慧，见到真佛时，会被吓着。因为我于定<a href=\"/remen/zhongguan.html\" class=\"keylink\" target=\"_blank\">中观</a>过真佛，心知真佛什么样。没见过的，以为供养的佛像庄严，其实真佛无相。佛像是示现给众生表法的，示现结跏趺坐像，告诉众生修行也要这么坐。佛这么坐证菩提，如修行人不这么坐，能成就佛道吗？有的人一坐就怕腿疼，愿意舒服，想食得好、穿得好，享受荣华富贵，那趁早别修行。修行与这些事情都是相逆的；是少数具有一定勇气、智慧的人才能行做的。为什么说“不投明师，易得邪知邪见”呢？就是一些修行人容易被相所转，而生邪知邪见。为什么佛要在雪山静坐六年呢？先天的身体都是父母所生、父母所养，身体得以转化就是靠雪山静坐这六年时间，使肉体转化为佛体。我讲三界火宅是众生的身体，<a href=\"/remen/shengren.html\" class=\"keylink\" target=\"_blank\">圣人</a>的肉体就是<a href=\"/remen/jingtu.html\" class=\"keylink\" target=\"_blank\">净土</a>。这个不是乱讲的，是有根据的。人的身心是无明烦恼充满，双手只能劳作，双脚就是走路。真正让人享受到的法喜还是人的身心，身体劳作只是外在的，肉体带来无穷无尽的禅悦才是真实的；菩萨身心净，则佛国土净。</p><p>　　佛说，阿难说的很好；应当清楚一切众生从无始劫来轮回生死，就是由于不知自己<a href=\"/remen/changzhu.html\" class=\"keylink\" target=\"_blank\">常住</a>真心、性本清净、又具足智慧的识体，而颠倒<a href=\"/remen/wangxiang.html\" class=\"keylink\" target=\"_blank\">妄想</a>。人的肉眼见到的都是颠倒的、不真实的、虚妄的色相。由于眼是色目，由血肉构成，与诸法相一样都是色相。人执著名利，就是被物色的诱惑力所转。修行的人，不忆昨天，不忧明天，只知今天，明心见性。若用人的色目去见，见不到真实的那一面；不要因为一句贡高我慢的话，断了自己的道业。因为见到的、听到的事物不真实。当人不知道的时候，用贡高我慢心轻视对方，本身就是一种堕落，会影响自己的道业。如一句话不慎，可以毁掉人一生的幸福，也可以毁掉修行人一生的道业。</p><p>　　无上菩提。菩提是佛的一种象征，无上菩提是究竟成佛。修行人的目的是成佛，是从心性上说的，人的肉体不能成佛。在这个世界上，只有释迦牟尼佛一尊佛住世，其它国土的佛都不现<a href=\"/remen/foshen.html\" class=\"keylink\" target=\"_blank\">佛身</a>，而示现人身救度众生。阿弥陀佛化身到过这个世界，现普通的出家人身，不现佛身；维摩诘现居士身，不现佛身；诸佛祖师文殊菩萨现菩萨身，不现佛身；现在至<a href=\"/remen/mile.html\" class=\"keylink\" target=\"_blank\">弥勒</a>菩萨出世之前，只有一尊释迦牟尼佛降世，没有第二尊佛示现世间。现在，人传的某某人是什么佛转世，不论谁说，都是魔说，不是佛说，千万记住。有的人走了弯路，都是在这上听了花言巧语，吃亏上当，说什么要开龙华三会等，统统要遭王难。要知道，这个世界上肉身不能成佛，只有一尊释迦牟尼佛化身，在报身佛世界，在佛法性身中，才有资格示现佛；其他尊佛到这个世界上来，都是化身，不能示现肉身成佛。了解这个实相很重要，避免上当。</p><p>　　佛接着说，阿难若修证无上佛道，知真常而明心见性，就要用直心回答所问。十方诸佛都是<a href=\"/remen/zhengde.html\" class=\"keylink\" target=\"_blank\">证得</a>同一无上菩提，而出离生死；从发菩提心至成佛的全过程中，都无诸弯绕曲折相，都是以直言直行的直心坐道场。</p><p>　　有道有法，方为道场；无道无法，不是道场。讲法要讲出道来，还要讲出法来；否则，不是修行人的直心道场。静坐是修行人的道场，行住坐卧心净是修行人的道场。佛说法是有道有法的道场；法师是讲佛说的法，离相无著，<a href=\"/remen/rufa.html\" class=\"keylink\" target=\"_blank\">如法</a>释讲，也是道场。佛说法是如语者，实语者；法师讲法也要无丝毫的谬误，无邪知邪见；法师平常说话可以方便一点，但讲法时不行，偏离正法谬解要负因果。讲要正解，根据证悟，讲出真知灼见的法义。直心是讲法论道时，而不是平常人说话。平常人说话直心是道场，非得把人的隐私事捅出来不可，不出乱子才怪呢！直心是道场，离相受持才无过失；应依佛说，如法讲说。法是直义，无谄无曲；诸法空相，如语实语。如语实语是终是始，中间才无弯曲。众生在无始无终当中行走，什么时间开始不知道，什么时间终止不知道；众生所谓的终和始是人生的阶段性，是一生一死。道业从何时开始？是从人初<a href=\"/remen/faxin.html\" class=\"keylink\" target=\"_blank\">发心</a>开始，从念一句南无佛、南无法、南无僧种善根开始，到往生佛净土，需要一大阿僧祇劫。在末法时代能讲出一句佛法，都要恭敬，这是种善根。现在这个时代多数人不相信佛法，如有人念一句“南无阿弥陀佛”都要赞叹。释迦牟尼佛将来三身合一到宇宙中去，仍然处于无始无终的状态，永恒的常乐我净。这个世界上的人都是有身，但凡圣享受的乐有质的不同。从开始发菩提心至成佛的一天，菩萨行人，心无不直，始终是直。有的法师讲，修一步退两步，菩萨还有退转心。这是从相上讲的，不是从性上讲的；未达不退转地的菩萨，身行有退而道心无退。菩萨行人在这个世间修行极难，如赤脚走在布满荆棘的西行路上；每前行一步，还有毒蛇猛兽；精进时还要跑步前进，没有时间躲开这个蛇那个兽，行菩萨道就这么难！为什么我不劝人信佛修行，因为我知实相，修行太不容易。要想有多大的回报，就要付出多大的代价；有多大的成功，就有多大的奉献，白来的事没有。如我求过两次雨都求来了，不是读多少遍《楞严神咒》求来的；是以身体重病为代价求来的。想为众生做好事，众生的业报谁担，任何事都是需要付出代价的。做有功德的事，另一面就是苦报；苦报福报相伴相邻，只是众生不觉而已。这个世界上的事都是相辅相成的，利弊各半。</p><p>　　佛接着说，阿难当初见佛有三十二相，是什么所见，是谁乐见呢？阿难说，是眼睛见到的，心生爱乐；所以，我才发心出家修行，愿舍生死。</p><p>　　目见、心见，都是从这里开始的。目是人眼，心这里是指人的<a href=\"/remen/yishi.html\" class=\"keylink\" target=\"_blank\">意识</a>，不是指真心。有的人修行一段时间后，一闭眼就说观见各种不同景象了，实际是意<a href=\"/remen/shixin.html\" class=\"keylink\" target=\"_blank\">识心</a>幻化出来的；不是真心<a href=\"/remen/zixing.html\" class=\"keylink\" target=\"_blank\">自性</a>观得的，自性无想无说无作。一闭眼观见不同景象，是业习通过意识的一种流露。如在定中观到化身佛现僧像，用心能观见。释迦牟尼佛的肉身，是要示现生灭，是要入涅槃的。有人说佛不是不生不灭吗？怎么要入涅槃呢？成佛是自性菩提，肉身只是化身示现；通过肉身示现来度化众生。佛的相貌有神变化身，有报身，有法性身。法性身是常住的，报身是常住的，化身无量亿也是常住的。凡是执著于肉身佛的示现身常住，都是邪见。</p><p>　　人们问，释迦牟尼佛不是人吗？那法不是人说的吗？问题表面上很简单，深层次上却是非常深刻。释迦牟尼佛肉身要灭度，不常住。释迦牟尼佛虽示现生灭，但佛化身还常住世间，佛法还在化度众生。当人修行有证悟时，佛会亲自来为其摩顶；用开悟人的话说，<a href=\"/remen/lingshan.html\" class=\"keylink\" target=\"_blank\">灵山</a>法会还没有散。出世间智慧是指自性上说的；虽然肉身外相上一样，但心的内含不一样，用科技测量不到，测知不了。如找不到真心，就不能降伏世间的尘劳，被红尘所累。众生轮回，没有终始；常处在一种不是生就是死、不是天堂就是地狱的<a href=\"/remen/liudao.html\" class=\"keylink\" target=\"_blank\">六道</a>之中。</p><p>　　佛说，阿难不是用心目所见吗？心在哪里？目在哪里？如若不知，则不能降伏尘劳，难以了脱生死。如国王要征罚逆贼，须知逆贼所在之处，才能克敌取胜。阿难说，眼就是我的目，感觉体内有个心，实际就是我的意识。世间众生的心在身体上，我的心在我体内，我观察佛的眼也在脸上。说我的心目在我的身上，佛的心目也在佛的身上。</p><p>　　阿难说的是实话，没证悟时，众生见色相就这么看，多少人读诵这部经不明白，都以色相的见闻觉知理解经义。我这身体里分明长着心目，怎么就说找不着心目呢？一开始就被相所转，一下子就在相上做文章，做来做去上哪找心去？所以，一开始就讲，色目非真目，意识非真心。在定中用心去观心中无物，用心直接照见<a href=\"/remen/wuyun.html\" class=\"keylink\" target=\"_blank\">五蕴</a>皆空。观察人的脸上有四根，眼耳鼻舌，都是用意识心、色目见，回答的问题仍然是在色相上。十几年前我也读不明白这部经，从实际修行中才证悟到，越是纷繁的越不是佛法，大道从简；越简单朴素的越是佛法。这是诸经当中最难懂的一部经，不听人讲，靠自己去读诵，没有证悟难懂，分不清、道不明。</p><p>　　佛说，阿难身坐讲堂内，你看祗陀林在哪里？阿难说，广大重重琼阁的清净讲堂，既在给孤园的祗陀林中，又在大堂之外。</p><p>　　佛说，阿难在大堂中，你先见什么呀？阿难说，我先见到佛，再见大众；然后，见到大堂与外面的园林。</p><p>　　佛说，阿难是怎么见园林的呀？阿难说，这大堂门窗开着，抬头举目可见。</p><p>　　佛说，阿难按你这么说，大堂开着门窗就能见到外面园林；那有些众生在此大堂中，却不见如来，只见大堂外面园林。阿难说，佛在大堂，见不到佛而只能见外面园林，那是不可能的，只要有眼睛就都能见到。</p><p>　　佛说，阿难你就如这样的众生；若你心灵能明了一切法相，明了心实在身内，那明了心应该先于自身合，先见身中众生，后见外物。若明了心先于身合，为什么不能内见知五腑六脏等；于内不能见知，怎么能见知外物呢？根据这一法理，你说的觉了能知之心住于身内，是不合法义。</p><p>　　佛法非常有深度，若以色相见佛，见佛肉身，佛的肉身是暂时的，是要灭度的。真佛既在又没在这肉身上，化身只是心观一片光而已，色目能见佛吗？深度就在于此。真正的佛无来无去；而肉身佛不论住世多长时间，都得示现生灭。如有人要执著修肉身成佛，是人行邪道。修行是心识去往生，自性去成佛呀！现在有的人说，我活八十岁时也得死，我成佛也得死，那我成佛干嘛呀？这就是平常人不信佛法，不信佛教的众生见。人不是体内有个真心吗？那应当先观察体内的事物，然后再观察体外的事物。现在能观察自己体内的事物吗？观察不了。什么人能观察？入定的人能观察。内里一片光明，而不是漆黑一片，往内里越观察越感觉身体无常，暂时住所，破烂不堪，一个大虫窟，一点不值得留恋。能观察内才能观察外，观察不同人的根基和心性，才是<a href=\"/remen/zhengjian.html\" class=\"keylink\" target=\"_blank\">正见</a>。用心在定中去观去照，而不是用色目去见。人见不到细菌的存在，见不到电波的存在；但见与否都存在，不见却能从其它方面感知存在。人的真心，既在体内又不在体内。</p><p>　　阿难说，听闻佛说法音声，悟知我确实有个心；如没在体内，一定是在体外呢。是什么缘故呢？就如灯光，室里点燃一盏灯，灯光就能照亮室内；灯光再透过门窗照亮庭院。一切众生心不自见身中诸脏器，只能见身外诸事物；就如室外灯光不能照亮室内一样。这个义理一定正确，不能有什么疑惑，如同佛法了义一样，不会是虚妄吧？真心在体内不能见知，就上体外去找真心。</p><p>　　佛说，阿难你见一人乞食过斋，大众能饱不？阿难说，诸比丘虽证阿罗汉果，但由于各自身躯不同，一人过斋大众不可能都饱。一人食饭一人饱，个人的业个人了，持戒修行是以个体<a href=\"/remen/shengming.html\" class=\"keylink\" target=\"_blank\">生命</a>为单位的。</p><p>　　佛说，阿难若你的觉了能知之心，却实存在于身外，身心就会自然内外分离，各不相干；而心所知事物身就不能感知，身所感知事物心就不能所知。佛把兜罗绵手举了起来，又问阿难说，你眼见手时，心里有分别吗？</p><p>　　兜罗绵手肤白柔软，细如香绵。心地善良的人，特别是修行人，身手皮肤都特别细软，回到了童贞。说童贞入道的人，回转童身，回转童心。回转到什么程度，五、六岁小孩囟门没长死，小孩的心识经常出离肉体，最容易被吓着；皮肤又细软，这是童贞。人要想修行成道，必须把身体转化到小孩那样。只有达到这个程度，才能达到灵肉分离。<a href=\"/remen/jingtufamen.html\" class=\"keylink\" target=\"_blank\">净土法门</a>难就难在即身不能恢复童身，不能即身成道。佛教有即身成佛的法门，但不是肉身成佛；而是人的自心性识证道，或人活着自心性识就往生极乐世界去成就佛道。活着往生的人修行上可以超越，人世间修行的一日一夜，等于极乐世界五百年。所以，修行不同的法门，有难有易。难信难解难行的法门，遇有障难一旦克服过去，成就的速度就快；越简单的法门，成就的速度越慢；如念一句<a href=\"/remen/fohao.html\" class=\"keylink\" target=\"_blank\">佛号</a>，一坐就腿疼的，即身难有大成就；修行这点疼痛算什么呀！对大乘根基的人讲上上法，对小乘根基的人讲通俗易懂法，对平常人讲容易接受的就可以了。对什么人讲什么法，根据众生的根基不同，要达到的目标不同，讲的法也不同。佛住世时根据个人的根基说不同的法，同样听法，个人所得感悟都不同。</p><p>　　阿难说，眼见手时，心里有分别。</p><p>　　佛说，若以色目见相而心才能知，你怎么说心在身外呢？根据这样的法义，你说的觉了能知之心在身外，是不可能的。阿难说，根据身心相连相知而不能相分相离的法理，心既不在内，又不在外，我想可能在一个地方。</p><p>　　佛说，阿难你说的地方在哪里？阿难说，心既于内而不能知，又不在外，而又能见外，我想可能在体内眼耳鼻舌意某一个根里藏着呢！如有人取两个琉璃碗，比作人戴眼镜。虽然从眼镜中见一只鸟从空中飞过，未必留下痕迹，只知道鸟飞过来的大约方向，是人思维当中的分别心，即思维记忆在推理；眼即见心即分别，同于眼无碍镜，镜无碍眼。不见内是心被眼根功用所代替；能见外无障碍是心藏在眼根里，心与眼同时发挥功用。这是想象，因为根与心不是一回事；所以，这一问一答，表示真心用思维想象不了。</p><p>　　佛说，阿难按你这么说心藏在眼根里，等于一个人戴眼镜，眼透过镜可见山河大地与万物，能见所戴眼镜吗？阿难说，确实能见眼镜。</p><p>　　佛说，阿难你心若能与所戴眼镜相合，远可见山河，近可见眼镜，怎么不能见自己的眼呢？眼镜只是个物，而不是人的心，与眼与心不是一体。觉了能知之心潜伏在眼根里不是那么回事，也是不可能的。</p><p>　　正常人的心和根尘是分不开的，在体内是一体的。只有心在身体内，体内的眼和思维等是一体相随的；既身在哪里，心在哪里。它们若不相随，体内<a href=\"/remen/wuxin.html\" class=\"keylink\" target=\"_blank\">无心</a>，心内无体，这人修行就有成就了。有没有这种境界的人啊？有！化身菩萨示现世间人就是这样。他的心不在身内，他的心在宇宙中分身无量无边。有人说，没心怎么活？所以，众生就是众生，在五行中，七魄住于体内，替心识做管家，心识是仓库，六根是贪吏。心识不住体内的人，七魄都回归本位，才是跳出三界外，不在五行中。心不在体内，不受七魄束缚；所以，佛打的手印是跳出三界外，不在五行中。七魄是受五行相生相克的，只有修行证道时，才不在五行中，不受它的生克。七魄离体没有心识住体，是什么住体？是佛的“不死之胶”（宇宙能量）住于体内。所以，只见光而见不到佛。众生迷惘各处找心，用众生和外道的心去观察佛和菩萨，累劫观察连边都观察不到。</p><p>　　阿难说，我现在又想，心是不是藏在五脏六腑呢？是不是内有脏腑，外有开窍？如肺开窍于鼻、肾开窍于耳、肝开窍于目等；有窍则明，明则能见，明则见外；有脏则暗，闭眼则暗，暗则见内；是不是这样呢？</p><p>　　有修为的人听人三言两语，就知修到哪。为什么？人说的话超不出思维范畴，超不出想象空间。如阿难的眼睁为明，就能见到外面的事物；眼闭什么也不见，暗为见内。</p><p>　　佛说，阿难你一闭眼就见暗，眼前一片漆黑，是暗境界与眼相对应还是不相对应；若是相对应，暗在眼前为外，怎么是见内呢？若见暗境界为见内，在暗室中无日、月、灯等光亮的状态下，此暗室是不是都成为你身体上、中、下三焦脏腑呢？若暗境界不与眼相对应，又怎么是见内呢？若眼离开见外，只相对应见内，合眼可见身中之暗；而开眼见身外光明时，怎么不能见自己的脸面呢？若眼见明不能反观自脸面，眼见暗也不能反观身中脏腑，还怎么是见内呢？若眼内外皆能反观，觉了能知的心与眼根都在<a href=\"/remen/xukong.html\" class=\"keylink\" target=\"_blank\">虚空</a>中，还怎么是在身内呢？若觉了能知的心在虚空中，虚空自然不是你阿难身体；佛现在能见你面，佛也是你阿难的身体吗？你眼与身本然一体，不须觉知；若你执著身与眼有两种感知，那你可一身成二佛吗？根据种种法义，你所说见暗就是见内是不可能的。</p><p>　　修行人修到四加行的世间第一法时，眼前不是见暗，而是内里一片光明，内外透澈。自心性识见，是既能见内又能见外。肉眼永远是见外不能见内，见前不能见后；用自己眼永远见不到自己的后脑勺。所以，人易犯一个过失，能见到他人的过失而见不到自己的过失。人的身体就如同一个小宇宙，佛的法性身本来就是宇宙一真如而具足万能，各有各的神力住持。在毗卢遮那佛的法性身之中，才有卢舍那佛的清净国土，才有释迦文佛的无量化身。化身不可能超越自己的国土现佛身示现世间度众生，超越自己的国土到其它佛国土现菩萨身，现<a href=\"/remen/hufa.html\" class=\"keylink\" target=\"_blank\">护法</a>身；如文殊菩萨、观世音菩萨等到此佛国土现菩萨身；再如阿弥陀佛、释迦牟尼佛到东方药师佛国土也现护法身。人现在的身是业报身修行，往生到极乐国土是清净报身成就，将来成佛也是清净报身佛。化身成就不是这个肉身，报身成就也不是这个肉身，法性身成就更不是这个肉身。一人修行只能成就一尊报身佛，不可能成就两尊报身佛。</p><p>　　阿难说，我经常听佛为开示<a href=\"/remen/sizhong.html\" class=\"keylink\" target=\"_blank\">四众</a>说法，由于心生诸有的缘故，从而种种法生；又由于法生诸相的缘故，从而种种心生；即因缘和合诸想，心法相生。修证心法皆空时，心本不生，法无自性；心中无法，法中无心。我现在想思维意根就是心性，心随意根功用而相随实有，也不在内、外、中间三处。思维执著妄心，即骑马找马。</p><p>　　佛说，阿难如按你所说，由法生则种种心生，心随诸法有而和合；若是心离诸法有无体相时，就不能与诸法有和合；若心无体相，而又能与诸法有和合时，是不是天地有十九界，人有第七尘；即六尘加无体空尘，等于七尘；十八界中人内有六根，外有六尘，中有六入，加无体空尘，等于十九界。这种心随法有的说法，是不可能成立的。若心有体相，用手自捏身体时，心是从内出还是从外入呢？若从内出则心能见脏腑，若从外入则心能见脸面；是不是这样的法义呀？</p><p>　　一些人往往在一开始就误住，无处找心；面对佛法博大精深，不好理解；其不知人用意识成劫去思维，永远也理解不了。只有修行证悟后，定中观照，才能立刻明了，清清楚楚地知见觉，语言文字永远也说不清楚。</p><p>　　阿难说，如我见到的是眼，而心知又不是眼，此见还如法义吗？ 佛说，阿难若是用眼能见真心，你所居室中有门窗能见事物吗？若是死人眼尚在也应能见事物，那还是死人吗？</p><p>　　现在有人经常说一句话，修行人活着能念经，若死了还能念经吗？死了还能听经、念佛吗？死人都不会。谁会念？心识会念，心识念佛才是真的。肉体一死<a href=\"/remen/tongku.html\" class=\"keylink\" target=\"_blank\">痛苦</a>不堪，再加上天寒地冷，身体疼痛，心识烦恼无边，早将佛号丢一边去了，众生业报就是这样。黑白无常用<a href=\"/remen/faqi.html\" class=\"keylink\" target=\"_blank\">法器</a>一收心识就走，哪有清净念佛的心呢。所以，不是自念靠不住，必须让心去念，心识会念佛，都摄六根，净念相继。否则，想往生不可能。往生不是肉体的人去往生，是肉体里有个心识去往生；若是去轮回去投胎，也都由心识去。这里还有自性的问题，心只是第八阿赖耶识的总称，它有主宰，是自性做佛祖，不是心做佛祖；自性做佛是了义，心做佛那是方便。</p><p>　　佛说，阿难你若觉得这个觉了能知的心，必有一个体相，是一体还是多体？今时在你身上是遍满全身还是不遍满全身呢？若是一体，用手自捏一肢体时，四肢皆应有同一感知；若用手自捏不固定处的一肢体时，只有一肢体有感知，一体之心就不能成立；若是多体，可成多人，哪人是你吗？若是遍体，当你碰头时也就碰了脚；若是不遍体，碰头有感知则心在头，而脚无感知则心不在脚；现在你的心当然不是依这样方式存在。根据这样的法义，合处随有生心是不可能的。</p><p>　　众生不能确知心的样子，一天修行功夫都没有，能读诵一般的经典，理解一些法义就很好了。真正修行没几天，还怨佛经太深太难懂了，就不怨自己空过几十年，还觉得自己很好呢！不知忏悔，生生世世在轮回之中，迷茫而不明法义。佛来这世上奉献多大呀！示现人生苦行破魔说法等，吃很多苦。一些菩萨行人来到这个世间以身命财为代价，为众生做奉献。有的人不知佛菩萨的慈悲，不知佛说法的实相，只认知世间法的假相，还拿着假相怨这个那个呢！所以，众生刚强难度。别怨佛经难懂，是身障太重。佛说法用了很多比喻，如碰人的头，脚有没有反应。人都是一个身体，碰哪大脑思维都知道，是思维感知到的。不是头或脚感知的，是意识思维。通过眼耳等器官感知的，死人的思维停止不能感知。人的真心是不能用物体碰撞感知的，物体对真心无碍。人的肉体无法感知真心的存在，外面的雷电，劈不着、也烧不着。</p><p>　　阿难说，佛与文殊菩萨交谈诸法实相时，也说过心也不在内，也不在外呀？我想心在内不能见知，在外也不能见相感知；而身心有知又不能分离，就应当在中间啦！为什么阿难请法？多闻第一。多闻第一是对声闻人而言；对菩萨行人而言，即无多闻之相，又无第一之名。诸法实相分世间与出世间；世间诸法实相，即有一切相又离一切相；出世间诸法实相，既真空不空又存妙有。</p><p>　　佛说，中间在哪里，是在内外的中间，还是在人身体内的中间呢？应准确说具体部位，不能混乱不清。若心在身中间，就应在前后、左右、上下哪个边处；否则，等于心在身内。若心在哪个边处，就应在表体哪个部位；若不能确定具体部位，就等于心不在哪个边处。为什么呢？若以表象为中间，方向就要发生颠倒，见东是西，见南则北；表体部位混乱，心也随之生起杂乱而无法确定部位。</p><p>　　阿难说，我所说中间不是内外与体内两种；而是眼根对应色尘的识入。因为，眼有分别功能，色尘无知；所以，识入生其中，则是心在的中间。眼观为色，入无影无形，这是六入当中的一入；通过眼观察到色，色入眼根，进入思维，这是入脑，不是入心。</p><p>　　佛说，若心在根与尘的识入中间，此心体相应该有二个，既在眼根又在色尘；若不是二个，哪个是你心；若是二个，色尘无量又无觉知，知与无知是相互对立存在的，怎么能成为中间呢？既然心体有二不能成立，眼根又不能思维知与不知，中间的体相又是什么呢？根据这样的法义，识入为中间是不可能的。用眼根见到的物体是尘，根尘之间如是心，就是两个，物体有心吗？没有。所以，两个心是不存在的，只能算根尘六入而已，不能说中间是心。既不在内，又不在外，亦不在中间。为什么呢？说修行人不执著于心，也不执著于身，又不执著于中间。为什么阿难找不到自己的心呢？没有禅定功夫。能入深禅次定时，就找到心了。不知体内还有一个真心存在，这就是众生迷惘。众生迷惘执著我身我见，吃什么都香，有钱就有用。为身体的需要造作无量无边的恶业，巧取豪夺得到手，挖空心机算计他人，占尽便宜，不论采用什么卑劣手段，只要弄到钱为我所用都可以干；众生业报重就在于此。重在为满足心里的欲望，不计后果，不择手段；重在这种贪欲根源，外在的是根据捞来的非法财产多少确立业报。觉知明了心性如虚空是存在的，众生愚迷不知。修行人对世间水下的、空行的、森罗万象的一切存在，都不执著，心空则法空。</p><p>　　有人问，有没有西方极乐世界？如是人想象中的精神世界，这不真实呀？那我还去不去呀？我对诸位讲，极乐世界是实有的物质世界，那里是莲花化生，阿惟越致菩萨是有身体的丈六金身；所谓的金刚之身是常住不坏而变异生死之身，金刚是一种比喻。如不是真实的物质世界，佛也不会说十方这个世界什么样，那个世界什么样。我真实的讲，极乐世界如同经书上说的一模一样，佛是如语者、实语者。极乐世界在娑婆世界的西方，不是虚幻的精神世界，是实有的物质世界！想不想那个世界都存在，去不去那个世界都存在；去者为智者，常乐我净；不去者为愚迷，六道轮回。所以，修行人发心往生极乐世界，那是一个安养的世界。存在的就是存在，不存在的不能说存在；不因为人执著与不执著而说，执著也存在，不执著也存在；太阳东升西落，想不想都按它的规律而运行，法的世界也如此。不是想象的观察不在内也不在外，一切事物都不能随人的主观想象而存在，思维想象的空不是空，圣人说空也不是想象的空。诸空也真实存在，说不存在也存在；想象的空不是空，空的存在不能用分别心推理想象。</p><p>　　阿难说，以前我见佛与目犍连、须菩提、富楼那、舍利弗四大弟子共同弘法时，经常说这个觉了能知的分别心性，既不在内也不在外，又不在中间；都不能固定一处存在，于一切处无所执著而生其心，可以称名为心。我现在也于一切处无所执著，是不是可以称为心呢？佛说，阿难你所说的一切是世间万物虚空和水下、陆上、空行的众生，无所执著是觉了能知的分别心性不在一切物象、众生处；心是在还是无？若无则心如同龟长毛、兔生角一样不存在，还用无所执著吗？若在则心还有无所执著，就不能称为无所执著；若心无有体相就不存在，心存在就必须有体相，有体相才能存在，还用无所执著吗？根据这样的法义，应当明知于一切处无所执著是心，是不可能的。</p><p>　　这时，阿难在大众中偏袒右肩单腿跪地，合掌恭敬说，原想我是佛的堂弟，他人与佛都不沾亲不带故，蒙佛慈爱今天已经出家，总觉得很好并比他人强；现在才知我只是多闻，修行未证得无漏；尚无慧力降伏外道邪法幻术，还被其魔境所转，自己都不知在什么地方，就稀里糊涂地落入淫室。请佛大慈哀悯我这样的人等，开示修行正定法门，让诸<a href=\"/remen/xinxing1.html\" class=\"keylink\" target=\"_blank\">信心</a>不足而喜乐放逸、邪见的人，销除垢秽，得清净行。说完便五体投地，与大众一样都倾心渴望，抬头凝神，钦敬的听佛教诲。</p><p>　　人体的右侧代表佛法，象征智慧方便；修行佛法又从右侧开始转化。人的大脑右侧支撑着左侧，左侧大脑支撑着右侧；右侧身体先发生变化，左侧大脑也随之改变。有漏是什么？被摩登伽女淫术所惑，被自我欲念所伏，抵挡不住物色的引诱。有的人身上有鬼秽住体等，说明心里有贪求，<a href=\"/remen/xingshan.html\" class=\"keylink\" target=\"_blank\">行善</a>中有求，心中杂染所致。要知召感鬼秽等，是人心复杂，有善还有杂恶；又有前世因缘。心无杂染诸漏，才不被鬼秽所伏；既内里的主人强健，窗户门紧闭，强贼也进不来。阐提就是断灭善根，不能完全、彻底相信有因果轮回；而执著于肉身生死就是<a href=\"/remen/shane.html\" class=\"keylink\" target=\"_blank\">善恶</a>断灭。妄认肉体是父母所生，死了什么也没有，什么都随一死而一了百了；从而有人身心不快，就去<a href=\"/remen/zisha.html\" class=\"keylink\" target=\"_blank\">自杀</a>，都是由断灭相心所致。事实不是这样，多少横死的人不得超生，苦上加苦。平常人都以自身感受好坏和利益得失作为衡量是非标准；如有人亲爹亲妈向自己要钱，我也得远离；谁若有钱给我，虽不是亲爹亲妈，比自己的亲爹亲妈还亲，见利生心。</p><p>　　昨天我问，诸位在为谁听讲佛经？有人回答，为众生而听。今天早晨我说诸位真行，到这里来睡地板，再为众生听经。我对诸位讲，我在读宣化法师讲的经时，我先<a href=\"/remen/baifo.html\" class=\"keylink\" target=\"_blank\">拜佛</a>，再拜宣化法师。我讲宣化法师这是为我说的这部经，不论道场多少人听，要想是为自己所讲。只有这样才能心不外溢，容易与自己对上号；将来知如何感佛恩，自利利他。读诵这部经要知怎么修行正定；开悟的“楞严”吗！<a href=\"/remen/chanzong.html\" class=\"keylink\" target=\"_blank\">禅宗</a>讲开悟，开悟的人立即知心在哪里。为什么让人找心？找到心，人就开悟了；开悟的人就找到心了。修密宗的人心识离体立刻就找到心；修净土的人念佛<a href=\"/remen/sanmei.html\" class=\"keylink\" target=\"_blank\">三昧</a>出现，立刻就找到心了。念佛的人，今天念两句明天念两句；修密的人，三天打渔两天晒网；修禅的人，腿疼了就不禅行了；还纳闷我怎么就找不着心呢？我怎么就不开悟呢？最后道业无有成就，一生空过。修行从哪里契入？修净土的人，要从静坐开始契入；修密的人，要好好静坐持<a href=\"/remen/zhenyan.html\" class=\"keylink\" target=\"_blank\">真言</a>或咒语契入；修禅的人，要从<a href=\"/remen/zuochan.html\" class=\"keylink\" target=\"_blank\">坐禅</a>中多参多悟契入。功夫到了自然开悟，都离不开坐和念，这样下去就能开悟。佛说这部经不是为普通修行人说的，而是说给佛的弟子们的；包括阿难，都是有一定修为的人。现在有的人没修行几天就想把这部经悟明白，一下子理解是不可能的。因为，没有修证功夫作基础，用思维理论去探讨研究，永远也研究不明白。现在的专家教授也证明不了人还有这么个真心。如专家教授能找到真心，那就不是佛学而是科学。为什么有些人开始信佛呢？不是他多伟大，而是有难事，没有办法了又没什么能力解决，才从求观世音菩萨护佑开始，这只是一种。真正懂得佛法的人，是从信佛修证开始的。一旦出家遇到法师有师徒传承，立刻就进入一种修行状态。如在家人听闻此经后，该怎么做还怎么做，腿一疼就不坐了，一有俗事就把念佛丢到九霄云外去了，那还是没有契入，想找到真心，门都没有。</p><p>　　说人往生是否是第八阿赖耶识？因为<a href=\"/remen/dujing.html\" class=\"keylink\" target=\"_blank\">读经</a>会遇到这个问题，往生时为心识。心识在人体内时为第八阿赖耶识，相当于体内的真心，相当于库房也可以，这里有黄金、有石头也有瓦块。通过修行，仓库中的黄金增多，就是功德在增多；石头瓦块减少，就是无明业力减少，心识得以纯净，才能去往生呢！如有无明业报，心识不能往生。修行人的修证过程就是心识得以纯净，功德得以增长直至往生条件的过程。否则，第八阿赖耶识一离开人的肉体就变成中阴身。在人体内出不来，是由于被人的六根所困所扰。为什么被困扰？有无明业报。有的修行人灵能出离，因为能把无明转化，能把业报销掉，功德增长，心识得到纯净，离体非常清明。开悟的人觉知自己的体内有个心识，立刻就找到转身处。开悟是通过身极静与心自净达到的，立刻转身知真心。人的心识在定三昧中有动，超越思维有无量智慧。现在有人说潜意识，那是第七识。达到净心念佛三昧时，人的思维没起作用。是谁在这念佛？这句佛号的力量怎么这么大？真心在起作用。达到念佛三昧的人、开悟的人或灵能离体的人，才知这是修行的开始，而不是修行的终止。在这之前都在借假修真，还没见道。道就是果位，没开悟没见道；有的人说，<a href=\"/fjrw/hcrw/syfs/105216.html\" class=\"keylink\" target=\"_blank\">平常心是道</a>；但有道的人，才有平常心。</p><p>　　这时，佛面门放种种光，其光如百千日，照耀十方世界，并有六种震动。同时，于此世界可见十方世界，十方世界如一世界；各世界诸大菩萨于本土都礼敬恭听佛说楞严正定妙法。<a href=\"/remen/foguang.html\" class=\"keylink\" target=\"_blank\">佛光</a>，现在世开悟的人于定中能观到，十方佛国土诸菩萨都能观到。佛住世时，佛用游戏<a href=\"/remen/shentong.html\" class=\"keylink\" target=\"_blank\">神通</a>力，将大世界变化为小世界。修行人有证悟后，有的能观到佛的国土都在虚空当中安立，虚空与虚空相通没有障碍，是一真如法界。毗卢遮那佛是一小真如法界，在一真如法界中，<a href=\"/remen/foli.html\" class=\"keylink\" target=\"_blank\">佛力</a>可以使各世界互动。于说法时，释迦牟尼佛的国土可以拿到别的国土去，别的国土也可以拿到释迦牟尼佛的国土来，互不妨碍，诸佛没有分别心。六种震动对修行人来说，就是身体六根的六种感应。显现神通就是折服众生的骄慢心，使其相信因果轮回。召感到佛住世时的众生相对易度，众生见佛有神通，并显现神通，自增信心。现在人不要看佛现神通才修行，而要看佛有功德才修行，才能自增功德。开悟的人为什么拼命去修行？因为了知宇宙人生的真相，因果轮回真实存在。如不修行将来即使到天上去，天福享尽也得轮回；只有修行这一条路，才能出离六道轮回。否则，金山银山带不走，娇妻美眷不常住，一切都将留在这个世界；只有因果轮回，且谁也不能代替谁。所以，有智慧的人，要真正发菩提心。</p><p>　　一佛说法时，十方世界的诸大菩萨都来闻法。报身菩萨供养十方诸佛，就是在听闻十方诸佛说法，未来成佛时也要具备十方诸佛的智慧。一佛的智慧是十方诸佛的智慧，十方诸佛的智慧也是一佛的智慧，一佛的智慧在因地修行时也离不开十方诸佛的智慧。法师讲法应是证到哪里讲哪里话，不知不讲。佛是整个宇宙一切法尽知，说法才能<a href=\"/remen/yuanrong.html\" class=\"keylink\" target=\"_blank\">圆融</a>无碍，在一真如法界中才显现神通<a href=\"/remen/zizai.html\" class=\"keylink\" target=\"_blank\">自在</a>。</p><p>　　佛说，娑婆世界的一切众生，包括地狱、饿鬼、畜生、修罗、人、<a href=\"/remen/tianren.html\" class=\"keylink\" target=\"_blank\">天人</a>等，从无始劫来，由无明业习染污种性，自然生出种种颠倒，如恶叉果一样同聚而生。佛、菩萨、声闻、缘觉四圣道是<a href=\"/remen/juewu.html\" class=\"keylink\" target=\"_blank\">觉悟</a>众生；四圣道以下是迷惘众生。这些迷惘众生，颠倒轮回，从什么时候开始不清楚。人从中阴身就开始颠倒，为什么投胎到这个家庭来，子缘其母、女缘其父而投其胎，性格相像，业习相近，有相同的因缘才相聚。现在有的人心行颠倒，出现很多奇怪的事情，贪婪物色无限，不知业报循环，将来因果轮回，还得万倍还人家。今天用颠倒来造业，将来要用颠倒来受报。天天生活在颠颠倒倒之中，是业惑心识的受体行作。第八阿赖耶识储存的业报不去掉，自性被无明覆盖，颠倒业报是很自然的事情。业报有其内在因缘，都是自己业习召感的；如今天有人打你骂你，也是无始劫来你打骂过他人；今天有病也是往昔食过众生肉、喝过众生血的业果。世间这么苦，众生还不想离开，若甜就更舍不得离开。现世间苦是为了度众生，也是众生的业报循环。读诵这部经，要知众生无始劫来业报循环，就像恶作剧，有很多非常恶的是非聚集到一起。能体会到这些无明烦恼，不是一个，有很多很多，见什么迷什么，见什么恼什么，说话、办事、生活的方方面面，有千百种；如看电视同情弱者，也随之着急上火，在思维当中执著这些文人写的悬念，颠倒。到死那天还执著，说“别火化我呀”，臭骨头还执著呢。人临死前如生龟剥皮，心识刚一离体就随业习见一些幻化像，见美女形、亲人形等，立刻跟着走了。为什么到地府转轮处转畜生的多，因为业习贪著。众生各种形体，是根据业习自己选择的，有贪著的因才结三恶道的果。</p><p>　　佛说，诸修行人为什么不能成就无上菩提？而另外成就声闻、缘觉？甚至成为外道或诸天魔王及魔眷属？有人用颠倒的心去信佛，有人用颠倒的心去修行；如有求心、执著心等。乐小乘法自了而别成就声闻；喜寂静独观<a href=\"/remen/shieryinyuan.html\" class=\"keylink\" target=\"_blank\">十二因缘</a>而别成就缘觉；执心外求法、著四相（人、我、众生、寿者相）而成就外道；妄执邪知见、妄著名闻利养而成就魔王及眷属；都是业习之根未除。诸位修行人别看不起外道、魔王及眷属，他们往昔可能是修行人，不明正法，妄执邪见，业报循环而堕落外道或魔道去了。修行人要时刻警惕，不要说我就烦这外道、那魔王及眷属等；我去不了或也不想去，到时就不是自己说得算了；心识离体以后它就不受主观思维控制了，而受业习控制。根据业习，什么业习就召感到什么道上去。什么是修行？天天静坐干什么呢？弃转习气。从修行<a href=\"/remen/jiedinghui.html\" class=\"keylink\" target=\"_blank\">戒定慧</a>当中转变自己的习气。修行过程中习气转了，就能守戒；心无烦恼，也就不生贪嗔痴。习气不转，一会求这个，一会又求那个，心有烦恼，能不生贪嗔痴吗！定的境界是一念不起，三昧常生，有智慧显现。智慧不现前，上哪找真心去。诸修行人都如此，不修行的人更是六道轮回了。</p><p>　　佛说，诸修行人之所以产生这样的结果，都是不知二种根本，而错乱修习。如同想煮沙石欲成美食，煮沙石多长时间还是沙石，永远也不能得成美食。什么是二种根本？一是不明无始劫来生死根本；即妄认诸攀缘的意识思维心，为自己的真心性识。二是不明无始劫来自性清净；即用自性妙识折射出的意识功能，妄生诸善恶因缘，再产生诸业习而保留下来。一切众生由于不明二种根本，而遗失不知本自清净圆明的自性；虽然终日劳心费神而不能觉知，白白地浪费时间而又徒然生死轮回于六道。</p><p>　　错乱修习是智慧不足，心中没有正法标准，不会判断适应自我根基之法，没有择<a href=\"/remen/fayan.html\" class=\"keylink\" target=\"_blank\">法眼</a>。佛说法还有五千人离席，不加阻拦。佛法不是语言上的问答，而是各人择法如此。修行人要记住管好自己，不要求任何人如何去行；讲法也是告诉他人，修行应从静坐念佛开始；至于他人回去坐不坐、怎么坐，与法师都没关系。不要提任何要求，自己选择，那是他人自己的事，五千人离席就离席。包括阿难，听闻佛法后，如何证悟是自己的事。诸修行人由于错乱修习，没有择法眼，找不到根本目标，如蒸沙石成饭想，沙石非饭本。由于错乱修习，找不到一位真正的善知识，不懂正法修行。结交善知识，关系到生生世世乃至无量劫的事；结交恶知识，带来的恶报也是无量劫。所以，要知重要性，不结俗缘，善结法缘。</p><p>　　众生不明自性菩提，尚须修行证悟圣性菩提，再成就<a href=\"/remen/foxing.html\" class=\"keylink\" target=\"_blank\">佛性</a>智慧菩提。众生不明自性清净本自涅槃，尚须修证圆满圣性功德净土涅槃，再成就佛性<a href=\"/remen/suiyuan.html\" class=\"keylink\" target=\"_blank\">随缘</a>示现涅槃。</p><p>　　佛为一大因缘故来到世间，化度众生。修行人为自己一大因缘故来到世间，干什么来了？解决生死问题。我信佛修行、听经闻法是为自己，解决自己的生死。所以，我听经给我自己听，我自己的生死解决不了，我如何去度脱众生脱离生死、去帮助他人解决生死呢！自己没有功德资粮，能帮助他人解决法饥饿吗！</p><p>　　什么是攀缘心？人的思维意识，被其它五根所转，追逐权贵、欲乐、名闻、利养等，都是攀缘心的反应。认为人的意识就是自性，人的思维就是真心，人的思维特征与习气就是心性，这就是颠倒。由于自己体内住有一个圆明的精体，它从无始劫来本自清净。但白白易污，夭夭易折，若不修行易被无明覆盖；如久存的黄金被遮蔽上一层灰尘。无始劫来这个自性被无明所遮蔽，召感哪趣就被什么无明所染污，形成各自不同的烦恼业习；本来是一张白布，却染成花布了。</p><p>　　众生的颠倒从哪里来；一是意识，二是习气。无明的烦恼习气所遮蔽自性而颠倒。自性本来具足一切，没有修行，功用不得发挥。说众生天天在红尘中行做，而不知自己有一个真如本性，白白地在六道轮回中循环。今天是蚂蚁，明天是人，后天是猫狗等，往来六趣还不知缘由，在各条路上颠颠倒倒地奔走。</p><p>　　有人问，灵能离体就是开悟吗？应是修行人于正定三昧中，灵能离体往来于三界无碍，住于中道，经明师认证后才为开悟。蛇妖的灵能也可以离体，怎么不是开悟？是由于它们的习气所致，功德不足；虽是灵能离体，上这个人的身，占那个人的体，但无有功德。它这个灵能是有业报覆盖的，灵能纯度不够，高度上不去；虽有一些报通，但灵能到一定高度时，各界天神不允许再往上升，只能在忉利天以下或四王天以下及这个世间走动，其它地方去不了。为什么教人依正法修行，因为修外道法得到的魔通、妖通不真实，必须是正修、正行、正定，才能证入四圣道。</p><p>　　佛说，阿难你现在欲修行证知正定的妙菩提法门，而志愿出离生死；那再问你，即时佛举紫金色臂，手轻握成拳，你现在见到了吗？阿难回答说，见到啦！</p><p>　　佛说，你是怎么见到的呢？ 阿难说，我的眼见佛举手臂握拳，其拳紫金色光明照耀我的心与目。</p><p>　　佛说，是你什么所见呢？阿难说，我与大众都用眼见到啦！</p><p>　　佛说，你用眼可以见到，但你的心是如何面对紫金色拳光照耀的呢？阿难说，佛问我现在心所在的部位，而我用心来推求至穷尽处，接次序寻找，这种推求寻找的功能，是我的心。</p><p>　　佛说，阿难别说了，那不是你的心。</p><p>　　这时，阿难突觉茫然，立刻离座站立，恭敬地向佛请法说，这不是我的心，又是什么呢？佛说，阿难这是你身体六根对六尘的功能表现，是对诸相虚妄不实的思维迷惑了你自己的真如本性；你从无量劫来至现在，仍认贼为子，迷失而不知本有常住的真心，才枉受生死轮回。意识就是体内的六贼之首，还觉得它怎么想自己就怎么做理所当然呢！殊不知是贼子替自己当家做主呢！意贼替自己当家做主，能好吗？能修到佛净土去吗？天天帮助自己打妄想，时时帮助自己出坏主意；若执著思维<a href=\"/remen/wangnian.html\" class=\"keylink\" target=\"_blank\">妄念</a>，并把它当作至高无上的我；我的名闻利养又是至高无上的，我的一切拥有更是至高无上的等，要知这是贼子在作怪；让自己常往来于六道，白白地遭受生死轮回罪苦。要知平常人是贼子当家作主；修行人是通过定空销除贼子，认识真心性我，停止贼子当家作主。有的人修行是进一步退二步，天天都在妄想之中，要知忏悔，认识这一真理法义。修行人在未开悟之前，虽然是贼子在给自己当家做主，但要把贼子功用降到最低程度。修行人明心见性是弃转习气的结果，弃转习气就是让人的意识功用彻底转化。人的根基不在于贼子功用的强弱，而在于人的自性被无明遮蔽的程度和有无功德。</p><p>　　阿难说，当初佛宠爱弟，我心也爱慕佛；佛劝我出家后，我心不单独是服侍供养佛，也愿意服侍供养无量世界国土诸佛与善知识；我已发大勇猛精进心，行诸难行能行的一切<a href=\"/remen/fashi.html\" class=\"keylink\" target=\"_blank\">法事</a>，都是用的此心。假如我谤法，永断善根，也是因为此心。若证明此心不是真心，那我等于无心，同土木一样。若离此觉了能知的心，就一切无所有。佛这么说，此心不是真心，我实在害怕，包括在座的大众也不知怎么回事。所以，请佛慈悲开示这些未开悟的众生。</p><p>　　阿难说的非常实际，信佛的人天天用思维上香花果等供养佛，不都是心吗？怎么不是真心了呢？未开悟之人听闻此法是真害怕、真惊疑。修行人一旦开悟了要痛哭几小时或几天，原来无始劫来所做的一切事尽是颠倒，自己太苦太傻了。从今天开始才知世间的森罗万象，都是言行起因缘，罪福身心受；谁也不能替代谁，迷与悟真是两回事。悟的境界，瞬间天下静，不觉世上情；往来不相代，你我谁是谁。心中好恐惧，不觉两泪流；惜为红尘客，有岸不回头。心里恐惧害怕呀！我在这个世间非常孤独呀！孤独到身边的人谁是谁呀？无始劫来，和这个是眷属，和那个是眷属，六道众生都曾是眷属，苦不苦？太苦啦！真相就是这样！所以，开悟的人都痛哭！开悟的人知道，人身意识功用是正常的事；但还有自性可以超越三界，真我又可在十方发挥作用。所以，意识可以转化；众生的三界火宅肉体是，包括人的意识；圣人的世间净土肉体是，心已转迷为悟。人同样都有一个大脑，圣人的心不颠倒了，六根不迷诸相有了，视而不见空掉了，声香味触法也无所谓了。众生的意识还帮助打妄想呢，知道吗？执著于这个那个，听经闻法也犯困，出了道场以外有睡的时间，一睡一千年。虽然睡觉是身体本能的反应，但也是业报的一种表现。佛住世说法时，有一位新出家的弟子听法就睡觉，佛呵斥后上火了，啼哭自责，七天七夜没睡觉，结果双目失明；但他不改初衷，佛开示他修行天眼通的方法，便证得乐见照明金刚三昧，不因眼见而遍观十方。所以，财色名食睡，地狱五条根，修行障道一般先从身障开始，然后才是智障、业障等。</p><p>　　这时，佛开示阿难与大众，欲让大众真心证入无生法忍。于师子座中摩阿难顶后说，佛经常开示大众，世间诸一切法存在并发生作用，唯依众生的缘心和佛化度众生的愿心所显现；世间一切因果循环规律和日月、虚空、大地等万物法相，也因众生的缘心与佛化度众生的愿心所形成体相。如同十方诸世界的一切存在一样，其中包括一草一叶、一线一结等，都有各自形体特性；就是山河、大地乃至虚空，也都有各自名称和体貌；更何况是真实存在的清净妙净自性所显现的明心呢！这种清净妙净自性识体显现的一切心能自无形体吗！若你认为人的觉了能知的功用就是心，此心也应与六尘变化事物的作业不同而相互分离，另外完全独立的存在。如你现在听法，都是因为有不同音声，才产生分别心；并能暂时销灭其它诸外缘的见闻觉知，保持清静的思维状态；但依然为法音的声尘，是意识分别如影不实之事。佛并没有强让你执著此分别心，但你的思维要认真推理分析；如你能离开音声等尘事而再有觉知分别的识体，那才是你存在的真心。若这种有觉知分别的识体离开诸尘事而不能功用，只能与尘事相对的虚幻存在；如尘销事灭时，相对存在的虚幻之心则同龟毛兔角一样而不真实存在；而你的法相身体也随同于尘销事灭，还有谁修行证入无生法忍呢？此刻，阿难与大众都沉默不语，不知所以然。</p><p>　　明心的人，得入无生法忍；不能明心的人，未证无生法忍。为什么？六贼当家做主，而不是心当家做主。若不把六贼转化到正知正见上来，是心颠倒；能得入无生法忍吗？世界因心成体，<a href=\"/remen/weixin.html\" class=\"keylink\" target=\"_blank\">唯心</a>所现。唯心所现就是第八阿赖耶识召感的业因，才召感到此世间诸相的缘果。为什么修行人能召感到极乐世界去，人心纯善而无著，人心清净而无业，佛菩萨接引能往生极乐世界，这就是唯心所现。什么是因心成体，阿弥陀佛发四十八大愿，愿愿度众生，佛国土清净，将来什么样子等，这不是因心成体吗！十劫坐道场最后成就极乐世界的佛国土，是不是因心成体？是！佛怎么造化宇宙的？因心成体。如我所发大愿也是依这个法理，第十一大愿，愿我来世得菩提时，愿无量众生闻我名者，见我像者，皆心生欢喜。乐持我名，愿生我土。乃至命终时，心生一净念者，我即带领百千菩萨前来接引，化生见佛直至菩提。若不尔者，弟子誓不得菩提。第十二大愿，愿我来世得菩提时，愿我国土功德庄严，正法久住，无有像法末法，无有诸天及声闻缘觉诸智慧不足之人，所有众生皆具行菩萨道之人，具足菩萨智慧，具足菩萨种性，具足菩萨明杰，具足菩萨妙音，具足菩萨清净，具足菩萨勤行，具足菩萨愿心，具足菩萨法藏，具足菩萨安乐，具足菩萨无碍，直至菩提，若不尔者，弟子誓不得菩提。佛的愿力可造化宇宙，改变这个宇宙。十方世界是根据诸佛愿力所化，不是人力所为，不是思维所现，不是现代科学研究得了的。劫尽时一切回到原始状态，劫初时一切重新安置再现；而一切众生根据业力，召感千形万态之体，受善恶业报之果。这就是宇宙人生真相。</p><p>　　意识功用可攀缘，正是因为有这些攀缘才有六根对六尘与六入的因缘，正是有这些善法因缘才能把人带入修行，得戒体法体并能转凡为圣。当人是凡夫的时候，意识是六贼之首；当人转过身来证悟时，意识就可感知心的存在；当人行菩萨道时，意识就可具有正知正见，弘传佛法，续佛慧命；当心证得菩提时，意识就可觉悟自性的功德。读诵《维摩诘所说经》要知道，众生在哪里，哪里就是弘法的地方；哪里有烦恼，哪里就是修行的道场。认识六根功用并转化六根功用，达到超越意识的智慧显现，就能了脱生死。不能了脱生死，是人智慧不足，说六贼就害怕；不能了脱生死，如是顺流背本己，生死<a href=\"/remen/kuhai.html\" class=\"keylink\" target=\"_blank\">苦海</a>浩浮盈，轮回无尽期。修行人逆流来明心，才能了脱生死，才能有始有终。否则，意识思维最可怕。把烦恼转过来就是菩提，转化过程就是修行弃转习气的过程。习气哪来的？无量劫来的，是通过第六意识传导入心，业力召感来的。人的思维千差万别，习气也千差万别；表现为一个人一种特征、一种习惯、一种性格、一种需求等。</p><p>　　这世上一切草木有它的根性，有神在各自主持着。人造小草不能生长遗传，只有它的物理特性。有少部分人死为鬼，鬼死为渐；如毁法灭教极恶的众生死后，魂魄震碎，哪里去了？在宇宙中能量不销失，鬼死为渐依附于草木上，是鬼类震碎心识的细化，让它的体性失去知觉，不再危害佛教善法与菩萨善行。为什么妖类作恶时也要震碎魂魄？因为一旦它们入魔道，扰害修行人行菩萨道时，除动物的妖身被斩杀以外，<a href=\"/foxue/changshi/153417.html\" class=\"keylink\" target=\"_blank\">罪恶</a>极重的还要震碎心识，是天地不容。所以，古德说“宁可千日不悟，不可一日着魔”，道理就在这。人着魔以后，心性被魔搅乱，轻者转为魔子魔民，重者恶极要被震碎心识。什么时候复原？贤劫千佛出世后，劫尽时草木等一切被地下岩浆烧毁；即经过世界坏空成住一个大循环后，这个世界重新开始；根据未来劫千佛的愿力，再有机缘恢复灵性。所以，草木都有它的体貌特性，虚空也有体貌特性。这个世界是娑婆世界，这个虚空是毗卢遮那佛的法性身；法性无体，包藏宇宙，整个娑婆世界是一真如法性体。人只见这个世界与虚空而未见佛性妙法，可佛性妙法却尽在虚空；虚空法性有无量大，一切星辰日月和此世界的地水火风及万物生灵等，都有各自的存在空间；又各有各自的主宰；如主药、主稼、主林、主山、主海、主水、主火、主空、主昼等神，平常人能见吗？包括宇宙各个世界的奥妙，若没有佛的法性密藏，哪里来的奥妙？只不过是人愚昧，智慧不足，见不到这些法性实相；用眼或借助仪器等外力，只见一些理性物相。极乐世界是阿弥陀佛的法性，佛的虚空，佛的愿力成就。一佛国土，就有一尊佛的法性身。若佛不证知宇宙法性实相，佛能在十方世界说法吗？若一切无有法则与主宰，因果轮回不就乱了吗？一切必须是佛的智慧与能量，总摄宇宙。当佛法在此世界陨灭时，三灾八难相继降临，人类也不会有太多的生存时间；火山岩浆喷发，地球进入一个小循环坏的阶段，大海的水被蒸发到天空中去。再经过空和成的阶段，进入住的阶段，岩浆停止，有山有水有风吹等，地壳逐渐稳定。地球现在是住的后期阶段，众生充满世间；在地球住的初始阶段，形成了这个细胞、那个细胞等。在地球住的中期阶段，出现了各种动物等。只有在地球住的后期，天降灾难，恐龙等一些动物灭绝；才逐渐产生原始人类，再逐渐出现文明，到现在发展到科技时代；如是猿变成人，那现在猿猴怎么变不了人呢？这些用科技手段证知不了。人的真心是无形的，想象无法形容；真佛无相，就是这样。</p><p>　　人若要执著分别这个思维是心，那人的思维应离开色声香味触法。心应是一种独立的存在，能独立吗？思维不可能独立于色身的大脑之外。人活着思维可以乱想，人若一死，大脑停止活动，就不能再有思维。思维起的分别，是眼耳鼻舌身意在起作用，是世间尘染的虚幻影像。思维有分别性，见事就有分别，总想分出个大小高低、美丑好坏来；修行人就从这里下手，把这个分别性停止。怎么将分别性停止呢？就是静坐念佛，定入三昧，一念不生，一念不起；<a href=\"/remen/canchan.html\" class=\"keylink\" target=\"_blank\">参禅</a>的人参到海枯石烂，当头棒喝立即明心见性；修密的人，修到一念不生，一念不起，定入三昧而出现既可观照又可灵能离体。什么是初静与初空？这是我修行真实走过的路；当初静时，呼吸如狂风怒吼，血流如江河奔腾，心跳如战鼓不停，肠动如暴雨雷呜。修行人禅修密行到这个境界的时候，每一个细胞发生什么变化都心知。当初空时，突觉身无边，瞬间宇宙同。定的境界，科学研究不了，也回答不了。息似晴空无风，说白了呼吸没有了，内里很忙，隔肌抽动几下；脉似旷野夜静，出现定的境界。定的境界是血液循环与呼吸停止了，下丹田抽动几下后，心脏立刻停止跳动；心脉开时，心脏就如掉进凉水盆里。说心脏不跳动会吓死人，只有走过来的人讲不要害怕，那是境界。为什么修行人离开善知识行走不了？说白了，修行刚搭边，境界就把人扳回来，心过不去。身似一滩清水，这时才感觉身心如一滩水似的，清澈透明。<a href=\"/remen/shana.html\" class=\"keylink\" target=\"_blank\">刹那</a>乐无时日，什么时间地点根本不知道，空无所有。定的境界入三昧时，心识离体清明。就这个身体可超越时空存在，几千年万年亿年都可以，如大迦叶尊者鸡足山入定。达摩祖师在少林寺静坐九年，那就是入定；身体不被空气氧化，不受外界六尘染污，也不用食物维持，就保持当时的能量状态。什么时候一敲木鱼召唤，立即出定，身体一切恢复正常。否则，证悟人哪来的法妙。心识离体清明，即<a href=\"/remen/shenshi.html\" class=\"keylink\" target=\"_blank\">神识</a>出离肉体，仗佛威神到宇宙中各处一观，才证知宇宙人生真相，才觉知自心在佛的法性身内太渺小，才悟知妙明心性缘来如此。这时，人不再执著这个肉体，一丝一毫的留恋也没有。随心所愿处行，三界内去哪都可以，一些因缘可以照见；根据修证功德不同，心行高远也不同；只有化身成就的菩萨，才能于十方世界任由往来。天堂地狱可去，光速万倍太虚。光是最快的，可是与神识所行相比慢多了。到其它星球刹那就到，速度相当快，就如东家到西家串门；只是各星球时间差不一样，回来时一夜或几日过去。只有定入三昧，才能把分别性去掉。还用思维去找心吗？平时修行不吃苦永远也找不着心。这个世界出离的人少，特别是末法时代，太少了。想找个真正出离的善知识都是难上加难，找一些有点悟性的法师都难。有的法师讲法，闹了半天他自己一点定的境界都没有，讲什么法呀？正知正见都讲不出来。现在讲法，就要讲出末法中的正法，末法中的正语，末法中的正福，末法中的正智。</p><p>　　若分别心没有了，见闻觉知一切事，是一种虚幻尘劳，是一种扭曲颠倒；只有这样，才能见真如本性。当人的思维心断灭时，即是死之时，意识还存在吗？意识将随着的肉体死亡而销失。所以，尘劳影事都是思维当中产生的，思维感受的。修行人只有见到真如本性，才能达到无生法忍。否则，没有开悟。亲人近人有点痛苦就哭，认为开悟就是欺骗自己，被情所转。情是尘劳影事，心被尘劳所转。开悟的人为自己落泪，不为任何人落泪，昔为红尘客，有岸不回头。做了颠倒的事情，被情所困；得到无生法忍，世情已空；肉体是断灭的，心识是常住的。</p><p>　　佛说，世间一切诸修行人，于当前虽然能够成就九种不同次第定；但是不能证得漏尽通，只能成就一至四阿罗汉果；都是因为执著于意识的颠倒妄想，误认虚幻假象是真实自心；所以，如今天你阿难一样，只是证得多闻第一，还是不能成就彻底<a href=\"/remen/jietuo.html\" class=\"keylink\" target=\"_blank\">解脱</a>的菩提圣果。九种不同次第定是，初禅定、二禅定、三禅定、四禅定、四空处定、空无边处定、识无边处定、无所有处定、非非想处定。漏尽通是，菩提心中除尽生死之根，净尽无明之本，证得慧解脱或俱解脱的神通自在力，彻底解脱。菩提圣果是，发菩提心而成就的大阿罗汉果、菩萨果、<a href=\"/remen/foguo.html\" class=\"keylink\" target=\"_blank\">佛果</a>。我与诸位讲过，讲法是讲证悟还是讲体悟，这是凡圣之别，隔着凡圣二重天。一果罗汉以上讲些证悟的话；否则，说不起证悟两个字。有证悟的人让其舍佛法修行他不干。为什么？自明道业须一步一步的真修实证而成就。否则，都是用理论修行，用思维讲法，用感知解义，只有世间的大聪明。阿难即使是佛的堂弟，不修行仍然是未证漏尽通；修行谁也不能替代谁，不修行永远也不可能证得圣果。佛住世时是这样，正法与像法时代是这样，末法时代更是这样。受善知识教后也得自己实修，自己除灭自己的无明，自己了脱自己的生死。</p><p>　　阿难闻佛说法后感悔交加，悲伤流泪，五体投地，长跪向佛请法说，我以为随佛出家，可仗佛威神力不须自修，佛便恩惠于我正定三昧力；不知修行各自身心本不能相互代替；即身是堂弟，而心无堂弟相，佛是佛，阿难是阿难，心和心只有法缘而没有俗缘关系。心本来不相代，你我谁是谁。所以，迷失本有真心，认贼为子；身虽出家而心未入佛道；就如一个穷儿子舍父远逃。</p><p>　　穷儿子是谁？是思维。父亲是谁？是心性。无量劫来，是自家的贼偷了自家的宝，不知寻自家的宝还自家。有个典故上说，伐木人把树枝子砍做木头楔子，先夹在锯口上；然后，才能把这棵树锯倒。这棵树倒后说了，我不恨伐木头的人，我恨这些树枝子，它是我身上掉下来的肉，还帮助伐木人把锯口嵌开，将我锯倒。为什么？凡夫是自家贼偷了自家宝，修行人是找到自家宝还自家。佛的诸弟子都得自己去实修才能证道；佛为示现菩提也不例外，雪山苦坐六年。可一些人见佛正法心生恐惧，不好修呀！难呢！一听哪位法师讲一本经书、一句佛号，不须静坐修行，就能往生极乐世界，这个省劲呀！攀缘心重，想用最小的投入得最大的果报。事实上不可能，只是种善根，道业尚须慢慢成就。心出家是发菩提心，出三界火宅之家，成就佛道。</p><p>　　阿难接着说，今天我才明白，虽博学多闻而未实修，只是意多闻，不是心多闻，于未闻相等，只种善根；如同天天说吃饭，却一口没吃，最终还是未饱。我与诸位讲，十几年前我没读诵过经典，也没上香供养佛，就静坐修行，一门深入。什么功德事都暂时放一放或随缘，就以静坐修行为主。我师父就这么教我的，我就听师教。我师父说，“你呀没地方去请佛像，好好静坐念佛就行，以后修出来的时候就什么都有啦”；我静坐修行十年后，证悟境界就是不一样；如天天去各处拜佛，去四大名山拜庙，心天天向外求，转了一圈，佛还是佛，我还是我。心性说不出来，就是值佛住世，佛也不能替代我修，我心也不能见佛，就是这个法理。我修我得，自己吃饭自己饱。我听经是给自己听呢！读诵受持此经是为自己读诵受持呢！自获法益后，再去利益众生。修行人就应这样，证悟后有所言说离言说；否则，言语道断，自性无言说。若有人闻法后不去修、不去行、不去证，只是往八识田里装点善业而已，几十年后这人死了，这人白听了，我也白讲了，只种善根。此经为什么是开悟之经？是让人明白佛教的实相法，再依法修行，才能开悟证道。法师带弟子，初始是不论弟子以前参访修学到什么法理，暂时统统<a href=\"/remen/fangxia.html\" class=\"keylink\" target=\"_blank\">放下</a>舍去，一门深入去修行；修行过程中，逐渐克服心烦意乱，腿痛身懒等。当修行人眼睛一闭，往那一坐，有时<a href=\"/remen/zijue.html\" class=\"keylink\" target=\"_blank\">自觉</a>满身发光；这光是正常的，只是一个气罩，不是自心之光。修行有成就时，可自观无色心光，没有杂染。</p><p>　　阿难接着说，我与一些修行人被二种障所缠缚；一是烦恼障，诸事执著而生贪嗔，分别而生疑谤；二是智障，凡夫执著我见我慢而生嗔恚，二乘圣人执著法相法理而生我有。长时间处于迷惘状态，不知本自寂然常住心性；惟请佛慈悲哀悯我等法穷无安身处之子，能觉悟自有妙明真心，早开慧眼、法眼、佛眼。这时，佛从胸间卍字涌出百千色耀眼宝光，普照十方世界，普遍灌注十方宝刹与诸佛顶，又旋回道场至阿难与大众顶。佛胸间卍字宝光，表示妙明佛性的正智具足；又表示众生皆自性正智具足，只是未证圣性。佛说，今天对大众要讲大佛顶首楞严法，也让十方众生都能获知本自具有的微妙密细的明心净性，得开清净法眼。清净法眼不是肉眼，是用心观察诸法，用心照见诸法；否则，不是清净法眼。清净法眼是功德成就，自然观察到诸法相无常。得清净心的人到其它佛国土，为什么不用语言文字？心性本自具足。</p><p>　　佛说，阿难你先回答，你见佛握的光明拳头为什么而有光明？为什么轻握成拳？用什么所见？阿难说，金色拳的光明从佛的全身清净宝光所生；拳是佛将手指一屈轻握而成；见实是用我的眼见。佛说，今天实话告诉阿难你，很多修行证有智慧的人，须要以事例比喻才得以明白法义，得以开悟证道。若无佛手则不能轻握成拳，若无你眼也不能成为你见；以你统摄见功用的真心自性事例比喻佛轻握成拳的法理，其法义能相同吗？诸佛是具足智慧者，诸菩萨是具有智慧者，诸阿罗汉是具有限智慧者。修禅的人有疑就有悟，不疑不悟，大疑大悟。自己在静坐念佛时，南无阿弥陀佛一句佛号在意识生起，就找谁在念佛；一个念的，一个找的，两个念头；开始是思维念，心里那个找，后来是心里那个念，意识去找；就是让人去参悟。开悟不是用思维去推理判断；而是清净心定三昧中去观照因缘；否则，思维一推理判断就容易产生谬误。</p><p>　　阿难说，是这么回事；如无我眼则不能成为我见，以我统摄见功用的真心自性事例比喻此成拳法理，其法义类同。佛说，阿难你说的法义类同，其义理是不可能的。为什么呢？若没有手的人则不能轻握成拳；但没有眼的人虽不能眼见，却不是能统摄见功用的真心自性完全没有。为什么呢？你可试验一下，询问走在途中的盲人见到什么？盲人必然回答你，我现在眼前唯一见到的是黑暗，其它什么也不见。以这样的义理观察推断，盲人眼能见黑暗色尘；由此而论，统摄见功用的真心自性有什么亏损呢？阿难说，那盲人眼前是什么也不见，唯一能见黑喑；是用什么见到的呢？佛说，把盲人和正常人，同样放在黑屋子里，二者所见黑暗有区别还是没有区别？阿难说，二者所见黑暗比较，应没有区别。佛说，若盲人在黑屋子里所见是黑暗；但于突然之间，盲人恢复眼功用，可见外部种种景物；这时可称此人为眼见。若有眼人在黑屋子里有见是黑暗；但于突然之间，于黑屋子里出现灯光，也能眼见种种景物；这样能否称此人为灯见呢？如称是灯见，灯也具有能统摄见功用的真心自性，就不能称为灯；再如称是灯能见，那灯见还关阿难你什么事呢！ 借着灯光能见，为什么不能见自性呢？灯见还关系阿难你什么事？这是佛点悟的法语，平常人此问就给挡住了。被什么给挡住了？我慢！平常人会想，尽给我出难题；而产生逆反心。但要<a href=\"/remen/jiaohua.html\" class=\"keylink\" target=\"_blank\">教化</a>众生，不出难题就不能降伏众生慢习，去除逆反邪见，仍就执迷不悟。</p><p>　　佛接着说，据此义理应知，是眼借灯光显色才能见种种物体，能见物体的是眼而不是灯；但眼只能见灯光显色的物体，而不能觉知分辨物体的物化作用；这样的眼见只能是身心整体功用的结果，而不单独是眼见。眼若即见与若离见，仍不是心见；是第七识的传导功用的显现。只有修行人进入禅定状态，才能回光返照心开，不用灯光也能观察到物相，这才是心见。阿难与大众，虽有些明白，但还不能了悟；仍然盼望佛慈悲再给予开示，便诚心恭听教诲。这时，佛舒展一下绵软相光之手，展开五指，不容置疑地教诲阿难与大众说，在菩提树下佛成道初期，于鹿野苑曾为阿若多等五比丘及四众弟子说过，一切众生不能修行而成就佛道及证得阿罗汉果，都是因为被客尘烦恼所误。五比丘等你们当时是怎样去除客尘烦恼而开悟及成就阿罗汉圣果的呢？什么是客尘？心外诸法都为客尘；即由根尘偶入因缘产生的一切见思二惑。什么是客尘烦恼？由见思二惑产生的无明；即执著诸相的分别妄想。这时，憍陈那离座起立向佛说，于大众中都称我的名字为最初解悟的人，是因为悟了客尘本空，才精进修行，证得阿罗汉圣果。我用事例比喻，一个客人投入旅店，吃住之后，收拾财物就往前走，这个地方不是常住的；如我是这里的主人，我吃住在这里就不走了。身体是旅店，心是客尘的主人，身体不是心的主人，这里不是心常住的地方。我再用事例比喻，雨过天睛时，太阳从天上升起，光芒照入门隙之间，见到室内浮尘飘动的景象，而虚空依然空寂而没有变化；如按照这个法理去想，清净智慧寂然不动就是证空，烦恼不停的摇动就是客尘。</p><p>　　人的身体意识都是客尘，何况眼睛观察到的外部世界，不更是客尘吗！不要小瞧客尘两个字，憍陈那在大众中很有才华，是长老中年岁比较大又修行经验很多的人，得到最初解悟的名字，大众中有什么事不明都向他请教。</p><p>　　人的肉体早晚要离开这个世界，心不可能在肉体内常住。道家修仙可以在世上活一万年，也只不过是看尸鬼；他们执著<a href=\"/remen/shouming.html\" class=\"keylink\" target=\"_blank\">寿命</a>久长，身是真我，天乐常住；所以，就修这个身，而不修心。佛教化弟子不执著于客尘，不执著于这个肉体享乐。修行人用心观必然达到空的境界，只有心空而智慧生起，才用心观而不用眼见。人的血流、呼吸、细胞、神经、思维都在动；所以，整个身体就是客尘。如不能将这个客尘静下来，心就不净。必须修行到身空、意空，心才能空。离开定空，心什么都不能观，修行必须从定空入手。</p><p>　　佛说，憍陈那你说的心智观客尘符合法义。这时，佛在大众中用手轻握成拳后将手伸开，手伸开后又轻握成拳。佛说，阿难你见到什么啦？ 阿难说，我见佛百宝轮一样的手掌，一会伸开，一会又成拳。佛说，阿难你见佛手于大众中有开有合；那究竟是佛手有开有合，还是你见有开有合呢？阿难说，是我见佛手在大众中自开自合，不是我统摄见功用的真心自性有开有合。佛说，佛手与你统摄见功用的真心自性是谁动谁静？阿难说，是佛手连续开合在动；而我统摄见功用的真心自性没有动也没有静。若我真心自性没有动静相，就不存在真心自性的动。 佛说，阿难你说统摄见功用的真心自性无动静相符合法义。这时，佛从手中放出一缕光在阿难头的右边，阿难将头转向右边；光又向左，将头又转向左边；阿难随光动而左顾右盼。阿难你现在为什么头在左右摇动呢？ 阿难说，我见佛放的一缕光在右边时，头便向右看；光在左边时，头又向左边看。所以，我头才左右摇动。佛说，阿难你头随见佛光而左右摇动，是你的头在摇动还是统摄见功用的真心自性在摇动呢？条件反射时六根发生反应变化，这是人正常的一种本能。心是否随客尘转呢？不悟的人一定随客尘而转，悟的人一定不随客尘而转。为什么？开悟的人，心可以转化客尘烦恼为自性菩提。阿难说，我见到光，是头自动。而我统摄见功用的真心自性没有动止相，也就不存在真心自性的动。佛说，阿难你说统摄见功用的真心自性无动止相符合法义。这时，佛又对大众说，众生还是认为身随外界条件变化是尘，外界条件的变化为客；即只知主观与客观是对立的统一，而不知真心自性的存在。你们见阿难的头在摇动，而见功用没有动；又见佛手自有开合，而阿难的见功用没有舒展与卷曲。你们想一想，众生身体为什么随外界条件而运动呢？就是从始至终，都以念生念灭在思维客尘。所以，众生遗失真心自性而不觉，颠倒行事而不知；既失真心自性，必认假身妄想是我，从而轮回于六道之中，完全是自取生死<a href=\"/remen/liuzhuan.html\" class=\"keylink\" target=\"_blank\">流转</a>。</p><p>　　佛光为尘，头动就是客；身体为尘，运动就是客。为什么身体为尘，天天在动，动就是客？因为身随外界条件变化而变化，产生我看我听我知我想我得等。如外界条件发生变化时，人的眼耳鼻舌身意立刻就随变化而欲见闻觉知。众生现在是这样，从无始劫来都是这样，五蕴炽盛，前念灭后念生，才有生死轮回之苦。众生自以为这是合情合理的，但这就是迷失真心自性。修行人一旦开悟，明心立刻不颠倒；如不是正道来的财物有业报相随，不贪了；食物多有多吃，少有少吃，吃好吃坏都是一生，不贪了；见美男美女转眼色衰，不贪了；终日面对的是自心安理得，非他是非短长；身心清净，停止颠倒。可是众生的身心时时处处在颠倒，认为颠倒才好，不颠倒不好；认为客尘的身体是我，得到的一切就是我的。殊不知自己在生死之中轮转，这个身体销失时，新的生命体是什么不知道，可能是狗是猫或是天人等六道中的一种。众生的身体有需要，为这些需要去造作新业，又随新旧业因缘和合而轮转。什么是轮回？轮回是业报在轮转。地狱为什么有轮转？是众生的业报天天在轮转。业报为什么天天在轮转？因果是始终的两端，有因就有果，有果必有因。</p><p>　　第一卷从找心开始，不要被这些过程所迷惑；经文怎么好，法义怎么难涉难入等，先放下这些知见，这只是一种缘起。这一卷要知，佛给阿难说法，憍陈那找到心了，开悟的人找到心了，佛知道心在哪里；而众生没找到心，是认贼为子。通过听闻佛法，从文字上理知宇宙人生的真相。对客尘烦恼怎么认识，用哲学的话说是世界观；若相信的是唯物主义，就认为人主观意识等一切，都以时间、地点、条件为转移。若相信的是唯心主义，就认为主观与客观等一切唯心造，一切事物想就有，不想就没有，强调精神对物质的反作用；这样的唯心只是一半，心法不了义。我给诸位讲，唯物主义一半是正确的，彻底的唯物没做到，佛才是彻底的唯物主义。佛知道人体内有个心性真我；即在人体内第八阿赖耶识中。对人体内有心识存在，现在的科学无法证知。心识存在又怎么不是物体？空气、电流、电波、原子等，这些虽见不到也觉知是物质存在。心识也是存在的，只不过平常人没有修证，无法觉知存在而已。现在的唯物主义是看得见、摸得着、感受得到的。身体这个客尘本身就是感受到的，世间的法则就是这样，生灭就是世间法。彻底的唯物主义才能彻底明白，一切众生身体里都有个心识存在。彻底的唯物主义和彻底的唯心主义无有区别，是一不是二；但对众生，既是一又是二；如说这手心和手背，能说手心是我的，手背不是我的吗？它们都是统一的，一切唯心造与存在是一个事物两个方面的不同表现。有修行的人懂得哲学，懂哲学的人未必懂了得佛学。\t\t\t\t</p></div>"
},{
    "title": "【大佛顶首楞严经卷二】",
    "author": "净慧大师",
    "date": "",
    "html": "<div class=\"B1_text\"><h2>【大佛顶首楞严经卷二】</h2><p>　　这时，阿难与大众听佛这么开示，对佛说法深信不疑，身心泰然，立即观照自己；无始劫来缘来如此；妄认虚幻客尘是我，妄失自己的真心自性。闻佛说法，才如梦方醒；我们就如失去母亲的婴孩，忽然又遇慈悲的母亲。大众都恭敬<a href=\"/remen/lifo.html\" class=\"keylink\" target=\"_blank\">礼佛</a>，愿再听闻佛说法，进一步开示心是怎么真实存在，而又不生不灭？身是怎么虚幻不实，而又生灭不息？身心二者之间的因缘<a href=\"/remen/zhendi.html\" class=\"keylink\" target=\"_blank\">真谛</a>在哪里？</p><p>　　为何佛住世度人好度呀？佛说法大众就相信，不去研究法如何。心不怀疑，停止妄想，放下执著，欣然修行。这样依法修行，能速成就。这时，波斯匿王离座站立向佛请法说，我在没有接受佛教诲前，只听迦旃延和毗罗胝子二人说，人的身体死后就是断灭，什么也没有就称为涅槃。今天虽当面听闻佛说法，仍然有些疑问；如何修行才能证知此心不生不灭呢？大众中诸未证无漏的人，也都想知法义。妄认身死断灭就是涅槃，是外道法。三果罗汉以下的人，都为有漏的人。阿罗汉为无漏，是诸漏已尽。佛说，大王，今天只问你，此身是否如金刚常住不能朽坏呢？还是要无常朽坏呢？ 大王说，我此身是无常之身，早晚有一天要朽坏而死。佛说，大王，你现在活的很好，如何知一定要朽坏而死呢？大王说，我此身虽然现在活的很好，但随时都有可能朽坏而死。据我观察当前是念生念灭，念灭念生，新陈代谢，永不停止；此身也如薪火成灰一样，有旺盛也有销殒；燃起与殒亡，交替不息；所以，我坚决相信，此身一定要朽坏而死。人走到高峰时，面临的就是低谷。当人处于艰苦时，还会信心百倍；当<a href=\"/foxue/changshi/153455.html\" class=\"keylink\" target=\"_blank\">命运</a>跌到低谷时，还会有好运等着。所以，人得意时，且莫大意；人失意时，且莫失志。佛说，大王所说符合法义。并问大王说，你现在虽然年岁大了，身体有些衰老；但你的容颜相貌与孩童时相比，有什么变化吗？大王说，当我孩童时，皮肤细腻，心情活泼；少年时血气方刚；壮年时，心思老成；现在头发白了，精神颓废了，脸上有皱纹了，离死也不远了，怎么能和青壮时相比呢？佛说，现在大王的身体很健康，不能很快衰朽。我问诸位，世间的智慧在哪里？在世间的一切烦恼处。若能把世间的烦恼转化了，才有本事。世间智慧的常态是什么样，智慧如水，如水一样顺从，见硬慢慢渗透或绕行；还可为气、为雾、为雨、为霜、为雪、为冰、为电、为物等；遇到烦恼，有很多种转化方法；如今天解决不了，还有明天。佛法随顺世间法，让人容易接受奉行。</p><p>　　大王说，我从小到大，只知年年过年，春夏秋冬年年过，不知不觉就这样了。我的面容相貌二十岁已衰老于十岁时，三十岁又衰老于二十岁时；今年我已六十二岁了，回想五十岁时，仿佛还很强壮。时光流逝，十年一个变化，年变化是以月为单位，月变化是以日为单位，日变化是以时为单位等；我见是日日增加为一月，月月增加为一年，我几十年就这么过来的（十二年为一纪）。我细致观察念念流转，一刻也没有停止过；所以，知道我的身体也得变灭，不可能永存于这个世界上。佛说，大王你身体随时间于不知不觉中变化不停，悟知自己有一天会死亡；当你死亡时，知不知身中还有一个永远不死的真我呀？大王说，我实在不知。佛说，现在就让你明白身中存在一个永远不生不灭的自性真我。并问，大王你几岁时见到恒河水的呀？大王说，我三岁时，慈爱的母亲带领我参拜长寿天神求寿的途中，经过恒河；当时即知有此恒河水。佛说，大王如你所说，二十岁时衰老于十岁，乃至今年六十二岁还念念不停；日月时光的流逝，于不知不觉中也留不住；而你三岁时见到的恒河与你十三岁时见到的恒河，有什么不同吗？大王说，如三岁时所见到的恒河，仿佛没有什么变化；直至今年六十二岁，仍然没有变化。佛说，大王这样观察自然伤感，发白、面皱；但这些是与童年相比较而有变化；而你现在见恒河，与童时见恒河的统摄见功用的真心自性相比较，有没有童老之别呢？大王说，人虽老了，眼有些昏花；但统摄见功用的真心自性没有童老之别。佛说，大王虽然你的面变皱了，而你统摄见功用的真心自性从来就没有皱。面有皱为变化，真心自性没有皱为无变化。有变化的身体就一定受生受灭；而真心自性没有变化，则自然无生无灭。你的真心自性怎么随身体生死而同时断灭呢？怎么相信不见道的人所说此身死后什么也没有的外道法呢？面上有皱，为人衰老；心有皱相，为人烦恼。若面有皱，心无皱相；为人离相，为人童贞。大王说，听闻佛说法义，我明白身舍生命后，被无明覆蔽的心性还要随业习生往他方，而生死不息。大王与大众一起，都欣喜未曾听闻过这样奇妙的法义。身体有生有死，心性无生无死；人的心里还有个希望，还有个盼头。人知有这种希望很重要，知畏因惧果，而积善功德，可了生脱死。为何有的人坏事干尽？就认为一死拉倒，没有因果轮回。若知道有业报轮回，让人做恶事都不敢做；让修行人做恶事他不做。为什么？知道有业报轮回。常言道，别占他人便宜，占了便宜，脱牛变马得还人家。什么人知体内有心性存在都高兴，有过失能自忏悔，有善行能证真常。</p><p>　　阿难向佛请法说，若此统摄见闻功用的真心自性必然不生不灭，为什么佛说我等众生遗失真心自性，而颠倒行事呢？请佛慈悲，用清净法水洗涤我心中的污垢。 这时，佛将金色手臂下指说，阿难你见佛的手现在是正还是颠倒呢？阿难说，世间人都以为佛手这样下指是颠倒的；而我不知是正还是颠倒。佛说，若世间人以手下指为颠倒，那么以什么样为正呢？阿难说，佛手为兜罗棉手，应竖臂上指于空为正。佛说，若竖臂手指方向上下相交换，世间诸人加倍细看，便用你阿难色身与佛清净法身相比较；佛是包藏万法的自了知心住于身内，而你阿难是执著我法的颠倒心住于身内。阿难你现在随意观察，你的色身与佛的清净法身相比较，称色身为颠倒的名称在什么地方？怎么是颠倒的呢？这时，阿难与大众都面对佛而目瞪口呆，不知自己身心颠倒在什么地方。佛的清净法身是不用上、下来分别的，上方有佛，下方有佛，十方都有常住佛法僧<a href=\"/remen/sanbao.html\" class=\"keylink\" target=\"_blank\">三宝</a>。若认为上方有佛，下方没有佛，不是颠倒吗？古有一小<a href=\"/remen/shani.html\" class=\"keylink\" target=\"_blank\">沙弥</a>对着佛像撒尿，老和尚呵斥小沙弥这样做是不尊重佛。小沙弥说，十方都有佛，让我上哪撒尿去！一句话把老和尚问住了。若认为上方的佛正，下方的佛不正，不是也颠倒吗？阿难与大众目瞪口呆的样子，就已经被语言所转，身心都颠倒了。</p><p>　　佛见阿难与大众都不能回答所问，发大慈悲心，哀悯阿难与大众；用大音声普告法会大众。慈能给予安乐，悲能拔苦。哀悯什么人？众生是可哀可悯之人。为什么哀悯众生？觉悟之人，见迷惘众生<a href=\"/remen/wozhi.html\" class=\"keylink\" target=\"_blank\">我执</a>而不知谁是真善知识，法执而不知什么是真实正法，拿着干屎橛用糖麻花也换不下来。有位出家人身体不适，众人替他着急想办法；我讲这是大好事，为他高兴还来不及呢！他在修行过程中，胸脉通开的情况下出此境界。修行人恢复童身，脉络畅通；包括胸脉，胸脉是比较难通开的。在胸脉中有如蚕豆大小的结，是胸腺。孩童时最大，分泌胸腺逐渐减少，人就逐渐变老。年龄越大，腺体越萎缩；所以，年龄越大，<a href=\"/remen/xiudao.html\" class=\"keylink\" target=\"_blank\">修道</a>越难。这位出家人，这个年龄修到如此境界是精进所致，才有此变化；一边静坐精进，一边听闻佛法让时间不空过。法不唐捐，修行没有空过的。修行人胸脉通开，再修行易返老还童。返老还童怎么还的？老年人修行能白发变黑发，我师父七十六岁长出一口新牙，这就是返老还童现象。人是贪嗔痴慢疑五毒之身，满身都是毒素，吃的化肥农药这些污染物不排出体外，满脑子都是妄想。为何有的修行人长期静坐后脚下起泡，这是在排出毒素；修行人就是这样，先净身，再净心，达到身心同净。</p><p>　　佛说，色法与心法交融而产生诸因缘，心被色法驱使，缘法生心想；同时，色唯心法所现，缘心生法相。你身你心，都是由微妙存在又具足智慧的真心自性所显现物相和灵识。为什么你们与众生无始劫来遗失真心自性，在追求醒悟的真理中而迷顽颠倒呢？以昏暗不明的黑暗为静闲，在静闲的无明黑暗中，心与业习因缘和合而生色身。根尘杂交而妄想纷飞，执著色身相有为真我，心里集聚多种因缘而五蕴炽盛，又按照各自情趣习惯等奔走劳逸；受妄想干扰而心不明，心不明又扰乱身行而贪嗔痴；并以此妄心为心性。一迷一切迷，以迷惘的我法执著为自心，在心中又决定生起见思二惑；并妄认自心常住色身之内。却不知真心自性在内可统摄身心功用，于外可包藏山河大地、万象虚空；于中又可全部显现世间一切存在。真心自性妙有如澄清的百千大海，而众生却弃失广大无边的大海，唯认似一浮动水泡的身体与妄心为真我；便以为见水泡潮动就等于观尽广大海洋的全潮。你们与众生即是迷中的迷人，如佛垂手便误为手臂颠倒一样，妄本逐末，心著诸相，真是可怜悯者。</p><p>　　色法是一切物质存在现象与变化规律；心法是在无明的作用下，受业习牵引而影现的因果规律；心法分世间与出世间，这里只讲世间。诸缘是既相互存在，又相互同一；既相互依赖，又相互予盾；既相互静止，又相互促进等对立统一规律；缘有善恶亲因、增上、次第、所缘等。太阳东升西落就是法，打雷下雨也是法，社会有社会的法则，自然有自然的法则。心随规律去攀缘，唯心所现；如中阴身随业习召感到这个世界，召感到身心环境。人现在的身体、思维等功能作用，皆是精妙心性的显现。众生遗失真心自性，是被色法所转，是受业习所牵，在迷茫中不得开悟。昧就是黑暗，就是无明，烦恼冥存实在。人不知鬼不觉做的亏心事，见不得人的事，都属于暗昧。见现象动心机，一动心机，业报不可思议；最低是水下众生，做鱼做龟等；一动心机，罪恶就产生；不动心机，骄慢也不行，会召感到天上的飞禽。修行人证空的境界，才有智慧转烦恼，脱离生死轮回。由于无明召感的烦恼集中到身体上，就成为色身。身体是业报所召感，生生世世造业而召感到现在这个身体。人从欲中来，身体臭秽不堪，心里更肮脏。但是，发菩提心，行菩萨道又都是从身心开始的，烦恼即菩提。离开烦恼找菩提，如同兔长角，找不到；所以，不要瞧不起自己，不要说年纪大了，多大都来得及；只要发起深心，有决心，就成功一半。思维在内里不销停，在外放逸，浑浑噩噩，奔奔波波，都是以相为心。人们说，我心想如何如何，实际都是思维心被客尘所惑，为身体诸根的需要，一迷再迷。</p><p>　　这首偈语可以帮助理解妙明心中物的义理，数载苦寻觅，突觉身无边。万像心中物，瞬间宇宙同。多少年苦苦静坐，突然觉得身体无限增大，静坐时思维静止；刚开始先觉得腰粗，然后身体如房子那么大，越来越大，同宇宙一样大无边际。这时感到山河大地，宇宙虚空都是“妙明心中物”。小而无内，心性万能；没有修行，没有功德，心量不能扩散；证得空的境界立即感知体内有心性。这是修行过程中必经之途。有的人遇到这种情况就害怕，怕不怕该生得生，该死得死，该死时谁也救不了，该生时谁也拿不走，既然知道真相还怕什么呀！生死无所畏。越是这样，越坚持修行，身体才能变化千万般，要坚信依法修行能够了生脱死。人身也好比清净大海上漂浮的一块朽木，用心观潮起潮落时，朽木也随之起落。身心五欲，此起彼伏，苦海无边，<a href=\"/remen/huitoushian.html\" class=\"keylink\" target=\"_blank\">回头是岸</a>。</p><p>　　阿难向佛请法说，我虽承蒙佛微妙法音教诲，从法理上悟知真心自性，本自具足功德，常住于众生心地中。但我悟知的微妙法音与常住，都是缘以现在的身体与思维心，只能从法理上领悟及敬仰。徒劳获知理相上的真心自性，不敢承证在自我心地中常住。请佛再哀悯，以一语妙音宣说开示；拔出我的疑惑之根，皈依自性无上佛道。</p><p>　　小疑小悟，大疑大悟；修行人开悟前可以有疑惑；开悟后一点疑惑也不可以有。再有疑惑心易入声闻，难证佛道，必须销除。以攀缘心、求知心来听法，都是外在的，得不到道交。同样听法，道交不一样，须各自证知。佛说法无二语，即以一语妙音。</p><p>　　佛说，阿难你与大众还以攀缘、求知的身心之相听法，所听法义也会成为满足攀缘求知的法相，还是未得证悟法义实质；即没有实际悟知常住的真心自性。如有人用手指月告诉他人望月；他人因有人指月，才应当望月一样。再如他人从不知月名，误以人手指为月实体；指月人不但白白失去月轮，也白白失去手指；这都是以指为月而误认目标的缘故。人岂能因失去指名，而不能识别月明与黑暗呢！是什么缘故呢？他人误以指体为月明的存在，但月明与黑暗二种存在不能因人误认而不存在；你与大众也是这样，不因误认客尘为心性而不存在真心自性。若以听闻佛说法的意识分别为心，这样的心应自然能离音声分别而常住；如有客人寄宿旅店暂住便走，不能常住；而开旅店的主人都无法离去，名为店主。同此比喻法理，若这种意识分别心是人的真心自性，就不能离开身体而去；为什么离开音声等这种意识分别心就不能常住呢！这里不单指听闻佛法音是唯一的，也包括用意识分别佛三十二相等；若离开诸色相，就无意识分别心，乃至一切都无分别，见山色不是山色，见虚空不是虚空。如拘舍离等外道的苦思冥想为修行真谛，当离开诸法为缘起时，意识分别的思维暂时静止；一遇诸法为缘起时，意识分别的思维又长期变化。而阿难你现在的真心自性内受业习所牵，外受六尘所扰，又以诸法各有所缘，不得自在；怎么是常住的主人呢！</p><p>　　月亮是实体，如没有实体，就没人相信有月亮。明暗用在人的身上，心性属于暗，身体属于明；明是明摆着的，心性在暗中藏着。人的心性是常住的，不因听闻佛法而离去，也不因听闻佛法而常住。今天读诵经典，见的是文字，用眼见了意识有分别，本能的加以理解。修行人要有一种无碍，于一切诸色相无分别想，都是平常心。心观离诸色相不起分别，不起妄想，不被六尘所染，达到这个程度才能解脱生死。若执著分别，总想好坏对错等，思维总是在两边转，总是在对立中循环，心能清净吗！看不破，放不下，围绕着思维执著转，这样最可怕。在定中观察的因缘，离诸往来无分别；这个星球那个星球不去分别，观什么也不染著；观到地狱不恐怖，观到天堂也不高兴；观见男人女人无诸相，观见金银财宝也无作用。要真心做主，非客尘做主。</p><p>　　阿难说，若我现在的真心自性各有所还而不能为主人，佛怎么说真心自性应不受诸法所缘，是主人而无还呢？ 还请佛垂爱慈悲, 再为开示。 佛说，阿难你现在见佛，是眼功用；这种眼功用虽不是真心自性直接见佛，却是真心自性诸法所缘的折射；即第八识通过第七识的传导而发挥眼功用，才能见佛。如天空有第二轮明月又不是月的影子。什么是无所还地？现在应当明示于你，即常住心地，如如不动；无来无去，具足功德。</p><p>　　开悟的人能知前世如何因缘，灵能离体的人能观自身与心性；既能观一个色身与一个识体的一人二体。这就是佛说的第二个月亮，第二个识体。观不见怎么办？通过参禅静坐得定，于三昧中去观察。如还执著肉身，思维所限，那就没有办法；谁都没有办法，众生还是众生，悟者还是悟者。修行人要放下执著；一切有为法，如梦幻泡影，如露亦如电。修行人要看破诸相；被诸相所转是生灭法，不得无为。</p><p>　　佛接着说，阿难你见此大堂了吗？门窗大开，远望东方，太阳升空，则有光芒照耀。若入中夜，黑暗无有月光，又云雾腾空而昏暗不明。从门窗缝隙中，也能见大堂内外相通；有墙壁的地方，则只能见阻塞。若缘于不同的时间、地点处，又可以见不可改变的虚空之中，遍满空寂；于虚空中有云雾升腾及沙尘飞扬等景象；或有昏暗不清及雨后天睛等清明景象。若将这些明与暗、通与塞、同与异、清与浊等变化相，各还归本因所起处。什么是本因所起处呢？即将诸变化相中的光明还归于太阳。是什么缘故呢？因为没有太阳，就不能有光明；所以，光明还归于太阳。黑暗还归于没有月光的黑夜，通达还归于门窗，阻塞还归于墙壁，缘还归于不同分别处，不可改变的虚还归于空，云雾沙尘还归于地水风尘，清明还归于雨止；而世间所有一切变化相，都超不出这八种变化相。这见八种变化相功用的真心自性，应当还归于谁呢？没有还归处是什么缘故呢？若还归于光明时，应随光明而去；没有光明时，怎么又见黑暗。虽然明与暗等八种变化相有千差万别，而统摄见功用的真心自性却始终没有差别变化。诸变化相都相对存在，都有各自的还归处，自然不是统摄见功用的真心自性；那真心自性应属于谁呢？至此，阿难你应悟知，于身体中发挥统摄功用的就是你的真心自性。可惜，人自迷惑，丧失本来具有的真心自性，枉受生死轮回，经常漂溺于苦海之中；所以，佛说不知苦本是最可怜悯的人。</p><p>　　本来真心自性是清净无为的，而人是自生迷惘，自生烦恼。让一些人静一会，静一会就闹心。特别是年轻人，总想跟谁打会儿麻将，喝点酒等，随波逐流于五欲中，这都是迷惘所致。修行人从年轻就应知独自清净，僻静处常思世间无常事，身体怎么来的，怎么变化的，生命奥妙在哪里；又怎么丧失本性，怎么枉受生死轮回等；有助于苦行与醒悟。众生于中阴身时，还有攀缘心，还执著于诸有。所以，中阴身于鬼道时还记仇，谁害过它，它找谁。如我收一位弟子时，有个不得超生的鬼，占这人身说，“谁度她，得先度我呀！我在唐朝初时已考取功名，当时她是主考官，因受贿将我的名字抹掉，使我落榜参军。玄武门之变时，死在战场，不得超生。所以，我生生世世跟着她寻仇，谁度她，得先度我。”这就是中阴身，做鬼都执著，都来寻仇。我先收下这位鬼弟子；并当即先超度这位鬼弟子去地府任神职。然后，才收下这位弟子。</p><p>　　阿难向佛请法说，我现在虽然从法理上悟知统摄见功用的真心自性是无还，但怎么修行能证知这就是我的真心自性呢？</p><p>　　佛说，阿难你现在还没有证得无漏阿罗汉；但承蒙佛的神力可以见到初禅天的境界，无有障碍。而天眼第一的阿那律，见此阎浮提世界就如观手中的奄摩罗果一样清楚。诸菩萨根据品位功德可以平等观见百世界、千世界、十方无尽无量清净佛国土，没有见不到的地方。只有众生，见不过眼前；不能遍见。佛再与阿难你同观四天王所住的宫殿，遍见那里水陆飞行的众生；虽然那里也有昏暗与光明种种物象的存在，但无非是眼见客尘现前，是意识留下的痕迹。</p><p>　　四王天离地球最近，护法韦陀菩萨示现居住在四王天，是贤劫千佛出世的最后一尊佛。这尊佛示现出世与再灭度时，贤劫就结束。四王天的一昼一夜是地球的五十年，位于北极星的中间位置。世界有很多奥妙，人不能知；如地球受四王天天王统摄，有天兵镇守着地球，保护人类不受妖魔鬼怪等侵扰；并护持佛法。若四天王的天兵被修罗打败，会引起地壳变化等。天兵被打败，是因这一方人往昔业力深重，今世有难，共业各受；天兵神力不能抵住众生的业力。有圣人（菩萨）住世的地方不遭难，水火风三灾不起。四王天上有庄稼，和地球的物象相似，但植株高大，玉米如地球的松树那么高。带到太空的种子，接受宇宙射线而物化，再带回地球时，遗传物质发生变异，如有二百多斤的西瓜等。四王天的天人，就如寺庙四天王像那么高大。有的外道，种些善因，有其天福，无其天德，只能做天上的动物而已。所以，修行人证悟后，遍观宇宙人生真相时知其因缘；一些人修善，由于没有正知正见，产生邪念，不得正报，只得依报。没有正报的人很可怕，但是这个世界上的人命终后，有的堕落地狱、饿鬼、畜生、魔民等；谁也不是被逼去的，都是自己造作的恶业召感所致；认为万事有我理、我高、我能、我强、我荣、我富、我贵等，形成业习，最后堕落恶道上去。却还不知这是谬误，仍执著于我法，自缚不得解脱。有证悟的人知用心见，可见无相真佛；如用目见，只能见诸佛像；不见佛的法性身、报身、化身庄严。</p><p>　　我顺便讲一下，忉利天也如此，还有天龙等召感到那层天上的动物。那层天上的动物比在人间享福，召感到那里的动物也有些善根；但往昔恃世智聪明，多有邪见邪行业习。忉利天与地球大同小异，地球有什么，忉利天基本都有；只不过动植物都比地球上的高大，一切都是妙衣妙食等妙有。虽有动物，但天人不食；不像地球人什么动物都敢吃。在欲界天，地球是比较低层的天体。地球人的心欲望重，业报也重；如能修行，也是最容易发菩提心的地方。天人享有天福，不愿修行。天天只想享乐，待五衰现前时后悔；后悔当初修行就好了，但来不及了。世间人也有今日推明日，明日何其多；最后临死前，想起要修行也来不及了。死亡随时都在身边，信佛修行一时不可<a href=\"/remen/xiedai.html\" class=\"keylink\" target=\"_blank\">懈怠</a>，一个死字挂在脑门上，督促自己勇猛精进。</p><p>　　佛说，阿难你于此应仔细参悟，什么是真心自性？什么是客尘他物？佛现在将这些法相义理交给你自己辨明拣择。于此拣择中悟知哪个是真心自性？哪个是身的见闻功用？哪个是物化现象？</p><p>　　此经从一个淫字开始，后至破五十种五蕴魔。究竟怎么破的魔，是用智慧破魔。用智慧破的什么魔？不知道就容易被转。从淫字开始至破五十种五蕴魔，实际破的是见思二惑；见思二惑多表现为邪知、邪见、邪行。破魔过程，就是树立正知、正见、正行的过程。邪知见行，就是颠倒用心；如平常人用平常的思维去推论佛教法体时，本身就处于颠倒状态；颠倒时见到的物像，正的看成是倒的，倒的看成是正的。</p><p>　　读诵受持此经，要知在破淫魔时，首先要破除我执我见。只有破除我执我见，才能不颠倒行事，而行于中道。然后切记不要用平常人的思维去推论佛法，拿着佛经去衡量法师或修行人的证悟境界；衡量不了，只能认证。若一位法师禅修密行几十年，平常人一天也没禅修密行，用平常人的知见或理论能衡量法师证悟境界是什么样吗！能推论得了吗！所以，世间人就容易被假相所转。读诵受持此经，要知观察自身知见行，千万不要去衡量他人境界。一果罗汉的境界，未<a href=\"/remen/zhengguo.html\" class=\"keylink\" target=\"_blank\">证果</a>的人无法衡量；用声闻戒去衡量菩萨行人就是犯戒。如此经中的摩登伽女到这个世界示现妓女身，是不是犯戒？用声闻人的知见衡量，是堕地狱的罪过。但有证悟的人于定三昧中观知，摩登伽女是一尊菩萨化身，为度脱众生故示现妓女。众生应以什么身度脱，就化现什么身，特别是要示现一些反面人物。五十种五蕴魔有一个共同的特点，赞叹淫欲，执著妄想。被蕴魔所困的人，名义讲佛法，暗里讲淫欲，贪求名闻利养等。开始有欺骗性，时间一长就行不通，三五年或五七年就出问题，要遭诸难。读诵受持此经，只要深信佛法，行于中道，就不会被蕴魔所困。</p><p>　　佛说，阿难你可极尽眼见能力，从自身至四王天天王居住的宫殿日月宫，百种物象都不是你的真心自性。你再远见至七金山，在那里全面仔细观察，虽千种空光与万种物象，也都不是你的真心自性。你再从上至下、从远至近，逐渐细观，可见云腾鸟飞，风动水起，树木山川，草芥人畜等，无限风光与无量物象，更都不是你的真心自性。而上下远近的各种物象，都各有运动规律和生灭特性。各种物象的生灭特性虽有千差万别，但这些生灭特性如有目共瞩的存在一样，可以等同于你存在的真心自性。虽物类不同，物性也不同；而你的真心自性却没有不同。此真心自性，就是统摄你身功用的本源。</p><p>　　山有山性，水有水性，玉米有玉米的物性，中药有中药的物性等，各有各的物性。这些物性，各有差别，通过遗传基因在起作用，如花开的颜色不同、形状不一等；若只见到物色，不见物性，是我见，是人见。若定中观察时，色不异空，空不异色；色即是空，空即是色，本无差别障碍。各种物色，各有自然力，也称神力；主宰生长与销亡。人生是报身召感到自身心的环境；命终后为中阴身时，回顾自己一世，想当初怎么不知修行而了脱生死呢？但是，再受生后还是那样，还是处于颠倒状态，是入胎之谜与习性在作怪。识蕴区宇最可怕，习性多少生多少世都不亡失。<a href=\"/fjrw/hcrw/zyfs3/110873.html\" class=\"keylink\" target=\"_blank\">心灵之窗</a>打不开，心里面的蕴想越捂越有味；若是把心灵之窗打开，心里就清净无染。无量劫来在颠倒之中业障越走越沉，习气越染越重。所以，末法时代信佛的人多，得度的人少。有的人专门研究表面义理，一研究就谬，离道甚远，语言文字都是客尘。有证悟的人说，白的是纸，黑的是字，看它做什么呀！有证悟的人是见文字又脱离文字相。法师讲法也要放下我执我见，破除客尘烦恼；更不要用语言文字去障他人的道，示其义、教其行即可。否则，障他人就是障自己，这块石头只能砸自己的脚。自己没得度，度不了任何人。若有病的人，千万要打针吃药；药性是神力，用药的神力克服病的业力，正好获得身体健康。</p><p>　　佛接着说，若统摄见功用的真心自性也同于物象，而你的真心自性也应有形态，见自形态也等于见真心自性。若见真心自性等于见自形态，就可以称为见自形态；若闭双眼什么物象也不见时，为什么也不见自形态？这一不见又在哪里呢？佛住世时，佛处在无量光之中，那是真见。为什么佛说法时，十方世界的诸菩萨能知呀？见闻的不是佛肉身与音声，观的是佛无量光；有释迦牟尼佛在此说法，见无量光中有佛。平常人只能见佛像，不能见佛清净化身无量；认为佛的肉身灭度了，佛就不住世了。佛肉身示现灭度，而佛化身实无灭度，继续住娑婆世界。现在人修行到一定程度，佛必现真身，还要给摩顶授记，就看有没有这个功德；哪里有讲正法的道场，佛化身随时随处都降临，只是听法的人不能眼见而已。我不讲见过多少次佛化身，但确实蒙佛多次恩惠。当修行至山穷水尽时，佛会现身化转。在定中观察到佛来加持，加持的不是人的肉身，用色目永远也见不到佛真身；必须是在定中，入深禅次定时，才能观知。若修行人虽未得定，但心诚所至时，佛会现僧像入梦点化。哪尊佛都存在，哪尊佛都说法；但现在不是为人的肉身说法，只有释迦牟尼佛示现人身才能为人说法；人只不过是无量生命形态中的一种。千万要知道，人的肉身臭秽不堪，心中充满颠倒妄想，时时处于生灭无常中。定中见佛化身加持后，真是心悦未曾有，更知真心修行，更知珍惜时间，更知珍惜与人的善缘，更知肉体是暂住的房子。</p><p>　　佛接着说，若睁开双眼也见不到不见处，自然不见处不是物象，自然也见不到不见处的形态相；若自形态不是不见处，不见处又自然不是物象，那统摄见功用的怎么不是你的真心自性呢？再如你现在见物象之时，既然你见到了物象，物象也应见到你；若是这样，人体与物象就相互混杂，而分辨不清你与佛，更分辨不清有情世间与器世间；若有情世间不存在，世界还怎么安立呢？</p><p>　　见又不见，不见又见。要只见文字，永远也解释不了佛法真实义理。若用心见时，似相非相，自然解法理、知法义。所以，佛法是处处让人醒悟，哪部经都是一源流出，千河归海。净土有净土的传承，禅宗有禅宗的传承，密有密的传承，律有律的传承，各宗都有传承，师徒如父子。对初<a href=\"/remen/xingzhe.html\" class=\"keylink\" target=\"_blank\">行者</a>，提倡一门深入；修行有证悟后，要超越这些宗门，无量法门誓愿学。这时才知禅密一理，禅净一理，禅律一理，整个佛法是一，不是二。只是人的根基不同，选择有别罢了，还执著什么呀！至于怎么修行，什么是密是禅是净，事实上说都是从净土开始的，不论是谁，都得从这一法门入手，到最后，这一生修行都离不开这一法门，哪宗哪派都离不开。有些人根基浅陋，连一禅三天都没有进入，还谈什么圣知圣见呢？三五岁的顽童，见七八十岁的老人，不是一回事儿，两股劲儿。所以，释解佛法，可来不得一点我执我见。禅宗参话头从清净开始，没有清净就不会有定。证四禅天境界的修行人诸漏依然，诸障未破，不可妄执。定有深有浅，智慧有多有少，智慧足才能破诸障。物象没有分别心，没有思维；而有物性，既有物理作用，又有物理变化。不同物体有不同磁场，能影响环境；如人类发明用磁治疗疾病；再如室内有毒气，虽见不到，但能让人中毒，影响健康。修行人一定要记住，不要排斥科学，要懂科学，顺从科学，科学的安排自己的人生；但是不要被科学的局限性所控制，唯科学而科学，这才是信佛人的理性。修行人更不要将人与物、人与人对立起来。世间的诸事物，是对立的，又是相辅相成的。不对立、不妄起差别，是心态平和。修行人也离不开用眼见诸相，用想行诸相；但还要知空相，心不执著。如不空掉，不能看破放下，就被这些物象的体性纷杂所困扰。天天研究科学，没有时间修行，追求这个、追求那个，一生追求完了，也追求不到真如本性，自己的生死大事也未能解决。今天见到的事，当下就把它放下、空掉。说“空掉”很困难，可以心里念佛号转境。而修行人修至空的阶段，不想空也得空，有时无念无记；平常人用理论，想空也不得空。讲空让人知道修行人真富贵，谁真修，谁真得；不修不得。鼓励人勇猛精进，去修行、去证悟。</p><p>　　佛接着说，阿难你若见物象时，是你见而不是佛见；你的真心自性无处不在，不是你而又是谁呢？怎么还自疑你本有的真心自性不是真实存在，反而向佛求真实呢？人的自性是非常真实的存在，不要怀疑，也不要向佛求证。存在即有，怀疑求证也有。阿罗汉是怎么找到真心自性的，是参禅静坐；由静入定，由定显现。阿罗汉找到真心自性，不是读经读来的，把经读烂也找不到，必须是真修实证才能找到。只有放弃我执我见与颠倒妄想，自觉真心自性，才明知缘来如此，自己以往尽在虚妄不实中走偏路。阿难向佛请法说，若此统摄见功用的真心自性必是真我，而不是其他；但我与佛同观四天王殊胜宝藏般的宫殿日月宫，又见周围物象及娑婆世界，再退回至精舍，只见清净道场，即瞻望大堂通透明亮的门窗、垂檐和周围的房舍；为什么统摄见功用的真心自性，其体积能量本来可尽虚空遍法界，而现在随我居于大堂中只能遍见一室呢？是不是此真心自性可缩大为小呢？还是墙壁与房檐阻隔断绝了呢？我现在实不知此法义所在哪里，请佛给予慈悲开示。</p><p>　　为什么老在这里打转转，智慧不开的人，不证道的人，就误到这个理相上。阿难与佛的对话，告诉修行人此处是最难入的。这段内容在修行当中不重要，对初学者理性上重要；对修行人不重要，是因为修行人渐修，自然而然就契入。初学人不行，初学人要辩理，来回辩才知法理，才知去明心。世间那么多不信佛的人都是目见，认为意识是心。大脑想事就以为是用心去想，一想就想到断灭，反正早晚得死，这一生吃好玩好就算完活，不虚此生，其不知造业轮回。初学人很可怜，只知浅理，难解深义。所以，我们要共同把解法理的能力提高，把对深义的误区解决，让这些人从心里灭除我执我见；再树立起对法理的正知正见，让正知正见占据人的心灵，再指导精进修行，把偏离的航向引导回来。</p><p>　　佛说，一切世间存在的众生与物象，无论大与小、内与外等自然界和社会中的诸活动与现象，都属于客尘，与真心自性是两回事；所以，不应说真心自性有体积而有增大或缩小；如不能说，见方型器具中的空是方空。现在，佛再问阿难你，方型器具中的空是方空或不一定是方空呢？若是方空，将此方空另外放在圆型器具中，此方空应不能成为圆空；若不一定是方空，在方型器具中应不存在方空。阿难你所说不知真心自性是缩大为小，还是阻隔断绝的法义所在那里的疑问，与方空与圆空比喻的法义一理；还有什么体积所在吗！若再将空装入无方无圆的器具中，还须要去除器具的方圆型吗！若空无体积相也无方圆形，还用再说去除空方与圆相的法义所在哪里吗！若如阿难你问，真心自性随你见大讲而缩小，那你仰面见太阳时，能将真心自性追逐于见一起，等同于太阳那么高吗！若再建筑墙壁与房舍，能阻隔断绝真心自性吗！若不能阻隔，还须要从墙壁穿一小洞来往而不留痕迹吗！这样的义理，是不可能有的。</p><p>　　客尘在人眼中有大有小；但在物性上，没有言说，没有大小。如一个杯子，杯子里是空的，见着杯子里的空，是不是有一定界线的；若把这杯子摔坏，这杯子里的空还是不是空？这杯子里空的度还能不能存在？若将杯子里倒满水，空就排掉了；把水倒出去，那空又回来了，这个空又怎么决定呀。怎么测定空的存在呢！这不是绕口令，是告诉人，从我执我见进入无常相；破我执我见，从无常开始。我跟诸位讲，死人读诵不了经，此经读诵烂了，也去不了极乐。读诵经典能读诵到极乐世界去我也读诵，修行法门还有什么用。什么读诵佛经三百遍就是菩萨，那是多少世以后的事，种善根可以，须慢慢去成就；如种子种到地里，早晚得成熟。若把这杯子里的容量排除掉，就要用物体把它填满。能把整个虚空排除掉吗？用什么能把虚空填满啊？什么也填不满。这虚空有多大，用多大度量来称量，说虚空不能被度量，一个杯子的容量小，可以把它填满，但将物体倒出去，又恢复到原来状态了。如一个富翁有三个儿子，家里财宝交给哪个儿子管理，他要考一考。他给每个儿子一百元，谁能用一百元把一千平方米的仓库填满；谁就有资格继承父亲的财产。大儿子买了一百元的泡沫，结果没填满仓库；二儿子买了一百元的稻草也没填满仓库；三儿子只买了一根蜡和一盒火柴，把蜡点燃，光亮立即填满仓库。富翁将财宝交由三儿子继承。世间有两种物体能把虚空填满，一是光明，二是黑暗。虚空可量风可击，大海中水可饮尽，不能尽说佛功德。如法师讲的是正法，诸佛菩萨必然加持，必现祥瑞，而且要降临道场；凡是在道场听经闻法的人都会受到加持。听经闻法的功德大，拥护道场的功德也大；因为既明法义，又获法益。获法益中又有佛菩萨降临道场，佛光让听经闻法的人感觉身心舒服，没有烦恼，开启智慧。离开道场后，没有佛菩萨的神力加持与佛光照触，感觉就是二回事。如有祥瑞出现，必定是正法道场；否则，不是正法道场。在证悟问题上，不能出现偏差，出偏差会误导众生，果报不可思议。魔说邪说不现祥瑞，而现幻像。有证悟的人讲出的法是无漏法，让人时时刻刻发菩提心，证得无学。现时讲法说无漏的人，事实上讲的过程当中就有漏，会说的不如会听的。</p><p>　　有人问，两天前有座寺庙发生争斗，庙门关了几天，菩萨住世应该<a href=\"/remen/liuhe.html\" class=\"keylink\" target=\"_blank\">六和</a>合呀？我对诸位讲，哪里有正法，哪里就有魔扰乱；哪里有菩萨住世，哪里就有人去出难题，不要被这些所转。如众生都按佛法去修行，魔王就会失去眷属，所以魔王破坏菩萨讲法。我师父十几年前就对我说，你知道世间的魔在哪里吗？我说一个在人心里，另一个住伽蓝。他说，你说的不全，五十种五蕴魔在人心里，魔子魔民住伽蓝，专破坏佛法；还有一部分魔子魔民在白衣，用邪见对待佛法。研究佛法是为了破坏佛法，而不是修行佛法。修行人一定要知道，深刻警惕，保证自己修行，不要不知不觉跑到魔道上去。住伽蓝的人也不见得就有证悟，也可把人引到邪道上去。皈依时，一定要皈依有正见的人，不论是僧人还是白衣，要去相、依正法，才是真见。佛教的奥秘太多，简直个个是迷宫，这个门绕那个门，绕不出去，必须有向导带领前行，才能出离三界。五台山有位讲法的法师，在佛学院毕业典礼上，对大众提出的很多问题，一一作答。大众说这位法师讲的太妙了，但有位出家人微微一笑；法师见状，走下讲台跪下说，“法师有话要说但没说，是我讲的有误，还是不如法？”这位出家人说，“你讲的很好，但讲的是他人说的，不是自己证悟的，是佛话不是人话。”这位法师说，“您得救我，我不能白出一次家，白弘一次法。”出家人说，“我救不了你。有一位禅师，多年来就想找一位有缘人，去找找他吧。”这位法师立刻辞去寺庙住持，什么也不论，背一个小包就走了。人生死是大，立刻找到那位禅师，修了多少年后又回到五台山讲法。现在这位法师弘法说，“通过修证我才知道什么是证悟，我现在讲法才讲出我自己要说的话，我才知道什么是法，以前我讲的都是他人证得的。只会说理论不行，证得自己的真智慧才能度人。”</p><p>　　佛接着说。一切众生，从无始劫至现在，都将自我迷误为身体诸有，而遗失本有的真心自性；并为身体的各种需要所转，贪著诸有；所以，处于生灭中，妄以物相衡量真心自性的大小多少等。若修行人能明心见性，转化身内六根为清净戒行，转化身外六尘为清净法行，转化中六入为清净心行；这样的修行人，就同佛的身心一样，具足圆明妙智，处处在在都是佛事、法事、僧事的不动道场。能包含或显现十方佛国土于一根汗毛的顶端。</p><p>　　一切众生从无始劫来，为物所转，迷失本心；主要的物先是自己身体，后是客尘。身体才能对金银财宝、美女美男、酒色财气等起作用。身体有需要和欲望，才向外求索；如有钱人，见路上有一角钱不捡；若是收废品的，不论钱在地上表面脏不脏，肯定捡起来。有大钱就不看小钱了，有钱人丢辆汽车不算什么；贫穷人丢台自行车还挺上火；这是唯物主义的物质决定精神。但是，修行人若被身体所需和外物所转，修道难呀！有钱人上庙<a href=\"/remen/shaoxiang.html\" class=\"keylink\" target=\"_blank\">烧香</a>供养一千元或一万元容易，让他修行困难，为物所转，为情所困。还有人生活困难，为生存奔波，没时间修行。其不知富贵也好，贫穷也罢，修行都一样。若不能转物，就修行不了。财物多了，是谁的？死时什么也带不去。前世积福，今世富贵，有享尽的时候；享福也了福，就有遭罪的时候。修行不在于贫穷还是富贵，只要有真心就行。众生在社会活动之中，看大看小看变化，今天这个形势，明天那个趋势；今天有这个新事物，明天又有那个新样式；天天追求新美奇特，永远观察追求不尽。在变化之中，不知不觉人就老了，年纪大身体就变坏了，命终落其它道上去了。说你去地狱，你会很<a href=\"/remen/shengqi.html\" class=\"keylink\" target=\"_blank\">生气</a>；最后真的向地狱去时，不知为什么就去了，苦报自受。转物首先要转自身心，自身心不转，“则同如来”如不了。修行是从转身心开始的，身心清净才能入道。有位修行人对我说，“我现在挺慈悲的，发起菩提心了。”我说，“不可能！”他说，“那发菩提心什么样？”我说，“你身心当中的诸毒去除了吗？”发菩提心不是那么回事。要把自己体内的毒素都排净，有人从脚下排，有人排到下肢就排不掉了，腿都烂了，是真实的；还要去除心中的贪嗔痴慢疑五毒等。若思维一灵活或一转弯就以为发菩提心了，但一遇到难事就退转。真正发菩提心的人不退转，而且转化身体后，慈悲心生起，见蚂蚁都不踩。佛在一次弘法途中，见一堆人骨就<a href=\"/remen/libai.html\" class=\"keylink\" target=\"_blank\">礼拜</a>。弟子们请教佛为什么礼拜，佛说不知这人哪一生是我的父母、兄弟、姐妹，今生骨暴荒野；弟子们就将人骨埋葬。这在凡夫眼里是善良，在小乘人眼里是<a href=\"/remen/xiaodao.html\" class=\"keylink\" target=\"_blank\">孝道</a>，在菩萨眼里是慈悲。身心转化了，才能转外面的物色，不被外面的物色所染。身心不转，能转物色吗？不信拿来一条鱼，猫不吃才怪呢。人要爱好什么，没有缘因就说自己不爱好了，谁信呢！如心能转物，不被外面的客尘所扰，就能善心生起，慈悲心生起；才能发菩提心。否则，人的境界达不到一定高度，心识杂染度特别大，灵光显现不出来，智慧显现不出来，不能为这个肉体当家作主。只有将身体转化了，心才能当家作主，才能转化外面的物色。身体的欲望，爱好要求等都被禅悦法喜代替了。佛当初说法时，提婆达多与<a href=\"/remen/poluomen.html\" class=\"keylink\" target=\"_blank\">婆罗门</a>外道等，攻击佛教。佛利用神通，如法制伏；这就是不动道场，不为魔所动，不为外道所动，不为凡夫所动。讲正法的道场不容易，听法者中也有人干扰，生疑诋毁等；能转是法师的本事。最不好征服的人，是身边的人。有功<a href=\"/remen/dexing.html\" class=\"keylink\" target=\"_blank\">德行</a>三宝事，才能达到不动道场。在一根汗毛的顶端上，把十方佛国土包含并显现出来，只有佛具足这样的神通自在；既能知宇宙的变化原理，又能自在运用。</p><p>　　阿难向佛请法说，若此统摄见功用的真心自性就是真我，就应显现在眼前，让我能见到啊！若能见到真我，我现在的身心又是谁呢？现在身心的分辨能力是实有；而真心自性怎么既没有能力分辨物象，又没有能力分辨自我身心呢？若真心自性实是真我，我现在就应立即得见；从而证明真心自性就是真我，现在的身心不是我。这与佛先前所问，我能见物，物能见我有什么不同吗？请佛慈悲，再教诲我这样没有开悟的人。</p><p>　　佛说，让真心自性显现在阿难你眼前即见的义理，不是心法实相。假如真心自性能真实的显现在你眼前即见，那么此真心自性就应有形状和固定常住的地方，也就不存在于你身心中的统摄功用。怎么还会与你一起坐在祗陀林，普遍见到山林、水渠、殿堂、日月宫、恒河等物象；怎么还会与你一起于佛师子座前，用手指出所见各种形像；如树下林荫、太阳光明、墙壁阻碍、虚空通达，乃至一草一树、一纤一毛等，虽大小不一样，但都有形像；没有不能指出的地方。再假如真心自性必须显现在你眼前即见，你应以手确实触摸摆放，那就无所谓见与不见。阿难你应当悟知，若真心自性是以虚空或是以物象的形像存在，那什么是虚空和物象呢？你可仔细剥离万象的遮蔽，辨明真心自性的形像，具体地告诉佛；如同诸物象中的哪一种，并分辨清楚又无疑惑呢？</p><p>　　怎么才能证知真心自性确实存在呢？把无明业惑去掉，就如同层层扒皮见仁一样。不把皮去掉，找不到仁；不把见思二惑一一去除，也不能明心见性。若不把心里的客尘去除，就烦恼不止，就天天妄想，就一切颠倒。若空说真心自性一万年，也说不出明心见性来；一天也不说，就持戒苦行，自能明心见性。若不下真功夫，光练嘴皮子，一点用没有。</p><p>　　阿难说，我现在于此只能近见大堂的层层亭阁，远望自古至今流动的恒河，上观日月；凡是用手所指，都是用眼所见物象，都不是我想见的真心自性。如佛所说法义，何况我这样初学的有漏声闻，就是圣位前的菩萨也不能于万千物象中，剖析出并了见离一切相而存在的真心自性。</p><p>　　佛说，正是如此法义。再如阿难你所说，一切物象中没有真心自性；即离一切物象，另外存在真心自性。而你所见物象之中，根本就不存在你的真心自性。佛再告阿难，你与佛坐在同一祗陀林处，观赏园林苑景与日月等各种物象的差别，一定没有被你所指的如真心自性的形相；你再仔细分辨，诸物象之中又有什么不是你真心自性所见呢？</p><p>　　心若不能转物，被根尘偶入所困，永远也不能了见到真心自性。再大的根基也要修行，去除烦恼才能转物。若不能证圣，就不能转物，就不能去除无明。若知佛法，而不修行，谁也没有办法；只要肯修行，都可能成就。身心转了，虽不能了见自性，但能觉知自性，心才能转一切相；色即是空，空即是色，就是这个法理。世间的声闻缘觉，若不证得无漏，心不能转物，也不能觉知真心自性。一切物体都有物性，酒是麻醉神经的，喝多了就醉；喝酒的人能把酒性转了，是有本事；否则别喝，喝了就犯戒。酒是乙醇，化学物质，只能用化验的方法，才能得出这是乙醇。眼见不着，但平常人谁喝谁受麻醉，千真万确；只有修证的人，可以适量的直接排出体外，不受麻醉，这才为转化。</p><p>　　阿难说，我实不知，所见诸物象之中有什么不是我真心自性所见呢？是什么缘故呢？若没有见树，是什么在见树？若树是我真心自性所见，怎么会有树的名呢？乃至见虚空等，都是同一法理。据此，再仔细分辨，诸物象都是我真心自性所见。</p><p>　　此经确实难讲，各有各的证悟，证悟不同，知见不同；知见不同，讲出的法不同，这个人证悟到这个境界，就说不出那个境界。很多修行人承认有妙有，可不知什么是妙有，证不出什么是妙有。证得妙有的人，又不说证得妙有。证得妙有的人，知妙有真空处，妙有才是真空真妙。既觉知自性具足妙有；又觉知法喜充满，禅悦为食，是修行人身心妙有；有愿力续佛慧命，是菩萨的妙有；人人有佛性是众生的妙有。佛法是圆融的，各宗难易不同。法门无有高下，只是人的根基不同。佛法能够住世，就因为有佛真法传世。魔王只知佛有真法传世，却不知真法内含。一切邪魔鬼秽若盗知佛传真法时，必遭五雷击顶，震碎心识。秘密传承的佛法，哪个门派都有，同一法理。不要互相排斥，互相看不起，修持哪个法门都度人。众生需要哪个法门得度，佛菩萨会现身说法。机缘未熟，善知识在眼前也如浮云，视而不见。法不讲情面，讲根基、讲传承。修行人不见世间过，他人如何造作不需要谁承担，不要挂碍；要独善其身。见到不如法的事，有分别本身就不如法了。</p><p>　　佛说，正是如此法义。于是道场修行未证无学品位的大众，闻佛如此说法，都一片茫然，不知此法义的开始与终了在哪里；一时都紧张的有些惶恐悚惧，几乎失去自我控制。佛知其法义使大众惊魂动魄，心灵受到震慑；于无为心中生起<a href=\"/remen/wuyuan.html\" class=\"keylink\" target=\"_blank\">无缘</a>大慈、同体大悲的怜悯心，用软语安慰阿难与大众说，诸善学男子，佛是无上法王，所说法义是真实语，是如真我空性所说，是如诸法实相所说；既不欺诳而不实，又不妄伪而不真。绝不是末伽黎等所说四种不死的外道法，故意搞乱正法论义而迷惑众生。你等大众仔细思维，不要辜负佛的哀怜心与你等大众对佛的仰慕心。</p><p>　　外道法的四种不死是；一是亦变亦恒；即生命也可变化，也可恒常存在不变化。二是亦生亦灭；即生命也可永远生存，也可永远灭失。三是亦垢亦净；即生命也可永世充满污垢，也可永世自然清净。四是亦增亦减；即生命也可增寿永生，也可减寿永灭。大众为什么惶悚？圣位菩萨不能了见佛性，阿罗汉与辟支佛只能觉知圣性。人肉体当中有一真我，自不得见。如一棵树，内有木性，得见了吗？有一种渐依附在树上，不见它也存在。一粒种子撒在地上，通过阳光雨露而自然成长，最后长成一棵玉米，基因密码多妙呀。人类科学那么发达，怎么不能造一棵玉米出来；还必须得自然造就。因为有主稼神赐予物种物性，即神力。众生也有一种看不见、摸不着、觉不到的自性存在。</p><p>　　这时，文殊师利菩萨因慈悲怜悯四众弟子，从大众中离座站起，礼佛后说，此道场中，诸大众不能悟知佛说真心自性所见与不见客尘空相二者之间关系的法义。为什么呢？若真心自性所见是客尘空相等真实存在的物象，所见应有可供指出的具体目标；若所见没有可供指出的具体目标，就应无所见。而现在大众不知是与不是的法义在哪里，才有惊疑怖畏，其中的缘故不是往昔善根轻浅鲜嫩。还请佛发大慈悲心，将真心自性与诸物象都是以什么形式存在，以及其中是与不是的法义，再给予分明教诲。</p><p>　　文殊师利菩萨早已成佛，来此世界示现菩萨身，给释迦牟尼佛顶礼。一般人作得来吗？作不来，我相十足。在菩萨境界里没有你低我高的相，如有你低我高相，就不是菩萨；在佛的境界里也没有你先我后，讲十方三世诸佛，没有贡高我慢想，没有差别想，才能顶礼佛足。在家人遇到出家人要施礼，名义上是礼节；实际上是让出家人增强信心，心中法喜；同时，在家人也增益福德。表面给出家人施礼，实际是拥护道场，无形中的善行，不要轻视一些礼节。一位修行人若要往生时，化身首先要在地藏王菩萨道场成就，受教并<a href=\"/remen/xingyuan.html\" class=\"keylink\" target=\"_blank\">行愿</a>七年；化身然后要在观世音菩萨道场继续成就，受教行慈七年；化身最后要在佛净土才能究竟成就；只有人于此世界行菩萨道，才有时间上为七年的超越。否则，时间各是一大阿僧祗劫。同时，观世音菩萨在地府说法，也在天上说法，也示现人身说法。观世音菩萨既度众生的报身，又成就化身的慈悲。不要以为说慈悲是名词，慈悲心发起的时候才有化身成就。文殊师利菩萨成就修行人的法性身，智慧不足成就不了法性身。文殊师利菩萨无有言说又教真正的无上智慧，也须要先在文殊师利菩萨的国土受教行慧；然后才能到东方药师佛的国土去，最后成就法性身；也只有人于此世界行菩萨道，才有时间上为七年的超越。否则，时间也各是一大阿僧祗劫。凡是示现的这几尊菩萨都与修行人有关，也都与众生有缘，正是这些菩萨倒驾慈航来度脱众生。</p><p>　　佛说，十方诸佛与证佛位的大菩萨，自有佛性常住于妙定的净土中；对于真心自性所见与见诸物象的因缘，以及所思维的诸法相，都如空中花，本来就不存在。因为，此真心自性所见与见诸物象的因缘，始初都是佛性妙有的清净智慧体。既然同一法体，怎么于其中有是与不是的差别呢？如现在你文殊师利菩萨，是不是还存在另外一位文殊师利菩萨呢？</p><p>　　在诸佛妙定境界中，有情与无情世界中的一切存在，都同一法体。而人的真心自性是被无明覆盖；所以，局限于诸相的差别中。人的真心自性是随各自业习，既受召感，又依附于物相显现的身体。在历史的无量劫当中，人这一生就如闪电般短暂，还执著于诸有，执著于诸相，都是分别心在起作用。由于业报所致，于生灭法中不见真心自性。只有修行有证悟的人，可以观察众生都有真心自性，只是功德不具足。功德大的人，其真心自性光明增大；功德小的人，其真心自性光明微小。这奇怪不奇怪，妙不妙。一些众生业报重，堕落到蚊虫等；当命终时，其真心自性入地狱后就是黑压压一片，光亮一点点，非常非常微小。蚊子身中有没有真心自性？一定有。为什么微小？没有功德，被一团黑气所遮蔽。所以，修行人修身口意是在修真心自性。身心功德增长，才能增加智慧光明，将遮蔽的无明黑气破除；否则，就在六道中转去吧！越转越黑，越黑越转，真实可怕。</p><p>　　文殊师利菩萨说，正是如佛所说，我就是真文殊；除此真文殊外，没有第二位文殊。如有第二位文殊存在，那现在的文殊是谁呀，不就一文殊存在二相了吗？然而于现在，既不是没有文殊的存在，于其真实存在的身体中又没有是与不是二相。</p><p>　　如未证得正知正见，不明诸法实相与诸法空性，讲法时就说不清真实内含。在世间，人的肉体只有一个，千真万确就这一个；真心自性既住于体内，又与法界相通；既以光能藏于肝，又统摄身心功用；既真实存在，又不能见于相。平常人理解不了，也无法觉知其存在；若入定觉观，立即悟知。如某人身上有蛇妖占体，能见到了吗？见不到。这种现象存在不存在？一定存在。蛇妖的相在哪里？蛇体藏于洞穴里；但灵能入到人身体，既让人感觉一种外力存在，有时又影响人的言行。其它的鬼秽占人身时，也同此理；只是灵能有限，又受诸法控制。</p><p>　　佛说，文殊师利菩萨所说，佛性妙有的清净智慧与虚空万物的存在，正是如此法理。无上佛性本自妙有清净智慧；而将清净具足功德的真心，因妄想又误认为是色有或空无，以及是可闻可见。如天空有一个月，人心中也有一个月；哪个月是真月，哪个月不是真月；文殊师利菩萨你知，只有天空一月是真有相，而心中之月是空无相；但人心中之月是月不是月呢？当以现在，文殊师利菩萨你再看此道场大众，对真心自性与客尘的各种分辨，都为名相而生妄想；不能于诸妄想中，分辨出是与不是。由此可知，真正存在的本自妙有清净智慧的自性，以诸妄想的缘故，让大众也能觉察出存在，又不能了见到存在。</p><p>　　虚空物相都有神明主宰，都有物性存在；人只能改变物相，利用物性；而不能改变物性，这就是真实存在。佛是证得，不是自封。一人开悟了，要找法师认证，自己说不行；若不认证，自己说有通了，那是魔通。没开悟的人也千万不要盲目的评价法师，妄说一位证果的圣人，要堕地狱的，和谤佛谤法谤僧同样罪过。无上菩提自性是因修而证得转迷为觉，具足出世间智慧；若用世间聪明的凡夫所见去评价，不是大错特错吗！评价得了吗！性我做佛祖，人人都有自性；而心有杂染。离开心说性太难；在<a href=\"/remen/jingtuzong.html\" class=\"keylink\" target=\"_blank\">净土宗</a>说心，在禅宗也说心，而在密宗说性。转变人身心，发起慈悲心，指的是控制身口意不造作恶业。所以，一个心字有方便说的地方。首先让思维心清净，控制诸妄想，才能身心清净念佛。然后才能达到真心清净，去除业障才能往生。否则，往生不了。月是一个星球，当月球寿终时在宇宙中化作一道流光销失，这是无常说。月球上有月神主宰，上面也有众生存在。有人说登月的人怎么看不见？月球上的众生无形无相，处在另外一种生命状态。人有口气活着，这口气一断，是什么呀？月球上的主宰神完成使命时，月球就在宇宙当中失衡。太阳有太阳真君，土地有山神土地神，都各有主宰；若这些失去主宰时，就自然失衡。没有人能控制，就是一道流星；如人精神失常一样，既不能自知又不能自控。人只知向外去找，迷恋客尘，什么念头都有；于不知不觉中，为食物而想吃这个，又想吃那个；这还不够，张家长李家短又来了；又寻思谁对我友好，谁对我不友好等等。而不知向内去求，寻觅无量宝藏。</p><p>　　阿难向佛请法说，若佛所说法义真实如此，真心自性既觉于十方世界，又缘于十方世界；既清净自然的常住，又不生不灭。这与自为大梵天人后裔的梵志外道所说冥冥中存在的，大梵天公主宰宇宙，人命终后自然回到清净的大梵天化为天人；还与持牛戒、狗戒等苦行的娑毗迦罗外道所说冥冥中存在的，真我有大我、小我、无定我，也能遍满十方世界而存在；有什么差别吗？佛也曾于楞伽山道场，为大慧菩萨说《<a href=\"/fojing/lengqiejing/yuanwen.html\" class=\"keylink\" target=\"_blank\">楞伽经</a>》时开示此义；即外道都认为世间一切存在，都是自然生灭；而无因果规律可循。而佛说世间一切存在，都是因缘生灭；并有因果规律可循。佛说法义境界与外道所说境界，是完全不同。以我现在分辨看，此清净自然常住又不生不灭的真心自性，远离一切虚妄颠倒，似乎不是因缘，就是自然。佛怎么开示此自然与彼自然，才能使我与大众不入多种外道邪见；而能证得获知真实存在的真心自性呢？</p><p>　　佛说因缘非因缘，外道说自然著自然。说自然著自然是，一切都是自然产生，其中没有业果因缘；并求得生命的自然长生。如伊斯兰教认为，自然生成牛羊，这些清净的动物就是让人食用的。佛说因缘，是众生业报所致，才转畜生身。如不食众生的肉为因；众生皆贪生怕死，畜生身已经够可怜了，还相互吞啖；若慈悲不食，不结恶缘；还超度众生，买鱼鸟<a href=\"/remen/fangsheng.html\" class=\"keylink\" target=\"_blank\">放生</a>等，也能脱离三恶道为缘。但真心自性不是因缘生出，也不是自然生出。佛说，佛如此方便真实的开示，阿难你仍不能悟知，又迷惑其真心自性是自然。若真心自性必是自然，你须审慎辨明当有自然体相存在。你再审慎辨明，真心自性以什么形式存在为自然体相；是以光明为自然体相，还是以黑暗为自然体相；是以虚空为自然体相，还是以塞相为自然体相。若以光明为自然体相则不能见黑暗，若以虚空为自然体相则不能见塞相；反之亦然。这样的自然体相，必是相对的断灭相。阿难向佛请法说，此真心自性一定不是自然生，我现在分辨那一定是因缘生；但心里还犹豫不决，再咨询佛，因缘生的义理是否符合因缘性呢？</p><p>　　真心自性随因缘，因缘牵真心自性；真心自性非自然生，真心自性非自然相。我请教我师父，您怎么不弘法呢？师父说，“修行到现在，只能是随缘说；讲经说法还不行，没有达到那个辨才；我观察的诸法相因缘有限，还须加倍修行，精勤努力；时间太珍贵了，可不敢空过；早晨三点钟起来静坐，不耽误上殿；他人早晚过斋我都不去，争取时间静坐；一天就中午过一次斋，晚上静坐到十一点，精进而不敢懈怠。再说，我也没有时间讲法，修行人视时间比生命还重要。”我又请教，怎么才能见道呢？师父说，“必须静坐，都摄六根，入定三昧，才能明心见性。否则，是说道”。</p><p>　　证悟的人讲证悟的话，是与经义暗合。凡是讲法的法师都应知道，所讲应是证悟的话，与经义不违逆，这就是暗合。虽然话不一样，义理是一样的。否则，将经义用白话讲出来，恐不敢讲！若有谬误是负不起因果的呀！将佛说的法，用修行人的证悟境界，用普通话释解清楚；既不违逆法义，又与经义暗合就可以。所以，才有第二妙高峰喧嚣，一些行菩萨道的人引度众生，弘法利生。</p><p>　　佛说，阿难你说真心自性是因缘生；佛再问你，你现在因见的真心自性，是因光明、因黑暗、因虚空、因塞相而有见的吗？若因光明有则应不见黑暗，若因黑暗有则应不见光明；因虚空有见与因塞相有见，义理同于因光明有见与因黑暗有见。若此见是缘光明、缘黑暗、缘虚空、缘塞相而见；若缘虚空有则应不见塞相，若缘塞相有则应不见虚空。若缘光明有见与缘黑暗有见，义理同于缘虚空有见与缘塞相有见。以此义理应当悟知，真心自性不是因生，也不是缘生，更不是自然生；又不存在不自然的名称，又没有非与不非的名称，又没有是与不是的名称。既离一切相而又存在，既是一切法而又空性。你现在为什么于其中筹划妄想，以世间诸戏论与名相来分别真心自性存在的妙义呢？这样做如同用手掌摘取或抚摸虚空一样，只能徒劳无益；虚空怎么会随你的意愿而被捕捉呢？</p><p>　　为什么法离文字相，言语道断？经义非常明了。但诸修行人都能悟知此法义很难，须真修实证悟入而后觉知；理入不等于悟入，悟入才为功德。</p><p>　　我们天天念佛修道，没有为任何人修行；是在利益众生中为自我修行。因为真心自性暂住于体，身体就要承担识蕴中的无明业报。业习随因缘和合，召感到谁身上，谁就承受善恶业报。在承受善恶业报时，各种苦受传导于心灵，记录于心识。如人做恶梦时，就是心识记录恐怖的反传导的影现。再如动物被杀时，一种恐怖与痛苦自然落到八识田里。在此世间，平常人的身体只能帮助自心造作恶业，继续堕落，反帮倒忙。身心在那里分别，就等于用手去摸虚空，怎么摸最后都两手空空，白白忙活；最后累的是自己，累不着他人。修行人说没有时间，就要利用身体以生命争取时间，今生要是修不出去，一误就是几千年，几万年。诸位问问自己都在以什么心修道，别说年纪大与年龄小；那位老人八十岁，一天坐七八个小时，跟自己玩命，跟时间赛跑，修行真精进，就是不误自我。</p><p>　　有人问，法师收的弟子是皈依法师的吗？不是。是人皈依佛法僧三宝，又是皈依自性佛法僧三宝。法师收弟子只是中间人而已，如说某人是我度的，是谬误。一是佛度；二是自度。但是，在带领过程中，师父应自然承担弟子的一些过失，而功德却一点没有。度人是佛度、法度、缘度、愿度，不是人度；所以，发菩提心难，行菩萨道难。</p><p>　　阿难向佛请法说，如佛所说的真心自性既不为因，也不为缘；为什么佛经常与诸比丘说，修行人若明心见性，须具有四种因缘呢？就是因空、因明、因心、因眼，法义又在哪里呢？因空而生诸有，因明而显诸相，因心而闻诸法，因眼而见诸缘；才能说苦集灭道与十二因缘法。</p><p>　　佛说，因空、因明、因心、因眼的四种因缘，是说世间法的因缘相；不是说出世间的了义法。佛再问阿难你，世间一切人都说能见；怎么能见为见？怎么能见为不见？世间的因缘相，召感到人和生存环境就是因缘相；世间法是开示声闻弟子方便说。第一义是出世间了义法，既入世间，又无世间相。因为人有三身，召感到这个世界是第三重缩影，只是其中一个报身；还有两个身存在于天地，人不觉知而已。</p><p>　　阿难说，世间人于日月灯三种光明条件下见各种物象为见；若无三种光明的条件下，处于黑暗中，就不能见各种物象为不见。佛说，若无日月灯三种光明，不能见物象的同时，也应不见黑暗。若必然见黑暗，这只能是没有光明。若在黑暗时，因见不到光明的缘故，就为不见；那么现在有光明时却不见黑暗相，还能说不见吗？如此明见暗不见二种相，都应为不见。以此缘故，阿难你应当悟知，见明、见暗、见空、见塞时，真心自性都没有见明暗空塞相；才能悟知因空、因明、因心、因眼四种法义。阿难你还应悟知，眼见与真心自性观见之时的境界是，见不是见，空无见名，更不存在见因；见又离见，空观无见，更不存在见缘；见不及见，空无所见，更不存在见和合相。你怎么还说真心自性是以因缘见或以自然见，以及因缘与自然和合相所见呢？你们这些声闻弟子，心量狭小，根基劣钝，没有智慧分辨力，不能通达真心自性所具足的清净智慧和世与出世间诸法实相。佛于现在至心教诲，你们这些声闻弟子应当正思善维，勤于精进，不得疲倦、放逸、懈怠，要发菩提心，行菩萨道，证悟妙有的无上菩提。人的思维是坐于此可以想到美国、澳大利亚等，也可以想象星辰日月等，不因为有地域或墙壁等能阻隔断。只是身体要受世间法控制，不得自在。人的思维还可以超越空间，超越星球，想象极乐世界，想象净琉璃世界，想象十方佛国土等，只不过真心自性凭想象去不了。但修行人可以证得真心自性的自在，而不受明暗空塞所障碍。</p><p>　　阿难向佛请法说，蒙佛教诲因缘与自然，因缘与自然和合相与不和合，而又各自独立存在等，心仍不能开塞悟明；现在又听闻佛说眼见与真心自性观见及空无所见等，更重新增加迷惘不清。唯请佛再发大慈悲，再施大慧醒目，开示我们这样声闻人，如何证悟觉知真心自性的清净智慧？阿难请法时，自悲流泪；礼佛后默然听受圣音法旨。这时，佛怜悯阿难与大众说，佛将开示总持一切，又具无量义的戒定慧三无漏学与正定，证悟自性菩提妙有的修行路线与方法。佛又对阿难说，阿难你的记忆力非常好，有助于多闻；但于如何修行正定，并证入三昧而通达微妙密义的观照慧力不足。所以，你现在应仔细听闻佛的分别开示。也为将来有漏的声闻人，能够证得佛果。阿难你应悟知，一切众生生死轮回于世间，都是由于两个颠倒；既因迷惑而妄生分别，执著诸相；又因业习而心生妄见，执著诸想。于身口意所在处发生颠倒，又于颠倒造业处生死轮回。</p><p>　　佛接着说，什么是二种颠倒妄见呢？一是众生别业妄见；二是众生同分妄见。众生各自的一切业报都属于别业妄见；即独自颠倒，独自造业，独自邪见，独自受报。如失物、生病、自杀等，自作业自受报。众生共同的业报都属于同分妄见；即与多人共同颠倒，共同造业，共同邪见，共同受报。如地震、战争、瘟疫等，共同作业共同受报。众生是如何颠倒妄见的？是认为这事利益自己或利益部分人，才去造作；认为知见符合自己或符合部分人，才去执著等，于不知不觉造业生惑。</p><p>　　佛接着说，什么是别业妄见呢？如世间的平常人，眼红生翳，夜间见灯光圆影并有各种颜色重叠。阿难你是怎么想的，此圆影与颜色是灯光所显，还是病眼人所见呢？若是灯光所显，正常人眼为什么不见圆影与颜色，只有病眼人所见呢？若是病眼人所见圆影与颜色，病眼人所见圆影与颜色也真实存在，那这种圆影与颜色是什么物象呢？</p><p>　　众生眼红生翳是颠倒妄见，在烦恼黑夜中，不识真心自性之灯的智慧，只见如幻影的五蕴色身。正常人眼如诸佛菩萨的清净智慧，不见幻影蕴色，只知见觉真心自性之灯。佛接着说，若病眼人眼见的圆影与颜色，离开灯处又在别处显现；如屏、几、帐、桌等反光处。这种离灯别见应不是病眼人所注视的地方，为什么病眼人还能见到圆影与颜色呢？以此缘故，应当悟知圆影与颜色实是由灯光显现；但又是病眼人眼见才为圆影与颜色，圆影、颜色与病眼人都存在；病眼人的见不是病，只是颠倒妄见相；又始终不能说是灯光自见，只是灯光于反光处应现；于其中应现的灯光、圆影、颜色又都存在，这种应现的存在既不是灯，又不是见。</p><p>　　真心自性的智慧之灯，随人六根与五蕴而于业惑处应现，皆是虚幻不实；但又如病眼人，为假像而处处迷恋贪著。有人说，眼见为实，可实际上眼见未必是实。过去出家人，弟子做饭，饭熟了盛出两碗，在盛的过程当中吃了两口饭。师父见后说，怎么偷食呢？弟子说，饭里有个沙粒，沙粒上粘两个饭粒，我怕浪费了，把沙粒上两个饭粒吃了。师父方知错怪弟子了。所以，眼见未必为实。</p><p>　　佛接着说，这种灯光、圆影、颜色的于反光处折射应现，如人心中的第二月，既不是月体，又不是月影。是什么缘故呢？人心中的第二月，是人观月后想象而成；有智慧的人，不应说心中想象之月是月存在的根源；但月于心中，既是月形相，又不是月形相；既离所见，又不是见。人心中之月，既自不能眼见，又不能相见；他人更无法知此人心中之月，又只见人不见月。但人心中之月是存在的；如真心自性一样，虽离见不见又真实存在。佛接着说，这种灯光、圆影、颜色的于反光处折射应现，实是病眼人眼红生翳所致。对存在的各种折射应现，又怎么命名呢？是灯还是见；还是妄见分别的既不是灯，又不是见呢？众生于妄见颠倒中，妄认假我为真我，错用心机枉费心；改头换面迷认影，千劫万世唤不回。认为天下多是可怜悯者，其不知只有一人，那就是自己。佛接着说，什么是同分妄见呢？如此地球除大海水外，于中间平原陆地上，有三千水中陆地；其中于正中部分有一大块陆地，由东至西，包括南北面积很广阔，约有大国二千三百；其余小块陆地在诸海域中，面积大的地块上，约有三百国、二百国；面积小的地块上，或有一国、二国、三十、四十、五十国。如在同一小块面积上有两国，两国中只有一国人同感恶缘；而同感恶缘之国人，于当地看见诸一切不祥征兆，或见天空出现二日、二月、恶气晕月、黑气遮月（蚀）、白气佩月、半环玦月、慧星、孛星（芒短）、飞星（横向运行）、流星、日上恶气（负）、日耳、雨后早虹晚霓等。而另一国人，不但见不到此类恶象，也听闻不到恶象。一个国家的人同感恶缘，同有惑业，同感一族等。一个种族基本上是同感一种极重恶业，才有共同的业报。有媒体报导说，老鼠、蛇等动物集体自杀，说明某个国家需要很多婴儿出世，须<a href=\"/remen/zhuansheng.html\" class=\"keylink\" target=\"_blank\">转生</a>投胎，受业惑此死彼生去了；同时，这些畜生业报已尽，集体投生。异常天象，虽属自然，但也偶合；哪一地域有大灾难，天地也自然有异常现象出现。我国历史上多有记载，与此偶合的王朝更迭与天灾人祸等。</p><p>　　佛接着说，佛现在为阿难你再将病眼人与恶天象二事因缘，进行相互比较，辨明别业妄见的法理。如那个病眼人是别业妄见，注视灯光中所显现的圆影与颜色，虽似眼前真实存在，但从始至终，那个圆影与颜色都是眼红生翳所致。眼红生翳是视觉障碍，不是灯光造成；而病眼人的真心自性，始终没有在什么地方见到那个圆影与颜色。</p><p>　　世间万像，人类认为地球很美丽，结果是众生业惑所召感，集聚而成。众生不只是人类，畜生动物包括一些细菌等都是众生；虽生命形态不同，但与人类有共同业惑因缘，才召感到地球。释迦牟尼佛怎么也召感到地球？佛有愿力度脱众生，众生的业力不同，佛愿力所现的星球环境也不同。所以，佛力可以造化宇宙。凭什么造化宇宙？弘深愿力。度脱那道众生，不现这个星球环境，众生的业力不能去除；众生也不肯回头。如不现地狱、畜生、饿鬼三恶道，人就不知悔改所造作的恶业，而且无法去除。有人问，是不是人间什么样，地狱就什么样？地狱不是人间这么混乱，是众生的业报所感。地狱果报丝毫不爽，阎王都是菩萨做，不为金钱所动。有人问，怎样看待人类与灾难？人与天人比是低层次的，还觉得人生挺好，不知回心向善。为何有人类，人可以信佛修行。天人享天福，吃不愁，穿不愁，什么都自然化现。所以，修行就难；如人间富贵学道难。做人不要自卑，天人以上的圣道都是从人这一道修出去的，离开人这道不可能。四大部洲中，地球人的寿命最短，也最容易修成道业；因为知人生诸多痛苦，才能自有压力而知修行。一个国家容易造什么共业呢？如阿富汗和中缅边境的金三角，这些地方走私毒品，这就是共业。阿富汗有尊巴米扬大佛像，是世界上第三高的佛像，是古德为度化这个国家人民耗巨资建造的，可是塔利班这一政权，用炸药炸毁。当时，有人问我怎么看待。我讲，国王提出来的，很难改变，这个国家的人民要遭难。一旦炸了，这个政权长不超过一年，短则半年就垮台。后来的事情果然如此，这就是共业。本来业报是众生所造的，种毒品的地方有共业，把巴米扬大佛像炸毁有共业，一个民族的共业。再如一个国家无端侵略另一国家，炸药爆炸，死伤人类与自然界各类众生，这都是共业。这些共业都是因为这个国家领导人心态失衡，就是眼有病造成的；又是共同恶缘召感的。侵略国的人造的业和被侵略国的人造的业是因果关系，一个是果，一个是因，因果循环。世间众生互相吞啖，互相杀害，互相报复，这是业报所感。好斗的习气是哪来的？就是业报而来。</p><p>　　佛接着说，此别业妄见的法理合于阿难你现在境界，只能用眼见山河大地及诸众生等；这都是无始劫来真心自性被无明遮蔽，如病眼人与见恶象人的因缘。真心自性随业习应现与所见因缘，又好似现前所见境界；既是真实存在，却又变幻无常。真心自性本自具足觉了智慧；但智慧随业习因缘转化成无明，觉性随业习因缘转化成别业妄见；反之，智慧无明处，烦恼即菩提。若能明心，才能转迷识为觉性，才能回归本源智慧，才能转烦恼为菩提，才能觉缘随缘而不是别业妄见。只有觉性，才能觉知别业妄见颠倒，觉性又不在别业妄见中产生。此是真实存在的真心自性见与随缘见；怎么能与世间的见闻觉知相提并论呢？以此缘故，阿难你现在见佛与见自己，以及见世间十类（去除无色、无想二类）诸众生，都是别业妄见；而不是以真心自性观照别业妄见者。只有那个真心自性观见才为真实而无杂染，而真心自性观见又不是别业妄见；而真心自性观见，又不能称为相见。以色目见如来，非见如来，是为见如来像。真心自性无相见如来，见如来无相，才为见如来。如来可不变随因缘示现十方，示现见像又无见相；随因缘示现又可不来不去，示现生灭又无生灭。</p><p>　　佛接着说，如那一国同见恶象众生的同分妄见，与此病眼人见圆影与颜色的别业妄见，合于一处；一病眼人如同一国人，所见圆影颜色与不祥征兆，都是于共同无明、共同业习、共同妄见、共同颠倒中所生；即如瘴气所生起恶天象一样。一切众生无明也都是由无始劫来妄见所生，不觉起无明，无明起妄想，妄想起妄相，妄相起妄见，妄见起妄行，妄行起妄业，妄业起妄生，妄生起妄死。再如一人、一国、一地球、一四天下、一娑婆世界、一切有漏国土的一切众生，都具有觉了智慧、无漏妙有的真心自性；又都具有对诸相见闻觉知的虚幻妄见的业习因缘；业习与因缘和合而妄生，四大与无常和合而妄死。一切众生，若能远离分别妄见诸和合因缘，以及持戒清净行而不和合分别妄见诸因缘，就能灭除诸生因死缘。只有灭除诸生因死缘，才能证得身心无漏，才能真正发菩提心而出世间，才能圆满自性菩提而不生不灭又清净常住。阿难你虽理悟真心自性不是因缘性，又不是自然性；但还不能悟知如此不是诸因缘和合所生，以及不是诸因缘不和合而生。有人问，怎么理解似相非相，似见非见？我不想从理论上回答，只讲在实际修行中怎样去行。如修行人不见世间过一样，远离是非、戏论等。可有人却要问，这人怎么就不学善呢？这人怎么就不信佛呢？这人怎么就作恶业呢？这就是见相生心，这就不是似相非相与似见非见。这不是跟着瞎操心吗！这不是挂碍吗！谁有过失，请我讲，我宁可叩头都不讲呀。为什么？众生爱面子，太我执我见了。有过失不让人说，说不得。布袋和尚教化人，求不得，说不得，说了不行啊！他人有没有过失千万别分别；众生在我心里都是未来佛。他人打骂我的时候，要想，是未来佛助我成道呢！深感重恩！再如夫妻吵架，是逗着玩撒娇呢！这么一想就不生气了，一句话说乐了。若见他人生病也随之着急上火；把自己也弄病了，是不值得的。若用眼去见事物，就是颠倒不实，就是见相是相，又是相见见相。不但颠倒，还执著放不下呢！是一种执著心在作怪，真心自性做不了主，是可怜悯者。众生都是这样，不是哪一个人这样啊。禅宗讲不开悟的人都这样子，只不过是各人的习气有所轻重，各人的习气有所不同，各人的根基也有所差别。很难悟入似相非相，又难行入似见非见。</p><p>　　有人问，怎么理解别业？别业有善有恶。就是在同分妄见中，有别业正见。如阿富汗这个国家，同一个国家有很多人支持将巴米扬大佛像炸掉；但本国人中也有劝化的声音，也有不支持这么做的行动；这就是别业正见，因缘不一样了。再如缅甸政府规定禁止金三角的毒品生产，安置边民，这也是善业的别业正见，因缘也不一样。再如有的国家天天过太平日子，但也经常见到有很多犯罪的人，这也是别业。善恶别业，因不相同，缘也一定不同。在同一个国家中，多数人享受太平生活，都很幸福。可是幸福中有不幸的人，出车祸的人有多少，在医院的病人有多少，在火化厂火化的死人有多少，别业不一样，各有各的业报。</p><p>　　有人问，同见不祥征兆的业障是由何而起？由于恶业所感，恶业都是由身口意造作而成。有的人几世斋戒修行都有业障；何况天天在杀，相互吞啖，又起心动念总想算计他人等，这不都是在造恶业吗！业报虽千差万别，但是因缘和合时，都可同感不祥征兆。业障是在无明妄见时，在身体需要时，才有现行作业。如有人爱钓鱼，又有人爱打鸟等，都是不明白因果，认为这些行作正确，有求娱乐心需要得到满足。人与众生，表面虽形体不同，实际都有各自业报因缘。人食什么动物就与什么动物结恶缘，体内的毒素就渗入人的体内，并自动记入八识田中。今日是人食，明日是人还，总之是业报循环。人的业报颠倒不是今天才形成的，没有开始的时间，无始妄见所生。由于颠倒，又生出妄见；以妄逐妄，无有了期。</p><p>　　有人问，四禅天的胜境界怎么不能作圣解呢？没有证圣，作圣解行吗？作圣解为大妄语成。为什么？不究竟！这个世界灾难来临的时候，一禅天的天人贪欲，被欲火所害；二禅天的天人有嗔，被嗔水所害；三禅天的天人有痴，被痴风所害；四禅天的天人有我执法执，也要堕落。</p><p>　　有人问，世间有没有不妄生妄死的人呢？凡夫和圣人同样具有真心自性，但有迷有觉；凡夫是由于无明妄见的病根所致，召感颠倒妄业；再去因缘和合妄生与无常妄死。人生一次，不知为何召感生人；死也不知趣向何方，又不知到哪里去受生。所以，是妄生妄死。这个世间有没有脱离妄生妄死的人？有。证悟的圣人！从佛住世至现在，一直有往生到极乐世界的圣人，有往生到色界各天的圣人。有的人不能往生佛净土，怨谁呀？怨自己！怨不着任何人。佛是同等慈悲；只不过是人的别业所致，习气所感，颠倒太深，业报太重。在妄生妄死中，二十几岁、三十几岁乃至五十几岁的人，都作什么了？蹉跎岁月，执著于世间的生老病死无常相、酒色财气有娱相，色声香味触法尘贪相。有的人五十几岁，六十几岁才想起信佛，原来信佛还有这么多好处；赶紧去找善知识，当即修行，一下子就想往生到极乐世界去。这样想是善心，这样作也是善行；但理可顿悟，道须渐修。</p><p>　　有人问，怎么能离诸和合缘？持戒修行，身心不动。在持戒修行上，不随他人所动，一百人一千人当中，唯我一人独行；乃至六十亿人中，我都不随众，并为其所为；同时，不为根尘所动，依戒法而行；这是不随诸和合俗缘。世间人诸想法太多了，随来随去被这和合俗缘所害，三途离不开。只有不和合诸俗缘，独立的戒修佛法，自己修自己的，他人做他人的，才有机缘明心见性。世间事物千差万别，又有人生百态，考虑这个，又惦记那个，能有终了吗？只能是自度自身后，再能度他人。只有这样不起任何分别心，不怀疑佛说诸法，一门深入，得法入道，才能断生因死缘。就如赌徒押宝似的，今生就全押上了。佛法流传二千五百多年，究竟有什么奥妙，今生我干什么来了，这个世界法则这么多，这么奇妙，怎么才能了知。我认可这一生荣华富贵什么也不要了，有口饭食足矣，就修行佛法；修到柳暗花明又一村时，这一生就没有白来；何况既禅悦为食，又明了宇宙人生真相呢！跟时间玩命了，跟自己玩命了。世人谁不知娇妻美眷好？谁不知安逸好？修行人也都懂；但更懂因缘无常，更懂人身难得，更懂佛法难闻。若不离开诸生因死缘，一切免谈。谁能把经书读烂了，就能把生因死缘读没了，那是能人，能替佛多创建出一个修行法门来。“读经就能往生”，佛的八万四千法门中没这个。只能是读诵佛经的同时，念佛修行，从都摄六根开始，从苦行开始，才能离开诸生因死缘。</p><p>　　有人问，人体若没有神识，能不能正常生存？不能。人体有七魄住体，若没有神识统摄，人会感六神（即六魄，另一魄住性别之根）无主。一些人没等出生就<a href=\"/remen/duotai.html\" class=\"keylink\" target=\"_blank\">堕胎</a>，表面上是一种堕胎行为，实际是这种人不可能生到这个世间，有这个业报。神识什么时侯才能彻底独立呢？菩萨有化身成就时，就可以独立存在；化身也是报身的意生身。否则，都不能独立，只是受业牵的中阴身。我为什么反复讲，人若执著思维想，容易进入断灭；人若能超越思维想，了知神识存在，就知于分段生死中，还有个不死的真我，随业循环，继续在宇宙中存在。怎么才能不和合？就得寻找到一种解脱方法。解脱的方法在哪里？在佛法中，在自心里。否则，见相爱欲，迷尘惑觉，心无道力，处处和合。</p><p>　　佛接着说，佛现在还以世间客尘问阿难你，你仍以世间一切妄想与诸因缘和合的特性，而自疑惑。即真心自性不从诸因缘和合他生与不和合共生，又不是不和合而无因生，更不是自然而自生；那能证无上菩提的真心自性，和合的根源究竟在哪里呢？而你现在的真心自性，是与光明、黑暗、通达、阻塞和吗？若真心自性与光明和在一处，当你见明时，应有明相现前；怎么能见杂混相呢！而杂混相又可辨别，各有各自形像呢！若空无所见，怎么能见光明呢！若存有所见，真心自性怎么能自见自相呢！若真心自性是必然圆满的，还有什么地方须要与光明和呢！若光明是必然圆满的，那也不须要与真心自性和了！真心自性与光明必然是有差异的，若二者混杂在一起时必然失去其一；同时，二者的名称都要改变，各自也失去本自价值意义。黑暗、通达、阻塞和与光明和法理相同。</p><p>　　真心自性与思维念力既和合又不和合。怎么既和合又不和合呢？无常相。今天与人和合，人身死掉后，又不和合。业和合是暂时和合，是愿力和合。鸠摩罗什法师翻译经典时发愿，如翻译经典准确无误，荼毗后舌头鲜活不化；如翻译有误，荼毗时舌头成灰烬。鸠摩罗什法师发愿，贤劫千佛出世，生生世世翻译经典；翻译的经典一字不谬，荼毗时舌头鲜活不化。再有抗日战争时期，安徽有一位女子逃难到偏远的县城，由于人长相漂亮，被县长喜欢上了；这位女子不答应；县长诬陷这位女子是日本间谍；理由是教孩子学外语，跳西洋舞，唱西洋歌；证据是有个小镜子；罪名是为日本飞机导航，结果被杀。自从怒杀这位女子后，县长天天做恶梦；立刻请师爷，抄写《<a href=\"/fojing/jingangjing/\" class=\"keylink\" target=\"_blank\">金刚般若波罗蜜经</a>》。想用抄写佛经的功德，把业销掉。师爷刚拿起笔没等下笔，毛笔的头就掉下来，笔毛也散落，根本抄写不了。县长又找另一人抄写，结果蘸上墨落到纸上就是鲜血，这人也不敢再抄写。结果是县长胀肚而死。抗日战争以后这位女子的家人找到她的坟墓，整个尸体已腐；但是，心仍然鲜活。说明这位女子死的冤，执著心不离体，心与怨恨和合了。佛教中修行有一定功德的人，生前读诵《妙法莲华经》，死后多年打开棺木时，口出莲花。还有抄写《妙法莲华经》的人，突然间笔墨上就出莲花，旁边的人就能见到。这就是不同的心与各个不同缘和合的时候，生出各种感应现象。</p><p>　　佛接着说，再有阿难你现在的真心自性，是与光明、黑暗、通达、阻塞合吗？若真心自性与光明合在一处，遇到黑暗时，光明相因已经灭失而不能存在；真心自性既不能与黑暗合在一处，怎么能见到黑暗相呢？若真心自性见黑暗相时，不能与黑暗合在一处；那真心自性与光明合在一处时，也应不能见光明相。既不能见光明相，又怎么能是与光明合在一处时，了知光明相不是黑暗相呢？黑暗、通达、阻塞合与光明合法理相同。</p><p>　　阿难向佛请法说，如我仔细分辨，此真心自性与光明、黑暗、通达、阻塞诸尘缘相及人的意识不能和合吧？佛说，阿难你现在又疑此真心自性与意识不是和合，那佛再问你，你现在的真心自性是不与光明相、黑暗相、通达相、阻塞相和吗？若不与光明相和，此真心自性与光明相之间应有边际界限；你再仔细看一看自己，哪里是光明相，哪里是真心自性；再看一看各自边际界限在哪里？若光明相一边中必然没有真心自性，二者之间就是毫不相干的两码事；二者又各自不能自见，界限还能成立吗！黑暗相、通达相、阻塞相与光明相和法理相同。还有你现在的真心自性是不与光明相、黑暗相、通达相、阻塞相合吗？若不与光明相合，此真心自性与光明相之间就应相互背离，如耳与眼一样相互不能接触。而此真心自性不知光明相在哪里，怎么能分辨与光明相合与不合的法理呢！黑暗相、通达相、阻塞相与光明相合法理相同。</p><p>　　从普通义理上讲，见明不见暗，见暗不见明。光明与黑暗，这种名相来自于自然存在，是用眼观后，再用思维去想光明与黑暗；但这种光明与黑暗都以空相存在。如地狱长期处于幽暗之中，光明太难见了，就似一孔之光瞬间而过。此真心自性，有和合又非和合；既与这个肉身和合，又不与这个肉身和合。有非和合才有自性的独立存在，才有修证的开悟，才有四圣道；有和合才有人与众生都具有佛性。</p><p>　　佛接着说，阿难你还不能悟知世间存在的一切客尘运动，诸存在既如幻不实又变化显相，可当处出现又随时灭尽。但人生也如幻变化，又妄称名相；只有真心自性才是常住不变，又妙有觉了的智慧识体。 人所见的事物，都是浮尘与幻化相。如前面一片树林，十几年前被砍伐了；那个山头美丽，过几年采石的人又将山头转移了；再如，地球变迁，有的地方以前是海底，现在变成高山，地球也是经常变化的。人生也是随处生随处灭，生灭法则，有生有死，没有人能不生不死。只有证悟解脱自在的真心自性，以妙有身才能永恒存在。</p><p>　　佛接着说，人的身体是色受想行识五蕴与根尘结合的六识入，又从眼耳鼻舌身意与色声香味触法相对应的十二处，又至眼界等六根界与色界等六尘界再与眼色识入界等六入界的十八界，诸因缘和合而虚妄有生的生命体；若诸因缘分别离散时，虚妄有生的生命体与名相一起灭失。人因执著根偶入诸相有，又迷恋十八界诸和合因缘，行在殊途；不肯回头证悟觉知，人生与死亡、轮回六道的去与来，都是在佛法性身中；即法藏世界中常住、妙明、不动、周遍、圆融的真如佛性，与诸因缘和合的虚妄相。真心自性真常而不能觉知，生灭无常与去来虚幻却又执著；将悟转迷而沉沦于生灭法则中，既了无出期，又空无所得；只有苦受与烦恼相随。人身色受想行识五蕴怎么是法藏世界中真如佛性的显现呢？就如有人以清净眼观看光明睛朗的天空，唯有晴寂太虚，反复观看还是空无所有。可其人无有缘故，却目不转睛。但因长时直视发生眼疲劳，就于虚空中另外见到花飘动乱舞，又见诸幻相等。这些乱舞的花与幻相，既见于虚空中，又不是虚空中生出，也不是眼中生出；应当知人的色蕴就是这样。若是虚空中生出，就应于虚空中有来的路线，或有没入途径；若有来的路线与没入途径，就不是虚空；若虚空不是虚空，而是实体存在，自然不能相容花与幻相自由生起与灭失；如同阿难你身中不能相容另外一位阿难一样。若是眼中生出，就应有来的路线，或有没入途径；花与幻相就应是实体存在。既然此花与幻相的形像性质，是从眼出的缘故，眼与花及幻相应合在一起，怎么还有眼见呢？若有眼见，花与幻相就应与眼分离；当花与幻相离去时，眼应是空而无眼；当花与幻相在虚空旋转并与眼合时，怎么还能见眼呢？若眼不能见眼本体，眼随花与幻相既合，如翳眼于虚空；旋转后归入时，眼应当是翳眼。可当眼休息清净后，又见花与幻相与虚空中；这时，眼应没有翳，睛空怎么称名为清净眼了呢？以此缘故，应当悟知，色蕴虽是自身心中真如佛性所显现，但仍是虚妄不实；这种色蕴不是因缘生，也不是自然生。</p><p>　　如来藏即真心自性可含藏于众生心识中，证菩提道后又可含藏法界。真心自性的功德是，常住、妙明、不动、周遍、圆融。众生的真心自性，随着业报之身生生灭灭；但不因改头换面、轮回生死而改变本具功德。人是诸因缘和合，畜生等众生也是诸因缘和合。因缘和合是虚妄有生，虚妄有灭，包括堕落地狱。在地狱里是一种虚妄；召感到天人等也是一种虚妄。若修行人没有证悟讲不了此经，就是一问为什么就说不清楚；如怎么离开五蕴无真如佛性？又怎么真如佛性在五蕴中？人怎么不觉心含真如佛性？世间人的五蕴怎么幻化无常相而相灭性离呢？为什么开悟的人才知开始真修行？为什么不开悟的人不知真修行等。也讲不出此经正定境界。只能以文解义，照葫芦画瓢。</p><p>　　佛接着说，如有一人手与足都很自然安乐，身体也健康舒适，于粗心大意时，忘记了生死大事，心中自性也无有违逆与顺从之感；其人于无缘无故之间，以左右二手掌在空中自相摩擦。经自相摩擦的妄动中，自然生出粗涩、细滑、风冷、汗热等现象；应当知人的受蕴就是这样。身体多种变化与触觉感受，不是从虚空自来，也不是从手掌自出。若从虚空中自来，既然能让手掌感受，怎么不能让全身都感受呢？虚空不应选择人的不同感受吧！若从手掌中自出，不应待左右二手掌自相摩擦时才生出；而应自动生出。自相摩擦时手掌有感受，手掌分离后意识有记忆；这种感受，手臂、手腕、骨髓等都应知入记忆的踪迹，而却不能知；唯有意识觉知这种感受的出与入，内里自有一种物体于身中往来；这种意识觉知为什么待二手掌自相摩擦时才能有感受，还要称名为感受呢？以此缘故，应当悟知，受蕴虽是自身心中真如佛性所显现，但仍是虚妄不实；这种受蕴不是因缘生，也不是自然生。</p><p>　　人两手相搓的过程中，产生涩滑冷热等感受，是受蕴区宇。凡是用身体觉触到的一切感受，都是受蕴区宇。两手相搓产生的现象是暂时的，是一种物理现象。佛法不排斥科学，科学是佛法末端的延伸。既然是两手相搓，两手感到热，是皮肤细胞传导到大脑的细胞，物体传导只能是神经传导。这种神经传导用眼不能见，只能是身体感受。受蕴区宇也是一种虚妄不实的暂时现象，随着无常变化而变化。</p><p>　　佛接着说，如有人谈说酸梅时，自己与听闻的人都会有口水从舌下流出的现象；再如有人思忆踏至悬崖险境时，自觉腿脚酸软等现象；应当知人的想蕴就是这样。这种所说之酸，不是从酸梅中生出，也不是口中自入。若这种所说之酸是从酸梅中生出，只有人食用酸梅时才能流口水；而不应于人谈说时也流口水。若这种所说之酸是口中自入，自然是人食用酸梅时才能流口水；怎么会在耳听闻后，才能流口水呢！若单独是耳听闻谈说酸梅才能流口水，此水怎么不从耳中而出呢！这种思忆踏至悬崖险境时，自觉腿脚酸软的理义，与谈说酸梅类同。以此缘故，应当悟知，想蕴虽是自身心中真如佛性所显现，但仍是虚妄不实；这种想蕴不是因缘生，也不是自然生。</p><p>　　想蕴区宇是人的起心动念处。如人走独木桥时，心里不想其它，一直走就能走过去；否则，一看一想一哆嗦就掉下去，这是想蕴在作怪。色蕴重的人多是地狱道，受蕴重的人多是<a href=\"/remen/chushengdao.html\" class=\"keylink\" target=\"_blank\">畜生道</a>，想蕴重的人多是饿鬼道。想蕴太可怕，男孩女孩失恋自杀，一切众生占有欲强烈，相互颠倒。想蕴区宇内容丰富，且又无穷无尽。想蕴区宇又可超越时空，既能想古代，又能想未来。修行人超出五蕴区宇时，对任何事物不起心，不动念。如见到他人有过失时，自己一想就有过失；从而深知五蕴炽盛之苦。世间有三种人，在想蕴区宇不起念头。第一种人是妖邪占体的人，如妖邪不被驱走，意识里就会出现空白，记忆力不好；第二种人是傻瓜，这种人不多，让做什么做什么，做完什么也不想；第三种人是圣人，意识里处于空而无念的状态，什么也不记，什么也不分别，只讲证悟语，能称得起是活死人；如宣化法师自称为墓中僧。知见重的人，往往都在想蕴区宇打转转；疑惑心重的人，容易堕落并沉沦于鬼道，很难度脱。</p><p>　　五浊产生的基础就是五蕴；所以，五蕴炽盛的害处，在五浊时就显现。哪个蕴生哪个浊，哪个浊有哪个浊的业报，就是这样。飞行员中有恐高症的人不敢跳伞，一旦把他推下去，跳一次很安全，想蕴区宇就这么破了，要不然破不了。想蕴区宇也是虚妄不实，本自虚妄，颠倒所生，完全是眼耳鼻舌身意及六入产生的蕴。在说六入之前，说的重点是声闻法。一说到六根、六尘、六入的时候，从十八界开始，讲五蕴区宇，说的重点是辟支佛法；辟支佛知其所以然。三途苦就是六根、六尘、六入召感的。声闻乘在找真心自性中，知苦集而修行，证道而灭苦集。辟支佛观察十二因缘法，知这些苦受从哪里来的，怎么产生的。所以，修行辟支佛的人住山洞、搭茅棚、<a href=\"/remen/biguan.html\" class=\"keylink\" target=\"_blank\">闭关</a>；再入定，脱离红尘，躲开六入，修自己的独观。唐玄奘法师取经途中，在山洞遇一辟支佛，在释迦牟尼佛没来到这个世界示现成佛之前就修辟支佛道。修行辟支佛并不是当生闻佛法，而是生生世世修行佛法才有这个功德，不是人人都可以做到的。辟支佛了不起，福报超过阿罗汉，功德比阿罗汉大；而且辟支佛乘，是修行过程中不可逾越、承前启后的过渡地带。声闻乘要想成道，必须用缘觉的修行方法，才能成就菩萨行。声闻乘、缘觉乘要发菩提心，才能成就唯一佛乘。释迦牟尼佛在雪山独自静坐六年，既是示现声闻法，又是示现缘觉法，最后才是示现成就佛道。成就佛道的程序是一个，只不过是发心不一样，愿力不一样，成就不一样。一些人从初始就想我发菩提心吧，我度人等，是不知其所以然，是初生牛犊不怕虎，什么都敢想，可以理解。但是真正的修行人就不敢说这话，要自己先学会游泳后，再去自救救人。修行人都离不开声闻和缘觉的修持方法，天天往那一坐就进入定的状态，都摄六根，控制五蕴。若离开这样的修行方法，成就不了道业，法为一理，义有别同。平常人想蕴区宇里是五蕴炽盛，前念生后念灭。思想当中的想法妄起，想控制念头不容易，太难太难了。不想不可能，想这个，想那个，一个念头生出多少个念头，想一想自己还来气呢；想一想高兴的事，自己又乐了，都是属于这一类。所以，想蕴区宇坑坏了很多人。一些人对佛法狐疑不信，都在想蕴区宇。有些人不知狐臭病怎么回事，是前世对佛法狐疑不信，今世就有这个<a href=\"/remen/baoying.html\" class=\"keylink\" target=\"_blank\">报应</a>。梁武帝一个妃子释氏，<a href=\"/remen/xinyang.html\" class=\"keylink\" target=\"_blank\">信仰</a>佛法，但她<a href=\"/remen/linzhong.html\" class=\"keylink\" target=\"_blank\">临终</a>时生出一念嗔恨心，堕落蟒蛇身。不要认为念佛了，就不堕落三恶道。在修行的问题上没有小事，也没有俗事，不得不慎。如乘急戒缓，发的是大乘心，结果<a href=\"/remen/jielv.html\" class=\"keylink\" target=\"_blank\">戒律</a>守持不严，会堕落龙道畜生身；有天福而没有天德；再如念佛人在想蕴区宇，爱耍小聪明，容易堕落黄鼠狼道等。</p><p>　　佛接着说，如有一条波涛汹涌的河流，波浪接连不断，后浪推前浪起伏而不能相互逾越；应知人的行蕴就是这样。这种波浪流动的特殊性，不是因为虚空而生出，不是因为流水而必有；波浪也不是水的性质，又离不开虚空与流水。若是因为虚空而生出波浪，十方无尽虚空都会成为无尽的水流，诸世界也会淹没于汪洋之中。若是因为流水而必有波浪，这样波涛汹涌现象的性质应不是水。若有水必有波浪相，当下就应显现于眼前让人随处可见。若水就是波涛汹涌的性质，而澄清平静时，应不是水之本体了。若离开虚空与水流，虚空周圆而有内无外，水离开外力空间也无法流动。以此缘故，应当悟知，行蕴虽是自身心中真如佛性所显现，但仍是虚妄不实；这种行蕴不是因缘生，也不是自然生。</p><p>　　水有流动性，因为是液体；但也不是有水就必起波浪。这种波浪怎么来的？一是因流动，随着地形的高低而产生；二是随空气流动而产生；三是静水随外力产生的；如一潭静水，扔一块石头，立刻起波浪。所以，波浪不是水的物性；只是流动中产生的现象，又是内力与外力和合所致。外力是什么？身心有动就是行蕴区宇。水是自然物质，当地球处在坏的阶段时，火山喷发，水马上就离开这个世界，到其它星球去了；所以，现在研究其它星球无水，这个水哪去了，在星球之间流动。人的行蕴区宇在哪里，所思所行是。人一天、一月、一年、一生都在做什么？业习结因，因又结果。一生所思所行一切都自负因果。要知前世因，今生受者是；要知下世果，今生作者是。人念佛也好，静坐修行也好，既为现世安乐，又为下世做准备呢。为什么所思要自负因果？久思形成习气。</p><p>　　佛接着说，如有人取来一个似频伽鸟型的瓶子，用物塞住头尾两端瓶口，瓶中充满本地虚空；并将此瓶托起，带到千里之外，用来馈赠另一国家为礼品；应当知人的识蕴就是这样。瓶中虚空对另一国家是，既不是从他方来，也不是从此方入；若瓶中虚空是从他方来，将瓶如此带回时，瓶又贮满虚空而去，此地应少了一瓶虚空才是；若能如此，将瓶塞去掉时，应见从瓶中倒出的虚空。以此缘故，应当悟知，识蕴虽是自身心中真如佛性所显现，但仍是虚妄不实；这种识蕴不是因缘生，也不是自然生。</p><p>　　识蕴区宇就是这样，不好理解；众生的体内有第八阿赖耶识，就等于这个空瓶子，不觉知有又实际存在。人所行、所思形成的习气差别，都在识蕴区宇。如有人性格好与不好等；又有人爱吃、爱穿、爱名、爱利等；还有人能歌、能画、能讲、能写等，都是八识田里流露出的一种习气，来源于识蕴区宇。人最糟糕的就是识蕴区宇，江山易改，秉性难移。这个秉性就是识蕴区宇里的习气，江山易改，因为有形有体；秉性难移，习气无形无体。自己都对照一下自己，从懂事那天起到现在习气改多少了？没改多少。人这一生的性格都不好改。识蕴区宇的性格，影响人的事业、家庭、身体，对人这一生一世都有影响。当然，人的特长技能，多是天赋，也来自识蕴。习气表现为各种贪欲，影响人的生生世世。而且都是在不知不觉当中，想改一点都很难。只有依法修行人，有证悟后方可除掉习气；否则，除不掉，想改变比登天还难。谁说发慈悲心了，我不敢相信。因为，识蕴区宇的习气是从八识田里来的，无始劫来积累的，靠几句话发慈悲心，没有人敢相信；所以，有兵不厌诈之说。善于带兵的将帅，首先研究对方将帅的品格是什么，性格是什么，爱好是什么，特点是什么等；然后再研究作战方略，克敌制胜。人性格不好，自己把身体造坏了，还怨天、怨地又怨人；包括父母关系处理不好，<a href=\"/remen/zinv.html\" class=\"keylink\" target=\"_blank\">子女</a>关系处理不好，夫妻关系处理不好，朋友关系处理不好，同修关系处理不好，上座与下座关系处理不好等，乃至事业失败，做人失败等，还怨这个赖那个，就不在自己心行上找缘由，过失总是放在他人身上。知道识蕴区宇的习气可怕，就要依法修行，一定能彻底弃转。谁要责难我，是我的过失；对不起，我赔礼，不管是谁，都不与之较劲；若打我两下，打的好呀，阿弥陀佛，这个业报没了，今天又过了一关，又离成就佛道近了一步，多高兴啊！太好了！还生气吗！修行人的习气就是这么转的。识蕴区宇里反传导有想，一想就有动。如男恋女，女恋男，是有色想，有形体；由于有形体，有触有感受，语音有感受，受蕴区宇就有了色、受、想、行、识。五蕴之间谁也离不开谁，说是五个，最后归终为有一就有五。人识蕴区宇里的业习是虚妄不实的，是可以转化除掉的。这句话很重要，识蕴区宇的无明，是自己的业报，是积习累业而来。这种虚妄不实本非因缘，又业报因缘和合，都来自于有因有缘。在性上说，人各有自性，性与性之间没有因缘，往来不相代，你我谁是谁；就是非因缘性。非因缘性又是由因缘和合产生的，不是自然产生的。没有无因之果，没有无果之因。是性造作了吗？不是。先是这个身体去造作了，后是自性随业而转，而有心识。人活在世，吃好喝好，有贪求等，幕落鼓歇进火化场肉体没事了，自性还跟着心识转，包藏在阿赖耶识中，中阴身还得受报去；所以，一个生命体的结束，并不是心识的结束，只是人生这一阶段的结束，还得随业报而无结束。心识在地狱受苦报时，还喊着人世的俗名，念俗世的形像；包括阿鼻地狱，苦报如人做梦一样，幻想幻生，苦不堪言，处在恐惧之中，处在苦受之中。人一生如没做什么恶事和善事，命终到地府一殿阎君那里报到。报到后，直接到转轮处随业超生去了；一超生，这人的一生就结束，是分段结束，换成了另外一种受报的形体。宇宙人生的真相是，人生灵肉难离分，造作善恶随果因。换形变态异新命，十法界里自选身。入胎之迷难脱身，五行相克锁精真。吾心内外都不见，无始无终苦中吟。宇宙人生真相不是人编的，那是通过对宇宙人生现象的观察，得出来的法理。识蕴区宇的业习，召感的命浊最糟糕，定报难改。修行人自己弃转习气，就是改变自己识蕴区宇的无明，从根本上下手，解决生死这个大问题。\t\t\t\t</p></div>"
},{
    "title": "【大佛顶首楞严经卷三】",
    "author": "净慧大师",
    "date": "",
    "html": "<div class=\"B1_text\"><h2>【大佛顶首楞严经卷三】</h2><p>　　佛接着说，六根界与六尘界再与六入界怎么是身心中真如佛性的显现呢？就如那位目不转睛望空直视的人与眼的疲劳，同是身心中真如佛性显现的疲劳相；即表现为幻境与幻觉现象。这是因虚空明尘与眼体暗尘二种妄动，发生识见居于其中出入；外见色尘现象，内入为无尘无象，这是人识入的眼见功用。这种识入的眼见功用，若离开虚空明尘与眼体暗尘，毕竟不能存在。阿难你应悟知，这种识入的眼见功用，不是来自虚空明尘之明与眼体暗尘之暗中；既不是眼根自然生出，也不是于虚空中他生。是什么缘故呢？若来自虚空明尘之明中，眼体暗尘之暗就应随即灭失；于物理特性上，明不应见暗。若来自眼体暗尘之暗中，明尘之明也应随即灭失；于物理特性上，暗也不应见明。若来自眼根自然生出，必然没有明尘之明与暗尘之暗；这种识入的眼见功用，本来没有固定不变性。若于虚空中他生，既能见虚空明尘现象，归入时也应当自见眼根；又虚空明尘可自观虚空明尘，与眼体暗尘又有什么关系呢！以此缘故，应当悟知，眼根与色尘的识入，虽是自身心中真如佛性所显现，但仍是虚妄不实；这种眼根与色尘的识入不是因缘生，也不是自然生。</p><p>　　人体本身就是一个小宇宙。法界之中设这么个迷局，随业召感形体，随习气去痴迷，随欲望去造作，随愿力去修行等。内有六根，眼耳鼻舌身意；外有六尘，色声香味触法；中间有六入，因缘和合。一个死人还有六入吗？虽内有六根，外有六尘，但根尘不偶，自然也就没有六入了。召感心识中的业习还存在，引起的变化又千差万别。如我在这读诵受持佛经，诸位也随着听闻受持，是根尘有偶入为因缘。我教静坐，诸位也静坐，这是行入；我讲佛法，诸位感觉很对根基，这是受入；我分别讲诸法，诸位那一思维，这是意入等。是色受想行识将根尘行念因缘，装到八识田中。五蕴就似一把双刃刀，既可以伤他人，也可以伤自己；这是辟支佛知其所以然的因缘法，一定要知道。别的法师怎么讲的我不太清楚，我只根据自己的证悟去讲，证悟到哪里，讲哪里不同的境界。我用世间最普通的语言，把佛法表述出来，让平常人都能听明白，这才是我需要去做的。</p><p>　　人身就是法藏世界中业缘和合的物体，众生自性即是菩提。人修行能成就佛道，但不是肉身成佛；立地成佛非肉体，三身四智才是真。执著肉身成佛不行，要借肉体修报身；只有报身有成就，才有法身、化身的成就。只有释迦牟尼佛为度众生一大因缘示现成佛，又示现入大涅槃。法界有情众生的形体，是如来法性的妙用与众生业习因缘和合的化现。为什么末法时代后五百年，此经与《大般<a href=\"/fojing/niepanjing/\" class=\"keylink\" target=\"_blank\">涅槃经</a>》先陨没？由于魔王最惧怕这二部经，也是佛说法三百余会中阿难遭魔难的二部经。此经说出了成佛的正因、正智慧，有此经在就等于佛法性智慧住世；修行人读诵受持此经，就开智慧，于心中生出正知、正见，明了从入道到证道的全过程。《大般涅槃经》说出了佛的正行、正法，有此经住世，就等于佛正法住世；修行人读诵受持此经，就知正法久住，于心中生出慈悲喜舍的正知见觉，明了众生皆有佛性和世间与出世间的真谛。对于佛经若抓住本源诵持，就易明法理。修行证得开悟，不用谁讲，翻开佛经一读诵，和自己的感受一比照，修行过程完全是这么回事。没开悟的修行人，怎么读诵都被理论文字所转，一头雾水，理解不清。佛法存在于真如妙性之中，人体也存在于佛真如妙性之中。人体多奇妙，各器官、身形、走路安排都非常合理，谁想人为的改变一下，一样也改变不了。有人说肉体器官中胆没用，若把胆割了，就销化不好；有人说盲肠没用，还得阑尾炎，但有缓解肠道压力的功用。人体各器官安排的得体得用，太神奇了。一切世间的事物也同样，国家的最高机关和国王如人的大脑中枢；人体内有淋巴结分泌细胞，专门杀细菌，如国家有警察、军队；还有食物销化与各种排泄，政府也需要吐故纳新，思想也在不断更新等，都非常奇妙。怎么才是度人，名为度人，实则心性解脱于烦恼，心性存在于身中。度人不是人度，是依佛法，借假修真而自度。</p><p>　　佛接着说，如有人以两手指急急自塞其耳，致使耳根发生疲劳的缘故；于头中发出嗡嗡的响声。这种闻声与耳疲劳现象，同是身心中真如佛性显现的疲劳相。这是因自手妄动与耳静二尘，发生识闻居于其中出入；外闻尘现象，内入为无尘无象，这是人识入的耳闻功用。这种识入的耳闻功用，若离开自手妄动与耳静二尘，毕竟不能存在。阿难你应悟知，这种识入的耳闻功用，不是来自自手妄动与耳静中；既不是耳根自然生出，也不是于虚空中他生。是什么缘故呢？若来自耳静中，自手妄动之尘就应随即灭失；于物理特性上，静与动不应同时存在。若来自自手妄动中，耳静也应随即灭失；于物理特性上，动与静也不应同时存存。若来自耳根自然生出，必然没有自手妄动与耳静二尘；这种识入的耳闻功用，本来没有固定不变性。若于虚空中他生，虚空也有耳闻功用，那虚空就不应是虚空；又虚空能自闻声尘，与耳闻功用又有什么关系呢！以此缘故，应当悟知，耳根与声尘的识入，虽是自身心中真如佛性所显现，但仍是虚妄不实；这种耳根与声尘的识入不是因缘生，也不是自然生。</p><p>　　人的耳闻功用，是因为有动、有静、有入才能听闻声音。在正常情况下，有声尘发生，外有空气传导，内有神经传导，中有意识输出导入，才有耳闻功用。有动、有静、有传导，意识感知又加以分别、判断、反应，是诸因缘作用下的和合相。反应是这个声音来自何方，有什么不同，多近多远等。这些判断，是由思维记忆中产生的分别。耳根虽具功用，又是六贼中的一贼，虚妄颠倒，是因缘生，又非因缘生。因缘生是人的业习召感，是诸因缘的和合相。非因缘生，人人都有耳朵，动物都有感觉器官，为什么闻声有别。非自然性，不是自然的力量，又离不开自然的力量。非自然力量是神力化现，如瓢虫看似简单，人想改变它的形体，改不了；人想造一只瓢虫也造不出来。人若一碰它，爪子一蹬装死，贪生惧死是本能，不是人造的。非自然性，还是业力召感的缘果。其中有个妙，科学研究不了。科学只能研究基因组合、新发现存在或灭失一个物种。灭失了的物种，留不住；新发现的物种，又不知怎么来的；所以，世间诸法实相，诸法空性，又引导人进入一种奇妙境界。</p><p>　　佛接着说，如有人急促用鼻呼吸，急促时间过长时致使鼻根发生疲劳的缘故；于鼻中有如冷风吹动的感觉。因这种感觉分别发生呼吸通畅与鼻塞不畅的虚实二种现象，乃至嗅香与臭等不同气息的功用，并与鼻根疲劳一起，同是身心中真如佛性显现的疲劳相。这是因通畅与鼻塞二尘，发生识嗅居于其中，并有气息出入尘相；这是人识入的鼻息嗅功用。这种识入的鼻息嗅功用，若离开通畅与鼻塞二尘，毕竟不能存在。阿难你应悟知，这种识入的鼻息嗅功用，不是来自通畅与鼻塞中；既不是鼻根自然生出，也不是于虚空中他生。是什么缘故呢？若来自通畅妄动中，鼻塞不畅之时嗅功用就应随即灭失；若来自鼻塞的妄动中，通畅之时嗅功用也应随即灭失；怎么能发生嗅香与臭等感觉呢！若从鼻根自然生出，必然没有通畅与鼻塞二尘；这种识入的鼻息嗅功用，本来没有固定不变性。若于虚空中他生，虚空有嗅功用，就应反嗅其鼻；又虚空能自有嗅，与鼻息嗅功用又有什么关系呢！以此缘故，应当悟知，鼻根与呼吸及嗅尘的识入，虽是自身心中真如佛性所显现，但仍是虚妄不实；这种鼻根与呼吸及嗅尘的识入不是因缘生，也不是自然生。</p><p>　　鼻有鼻的功德，能嗅到来自任何方向的气味。鼻也是一贼，帮人起烦恼，嗅到香气想占有起烦恼，嗅到臭气生厌离起烦恼，鼻不通畅睡不着觉起烦恼。但修行有证悟的人，鼻呼吸功用减弱，有时候不呼吸，有时是息，有时鼻畅快至脑髓中，才感知鼻是一宝。不静坐的人，鼻不能正常呼吸还很难受；只知用来呼吸，不知还有畅快，真是憾事。鼻与其它根是一样的和合相，是物体发出气味，通过空气传导，通过嗅神经传入大脑组织，生出反应，就有一种感受等。</p><p>　　佛接着说，如有人用舌反复自舐其唇，长时间自舐致使舌根发生疲劳；这人如是病人，会感觉舌有苦味；如是无病人，会感觉舌略有甜味。舌能感觉出甜味与苦味，证明舌处于常态时，会感觉清淡无味。这种舌能分别味觉的功用与舌根疲劳一起，同是身心中真如佛性显现的疲劳相。这是因味觉与清淡二尘，并有识觉居于其中发生的现象；就是识入的舌味觉功用。这种识入的舌味觉功用，若离开甜苦与清淡二尘，毕竟不能存在。阿难你应悟知，这种识入的舌味觉功用，不是来自甜苦与清淡中；既不是舌根自然生出，也不是于虚空中他生。是什么缘故呢？若来自甜苦妄动中，甜苦之时清淡现象就应随即灭失；怎么还能味觉清淡呢？若来自清淡的妄动中，清淡之时甜苦现象也应随即灭失；怎么还能味觉甜苦呢！若从舌根自然生出，必然没有甜苦与清淡二尘；这种识入的舌味觉功用，本来没有固定不变性。若于虚空中他生，虚空有味觉功用，就应虚空自觉其味，就不应是舌觉其味；又虚空能自觉其味，与舌味觉功用又有什么关系呢！以此缘故，应当悟知，舌根与味觉的识入，虽是自身心中真如佛性所显现，但仍是虚妄不实；这种舌根与味觉的识入不是因缘生，也不是自然生。</p><p>　　舌根也能起烦恼，身三口四，在<a href=\"/remen/shijie.html\" class=\"keylink\" target=\"_blank\">十戒</a>中口就占四个。菩提就从这开始，佛子都从佛口中化生。人的是非烦恼也多从口出，当人被好的音声所转时，就已颠倒迷误，会将善言当成恶语听；也会将恶语当成善言解。舌觉味功用是因舌有味觉神经，传导到大脑，大脑有生物电波。静坐时间长的人，摸什么都有静电，静电极强，平常人静电少；所以，修行人与平常人的磁场不一样。</p><p>　　佛接着说，如有人以一冷手握其另一热手，若冷势强于热势时，热势随从于冷势；反之亦然。如此冷热握合的触觉，超过常态体温时虽能觉知，但长时间过冷或过热时，致使手触觉发生疲劳的现象。这种冷热握合与手触觉的疲劳现象，同是身心中真如佛性显现的疲劳相。这是因分离与握合二尘妄动，发生识触居于其中发生的现象；就是识入的手触觉功用。这种识入的手触觉功用，若离开冷热与离合二尘，毕竟不能存在。阿难你应悟知，这种识入的手触觉功用，不是来自冷热与离合中；既不是手根自然生出，也不是于虚空中他生。是什么缘故呢？若来自握合妄动中，分离现象就应随即灭失；怎么还能觉知分离呢？若来自分离的妄动中，握合现象也应随即灭失；怎么还能觉知握合呢！若从手根自然生出，必然没有冷热与离合四种现象；这种识入的手触觉功用，本来没有固定不变性。若于虚空中他生，虚空有触觉功用，与手触觉功用又有什么关系呢！以此缘故，应当悟知，手根与触觉的识入，虽是自身心中真如佛性所显现，但仍是虚妄不实；这种手根与触觉的识入不是因缘生，也不是自然生。</p><p>　　人身体是以手为代表的，手能感到冷与热，是身体有触入。冷热相都是相对的，是世间法，在引导人透过假相找真心自性；真心自性没在身体的哪一个部分，哪一个部分又都包含在真心自性中。身体由各个器官组成，躯体是内脏在住持着，内脏又在躯体支撑保护中。内脏按中医分有金木水火土，天有五行相生相克，人也有五行相生相克。脾胃不和不行，肝胃不和不行等，都需要和。人的真心自性虽是见不到，摸不着；但一离体，人就死掉；七魄就立刻散失，脏器也失去功用。身体劳作疲劳时，就需要休息；同时，不运动也不行，本身就是一种颠倒相。身体是烦恼所成，烦恼所聚。身体虽是假的，却是真心自性所暂住的房子；如离开身体，真心自性无依。身体离开真心自性，不能念佛，不能修行，不能成道。静坐禅行无念时还不行，还得身心去念佛，无念如同枯木禅。产生一念，但这一念可不是大脑产生的，是心念佛，意识去感知。身体里面似有人念佛，晚上夜静更深，还似有人在那念佛。如修行人静坐参禅疲劳时，睡一觉就好。宇宙能量都在虚空当中，禅密行人静坐，毛孔是张开的，由于人神经细胞都在活跃兴奋，五脏六腑运转比平常人快；所以，能吸收宇宙光能。修行人保护好身体，就是保护好修行的本钱。身体不光是自己的<a href=\"/remen/caifu.html\" class=\"keylink\" target=\"_blank\">财富</a>，也是真心自性的妙用，天地造化所成就；即人类社会的财富。所以，不知珍惜自己的身体，盲目的因这事、那事、嗔恨、生气、不解等自杀的人，业报极重。自杀的人，中阴身在阴阳两界之间游荡，谁都来欺辱，谁都来管事，天天受苦受气；至枉死城里时，众兽吞啖，非常恐怖。人要珍惜自己的生命，千万别自杀，不论世间怎么苦，都不及失去人身堕地狱的一时苦。修行中遇到什么难事，想开一些；越难时，越是要有成就时。智慧不足才是难事，智慧足就不是难事。遇见呵斥或不堪入耳的声音，恰恰是善知识在身边，是难得难求的慈悲声音。天地有阴阳，人随阳而动，随阴而息。身根与其它根一样，不是睡觉就是醒着，两者不可兼得，这是凡夫相。修行有证悟的人，就不是这样，见似睡觉，心里明白，动静尽知。</p><p>　　佛接着说，如有人疲劳困倦则需睡眠，经熟睡恢复体力便清醒，览阅物象时会引起回忆；如失去记忆为忘记，这是记忆中的颠倒现象。在记忆中，对发生、住存、变异、灭失四种现象，经常吸入可形成习惯，按先后顺序存储其中，还可回归前景；并对发生、住存、变异、灭失顺序不能相互逾越。如未发生的事物，不能形成住存、变异、灭失等。这种意识觉知功用与疲劳现象，同是身心中真如佛性显现的疲劳相。这是因发生与灭失二相妄动，汇集识知居于其中，吸入并聚起体内六根对外六尘，顺逆因缘的见闻觉知现象；并住存、变异于意识记忆中；虽不是直接流入第八识，但有间接影入，并存贮于其中；这就是识入的意识觉知功用。这种识入的意识觉知功用，若离开醒睡与生灭二相，毕竟不能存在。阿难你应悟知，这种识入的意识觉知功用，不是来自醒睡与生灭中；既不是意根自然生出，也不是于虚空中他生。是什么缘故呢？若来自于清醒中，睡眠现象就应随即灭失；怎么还有睡眠呢？若来自于睡眠中，清醒现象也应随即灭失；怎么还能有清醒呢！若来自于发生中，灭失现象就不应存在；怎么还有灭失呢？若来自于灭失中，发生现象也不应存在；怎么还能有发生呢！若从意根自然生出，清醒与睡眠二种现象，随身有起始与闭合；而意识觉知功用，是与身一体；若离开起始与闭合二种体性特征，此意识觉知功用，就等同于虚空花朵，毕竟不能存在。若于虚空中他生，自有虚空觉知功用，与意识觉知功用又有什么关系呢！以此缘故，应当悟知，意根与觉知的识入，虽是自身心中真如佛性所显现，但仍是虚妄不实；这种意根与觉知的识入不是因缘生，也不是自然生。</p><p>　　意根是六贼之首，人造作的善恶业都受意识支配。只要身体有暖寿识存在，就有生命现象存在。有生命现象，就有暖的体温，寿命的长短，意识的分别。修行佛法是从<a href=\"/remen/wensixiu.html\" class=\"keylink\" target=\"_blank\">闻思修</a>开始的，闻思修离不开意识。修行人可以转三毒心为三密藏，变贪嗔痴慢疑为佛法藏。六根转化是从意根起始的，意根不转化，修行人不得其它各根的转化。只有意根接受了正知<a href=\"/remen/zhengnian.html\" class=\"keylink\" target=\"_blank\">正念</a>，才有身心的正行正定。一切贪念，一切罪恶都从意根生，不知如来甚深法味，造作罪障无量无边。知见障是从意根生出来的，一障就把人障到一边去。菩萨在因地修行时，所谓的退转就是意识的作用，觉得世间太苦；供养财物又是增加西行的负担。一切供养皆有为，存世色像亦非真。累劫救度无以报，净念弥陀酬师恩。言真意切总是假，心心相印一灵真。金鸡报晓玄关外，昆仑顶上见故人。在这里多说几句，是因为意根对修行太重要；戒修法行，弘法利生等，都受意根支配；当然，其它五根对意根也有反作用；如离开其它五根的反作用，意根也将失去功用。意根可以带心识上天堂或出世间，也可带心识入地狱、畜生、饿鬼等。</p><p>　　佛接着说，六根与六尘相互对应的十二处，怎么是法藏世界中的真如佛性呢？阿难你在进一层观察，对这里的林苑泉池是怎么认为的？是因有色尘才生眼根，还是因眼根才生色尘呢？若是因眼根才生色尘诸物象，那眼见虚空时，怎么不见色尘诸物象呢！既然虚空无色尘诸物象，能生色尘诸物象的眼根见功用应随空无一起销灭；既然眼根见功用销灭，则应显而发现，一切物象也都应空无；既然色尘诸物象为空无，人体本身及眼根同属物象，也应为空无，还用什么去明辨虚空本体的空无呢！反之，虚空也是如此，还有可明辨的本体吗！若是因色尘诸物象才生眼根见功用，眼见虚空无色尘诸物象时，眼根见功用就应随之销失灭亡掉；既然销失灭亡为空无，还用什么去明辨虚空与色尘诸物象呢！以此缘故，应当悟知，眼根见功用与色尘诸物象及虚空，都不能固定不变的存在。既眼根与色尘二处都虚妄不实；根与尘所对应的法性，就不是因缘生，也不是自然生。</p><p>　　十二因缘法，六根顺用是贪嗔痴，无逆无顺妙用就是戒定慧；只有修行戒定慧，才能去掉贪嗔痴。杂染的身心，反过来就是净土。这身体年轻时没用在正地方，年老时想把年轻的时光追回来难呀！非痛下苦心不可！否则，一失人身，万劫不复。修行人证得身空、意空、心空时，心观空相是另外一种境界。世间的空是一种相空，是对比上的相空；不是心观空相的境界。十二因缘处，是法藏世界中真如佛性的妙用；明悟法理，可破除意根所生诸障。</p><p>　　色尘与眼根所见，山河大地诸物象是存在的；但是人身见，虚幻不实。缘故有二；一是无常相；人与物都不能固定不变，永恒一相。二是法则性；诸法性不生不灭，不能眼见。修行人衡量世间一切事物，不应以眼见与不见为标准，也不应以手摸到与摸不到为标准；应以心观了悟缘起缘生为标准。修行人是借假修真，身体是假和合，修的是真常，真常的是真心自性；所以，身体的过与失，语言上的顺与逆都不重要。《金刚般若波罗蜜经》中说破诸相，此经说破我执法执，都是同一法理。</p><p>　　佛接着说，在此园中，阿难你再听僧众过斋击鼓声与集合撞钟声，鼓声与撞钟声有先后次序，各自音声又声声相续相连。你是怎么认为的？是音声来自耳根处，还是耳根去往音声处呢？若是此音声来自你耳根处，就如佛于室罗筏城乞食，于此园中无佛一样，此音声与佛无关；同时，目犍连、迦叶等众都不应听闻；而事实却相反，此园中一千二百五十僧众，都能一时听闻此音声，并来至食处或集合处。若是你耳根去往此音声处，又如佛乞食归来并住于此园中，于室罗筏城无佛一样，此音声还是与佛无关。你听闻此音声，其耳根已去往此音声处；如钟鼓齐鸣时，耳根不应一时去往二处；更何况于此音声中还夹杂着象、马、牛、羊等各种音声呢！耳根不应一时去往各处。若没有耳根与音声的来往传递，也就没有听闻。以此缘故，应当悟知，耳根闻功用与诸声尘，都不能固定不变的存在。即耳根与声尘二处都虚妄不实；根与尘所对应的法性，就不是因缘生，也不是自然生。</p><p>　　人的诸障哪里来？从往昔与今世眼耳鼻舌身意积习而来，都是六根所觉知不真实的缘故。真心自性靠这六根向外求是找不到的，须依法修行把这六根转过来；既利用又暂时停止六根的功用，六根无分别；又住于定中，身心融入虚空，觉又不觉存在；世间一切空寂，又法喜充满。有时，开悟的人见物体是移动的。物体怎么移动？不开悟的人就说不清楚。物体并不是长移动，只是乍见时移动，细观时不动。所以，修行人要知从根本处下手，从实践处着眼。缘起性空，不去执著名相，放下我执，空掉法执。若以色目见我，以音声求我，是人行邪道，不能见如来。闻佛法、诵佛经等，要知怎么行，才是真实的。与自己修行不沾边的事，那是法理上的事，知多也好，知少也好，既重要又都不重要。</p><p>　　佛法不排斥世间法，认为世间的一切存在，既是自然又不是自然；既是因缘又不是因缘。佛法不排斥科学，认为社会有社会的法则，自然界有自然界的法则；社会与自然的一切存在都处于生灭法中，诸法又不生不灭。佛教的宇宙观，大而无外，小而无内，一真如法界；如宇宙中存在清净的极乐世界与生命状态等；十方无尽，又尽是十方。科学研究发现，宇宙中有种暗物质存在；又有外星球的飞碟光顾地球，还有各种各样人类不可知的生命现象等。世界上有没有能明了宇宙生命现象的人呢？有！但不是用科技，是用心观。有修证的人神识可以离体；正是神识离体清明，随心所愿处行。天堂地狱可去，光速万倍太虚。十方世界的佛国土，化身都可以去，如文殊师利菩萨的国土不用语言和音声沟通，人与人心有所思时，相互立即感知；若要回答问题，这人一思，那人就知。有的世界一闻香就可知，极乐世界树动鸟鸣都是阿弥陀佛的愿力音声等。所以，这个世界的人类与外星球生命现象、语言方式、沟通方法差异太大；与宇宙空间的高智能的生命现象，不可同日而语，无法想象，不是用语言文字和科学能描述的，是心性的冥通。有的修行人到海边、集市等噪声嘈杂的地方静坐念佛，身心还能清净下来；这是通过转化耳根功用，在转化身心。有的修行人一边看电视或听录音机，还能静坐念佛；要是没有这个功夫，静坐时可千万不要这么做；否则，身心杂乱，也不如法。有一定功夫时，一试就知道，外面的音声随听随忘，有时想听，不知道在听什么，没有那么回事；或听不到音声；心静下来了，体外体内的音声都被空掉。修行不是嘴上说来的，不是在佛经上读诵来的，是实修实证得来的；所以，谁要只执著于佛说的哪部经而不修行，想了生脱死是不可能的。读诵以后就立即放下，就立即受持实修去；如读完科学种田的书本以后，把书本立即放下，去实际种地，才会有庄稼的丰收。修行人如种田，边实践、边诵经，才能对上号；要不然的话，空研究法理，还是空对空；如隔山打鼓，不着边际。闻经开悟者，多为再来人；吾辈须精进，菩提当下行。若没有修行，诵经不知所以然，又易被功德转；有时还在猜闷，费挺大劲猜一圈，还不是那么回事。</p><p>　　佛接着说，阿难你再嗅此处炉中所燃的旃檀香，若再燃一铢（重量单位），此城四十里（二十平方公里）范围内，都可同时嗅到香气。你是怎么认为的？此香气是生于木处，还是生于鼻根处，或是生于虚空处呢？若是此香气生于鼻根处，可称是鼻根所生香气；香气也应当从鼻根而出，但鼻根不是旃檀木；鼻根中怎么能生香气呢！若称是鼻根嗅入香气，香气只能入鼻根，而不应出鼻根；此时鼻根却随呼吸能出香气，就不应称是鼻根嗅入香气。若是此香气生于虚空处，虚空恒常不变，香气也应常久存在；又何须于炉中燃此枯木呢！若是此香气生于木处，而此香的本质特征是，因热燃才能成为烟气；若鼻根得嗅此香气时，应嗅香与烟混合的气体；而其烟气刚刚腾入虚空，还没有达到四十里范围内，怎么能早已嗅到呢！以此缘故，应当悟知，鼻根嗅功用与诸香尘，都不能固定不变的存在。即鼻根与香尘二处都虚妄不实；根与尘所对应的法性，就不是因缘生，也不是自然生。</p><p>　　香气源于燃木，传播于虚空，嗅入于鼻根。在物理现象中，是诸因素综合作用，于众缘和合时，才生出此状况。但各自包藏的法，既表现为有生有灭，又表现为不生不灭；有生有灭为变化，不生不灭为常住（物质不灭）。</p><p>　　佛接着说，阿难你经常于早、午二时，随大众一起去托钵乞食；于乞食中，有时会遇到从牛乳中加工出的酥、酪、醍醐等上等品味的食物。你是怎么认为的？此上味是生于虚空处，还是生于舌根处，或是生于食物处呢？若此上味生于舌根处，可于你口中只有一舌根，食用此上味时其舌根应成为酥、酪、醍醐；而再食用甘蔗糖时，应不能改变其味而不知有甜。若能随食物不同而有改变，其舌根并不是多体；怎么能一舌根而能知多种味呢！若此上味生于食物处，食物没有味觉的识分别，怎么能自食自知其味呢！若食物能自食自知其味，等于他人食用，怎么能是你的舌根知其味呢！若此上味生于虚空处，你食用虚空应是什么味；虚空如是咸味，不但能咸你舌根，还应咸你脸面；此世界的人类都会同海鱼一样身受其咸；虚空如是咸味，就应彻底不知淡味，也不应觉咸味；既咸淡空无，还能称为味吗！以此缘故，应当悟知，舌根觉功用与诸味尘，都不能固定不变的存在。即舌根与味尘二处都虚妄不实；根与尘所对应的法性，不是因缘生，也不是自然生。</p><p>　　世间法是一切以时间、地点、条件为转移，佛法是缘起性空。如有的在家人修行，食肉就反胃，身体就有反应，这是身心不受；实际是心不受，影响身不受。这都是心以另外一种形态影响思维方式，影响身体行为所致。为何有的在家人信佛还食肉呢？是没有转舌根；众生的身心被众味牵着走，行戒人的身心能牵着众味走。</p><p>　　佛接着说，阿难你经常于清晨早起时，以双手摩触头部。你是怎么认为的？此触觉应在哪里？是在于手部，还是在于头部呢？若触觉在于手部，头部则无触觉，怎么能为摩触头部呢！若触觉在于头部，手部则没有发生作用，怎么能为用手部摩触呢！若手部与头部都各有触觉，那阿难你应有两个身体。若头部与手部的触觉是一个，则手部与头部应统于一体；若统于一体，手摩触头的触觉就不应产生。若有两个身体，触觉应在哪个身体上存在呢！不知触觉存在于哪个身体，又不知触觉存在于手部与头部；不能是虚空摩触其头部吧！以此缘故，应当悟知，身根知功用与诸触尘，都不能固定不变的存在。即身根与触尘二处都虚妄不实；根与尘所对应的法性，就不是因缘生，也不是自然生。</p><p>　　意识支配手摩其头，又传导回意识为感知；即表现为意识知手与头的触受。若是眼突见物体袭来，没用想也会闭眼，或用手先拨挡。这是人体的本能，也是下意识或称为第七识反应。人体这种本能作用非常强，表现在思维中应为我见、我爱、我慢、我嗔等；既是本能反应，又是久积成习，还是可以转化。</p><p>　　佛接着说，阿难你于意识中，经常受三种习气与性格所支配；即善缘、恶缘、无记缘。习气与性格是由妄缘产生，并逐渐形成固定的心理习惯与行为规则。此心理习惯与行为规则又不断的重复、不停的新生。此心理习惯与行为规则是由意根产生，还是离开意根另外有产生处呢？若是由意根产生，此心里习惯与行为规则就不应是法尘；尘应有相对的相存在，如声尘有声相存在；若法尘无相，就不是与意根相对应的存在；怎么是产生处呢！若是离开意根另外有产生处，那法尘的本质是可知还是不可知呢！若为可知应称为意根，如称为意根又异于你而不是法尘；以这种可知方式存在的法尘，若能独立存在，就等同于另外存在意根；那你现在的意根，怎么是你的意根呢！难道你的意根能一分为二吗！若为不可知，法尘既不是色、声、香、味、触（冷暖）相，又不是虚空相；那法尘的本质应如何存在呢！法尘的本质现在于色五尘相与虚空相中没有表明存在相；法尘的本质不应存在于人间之外与虚空之外吧！意根如不是法尘本质的产生处，产生处又从哪里安立呢！以此缘故，应当悟知，意根识功用与诸法尘，都不能固定不变的存在。即意根与法尘二处都虚妄不实；根与尘所对应的法性，就不是因缘生，也不是自然生。</p><p>　　人的意识不是记善事，就是记恶事，平常的事记忆不深刻。如有人天天被恶人整治，终生都忘记不了这一恶人。再如有人大恩惠于人，终生都忘记不了这一恩人。又如不善不恶印象不深刻的人，就容易忘记。真心不在意识里，但意识有传导的功用；将人的善恶因缘传导入到八识田里；即存于自心，亦为自染心。八识田里等于仓库，可储存善业恶业。善恶因缘和合生人时，又是善业恶业各半，才召感到这个世界上。修行人出离三界时，是纯善无恶。平常人命终时多是恶业多，善业少，而入三途；只有少数人善业多，恶业少，而生天人。</p><p>　　有人问，我没恶过谁，也没做过恶事；怎么是恶业多善业少呢？怎么不反问自己，善助过多少人呢？为社会做过什么大善事呢？为自己修行过十善业吗？在这个世界上对任何人和事物起恶念都为不善，何况食众生肉、说是非等。众生是有鲜活生命的动物体；食肉等于<a href=\"/remen/shasheng.html\" class=\"keylink\" target=\"_blank\">杀生</a>，心不慈悲。如见到一条蛇，觉得很厌恶，可知这个生命在宇宙当中多珍贵，人不能制造出这一生命体；但要毁掉或食掉太容易了，毁掉或食掉就是杀业。张三有过，李四有失等；见时、想时、说时已为妄想，都有业报随形。</p><p>　　有人问，五根有相而意无相，五尘有相而法无相；怎么为意根法尘呢？六根与六尘相互对应的十二处，是法藏世界中的真如佛性；又是身心中真如佛性的显现。五根有相而功用无相；有相为体象显用，无相为第七识妙用。意根无相，功用亦无相；意根无相是体象隐用，既综合支配五根，又受五根反作用力；功用亦无相，同为第七识妙用。七识妙用为魄神力妙用；既受心识统摄，功用又相对独立。所以，意根同为色身所有，等同于五根。五尘有相而法性无相；有相为物象显用，无相为法性妙用。法尘无相，法性亦无相；法尘无相为入意根可成印象，再入心识为有相；法性无相为真如佛性的妙用，真空存妙有。所以，法尘等同于五尘。</p><p>　　有人问，怎样对待善缘与恶缘？平常人多是遇善缘易随善缘，遇恶缘易随恶缘。心识未在意识里，但心识与意根关系紧密。如一个老和尚，善人来求法，他给讲法；恶人来求法，他多给讲法。小徒弟说，“师父好赖不分，不能理解。”师父没说话，写个我字，反过来写的，问小徒弟认识吗？小徒弟说，“要正写的我字认识，但反过来写的我字不认识。”这时，师父说，“这个字正写也念我，反写也念我；善人是人，恶人也是人，修行人要一样起慈悲心，平等心。”在这个世界上，有证悟的人，心中无爱憎，心中无是非。但平常人，见自己过失很难，他人过失一见便知，这就是法尘中的习气；所以，意根转法尘很难。法尘中的知见障都在意根里，入心识后为法相，于生生世世六道轮回中，作用于识蕴。修行没有证悟的人，读诵经书后心识易被六贼牵走；有人拿着经书的标准衡量这人那人修行的怎么样，一衡量一个误。不会用心识观人功德，只用眼见人表面言行。所以，佛教度人，师父带徒弟费劲。徒弟开悟后说，“师父啊，我才知道，心若光装善不能转恶时，这个世界上恶多善少，恶人就多，佛就没有度尽恶人的那一天。心若转恶时，无恶无善。所以，我要诚心向师父学，善人、恶人都具人的功德，人人平等相度。”善是在相对情况下为善，恶是在相对情况下为恶。再恶的人对自己的父母也善，同样父母对儿女也善，能相互包容，这就是人的天性。再恶的人也有一份天性，就这一份善意，都是可度之人。修行人怎么开的智慧，就这么一点点积累来的。证悟有智慧的人，不是善恶不分，只不过不去分别与表现，空于中道。如一位剑客，从未打过败仗；他说“感谢这把宝剑呀！”同道人问，“不打败仗，感谢宝剑，功夫不是自己练出来的吗？”剑客说，“我这把宝剑比他人的剑短一块，让自己常常保持不如他人的心，在与他人交战时，处处才小心，一点也不敢放松，才成为常胜将军。而使用长剑的人，见到这剑短一块，心就轻敌。所以，交战的人失败在轻视对手上，不是失败在剑下。” 修行人要时刻保持谦下心，不要把自己摆在高位置上去。佛的弟子都是乞食的，除乞法食外；粮食是农民种的，衣食行住的一切都是他人<a href=\"/remen/bushi.html\" class=\"keylink\" target=\"_blank\">布施</a>的，地地道道的乞食者。包括地里的蚯蚓和各类微生物，没有它们不能有土壤的松软，庄稼不能正常生长；没有蚊虫、蜜蜂传导花粉，庄稼不能丰收。把自己位置放低，修行才易有成就；若高高在上放不低，永远也难成就，就重要到这个程度。如一个企业招聘人才，上班的第一件事从扫厕所开始。企业老总说有知识又有才能的人能做最低的事情，也就能做最大的事情，小事做好了，才能做大事，小事做不好，大事也做不来。</p><p>　　有人问，怎样才为修有成就？通过修身，身口不造杀、盗、淫、妄等业，影响意识；由影响意识再往仓库里装善，积功累德，八识田里的业报才少；再通过忏悔，销除往昔业报，这样才逐渐修有成就。</p><p>　　有人问，从哪里转化身体？有的人闭关六、七年，身体没什么变化，是修为不到家呀。一千多年前一位高僧说过一句话：“炼转金丹火炭红。”我在书中一见，知是得道高僧；肾变化了。肾是先天之本，肾有变化，身体才能变化。天天静坐念佛，都摄六根，不是虚假的；这个障、那个障都是先天业障。</p><p>　　有人问，意识与心识怎么不容易分开呢？因为意识触境攀缘，贪著诸有；又执著所见所闻尘相等，不觉心识存在；并误为意识为心识。要知此妄心妄见，一是无常，二是不真。心识于定中观察，才观到真实的诸法实相与诸法空性。不再相信自己意识的思见，才知人的外相与内相不是一回事。就是人前世的业习召感因缘，外相业习有相同之处，内相因缘也有相同之处。</p><p>　　有人问，开悟的人都须认证吗？开悟的人，自己说开悟了不算数，必须有开悟的人认证才行。值佛住世时，佛为弟子亲自印证；正法时代多是师为徒认证；像法时代开始，都必须经开悟的法师认证。修行人一说话，开悟的人立刻就知怎么回事，是心照见；也是身体、思维、心性经过几十年或无量劫的修行，于证悟中走过来的路程。所以，才敢认证。拿着书本知识种不了田，分辨不了是碱性地还是酸性地。必须实践过才行，教授、专家还得到田间地头向农民取经，向农民学习实践中解决问题的方法，再加以研究实验，理论来自于实践，实践是成功之母。离开实践谈理论，那就颠倒了；用理论套实践不行，只能是指导实践。</p><p>　　有人问，极乐世界是不是精神世界？人的思维缘于时间、地点、条件，离不开空间；地点、条件、空间，又离不开时间，离开这些世界就不存在了，人也都离不开。极乐世界不是精神世界，不是存在于想象中的世界。极乐世界的人安乐，连个苦字都听不到，人人是菩萨，是具足福德慧德的众生。所以，人外有人，天外有天；心有所缘，性有所依。心见时才明了，迷于烦恼是众生，觉了无明才是佛、菩萨。</p><p>　　有人问，此世界与彼世界有何区别？文殊菩萨与维摩诘居土说法时，没有文字、没有语言，没有问答，那才是真实法。人的意识与世间法则，都是虚妄不实的，都是无常的，都是相对的，有起因就有落缘，业因感缘。虚妄就是颠倒，产生颠倒知见；即世间物象多是顺着人的意识想象创造的，天设迷局，酒色财气。众生入迷局一试一个迷，执著于颠倒，回不到心性的本来。此世界与彼世界，此人类与彼人类有差别，差别是善业与恶业的因缘不一样，是心识中功德不一样。</p><p>　　佛接着说，六根与六尘及六识入相互对应的十八界，怎么是法藏世界中的真如佛性呢？阿难你现在已悟知，眼根与色尘相互对应为缘，于此产生眼根的色识入。此眼根的色识入可重复与新生，因是眼根产生；所以，以眼根为界限。因是色尘产生；所以，又以色尘为界限。若色识入是由眼根产生，如没有色尘与虚空，眼根就没有可分别的尘相与空间；色识入又有什么作用呢！既没有色尘的青黄赤白等颜色与长短高低等形体，眼根的色识入从哪里安立界限呢！若色识入是由色尘产生，如虚空中没有色尘的存在，色识入应灭失；眼根见虚空时，怎么还有色识入知是虚空呢！若色尘形体或颜色发生变化时，色识入也应随色尘发生变化；而色识入不能发生变化时，色尘的色识入从哪里安立界限呢！如色尘形体或颜色发生变化，色识入也随色尘发生变化；那色尘的识入界限自然不能安立。色尘形体或颜色如发生变化，色识入应恒常不变；既然色识入是由色尘产生，色尘无眼根，自然不能知虚空在哪里。若色识入是眼根与色尘共同产生，眼根与色尘缘合时，眼根与色尘应合为一体；二者色识入中间的界限应离开；如眼根与色尘离开界限，眼根与色尘的体性特征就会产生掺杂混乱；各自的界限还能成立吗！以此缘故，应当悟知，眼根与色尘相互对应为缘，于此产生的眼根色识入界，三处都各自虚妄安立，空无实性；眼根与色尘及色识入界三处，都不是因缘生，也不是自然生。</p><p>　　眼根见色尘有识入，就有因缘。一切众生无始劫来善恶因缘不同，召感的身体形态、环境条件、时间空间等，也有差别。修行人不只是转变今生身体，也是未来心识召感生命现象的改变。若身体造作无量无边的恶业，心识于百千万劫中生死轮回而不得解脱。其它道的众生也造业，相互吞啖或有妖邪障修行人的道等，严重的今生就受报，雷击火烧，天界斩杀。其它道的众生如行大善时，也当即受报；如遇大善因缘或护持佛法，会脱离恶道，得人天之身。若有人造极重业时，业力现前，当世就受报；诸恶因缘纠缠，福报销失。</p><p>　　有人问，修行人应如何对待魔法与一切顺逆善恶因缘呢？心性如矿石里的黄金，必须用冶炼黄金的炉子才能将黄金从矿石中提炼出来。人身就是矿石，世间就是冶炼黄金的炉子，修行就是冶炼方法与过程，心性就是黄金。人是自作业习召感来的，是自愿来的，不是谁逼来的，来与不来都具佛性。魔王也具佛性，魔法与一切顺逆善恶因缘等，都是法藏世界中存在的妙法。修行人如证悟不到这一境界，尚难修、难行。平常人不知诸法实相，只知真善美是佛法，不知假恶丑也是佛法，二者相互依存，相互伴生；佛法又空于中道，无善无恶。顺是行世间法的本源，恒顺众生，没有道理可言。不顺心生烦恼，不顺诸事出岔，诸事结果还是顺其自然。极乐世界的人都是菩萨，是出离三界的众生，是纯度很高的黄金，可以加工为各种器具或装饰品等等，不再需要冶炼金矿石的炉子了。</p><p>　　佛接着说，阿难你又已悟知，耳根与声尘相互对应为缘，于此产生耳根的闻识入。此耳根的闻识入可重复与新生，因是眼根产生；所以，以耳根为界限。因是声尘产生；所以，又以声尘为界限。若闻识入是由耳根产生，动与静二相就不应现前，耳根便不能形成闻识入的知；如不能形成知，也必然没有所知的闻识入；闻识入又以什么音声为形貌特征呢！若闻识入是由耳根接受于听闻，没有动与静的缘故，听闻便不能形成；怎么能有耳的形状呢！耳是杂染色身的一部位，应属于触尘；怎么能称为闻识入界呢！耳根的闻识入又怎么安立界限呢！若闻识入产生于声尘，闻识入应由声尘而有，就不关听闻什么事；如没有听闻，声尘就应亡失，声尘之相又在哪里呢！若闻识入是由声尘产生，少许的音声也因听闻而有辨别，从而产生声尘相；既听闻音声，又应有闻识入相。如不能听闻音声，就不是闻识入界。如没有闻识入界，就会产生不同音声为同声，闻识入也已被耳根所听闻；那还有谁能知闻识入呢！如人没有知闻识入，就如草木一样而永无所知了吗！不应于声尘与耳根听闻二处中间，夹杂而形成闻识入的中界；闻识入没有居中位的界限；即闻识入不应兼有内相与外相，这种居中位的闻识入又能从哪里形成呢！以此缘故，应当悟知，耳根与声尘相互对应为缘，于此产生的耳根闻识入界，三处都各自虚妄安立，空无实性；耳根与声尘及闻识入界三处，都不是因缘生，也不是自然生。</p><p>　　如有噪音时，修行人能做到耳根静而不听。修行人若不被声音所转，身心如同草木时，是无记无念；若不及时提起念头，易形成枯木禅；绝不是开悟境界。</p><p>　　佛接着说，阿难你又已悟知，鼻根与香尘相互对应为缘，于此产生鼻根的嗅识入。此鼻根的嗅识入可重复与新生，因是鼻根产生；所以，以鼻根为界限。因是香尘产生；所以，又以香尘为界限。若嗅识入是由鼻根产生，而你心中以什么为鼻，是认为骨肉隆起如鹰双爪钩之形相呢？还是认为嗅识入的呼吸特征之相呢？若认为是骨肉隆起之形相，骨肉是杂染色身的一部位，应属于触尘；可称名为身，不应称名为鼻；又可称名为触尘，而不是香尘；鼻尚没有名称，鼻根的嗅识入又怎么安立界限呢！若认为嗅觉是嗅识入，在你心中以什么为嗅觉，认为是骨肉为嗅觉，而骨肉之嗅觉，属于身触识入而不是鼻嗅识入。如以虚空嗅觉为嗅识入，虚空如自有嗅觉，骨肉应没有嗅觉；如是这样应虚空是你，你身却没有嗅觉；那今日的阿难应在哪里呢！如以香尘嗅觉为嗅识入，嗅觉自然属于香尘，为什么让鼻根嗅觉呢！若香气味与臭气味就产生于鼻根，而另外存在的香气味与臭气味二种气味流，不应产生于极香的旃檀木与极臭的伊兰木；如香气味与臭气味二种气味流不来时，自嗅其鼻根是香气味还是臭气味呢？是臭气味就不是香气味，是香气味就不是臭气味。若香气味与臭气味能同时嗅知，那一人应有二鼻；也应有二位阿难向佛请法，哪一位是你身呢！若鼻根是一个，香气味与臭气味又能同时嗅知，就会香臭不分，香尘的界限从哪里安立呢！若嗅识入是因香尘而产生，嗅识入又是因香尘而存在；就如同眼有色尘能见，而不能反观自眼一样；如因香尘而存在的缘故，香尘应不能自知其香味；如香尘能自知其香味，嗅识入就不应是香尘产生；如香尘不能自知其香味，香尘就不应是嗅识入；如香尘不能自知其存在，香尘的界限就不能形成；如嗅识入不能知其香尘，嗅识入界就不能存在，从而香尘也就无从建立；既没有香尘与鼻根二处中间而形成嗅识入的中界，也不应兼有内相与外相。诸嗅觉与另外存在的气味，也毕竟虚妄。以此缘故，应当悟知，鼻根与香尘相互对应为缘，于此产生的鼻根嗅识入界，三处都各自虚妄安立，空无实性；鼻根与香尘及嗅识入界三处，都不是因缘生，也不是自然生。鼻呼吸气流，再通过神经传导，辨别气味。观察真心自性不在六根中，不在六尘中，也不在六识入处；但六根与六尘及六识入的意识传导，都落入心识，形成善恶业习。</p><p>　　佛接着说，阿难你又已悟知，舌根与味尘相互对应为缘，于此产生舌根的味识入。此舌根的味识入可重复与新生，因是舌根产生；所以，以舌根为界限。因是味尘产生；所以，又以味尘为界限。若味识入是由舌根产生，而世间诸甘蔗、酸梅、黄连、食盐、细辛、生姜、肉桂等有味物品，都将无味；这时，你自品尝其舌根是苦味还是甜味呢？若舌根本是苦味，由哪根来品尝鉴别呢！如舌根不能自品尝鉴别，又怎么能觉知其味尘呢！如舌根本无苦味，于舌根处味尘又不自产生；怎么安立界限呢！若是由味尘产生，味识入自为其味尘，就与舌根不能自品尝鉴别一样，又怎么能觉知其味尘是有还是无呢！再如一切味尘，酸甜苦辣咸等，都不是一种物体所产生；即味尘是多种物体所产生，味识入也应存在于多种舌体中。如味识入存在于一舌体中，舌体应自然产生味尘，那咸与淡、甜与辣等味尘也应自然产生；这时，味尘的诸变化相，也应混合为同一而不能分辨。不能分辨，就不能称为味识入；又怎么称为舌根与味尘为缘，于此产生味识入界呢！此觉知的味识入不应是虚空产生，而应是舌根与味尘和合产生；和合就存在中介与混合；存在中介与混合就失去本有界限，还怎么产生味识入界呢！以此缘故，应当悟知，舌根与味尘相互对应为缘，于此产生的舌根味识入界，三处都各自虚妄安立，空无实性；舌根与味尘及味识入界三处，都不是因缘生，也不是自然生。舌贪诸味，量劫怨生，怨怨相报，无有了期。根尘和合，识入产生，妄自分别，妄执无明。不知法味，禅悦乐生，离生死苦，自在解脱。菩萨境界，无疑为疑，无悟为悟，无世出世。</p><p>　　佛接着说，阿难你又已悟知，身根与触尘相互对应为缘，于此产生身根的触识入。此身根的触识入可重复与新生，因是身根产生；所以，以身根为界限。因是触尘产生；所以，又以触尘为界限。若触识入是由身根产生，应自然没有触尘分离与和合二种觉知对应的缘，身根怎么能产生触识入界呢？若触识入是由触尘产生，自然没有身根；哪里有没有身根而能觉知触尘和合与分离呢！物体不能自触，也无觉知；如自刀不能自削自把；而身根能觉知有触识入。觉知身根有触识入，觉知与触识入即是身根；但触识入不是身根，身根又不是触识入。身根与触识入二种相，本来就不能分离，如分离就没有存在处；二种相和合之身根，才能为身根本有特征；如触识入与身根分离而存在，身根就等同于虚空等相，而不再是身根相。无身根相就不能形成体内与体外，身根与触尘的中间处怎么建立呢！如没有体内与体外相对独立存在的空间处，触识入又从哪里产生呢！触识入还在哪里建立界限呢！以此缘故，应当悟知，身根与触尘相互对应为缘，于此产生的身根触识入界，三处都各自虚妄安立，空无实性；身根与触尘及触识入界三处，都不是因缘生，也不是自然生。</p><p>　　世间的净土是圣人的肉体，佛性如虚空而妙有。妙有性的存在，妙有身心对法喜的感知。修行人是真修真得，自修自得。当证知身心可贵时，感知无限的法喜与禅悦；方知妙有都由身心产生。如没有身心，就不能感知妙有，也不能证悟妙有。若只知理相说空，则承认妙有而身心无妙有。只有修行人证得妙有，才知妙有实相。如修行人只知手是干活的，却不知也能带来无限喜乐，仍是凡夫。若修行人只知心从空中来，再到空中去，仍是未证知妙有实相。妙有是了见佛性，而一乐自知。佛的妙有是常乐我净，修行人的妙有是心觉佛性而身喜乐充满。身体有触，心有灵识。所以，才有心如虚空，身有定境等。同样是身，天人和人不一样，圣人和凡夫更不一样。</p><p>　　佛接着说，阿难你又已悟知，意根与法尘相互对应为缘，于此产生意根的意识入。此意根的意识入可重复与新生，因是意根产生；所以，以意根为界限。因是法尘产生；所以，又以法尘为界限。若意识入是由意根产生，应自然存在与固定思维相互对应的法尘，才能发挥明辨法尘的意根功用。若没有与之相互对应的法尘，意识入就无法产生；如意根与法尘相互对应的缘分离，意根就没有形象思维的产生，意识入还能发挥什么作用呢？再如觉知功能与思维及明了鉴别作用，是一样还是不一样；如是一样，意根就是意识入；意识入还怎么产生呢！如是不一样，意根应没有觉知功能，只有思维及明了鉴别作用；如没有觉知功能，还怎么产生意识入呢！如有觉知功能，怎么分辨觉知功能与意识入呢！不论一样还是不一样，功能与作用都无法形成意识入，意识入界怎么安立呢！若意识入缘法尘而产生，世间存在的一切法相，都离不开以五尘为载体；即色法尘、声法尘、香法尘、味法尘、触法尘。各法尘相与形象状态，分别明确与五根相互对应，都不受意根直接摄入。觉知功能决定是相依法尘而产生，而现在仔细观察，法尘之法相是什么形象状态？若法尘离开色、声、香、味、触与虚空相，永远不能存在；若超越动与静、通与塞、合与离、生与灭等变化相，永远没有载体。如法尘产生，必与色、声、香、味、触及虚空诸法相互等同产生；如法尘灭失，必与色、声、香、味、触及虚空诸法相互等同灭失。既然没有法尘相互依存的载体，那缘于法尘产生的觉知以什么形象状态意识入呢！如法尘的形象状态不存在，意识入界怎么产生呢！以此缘故，应当悟知，意根与法尘相互对应为缘，于此产生的意根意识入界，三处都各自虚妄安立，空无实性；意根与法尘及意识入界三处，都不是因缘生，也不是自然生。</p><p>　　众生认为意识不分别就是傻人，谁都不愿成为这样的傻人；修行人都求证成为这样的“傻人”，因为能把分别心反过来，不立两边，不著两边。所以，不著善，不著恶；不思善，不思恶；也无中间，空掉中间。众生之所以著善、著恶、著中间，是分别心有执著力，是染心有业力，而不离生死轮回。意识有身根著触，感应存在才有这些界限，没有六根六尘与六入，就没有界限。死人照样有根而功能销失，却什么也不能知。傻人诸根也具足功能，但对事物的反应不一样。精神病人诸根也具足功能，但意识不清，神经混乱。又有多少人看着外表都正常，意识却不能自主，医学称之为“癔病”。世界上的人，都是同样的身体，意识却千差万别。一切善恶让人感到高兴与不高兴，都来源于六根相互影响的作用。意识感受身体舒服与不舒服，不是可以选择的。只能是身体感受到什么，意识就生什么反应。意识的功能是世间法则，通过色声香味触法发挥作用。修行人意根要依戒律，依教奉行又是大戒。戒是修行人的功德标准，也是修行人身行、口说、意想的底线；线上可成就圣人，线下是六道轮回。但受了戒不是声闻，不是菩萨。圣位<a href=\"/remen/daoguo.html\" class=\"keylink\" target=\"_blank\">道果</a>是证得，不是受戒受得。</p><p>　　身也是诸法中的一法，受意识支配，又处于生灭之中。人若长期离开相互对应的法尘，意识就处在一种空白状态。如科学家把一些人分别放到不同静室里，温和而光亮充足；但使用了隔音设备，什么声响也听不到；呼吸的空气是经过过滤的，食物是经过处理加工的。处在一种，想说话无动静，想听无音声，不知时间、空间，不分白天、黑夜的状态。经过一段时间，有的人疯了，有的人狂躁不安，有的呆滞无语等。只有心里能专注于一事的人，心理状态极好，处于静思状态，不执著于尘相，能平安度过。意识非常广泛，虽看不见，摸不着；但有度量，又会超越时空。如人的思维不受山河大地的控制，在室内可以想全世界的事，也可以想外太空的事，还可以想极乐世界的事，什么都可以想。平常人，我不知你想什么，你不知他想什么。只有证得他心通的人，谁动念就能知在想什么，不动念就无法能知。一切善恶内从意根产生，外从尘相产生，中从识入因缘产生。意根所思的善恶因缘传导入第八阿赖耶识里，心识要承受一切。修行人都在转化根尘偶入因缘，将恶言、恶行、恶法，转化为善言、善行、善法。</p><p>　　阿难向佛请法说，佛经常说和合因缘；即世间一切众生及物象，都是依各自的因缘而内外结合，产生种种变化现象；都是依地水火风四大的自然物化而产生与发展。为什么佛将因缘与自然排除舍弃于真心自性之外呢？我现在不知法义在哪里，敬请佛慈悲哀悯，开示我等大众及众生空于中道无偏执、究竟了义无戏论的法义。戏论法为偏执因缘与自然的两边，于相对法中求道，于定空中有染著，法不了义；而不能行于中道，也不能究竟证得菩提道。</p><p>　　佛说，阿难你首先厌离声闻、缘觉的诸小乘法；认为小乘法只是自己了脱生死，不是普度众生的大乘法，而不能成就无上菩提。然后发菩提心，勤行精进，而求证无上菩提。以此缘故，佛现在为你与大众及众生，开示究竟了义出世间的真实义理。</p><p>　　众生被身根所障，被思维所限，不能悟知究竟了义出世间的真实义理。无上菩提，即无上正等正觉，成就佛道；第一义谛，即出世间真实义理。修行人在世间，多依相发菩提心，心又不著诸相。</p><p>　　有人问，我发心成佛，天天想成佛，这是著相吗？这是为成佛而发心，用有求心修行，是著佛相！因为于世间上无佛道可成，下无众生可度。所以，成就佛道是，虽依相发心，但应于无相处行持，证悟佛性真空妙有。</p><p>　　有人问，我好好念佛，就想把身上的妖邪驱赶走，这样行可以吗？这一发心，身上的妖邪想，原来念佛是为了针对我啊，那我先针对你吧，让人出状况不能念佛。要想自己往昔业障深重，才有此因缘；要用报恩心念佛，功德<a href=\"/remen/huixiang.html\" class=\"keylink\" target=\"_blank\">回向</a>法界，妖邪获法益后自然离去，这样行才如法。</p><p>　　有人问，我好好念佛，就是为了将来离开这个世界，这样发心可以吗？这样的厌离心可以，但静坐时把这个心放下、舍弃、空掉；如带着这个心求证菩提，是著相修行，容易召感魔障或身障等。发菩提心的人，默默的去行持就可以了；不要挂在嘴边，不要放在心上。只管耕耘，不问收获。若是善人，多长时间人们也会说那人善；若是恶人，怎么装也装不住。老实人最有智慧，老实本身就是一种智慧；不要认为能说会道是智慧、聪明伶俐是智慧。往往这人表现笨拙时，正是具有大智慧；外现众生像，内怀菩萨行。</p><p>　　佛接着说，阿难你怎么又将世间的戏论、妄想、因缘等，与真心自性混淆在一起，在法理自相缠绕，而辨别不清呢！你虽多闻第一，但如说药理的人，只知药名理相；待真药呈现在眼前时，却不能分清辨别。佛说你这样的人，真是可怜悯者。</p><p>　　众生的心在理相上自我缠绕，给自己设置障碍，给自己出难题；最后还是自度自家身，不是他人度，根本因缘在于此。因为世间的妄想、戏论都是自己的无明生起。所以，最后还得自己去解缚。如在文字上研究药理的人，天天读诵药典；但只闻名相，不知实相，见到真药草时就分辨不清；只有去实践，才能名实相符。空说法理，不能证悟佛法妙义的人，是真可怜悯者，是可悲者。在颠倒妄想之中，还认为自己是最正确的人呢！这个世间的人不好度，一位法师当世能度三五七人，就算很了不起了。成千上万的度人，太难了；除非值佛住世或大菩萨乘愿再来；否则，刚强众生，难调难伏。</p><p>　　有人问，你讲经听众多否？我为一人讲法不少，为一万人讲法不多。因为真得度者不在人数。一生当中，能为得度的人讲法是很高兴的佛事。有很多人听法，不见得有很多人得度，只有听法的人自度。</p><p>　　佛接着说，阿难你仔细听闻，佛为你分别开示；也为当下与未来修行大乘法的人，通达世与出世诸法实相的真实义理。这时，阿难静听妙音法旨。阿难如你所说，地水火风四大和合，而产生种种变化现象。但地水火风四大的本质特征，不因和合而改变；即地大与水火风三大和合时，不失去地大的本质特征；犹如虚空中，可产生各种颜色；但虚空不因各种颜色而改变本质特征，还是虚空。如地大与水火风三大和合时，在和合的同一体中产生变化；但始终处于相辅相成、生灭相续的循环之中；如旋转的火轮，不能停止或息灭；又如水可形成冰，冰还可融成水。</p><p>　　离开实相说法，说法不圆融。以空说空不行，必须通达诸法实相。通过对诸法实相的通达，才明了诸法空性；须有一个过程，不是理论上怎么说的事。如地水火风和合，水中有火没有？火中有水没有？都有。水温升不是火吗？地球表面上不动，实际天天在动，大海的冰天天在融化，山天天有升高、降低。这是世间的诸法变化相，都是客观存在。身行顺应客观存在，心空不染、不著客观存在，心识又无碍于客观存在。不论大乘或小乘都离不开实相，离开实相说小乘与大乘，无有是处。大乘人也必须通达小乘法，在此基础之上，才能通达大乘法。诸位千万要注意，不要认为发菩提心了，是修行大乘法，就轻慢声闻、缘觉。对凡夫都不能轻慢，众生平等。</p><p>　　佛接着说，阿难你观大地的本质特征，粗广凝重可为大地，细小浮动又可为微尘；微尘又可析小七分为邻虚尘，邻虚尘极为微细；达到色尘与虚空的边际体相，但实际体相仍是大地的本质特征，不能是虚空的本质特征。如将此邻虚尘析小为虚空的本质特征，就会让人理解为虚空可生成产出有形的色相物体。佛现在问阿难你，由于地水火风四大和合的缘故，产生出现世间种种变化现象；在诸变化现象中，你再观一粒邻虚尘，能用多大的虚空与邻虚尘和合而成呢？不应将一粒邻虚尘还和合成一粒邻虚尘吧？还有，将此邻虚尘析小为虚空时，能用多少物体色相和合成虚空呢？如颜色于虚空中和合时，只能和合为颜色；而不能和合为虚空。如虚空与虚空和合时，只能和合为虚空；而不能和合为颜色。各种颜色还可析开，无量无尽的虚空怎么与虚空和合呢？</p><p>　　空中有微尘，微尘又不妨碍虚空；自性本空，寂然不动。十法界谁也离不开，佛也存在于十法界中；众生有八万四千种业报，世间的物种循环就有八万四千种和合，无穷无尽，众生召感的业报就是六道轮回。佛说第一义谛，教人发菩提心；说诸法实相，就是说众生要循业发心。平常人只知有身，不知世间还有无形之神，于五行相生相克中，作用于人类。人所行所做，一念一言，都有神灵于冥冥之中记录。世人怎么评价不重要，重要的是无影无形中神灵的记录和自心记录。谤佛、谤法、谤僧业报最大，并不是佛法僧怪罪谁了，是自心识里业报循环，所生出的恶念最大；如气球飞到一定高度，爆炸了，还得趺落下来，是承受力不够而爆炸。众生的业报不是外来的，不是佛菩萨加给的，也不是哪个人加给的，是随自心识中业习而现，怨不着任何人。在魔道的众生，都自认为很好，认为人才不好呢！见修行人真不好，这不吃那不吃就在那坐着。作魔众多好，愿意说什么说什么，愿意作什么作什么，专门整治善人、与善人作对，这就是各道众生有各道的执著心。佛住世时说，一窝蚂蚁，七佛出世还是蚂蚁，因为执著这道而不能舍离。</p><p>　　佛接着说，阿难你本不能觉知法藏世界中，佛性无心色真空，佛性真空又妙有真色；既清净无染，本然无为，不生不灭，不增不减；又周遍虚空，包藏法界，无处不在，众识含灵。随众生业习心识，应现其各自的身知心量；于循环中又随新业产生而显现。世间众生无智，不能悟知自有佛性，还迷惑为因缘生与自然生；其实，都是各自的意识分别心妄生计度。如无证悟，觉知自性；只停留在语言文字的理相上，都没有真实义理。</p><p>　　有的人不能悟知自有佛性，就认为语言文字是真般若。法离言说与文字相，言说与文字只是法的表现形式，不是法的真含内要。读诵佛经不能代替自己修行，只是修行过程中的一部分；更不能代替自己了脱生死，只在修行过程中起加持作用。哪尊佛住世，佛弟子都是依法修行证悟；佛在没说这部经之前，佛弟子中就有修行证得阿罗汉的人。搞清楚应怎么修行才是真的，而不是成天拿着佛经，研究这部佛经怎么说的，那部经怎么说的。告诉诸位，真正的佛法没在文字上，在文字上找，不是愚痴吗！佛说的多清楚，“但有言说，都不实意。”以前有一人来见我，我与他说，“我知道你研究很多佛经，走过大江南北，参访无数名师。我就给你讲释迦牟尼佛怎么修行的，那些弟子都怎么修行的。”他听了感到闻所未闻，就问“你怎么不弘法去呢？”我说，“问题在你那里，不在我这里。”有的人啊，是真可怜悯者，执著于文字言说，而不着实意。研究佛经，也不研究究竟。我读诵佛经时，通过与真修实证一对照，都是千真万确的。一些人对“但有言说，没有实意”不理解；说什么，佛怎么还说法，而且说了<a href=\"/remen/sanzang.html\" class=\"keylink\" target=\"_blank\">三藏</a>十二部呢？其实质是，通过语言文字，让人明法理，知法相，尊教义，行持戒。</p><p>　　佛接着说，阿难你观火的本质特征，没有自我的固体，只能依附于其它物体诸和合因缘才能产生、存在、变化等。如城中没有吃饭之家，想制作饭菜等炊饮时，用取火的器具对着太阳，产生热能于易燃物体上，以求得火种。这种取得火种的方式方法，可称名为火大和合的制作者；如佛与阿难你等一千二百五十名比丘，现在可称名为一个僧团；众比丘虽为一个僧团，但要追求于根本，众比丘各个存有自身；并都有各自的姓氏、姓名、种族等；如舍利弗是净裔族；优楼频螺是龟氏族；阿难是甘蔗族等。若火这样的本质特征是缘于和合而存在，那当取火人手执铜镜于太阳下求得火种时，此火种是从铜镜产生，还是从艾绒产生，还是从太阳产生呢？若从太阳产生，此火种自然能燃烧手中的艾绒；那艾绒经过的林木处，都应被火种点燃而被焚烧。若从铜镜产生，此火种能自然点燃于手中的艾绒，那铜镜怎么不能自燃呢！而在弯曲的手中握执，尚没有热燃之相，怎么没有熔化为铜水呢！若从艾绒产生，何须首先借助于太阳与铜镜的光明相互衔接，然后才产生火种呢！</p><p>　　这个世间事物是杂合相，用一种法理解释不了诸事物；一即一切法，一切法即一；是针对自性而言，不能代替世间诸事物。有人会说，世间一切存在都是由粒子组成，这不是一即一切法，一切法即一吗？那我反问，光明、黑暗、虚空、电波、音声、情感、精神等，组成粒子在哪里呢！在佛教里用一个宗门的法理，解释不了佛教的全部法理；如没有证悟的人，用佛经中的法理，去衡量一果罗汉的真实境界很难。因为一果罗汉以上是圣人，理相与实相尚有差别；所以，怎么能用理相去衡量实相法体呢！果位高于一果罗汉的圣人可以，缘于证悟了理相与实相的真实境界。如一位法师，有弟子来皈依。这位法师观因缘知这位弟子根基很好；但须弟子心悦诚服，去掉我执我见后，才能入室。这位法师正拿着锄头锄草，无意中锄死草里一条蛇。这位弟子见状想，出家人锄草，那么粗的蛇能不见吗！这不是杀生吗！想罢转身走了，一走十二年，又回来拜见这位法师。法师说，“你的心里有个东西，还没去掉啊”。弟子说，“我走到哪里都听人说您有证悟。但是当年我见您把一条蛇锄死了”。法师说：“你见到的是锄死，殊不知我是在帮它，它的劫数已尽，化度它超生了”。弟子说：“这回我知自误了，走了十二年，还得回来跟随您修行啊”。再后来，这位法师选择掌门人时，这位弟子想，我已经修得坐脱立亡的程度，想走随时都可以走，法师一定选我做掌门人。而法师却没有将掌门人的位置传给这位弟子。这位弟子很不理解。法师说，“修行得坐脱立亡是小把戏，你的师兄二十年前就做到了，你才得几天啊。”各宗门中，各有各的门道，区别太大了，不能用一宗法理或我执我见去衡量佛教法体。有人请我认证修证到什么程度，我须在定中观察，不敢加上自己主观上一丝一毫的知见，肉眼观察的不准确。</p><p>　　佛接着说，阿难你再仔细观察，铜镜缘于手执，太阳光明从天空而来，艾绒本自产生于大地，火种从什么方向与位置游历于此处呢？太阳与铜镜相互距离甚远，既没有和，也没有合，火种之光不应没有缘故而自然产生。阿难你仍不能觉知法藏世界中，佛性无火真空，佛性真空又妙有真火；既清净无染，本然无为；又周遍虚空，包藏法界。随众生业习心识，应现其各自的身知心量；于循环中又随新业产生而显现。阿难你应悟知，世界上各处的人，一处执镜取火，一处便能产生火种；遍满法界的人都这样执镜取火，也都能产生火种，不分什么方向与位置。世间众生无智，不能悟知自有佛性，还迷惑为因缘生与自然生；其实，都是各自的意识分别心妄生计度。如无证悟，觉知自性；只停留在语言文字的理相上，都没有真实义理。</p><p>　　物理现象是光聚到一定程度，就产生一定的热量，作用于易燃物体上，产生火种。在神话故事中有千里眼、顺风耳，现在世界上也产生这样的事物，如视频手机等。人在大洋<a href=\"/remen/bian.html\" class=\"keylink\" target=\"_blank\">彼岸</a>能和大洋此岸的人通话，网络视频还能见到图像。随众生心，幻想什么就能产生什么；这是物化作用，这是科学技术。但众生如是顺流背本己，回心转意向佛难。科学是佛法的末端，是法藏世界中最末端的法相。在佛教中的理解是流水出处高，妙在本源处。心性若回归本源处，则与十方诸佛同体；否则，空说法理没用，必须真修实证。修得一分是一分，证得一分是一分；若没修没行，空说一生等于没说，没有往西走半步。</p><p>　　佛接着说，阿难你观水的本质特征，不能固定为一种相体；流动与息静现象，不能恒常不变。如室罗筏城中的黄头仙、圆轮仙、红莲花仙、海水仙等很多大幻术师，利用方术求取太阴真精，来配制迷幻药；这些幻师于每月中十五日，中夜子时，利用五彩石炼成的水精珠，向月求水；即热石遇冷，珠外产生露水。露水是从珠中产生，是虚空自然存在，还是从月而来呢？露水若从月来，月于虚空的远方，能让此珠产生露水；那月光映照的林中树木也应含露吐流；含露吐流何须方术利用水精珠才能产生呢！若林中树木不能含露吐流，就说明露水不是从月而降下。露水若是从珠中产生，珠中应经常含露流水；何须每月中十五日中夜子时呢！露水若是从虚空中产生，虚空的本质特征没有边际，人天都应淹溺于滔滔水中，还怎么能有水族、陆居、空行众生的分别呢！阿难你再仔细观察，月从天空高悬，珠缘于手持，托珠接水之盘是人工制作，露水从什么方向与位置流动或注入于此处呢？月与珠相互距离甚远，既没有和，也没有合，水精珠产生的露水，不应是没有缘故而自然产生。阿难你仍不能觉知法藏世界中，佛性无水真空，佛性真空又妙有真水；既清净无染，本然无为；又周遍虚空，包藏法界。随众生业习心识，应现其各自的身知心量；于循环中又随新业产生而显现。阿难你应悟知，世界上各处的人，一处执珠取水，一处便能产生露水；遍满法界的人都这样执珠取水，也都能产生露水，不分什么方向与位置。世间众生无智，不能悟知自有佛性，还迷惑为因缘生与自然生；其实，都是各自的意识分别心妄生计度。如无证悟，觉知自性；只停留在语言文字的理相上，都没有真实义理。</p><p>　　露水是从哪里来的呢？是空气之中有水份，只是受冷、暖控制。包括地狱，也受冷、热控制。诸法相的存在，用意识不能改变。那些幻师取水于月中，是认为月为太阴。我国的道教之人也认为，月为太阴。为什么外道在子时、午时练功，是利用太阴与太阳，增强能量。于佛法中，若在这两个时辰静坐，不论是太阴还是太阳，都容易伤人的神经；又阳盛与阴盛时，易影响人的情绪稳定。道教所修练的《太阴经》、《太阳经》等，都是有为法。</p><p>　　有人问，龙王的宝珠是作什么用的？珠在龙的生命在、神通在；没有宝珠生命不存，神通销失。而且，在龙宫里起到照明的作用。有人问，法师讲法为了什么？讲法或听法，肯定都不是为了财物；不为财物肯定又有大富贵在里面，用财物无法衡量的大富贵。修行人所证法喜充满，禅悦为食等都是财物无法衡量的大富贵；修行人一旦往生到极乐世界去，离开娑婆世界，更是财物无法衡量的真富贵。同时，是各自的愿力。</p><p>　　佛接着说，阿难你观风的本质特征，没有相体，流动与静止无常。当你经常整理袈裟，走入大众中时，衣角依人行而拂动，会有微风吹拂人的面部。微风是从袈裟角产生，是虚空中自然现象，还是从人面部而来呢？微风若从袈裟角产生，身披袈裟应为披风，能让此袈裟产生飞舞与摇动现象；而此袈裟也应离你身。佛于现在的法会中静坐说法，袈裟垂服于身；你看袈裟中的微风在哪里呢！袈裟中不应有藏微风之处啊！微风若是从虚空中产生，你身披袈裟不动，是什么缘故没有风吹拂呢！虚空的本质特征是恒常不动，而风的本质特征是经常产生；如微风是虚空产生，当虚空没有风产生时，虚空应灭失。风灭失的现象可经常见到，虚空灭失应是什么形状呢！如虚空有生有灭，就不能称名为虚空；如称名为虚空，为什么能产生风呢！微风若从人面部自然产生，他人面部产生的微风，应吹拂你的面部。怎么会在你整理袈裟时，反倒吹拂他人的面部呢！阿难你再仔细观察，整理袈裟的是你，吹拂的面部是他人；而虚空寂静自然，不能参予风的流动。那风产生于什么地方，又是什么力量鼓动来于此处呢！风动与空静，本质特征是截然不同的，既没有和，也没有合；风的本质特征，不应是没有缘故而自然产生。阿难你仍不能觉知法藏世界中，佛性无风真空，佛性真空又妙有真风；既清净无染，本然无为；又周遍虚空，包藏法界。随众生业习心识，应现其各自的身知心量；于循环中又随新业产生而显现。阿难你应悟知，如你一人时，便能产生微风；遍满法界的人都这样略动袈裟，也都能产生微风，不分什么方向与位置。世间众生无智，不能悟知自有佛性，还迷惑为因缘生与自然生；其实，都是各自的意识分别心妄生计度。如无证悟，觉知自性；只停留在语言文字的理相上，都没有真实义理。</p><p>　　物动引起风，风动让人感到有风。如《<a href=\"/fojing/liuzutanjing/yuanwen.html\" class=\"keylink\" target=\"_blank\">六祖坛经</a>》中说，“不是风动、帆动，是仁者的心动”。风吹幡卷是目见，见转识心起波澜。此非三动是一动，风息幡静一真天。仁者心动是悟语，圣音点你凡心转。今人贡高多我慢，谁肯<a href=\"/remen/qianbei.html\" class=\"keylink\" target=\"_blank\">谦卑</a>下问贤。风是物理现象，空气流动产生的，这些自然现象都不依人们主观意识而存在。地水火风是一理，不依人们的主观意志为转移，是法藏世界中产生的物化现象。</p><p>　　有人问，我怎么看不出是如来法性呢？由于人的智慧不足，觉知不到如来法性；只知是自然性。天天在如来法性之中，众生身体都是如来法性中物，佛的愿力所化；菩萨是乘愿力来度脱众生。而众生还不知、不觉、不信，互相吞啖，互造恶业。在如来法性中，造作恶业，还很有理，还得轮回，是真可怜悯者。生在如来法性中，不知报佛恩，不知依法修行，还执著于这个那个，颠倒妄想。不知是怎么颠倒的；既闻知佛法，却还不信，还分别、嫉妒等。意识怎么去计量分别，不因计量分别而改变如来法性的存在。就如风的本质特征，谁也改变不了，只能利用，不能改变。</p><p>　　佛接着说，阿难你观空的本质特征，没有形体，缘于物体形象而显现并发挥作用。如于室罗筏城去河边处，一些刹利族人、净裔族人、商人、农夫、艺人、工人、屠夫、刽子手等居住的地方，建造新居后，须掘井取水；在掘井时，挖深一尺土石，其中就有一尺虚空；挖深一丈土石，其中就有一丈虚空；井中虚空的多少，根据井中挖出土石的多少与深浅而定。井中的虚空，是缘于取出土石而产生的呢？是缘于挖掘工具而存在的呢？还是没有缘故而自然产生的呢？若井中的虚空，是没有缘故而自然产生；为什么没有挖掘取出土石之前，不见有井中无碍的空间，只见大地坚实而不见井中通达呢！若井中的虚空，是缘于土石而产生；而取出土石时，应见虚空进入；如先取出土石，而后没有虚空可进入，虚空还怎么缘于土石而产生呢！若虚空没有出来与进入，就应是虚空与土石一体，没有差异，只有相同；那取出土石时，虚空怎么不随土石一同被取出呢！阿难你再审慎仔细观察，挖掘工具是随人手而运动转换，土石缘于地下部位移动位置；那井中虚空是缘于什么而产生呢！挖掘工具之实与虚空之虚，不能相互作用，既没有和，也没有合，井中虚空不应是没有缘故而自然产生。如井中虚空可见空的本质特征，无处不在，本自寂然，不动不摇，与现前存在的地水火风，可平等称为五大；本质特征都是圆融无碍，都是法藏世界中的组成部分，本来就没有产生与灭失。阿难你心识昏迷，仍不能悟知地水火风四大本来就是法藏世界中的妙有；也应观察到井中虚空，是有出有入，还是没有出、没有入呢！阿难你完全不能悟知法藏世界中，佛性具觉真空，佛性真空又妙有具觉；既清净无染，本然无为；又周遍虚空，包藏法界。随众生业习心识，应现其各自的身知心量；于循环中又随新业产生而显现。如于一处挖掘一井，有一井虚空；于十方世界都这样挖掘一井，也都具足虚空，不分什么方向与位置。世间众生无智，不能悟知自有佛性，还迷惑为因缘生与自然生；其实，都是各自的意识分别心妄生计度。如无证悟，觉知自性；只停留在语言文字的理相上，都没有真实义理。</p><p>　　地水火风是四大，这里加空为五大，四大依空而住。地球有引力，上面有空气，超越大气层能相对脱离地球引力；现在发射的卫星就相对脱离了地球的引力。但是卫星的光能、电能还受地球遥控，能发射出去，也能遥控回收。这是人类掌握了科学，利用了法藏世界中存在的一些妙法。科学是什么？是社会与自然的变化规律；但这是标，而不是本。五大本不生不灭，科学只是发现规律并利用规律，不能创造规律或改变地水火风空的性质。</p><p>　　佛接着说，阿难你统摄六根功用的真心自性，只有觉与迷之分，没有知与不知之别。缘于色身而存在，缘于空间而显现。就如你现在于祗陀林中，早起可见朝阳光明，至晚可见夕阳黄昏；再于安居处至中夜时，有月光则如白昼，无月光则为黑暗。这种色身与虚空、光明与黑暗等现象，是真心自性统摄六根功用的分辨区别。于此色身中统摄六根功用的真心自性，在这种过程中是与光明为同一体相，还是没有与光明为同一体相呢？是与黑暗为同一体相，还是没有与黑暗为同一体相呢？是与虚空为同一体相，还是没有与虚空为同一体相呢？是为同一体相还是不为同一体相，是有区别还是没有区别呢？于此色身中统摄六根功用的真心自性，若与光明、与黑暗、与虚空本为同一体相时，光明与黑暗二种体相应灭亡；因有黑暗时，就没有光明；有光明时，就没有黑暗。若与黑暗为同一体相时，则光明相应灭亡；若与光明为同一体相时，则黑暗体相也应灭亡；同一体相的灭亡，还怎么能见有光明相与黑暗相呢！若光明相与黑暗相分别存在，没有生灭，同一体相还怎么形成呢！于此色身中统摄六根功用的真心自性，若与光明、与黑暗、与虚空没有同一体相时，等于阿难你离<a href=\"/remen/kaiguang.html\" class=\"keylink\" target=\"_blank\">开光</a>明相、黑暗相、虚空相而存在，还怎么分辨区别色身与虚空、光明与黑暗等现象呢！如离开光明相、黑暗相、虚空相，于此色身中统摄六根功用的真心自性，就等于龟毛兔角一样而不能显现；既然离开光明相、黑暗相、虚空相不能显现，体相还怎么是有区别还是没有区别呢？分辨虚空与此色身中统摄六根功用的真心自性，本来都没有边际，还怎么不为同一体相呢！于此色身中统摄六根功用的真心自性，见光明与黑暗时，都没有发生变化，还怎么是有体相区别呢！阿难你再审慎仔细观察，从微细处审慎详察，并审慎观察仔细，光明来源于日月，黑暗来源于没有日月；光明与黑暗同属于虚空，阻塞归属于大地；而于此色身中统摄六根功用的真心自性，来源于哪里呢！既然此色身中统摄六根功用的真心自性之觉，如同虚空一样固定不变，既没有和，也没有合，不应是没有缘故而自然产生。若统摄六根见闻觉知功用的真心自性，具足无处不在，本自寂然，不动不摇，等于虚空，并与地水火风，可平等称为六大；即性大。六大的本质特征都是圆融无碍，都是法藏世界中组成部分，本来就没有产生与灭失。阿难你心性沉沦，仍不能悟知统摄六根见闻觉知功用的真心自性，本来就是法藏世界中的妙有。也应观察统摄六根见闻觉知功用的真心自性，是有生有灭、有同有异，还是没有生与灭、没有同与异呢！阿难你仍不能悟知法藏世界中，佛性具足觉悟智慧，觉悟智慧又是真如佛性；既清净无染，本然无为；又周遍虚空，包藏法界。随众生业习心识，应现其各自的身知心量；于循环中又随新业产生而显现。如一眼根功用显现的真心自性，能周遍法界；则耳根听功用、鼻根嗅功用、舌根尝功用、身根触功用、意根知功用，都与眼根功用显现的妙有功德一样，如同宝玉莹光纯洁而自然；既无处不在，又遍满十方虚空；不分什么方向与位置。世间众生无智，不能悟知自有佛性，还迷惑为因缘生与自然生；其实，都是各自的意识分别心妄生计度。如无证悟，觉知自性；只停留在语言文字的理相上，都没有真实义理。这里的见，是大见精真；即真心自性。人的色身，只是真心自性暂时住的居所。六根功用，只是真心自性随缘显现。但人多不识真相，只迷头认影；有计度差别，皆妄执妄见。</p><p>　　佛接着说，阿难你识的本质特征，没有固定的源头；既有无量劫来的积习影射，又是缘于今世六根对六尘的妄入。你现在普遍观察法会中圣贤的大众，用眼反复观看，用眼全面观看；但映入眼中的影像，如入铜镜中，本身没有区别、分辨、思析之识。你意根的区别、分辨、思析之识，通过眼根的尘相摄入，于法会中能按顺序确立目标，指出这位是文殊师菩萨，那位是富楼那、目犍连、须菩提、舍利弗等，识别的非常清楚。但这种识别是产生于眼见呢？是产生于体相呢？是产生于虚空呢？还是没有缘故，于突然间出现的呢？若这种识别产生于眼见中，眼根中充满无明的黑暗，与体相及虚空有什么关系呢！如此的眼根、黑暗、体相、虚空四种存在都各自安立，等于没有发生作用，本来也没有产生眼见。这种眼见都没有，又怎么能产生识别呢！若这种识别产生于体相中，自然就不是从眼见产生；而体相既不能见有光明，又不能见有黑暗；光明与黑暗都无眼注视，自然没有体相与虚空的区别；体相尚且没有，识别又从哪里发现呢！若这种识别产生于虚空中，虚空既没有体相，又没有眼见；没有眼见就没有对物相的分辨，自然也不能觉知有黑暗与光明、体相与虚空；没有对体相的觉知，识别之缘将会灭失；没有体相之缘，见闻觉知的功用就没有地方安立。虚空处于没有体相、没有见闻觉知功用二个没有之中，虚空等于没有；虚空若有又不能等同于物象所有，能从哪里发现这种识别，又怎么分辨识别呢！若这种识别没有缘故而产生，于突然间出现的；怎么不能于白日光明中，另外识别月的光明呢！阿难你再审慎详察仔细，从微细处详察审慎，见功用是寄托于眼根中，体相推放于眼根前形成境况，可以分辨形状形成有眼见；如不能眼见体相，就形成没有体相的境况；这样的识别之缘，又从哪里产生呢！识别活动是要有眼见清楚的体相才能产生；由此可见，没有缘故，既没有和，也没有合。闻觉知的功用，也如见功用同样法理；不应是没有缘故而自然产生。若这种识别心没有来的源头，应明了统摄六根见闻觉知功用的真心自性，具足清净寂然，没有固定的来源处，与性空、虚空及地水火风，可平等称为七大；即识大。七大的本质特征都是圆融无碍，都是法藏世界中组成部分，本来就没有产生与灭失。阿难你心性粗陋浮躁，仍不能悟知真心自性统摄六根见闻觉知的功用，本来就是法藏世界中的妙有。也应观察真心自性统摄的六根识处，意识的分别心是相同，还是有差异！是空无所有，还是存在呢！还是没有相同与差异呢！还是没有空无与存在呢！阿难你仍不能悟知法藏世界中，佛性具足知见觉智慧真识，知见觉智慧真识又是佛性；既清净无染，本然无为；又周遍虚空，包藏法界。随众生业习心识，应现其各自的身知心量；于循环中又随新业产生而显现。佛性妙觉既清净寂然，又遍满十方法界；既含藏十方虚空，又显现十方虚空，不分什么方向与位置。世间众生无智，不能悟知自有佛性，还迷惑为因缘生与自然生；其实，都是各自的意识分别心妄生计度。如无证悟，觉知自性；只停留在语言文字的理相上，都没有真实义理。</p><p>　　这里的识，可分为意识、七识、心识、性识。识在意识与七识中，表现为见闻觉知，反应为七情六欲；识在心识与性识中，表现为知见觉，反应为随愿力而慈悲喜舍与常乐我净。人的眼体中，本身处于黑暗状态；离开识的功用，等于死人之眼，有眼而无眼见。人与物体的区别，是有识与无识；人与动物的区别，既是形体，又是识大。人的识大是，有识的累加、缘合、抽象逻辑等文化知识、文明知识、自然知识、科学知识等。动物的识大，只是本能。</p><p>　　世间一切都妙，所见所闻，无非是妙。人悟时觉妙；迷时见世间一切都有吸引力，用生命去研究，去追索。如一位傻人，自我感觉活的有滋有味；再如一位聋人或失目人，只是活的质量与正常人有所差异，但仍然可以生活的很幸福。若人生来就失目，不知光明，只是理念上承认白天有日，晚上有月，但无法眼见。无法眼见时，日与月一样存在。如人生来就耳聋，从没听过声音，只能从名义上理解。美妙的歌声不因能听闻与不能听闻，一样存在。世间千奇百怪的事，千奇百怪的人都有。人怎么有不一样的事呢？怎么又有不一样的想法呢？因为业不一样，今生不一样，生生世世都不一样。今生召感人的体相特征一样，下生又各有各的环境，千差万别。我有位亲属，生前爱美，爱穿漂亮衣服，结果死后生为大花蝴蝶，翩翩起舞，非常美丽。我于静坐时一闭眼，大花蝴蝶就来到眼前。我赶紧读诵《<a href=\"/fojing/dizangjing/\" class=\"keylink\" target=\"_blank\">地藏菩萨本愿经</a>》，以此功德回向法界；为其超度后，静坐时眼前的大花蝴蝶不见了。追求美丽的人，要警惕自心莫贪著，以免循业往生。修行人稍有成就时，六亲眷属都来找，亡灵不灭呀！哪儿来的！地府有个神识，忉利天还有个神识。这两个神识，哪个都来找，救救我吧！不救我不行啊！出离不了啊！报身堕落畜生道了，畜生道千差万别多少种啊！地狱就有十八层，算算多少种差别。人可不是这一个下场，人可不是一生一死这么简单。讲到这里，讲几句要知惜福的话，诸位都要珍惜自己的幸福。今天有幸有缘坐到一起，共同读诵受持佛经，要知是往昔所积福报与善缘。过去有三位禅师，在河边闲游，见河边顺流而下一片菜叶。其中一位禅师说，这片菜叶漂走，太可惜了；第二位禅师人说，这片菜叶这么新鲜；第三禅师说，丢菜叶的人一定不知惜福。第一位禅师又说，见菜叶知离这人家不远，可以去化缘；第二位禅师又说，丢掉这么新鲜菜叶的人也不值得让其种<a href=\"/remen/futian.html\" class=\"keylink\" target=\"_blank\">福田</a>；第三位禅师又说，人若不知惜福就是不可度之人，享福就是了福，我们走吧！就在这时，一人匆匆跑来，追这片菜叶，把菜叶捞起带回。三位禅师相互一视说，我们往河上游走，就度脱这个人。别看这人与我们没打招呼，但这人自知惜福。惜福可了不得，福报不在大小多少，知道珍惜一粒米、一片菜叶、一根火柴等。这一个小小的物体是什么？是天物啊！浪费掉了，是暴殄天物。不知惜福的人，是不可度之人。有一片菜叶的缘由，这三位禅师就为之讲法，这人今生就有善报。所以，一时一刻为佛事，一念一言为法事，一啄一饮为僧事。</p><p>　　这时，阿难与大众，承蒙佛开示微细妙义，身心坦荡欣然，获得理义通达，心中再没有挂碍。从法理上都各自悟知，心性遍满十方法界；再用眼观十方虚空，如同见手掌中树叶一样渺小。一切世间存在的物象，都是佛法性妙有智慧与慈悲心所化现。各自心中纯净无染的佛性，与佛法性一样，周遍圆融，含藏十方法界虚空。各自反观父母所生之身，犹如十方虚空中被风吹动的一粒微小浮尘，于无常中存亡不息；又如清澈大海中浮流的一小水泡，起落与生灭没有依皈处。今日才了然自悟，得知本自妙有的真心自性，既常住不坏，又不生不灭。于法会中，合掌礼佛，获得从来未曾有的法益；并以偈赞叹佛功德。具足清净妙德智慧又总持不动道场的<a href=\"/remen/shizun.html\" class=\"keylink\" target=\"_blank\">世尊</a>，诸定法中王是世间稀有；销除我心中无量劫来的颠倒与妄想，如彻悟佛性则不须经历三大阿僧祗劫就可证得法性身。唯愿今世得证佛果而成就法宝之王，还立弘愿度脱如恒河沙一样多的众生；将这样的慈心悲智奉献无量法界，只有如是行愿才称名为报佛恩。跪地伏身恳请佛为作证明以示愿不虚发，为早日践行誓愿而先入此五浊恶世中；五浊恶世中如还有一众生未成就佛道，始终不于此五浊恶世中示现入大涅槃。佛具足大威德、大愿力、大慈悲心，希求佛再开示以审观并破除内思外见二惑；让自性真我早日先证无上正等正觉，于十方世界坐道场以弘法利生。虚空可以坏尽并销亡掉，坚固愿心也不会产生动摇。</p><p>　　有人问，怎么理解报佛恩呢？只有佛、菩萨，才有智慧与愿力度众生。否则，修行人都是自度；自不度者，度不了任何众生。到那时才知报佛恩，也才能报佛恩。平常人也说感佛恩，要报佛恩。怎么报呀？报得了吗！佛无来无去，智慧圆成。真正报佛恩是续佛慧命啊！言真意切总是假，一句弥陀酬师恩。续佛慧命，才是真报佛恩，也是名报佛恩。真报佛恩是从法性上说；名报佛恩是从法相上说。</p><p>　　有人问，什么是浊？浊是心有染著，受业习扰动，不得清净。五浊是劫浊、见浊、烦恼浊、众生浊、命浊。是由色受想行识，耽染贪嗔痴慢疑，五蕴受五毒侵袭生出的五浊。娑婆世界难堪难忍，众生最怕的是命浊，命浊也最难改变。修行人遇烦恼浊就难倒一大群，遇众生浊时一般人也超越不了，浊时是有障碍。</p><p>　　有人问，乘愿再来的菩萨行人礼不礼佛？如有三位禅师，见一尊手拿<a href=\"/remen/nianzhu.html\" class=\"keylink\" target=\"_blank\">念珠</a>的观世音菩萨画像；一位禅师说，“观世音菩萨手拿念珠念谁呢？”另一位禅师说，“这得问观世音菩萨才能知。”第三位禅师说,“念谁不重要，求人不如求己呀！自己去修、去观、去定，就知念谁了。”阿弥陀佛来此世界示现出家人时，也手拿念珠、也礼佛、也依佛，也诵持佛名号，依佛法而行，而不改变佛法。佛不因是佛化现而不礼佛、不依佛。证悟的人说这个化身、那个化身，对于化身本身来讲，礼拜佛像就是依法而行，为众生做榜样。观世音菩萨来此世界示现，遵循戒仪法制；修行人更应依戒依法，老实修行。</p><p>　　有人问，怎样理解修行人的智慧？如一块铁值五元；铁匠铺做马掌，卖了十元；工厂加工成器具，值二百五十元；加工成仪表上的指针，值二千五百元等。同一块铁价值差距怎么那么大，铁块没有发生变化，是人的智慧发生了变化。修行人的智慧，世人无法测知，也很难理解。佛、菩萨的化身无量，智慧无穷无尽。</p><p>　　有人问，如何把握自己的修行？有一个故事，一位哲人问一位将死的人，“让你再活一回，你最想做什么呀？”将死的人说，“如我再活一回，我不求富贵，只求随遇而安。我这一生很富贵，有很多钱，但是我很累；因为，我做人处处严格要求自己，处处给别人做榜样，做事总求全、要面子。所以，我再做人时不求完美，能糊涂时就糊涂，能退一步退一步，不再求全责备。”这是世人对自己一生的总结，对他人有警示作用。现在有的修行人，天天追求名闻利养，修了几年、十几年，一句话就翻脸，一句话就发脾气，这是什么呀？无明颠倒，见思二惑。虽然身心具有佛性，但习气深深植根于八识田中，弃转不了；修行道业不真，不得超越亿劫，怨不得任何人，都是自己放不下执著，所感、所造啊！</p><p>　　有人问，怎样理解菩萨入世呢？修行声闻乘，透出一个淫字，万恶淫为首。修行声闻乘，如破了戒体，证果就无从谈起。所以，声闻人须守戒启修。修行缘觉不但知世间诸苦，也知修行中淫字的厉害，然而远离尘世；观六根、六尘、六入，知众生的苦源。但若不发菩提心，都是随着情节找戏，迷戏忘家了。第一义谛，真实法义是以出世间为究竟；就是佛教化声闻、缘觉要发菩提心，也要发行菩萨道的心。行菩萨道，准备吃苦，吃苦在他人前面，以苦为乐，主动承担一切苦，让他人去成就道业。一切众生都可往生极乐净土，众生的罪业由我代受，这才是发菩提心，行菩萨道。不发菩提心的声闻人，是自了汉。世间太苦了，赶紧逃离吧！度众生是佛、菩萨的事，不是我的事。而观世音菩萨倒驾慈航度众生，成佛了都不现佛身；久行菩萨道。西藏活佛的转世灵童，一转都是二十一世呀，发愿做二十一世人；都是菩萨化身示现出家相，在度脱众生。于声闻、缘觉的境界中有世间与出世间，于佛、菩萨的境界中没有世间与出世间；因菩萨已出世间，又积极入世间，再救度众生也出世间。\t\t\t\t</p></div>"
},{
    "title": "【大佛顶首楞严经卷四】",
    "author": "净慧大师",
    "date": "",
    "html": "<div class=\"B1_text\"><h2>【大佛顶首楞严经卷四】</h2><p>　　这时，富楼那弥多罗尼子礼佛后，向佛请法说，佛具足大威德，开示的第一义谛法义，既善巧方便又详细微妙，甚是难值难闻。佛虽常说我于人中说法第一，但今日闻佛妙音说法，犹如聋人在百步之外听到蚊虫的鸣呐。本来百步之外连蚊虫的影子都不能得见，更何况得闻其鸣呐之音呢！佛宣说妙法，虽详细透彻，让我心中除去无量疑惑；但今日在法义究竟的悟知上，仍有一些未详处，尚未达到没有疑惑的地步。如阿难等果位相同的人，虽证悟心开智慧，悟知自性功德；但欲漏习气尚未除尽。如法会中等同于我证悟漏尽的人，虽诸欲漏尽除；但今日闻佛妙音法理，对重要的转折处尚有些疑虑，劳神而不得其解。如世间一切存在，及人的五蕴、六根、六尘、十二处、十八界等，都是法藏世界中清净佛性转化，本然具足功德；为什么忽然产生山河、大地等诸有为相，有规律的生灭变化，终始循环不息呢？还有地水火风的本质特征，是佛法性圆融，于法界中普遍存在，清澈自然而常住；如大地的本质特征普遍存在，为什么能相容水呢！如水的本质特征普遍存在，火应不能产生；为什么明确水与火二种本质特征，同时遍满虚空，而又不能相互毁灭呢？大地的本质特征是为障碍，虚空的本质特征是虚无通达；为什么大地与虚空二种本质特征，同时遍满虚空，而又不能相互障碍呢？我不能悟知此法义理在哪里，敬请佛发大慈悲心，宣说开示如大瀑流，荡涤心中昏迷的疑云。同时，五体投地，聆听佛无上教诲。</p><p>　　难值难遇，是真实语。一失人身，堕落轮回，真就是百千万劫呀！七佛出世一窝蚂蚁不得超生，多少劫呀！一失人身堕落为畜生或水下众生时，连佛法音声都不能闻听，真是百千万劫难遭遇。今生万幸为一次人，有这种功德，有缘读诵受持一部佛经，真是功德无量。实话实说，为了学佛修道，什么事都放下一点，抽出一点时间，受点苦都值得，比什么都富贵。能解决今生及后世的生死大事，是最值得，也是最大的投资。</p><p>　　富楼那弥多罗尼子五体投地向佛请法，是给当时大会上的弟子做榜样，也是给后世众生做榜样，礼佛、敬佛。人心里如不礼佛、敬佛，把佛当成可有、可无、可大、可小，就已经离佛甚远了。人往心里装什么，未来就有什么，于无影无形中，于一切言行处，就是自己未来世的去处。喜欢什么，最后就被那一道摄去，自我召感。恒顺众生，对周围人都要恒顺。我曾经讲过，不让任何众生因我而生烦恼，要说过失都是我的，这是我读诵受持此经的心得。听闻佛法要与自己对上号，谦下礼佛，恭敬他人，高看穷人。如关云长傲上而怜下，老百姓都拥护他。所以，关云长义流千古。</p><p>　　这时，佛对富楼那弥多罗尼子与诸漏尽无学阿罗汉说，今日，佛普遍为法会宣说殊胜法义中的真义本质与实相；让此法会中一果罗汉以上的声闻人，及一切既未证得人法二空又未发菩提心的阿罗汉等众，都能获得唯一佛乘的中道了义的实相法益；坐于可证悟涅槃之乐的清净道场，真正远离喧嚣杂乱处，住于正法修行地。大众都要仔细听闻，即为宣说。富楼那弥多尼子与大众，恭敬等待佛说殊胜法义妙音，静心受教。</p><p>　　佛说，如你富楼那弥多罗尼子所说，法藏世界本是佛清净法性，为什么忽然产生山河、大地等诸有为相呢？你不是经常听闻佛所宣说的佛性真觉妙有智慧，佛性具足真觉智慧妙有的法义吗！富楼那弥多罗尼子当即回答说，世尊，是这样的，我经常听闻佛说此法义；但尚未了悟实相。佛说，你所说的性觉与智慧，是认为性自然有智慧，才说性觉名称；还是认为性觉不能自然有智慧，须有智慧的名称，才为智慧性觉？富楼那弥多罗尼子说，如这样的不能自然有智慧的性觉，可以称名为性觉，性觉就没有固定的智慧。</p><p>　　佛说，如性觉没有固定的智慧，就没有智慧性觉；有固定的智慧，就不是性觉；没有固定的智慧，就不是智慧；没有智慧，又不是没有智慧；性觉清澈又具足智慧。性觉如必须有智慧的名称，就是虚妄的智慧，虚妄的性觉。性觉不是固定的智慧，又缘于智慧安立性觉；固定的智慧既然虚妄安立，才产生你心识的虚妄功能。在没有相同、没有差别心识中，心识自然形成差异，此差异与彼差异又形成固定的差异。在缘于固定差异的基础上，安立相同；相同与差异又相互作用，发现存在智慧；缘于存在智慧，又安立智慧的没有相同、没有差异。心识中微细的见思如此自相扰乱，转化为业相、转相、现相；又停留于智相、续相、取相、名相、业相、苦相等法相上，而产生心劳；心劳不停，久而发现法尘，心劳与法尘自相混淆成浊；由此产生法尘与心劳混合的诸烦恼。</p><p>　　阿罗汉为四果罗汉，都定力十足，无学无漏。慧来自于定空，定来自于戒修。有人守戒，认为受了戒就得了定，得了慧。实际则不然，须持戒禅行，才能得定空智慧。否则，将一事无成，永远进入不了定空的证悟境界。最大的戒是依教奉行，戒修统一，持戒修行。这个世界上，证得阿罗汉的声闻人易发菩提心；一旦离开人体入色界天时，妙乐无尽，就不容易发菩提心了。性觉妙明；觉是觉悟、觉醒，自性真觉；妙明就是自性真觉妙有无量光明，又具足清净无染的智慧。人的自性具足智慧，是心识觉悟智慧，又无智慧之名相。自性本具足觉，自性上本具足明；不需要再觉什么，也不需要再明什么；所以，密宗上师不说心，只说性。禅宗说心、说性，吾心即佛。在自性上，不须戒修；戒修身心是过程，最终是自性做佛祖。阿罗汉证悟的境界是，性乃心中一金丹；圣心中尚有业习之根，不能证悟自性的具足智慧；圣心中的业习之根，如不能发菩提心而除尽，于定力销失时，又随因缘和合而入循环，又生烦恼。戒修身心破无明暗时，不再受恶业习牵引；而受善功德牵引，超越五浊，不被三界诸法所控制；即无生法忍，法中无我。五十种五蕴魔来自五浊，浊中有魔；阿罗汉只是暂时逃离浊，没有永久彻底摆脱浊；只有发菩提心，才能永远彻底摆脱浊。阿罗汉于自性上有心觉，圣心中有破无明暗之明；但尚无真觉，也无了明。我心做佛祖，是对众生说，是对初行人说；对阿罗汉不能这么说，是性做佛祖。众生心不觉不明，性被无明遮蔽，执著我法。众生的身心无始劫来尽是尘劳，身是轮回之物体，心是轮回之识体。山河大地是众生尘劳之心的显现，有高、有低，不平等。</p><p>　　有人问，对性觉与智慧究竟怎么理解？确实很难理解，类似于 “只可意会，不可言传；”可证悟觉知，不可理悟真知。如一粒玉米，可为种子、玉米苗、玉米穗，乃至无量玉米；又可为食物，转化为纤维、淀粉、脂肪、糖类等。从法相上讲，是形体形态的改变；从法性上讲，是基因与能量的转化。对一粒玉米本身而言，无论是形体形态的改变，还是基因与能量的转化，都是人为的名称；改变与转化的过程，都是虚妄的尘劳。一粒玉米可比喻为性觉，改变与转化可比喻为智慧，不为名称的有无及过程的长短而取销存在，于世间为物质不灭。同时，一粒玉米为无量玉米的过程，也可比喻为戒修身心的成就过程；无量玉米既可为种子，又可为食物。一粒玉米为食物的转化过程，也可比喻为轮回过程；转化过程既可为营养，又可为肥料。为种子时，为菩提种性，续佛慧命；又为食物时，为乘愿再来，悲悯众生。为营养时，为善道乐受，无常生灭；为肥料时，为恶道苦受，自受因果。</p><p>　　佛接着说，心识妄起为世界，心识宁静为虚空，以相对形态存在；虚空为性觉相同，世界为心识差别，以分离形态存在；没有彼心识差别，也没有此性觉相同，以相依形态存在；虽性觉为一合法相而无为，而心识却依各自差异法相而有为。性觉与智慧如虚空而不能了见，又暗藏虚空中而真实存在；于自相矛盾中，相吸相斥，形成摇摆流动；以此缘故，才有风轮（包括宇宙风与地表自然风）固定存在并作用于世界。如人面带微笑，心却暗藏杀机，自相矛盾的心理，必然于气质上，形成各自风格。</p><p>　　佛接着说，缘于虚空中存在之风的摇摆流动，地大的坚固性显露，安立于虚空中为障碍。以相对形态存在的地大，其中含有宝贵作用（地磁力）；于相吸相斥中，如智慧的世界与如性觉的虚空，才相对安立坚固；以此缘故，才有金轮固定存在并作用于国土。如人自相矛盾的心理，必然显露于行为上，形成各自人格。</p><p>　　佛接着说，缘于性觉如金轮的坚固性，智慧如摇摆流动的风力，风相与金相相互摩擦；以此缘故，才有火光产生，为世界存在的变化性。如人遇事时，显现于内的悲喜急燥、呼吸加快等；显现于外的雷厉风行、迟钝缓慢等，形成各自性格。</p><p>　　佛接着说，缘于智慧如磁力可润泽万物，火光向上升腾；以此缘故，才有水轮含十方世界。如人善而良，凶而狠，喜智深，厌浮躁等，形成各自品格。</p><p>　　佛接着说，在火光向上升腾与水气向下降落的相互作用下，形成相对的存在安立；即水大为巨海，干燥为陆地。以此法义的缘故，于大海的深远处，也经常有火光产生；如海底火山爆发等。于陆地也有江河经常流动。水势弱而火势盛则形成高山；所以，山石相击形成火花，岩石融化成浆为水态。土势弱而水势调适则生长草木等；所以，草堆及林木遇火烧而形成灰土，生长的草木遇力挤压而形成汁水。地水火风交织妄动，又依各自法相传递为种；又以相对存在的运动规律形成世界相续的成、住、坏、空。再有，智慧的名相虚妄，不是真实智慧；虚妄的名相性觉与虚妄的名相智慧为过失处。地水火风虽交织妄动，但各自运动规律却相对安立，由此产生智慧的法理不可逾越；以此相对存在的运动规律，耳听不能超出声的范围，眼见不能超出色的范围；以及鼻嗅香、舌尝味、身觉触、意知法的六种功用成就；六种功用可产生妄想；六种功用又可分别为见闻觉知。</p><p>　　世间法就是有为法，修行也是有为法，人在有为法中，再用有为法行，才能证出世间的无为。“一切有为法，如梦幻泡影，如露亦如电，应作如是观”。这个世界就是有为的世界，人身及一切存在，都在“有”字当中。心性出离世间，住于中道，才是行<a href=\"/remen/wuweifa.html\" class=\"keylink\" target=\"_blank\">无为法</a>。为什么拜<a href=\"/sheli/fo/\" class=\"keylink\" target=\"_blank\">佛舍利</a>，能去除人四百亿劫生死重业？佛光普照。人的业力就是暗力，能见到中阴身的人，知中阴身影影绰绰一团黑气。去除心识中的业习，就是去除这些黑气。静坐念佛也吸收佛光的宇宙能量，佛光在这个世界常常轮转照触；但多数人都不知不觉。早晨静坐时，能观到极乐世界阿弥陀佛的红光照触，持续两个时辰。报身卢舍那佛佛国土的白光也照触两个时辰，二六时中于六个方向都有佛光照触。静坐念佛的人，越坐越喜乐，越坐越爱坐，才觉知并接受佛光照触。能接受到佛光照触，可去除心识中的业力。只有去除心识中的业力，心识得以纯净，才能去往生。地球以外有大气层，在磁力的作用下，这个世界与那个世界不能相混，这个星球与那个星球不能相撞；各星球又都在虚空中悬浮，相对稳定，虚空世界依此安立。在这个地球上，空中有水，水中有火，火中有石，石中有空。地球有很多奥妙，科学尚未研究透；如长白山天池水在山顶往下流；陆地水流到大海里，又没见大海水面上涨，地球的水也没见多，循环很奥妙。实际是海里的龙王和陆地的龙王各有分工造化。再如陆地、大海、空中都有百慕大三角，科学也研究不透。为什么飞机、轮船到那就失踪？海中百慕大三角，一是有魔王、修罗等镇守，人虽不能见其形像，但有其神力存在；二那里是循环要地，海水从那进入地壳循环。空中的百慕大三角，是天体循环的茫区。陆地的百慕大三角，是地球与某天体的对应点等。</p><p>　　佛接着说，妄动成习，妄想结业；同感业缘，相互缠缚。缘起缘落，相合相离；分别形成，不同形态。眼见光明，物色发现；光明见知，闻思想成。知见相互分岐时，心中形成憎恨。理想相互一致时，结成友谊，形成大爱；于大爱中又有异性情感爱恋，父精母卵为受生种因，精卵结合后，又有中阴身识想入宫为胎；善恶因缘相遇，异性相吸，同业相引；即子缘其母、女缘其父为相吸，以善合善、以恶合恶、善恶间杂为相引。所以，才有生育繁衍及胎儿发育的不同阶段等。地球上有肉体众生的四种生育繁衍形式；即胎生、卵生、湿生、化生。中阴身选择生的方式，是以其业因择其体果。卵生为情迷妄想而有生；胎生为情迷爱恋而有生；湿生为精卵于体外偶合而有生；化生为离母体随季节转身形而有生。胎情、卵想、湿合、化离四种生因，随阶段生死而相互变换身形，易择体态；一切受生随业，都是追逐业习而有上升与下沉。以此因果循环规律，众生的生命现象相互连接，永续生死，不能中断。</p><p>　　一个家庭成员往往有业习相近处，虽有区别，但也有遗传因素与业缘偶合点；表现为性格相近，习气相投等。虽说夫妻多是“怨家”，但多是有恩、有缘、有同业。女多随相于父族，子多随相于母族；随相比例有多有少，总有随相的地方。不同种族，不同人体，各有因缘。胎卵湿化，形成世间万象。有情来下种，因地果还生；若求离生死，与人结法缘，不与结俗缘。同修共度是法缘，有爱有恨是俗缘；千万不能结俗缘，一结俗缘就受业，有业将来就有轮转；因缘相续，就是六道轮回。执著爱恨名相因缘，死后你我不相代，谁也不能代替谁；此生因缘尽，业缘又新生。</p><p>　　佛接着说，情想与爱恋的共同结合，产生的欲爱不能舍离，深结世间俗缘，乃至父母子孙相续，代代相传，都是贪著欲爱这一生死根本。于贪著欲爱中，得到共同增益，致使贪无止足；而胎生、卵生、湿生、化生的生命体，随生命体身力的强弱，以强凌弱，弱肉强食；都是贪著食杀这一生死根本。为人时杀羊食肉，羊死后又随业习转生为人；人命终后，随业习又转生为羊。这种贪著食杀的众生，除胎生、卵生、湿生、化生四种生育形式而产生的众生外，还有世间若有想、若无想、若有色、若无色、若非想、若非非想，六种生育形式（共十种生育形式）而产生的有形无体或无形有体的众生类；都是死死生生，相杀相食，恶业同时产生；同时产生为，食者为杀业，被食者生嗔业。这样你杀我恨的业业相缠，没有尽期，都是贪著盗取这一生死根本。你欠我命，要偿还我命；你欠我债，要偿还我债；这样相互追讨命债的循环方式，经过百千劫也不能改变；常在生死轮回之中，而不能出离。唯以杀生、偷盗、淫欲三种贪习为生死恶业的根本，有恶因习为先，必有恶果报随后；怨怨相报，相续无尽。</p><p>　　淫是怎么来的？这个世界以欲为本，人从欲中来，人人有贪欲，有贪欲就有六道轮回。人的欲是从<a href=\"/remen/qingai.html\" class=\"keylink\" target=\"_blank\">情爱</a>产生的，有欲爱才有子子孙孙，子孙万代繁衍生息。由于有欲爱、有子孙，要维持生存而有杀食的产生，人食鱼，鱼食虾，虾食维生物，有一个食物链，互相吞啖，吞啖就是食杀。人是六道轮回中，众生的一道。哪尊佛、哪尊菩萨都曾为六道众生。要把众生当作未来佛，未来佛又是在众生当中产生。修行人只要肯修行，对贪嗔痴的业习逆世而行就有希望。如与佛法逆着行，就永远没希望，只有生死相续；恶业极重的人，小心不要将自己的心识整没了；心识没了中断相继，震碎心识后为渐，生为草木，这很可怕。贤劫千佛不度，到宇宙重新合和时，把草木含灵再吸过来化现众生识体。世间众生相食、相杀，是为生存；贪食口福，造下业因。因是果来果是因，百千劫来互吞啖。有的人贪财，贪财是欠业债；业债得还，付出万倍代价。有的人做苦力来还债，有的脱牛变马来还债，还掉贪得不义之财的业债。修行人一日不劳作，一日不得食；再静坐念佛，把当天当世及无量劫的业力化掉。化掉业力是，依佛愿力，化转自心业力；即佛光普照化为修行功德，抵销业债。</p><p>　　佛接着说，杀生、偷盗、淫欲三种贪习，为世界有为法、众生的有为相、业习有为想三种颠倒；众生贪习不断，三种颠倒相续。三种颠倒形成，都是妄执性觉名相与智慧名相，以了知智慧与性觉的名相为究竟；只是从法理中了知智慧，从法义中了知性觉。缘于如此头上安头、脚上安脚的了知，显现法相。随心内产生有为法相妄见，于心外产生山河大地等有为法相妄尘，并形成有规律的运动；即社会规律与自然规律等。缘于如此虚幻不实的妄见妄尘，有规律的运动终而复始，又无终无始而有规律的运动。</p><p>　　杀盗淫是身心行作；所以，戒杀、戒盗、戒淫是根本重戒，不可毁犯；否则，果报不可思议。同时，意根所生谤佛、谤法、谤僧的邪知邪见，一旦成文口说，业报更不可思议；业报重于杀盗淫千万倍。杀盗淫只毁有限众生身命、财物、正行；而谤佛、谤法、谤僧，能毁无量众生慧命；即毁一人慧命等于毁万人的慧命，乃至生生世世无量众生的慧命。末法时代，要是有人谤行菩萨道的人，比谤佛的业报还要重百千倍。因为末法时代，很少人相信佛法，很少人能弘法利生，佛法处在微弱状态；行菩萨道的人以身命财为代价弘扬佛法。千万不要说法师过失，高高兴兴的听，理解多少听多少，理解多少说多少。我不讲任何法师的过失，法师讲法各有因缘，只有证悟不同，知见不同；有的用善法往天道度人；有的用善法往声闻乘度人；有的用善法往佛国土度人等。末法时代的众生业报太重，佛教信众相当有限，信众中有证悟的人又凤毛麟角。所以，行菩萨道难，弘法利生更难。一切罪恶从意根生，意根著法，触境攀缘，比钢铁坚强，难调难伏。不杀生义理太广泛了，不只是不食不杀就是不杀生；用语言文字攻击善行，或用行作毁人菩萨行等，是杀无量生；不能救度众生也等于杀生，因衣食住行中有无量被杀的众生。若是行菩萨道的人，见花美就为贪；有贪，盗心即起。如一位出家人行菩萨道多少世，见花美，多看两眼，花神就出来说，“菩萨行人应该戒贪，怎么在这偷我花呢？”出家人说，“没偷，就多看两眼”。花神说，“多看两眼，吸我的花香就是盗我的花了。”行菩萨道的人，对任何美色多看两眼、一动念都已经犯戒了，犯了根本大戒。修行人起心动念处无非是戒，直心是道场，过去心了不可得，未来心了不可得，现在心当下空掉。为什么空掉？一念爱恋，一念好感，就起了盗心。狭隘的淫不用讲了，广义的淫外延很大，见到美色，不管是画片、图像等等，多看两眼，认为顺眼，修行人淫戒已犯，别说再起淫的念头，离淫方成道。行菩萨道的人怎么持戒，不论什么美食、美色、美言等，都味而不思、视而不见、听而不闻，一念阿弥陀佛圣号，其他念头不起。众生恰在情想方面为根本业，小乘人在狭隘上已证悟，在广义上未证悟。</p><p>　　富楼那弥多罗尼子向佛请法说，若此佛性具足妙有性觉智慧，众生心的三种颠倒，于<a href=\"/remen/foxin.html\" class=\"keylink\" target=\"_blank\">佛心</a>应不增不减，怎么没有状况忽然产生山河大地等诸有为法相呢？佛现在已证得空中存妙有的智慧，了见佛性，怎么又产生山河大地及众生有为业习的欲漏呢？佛说，比如一迷失方向的人，于一村落中，妄认南方为北方；这样的人一再妄认方向，是缘于迷惑而固有呢？还是缘于醒悟所产生的呢？</p><p>　　众生的自性与佛的佛性是一样的，只是众生不修行，心有无明颠倒；只能理悟闻知，不能证悟觉知。因为，佛与众生只有法缘，没有俗情缘、没有无明缘、没有烦恼缘。所以，佛性不增、不减、不垢、不净。只有众生的心有增、有减、有垢、有染。众生就如走路转向了，不分东南西北。但要转过向来就悟了，能明确方向，奔向目的地。开悟的人是修行的开始，不要有圣果想。没开悟的人是迷人，现在多数是迷人。迷和悟根本区别是什么？迷就是贪著杀，盗、淫、妄、酒等。悟就是逆着来，戒杀、戒盗、戒淫、戒妄、戒酒等。又空于中道，心无顺逆缘。证的根本是具有福报，悟的根本是具有智慧；虽同样有个身体，而戒身法体不去执著于迷茫，弃舍贪欲习气，他人爱财、<a href=\"/remen/aiqing.html\" class=\"keylink\" target=\"_blank\">爱情</a>、爱穿、爱美食、爱享用等；自己不爱了，转为爱寂静念佛，爱持戒修行等，不就有证悟的一天吗！修行人若想出离三界火宅，仍然离不开有为法；守戒、持戒是有为法，静坐念佛是有为法，达到无作戒与净念相继就是无为法。</p><p>　　富楼那弥多罗尼子向佛请法说，这样迷失方向的人，不是缘于迷惑而固有，又不是缘于醒悟所产生。是什么缘故呢？因迷惑没有生根，怎么能是缘于迷惑而固有呢！醒悟不能产生迷惑，怎么能是缘于醒悟而固有呢！佛说，这样迷失方向的人，如正处于迷惑时，忽遇一醒悟方向的人，指明方向；富楼那弥多罗尼子你是怎么想的呢？这样的人，于此村落中还会迷失方向吗？富楼那弥多罗尼子回答说，世尊，这样的人不能再迷失方向。佛说，十方诸佛就是这样醒悟方向的人，为众生指明出离三界村落的方向。这样的迷惑不是本来就有，自性毕竟真空，往昔本来没有迷惑；只是入三界村落，不知出离路径，似有迷惑颠倒的觉知；一旦醒悟觉知方向，迷惑立即灭失，醒悟的觉知不再产生迷惑。</p><p>　　人于红尘世界中迷路了，有过来人为其指明方向；迷路人只要肯顺着指引的路走下去，这个人就能出离生死苦海。现在人信仰佛教的少，多数人不信仰佛教。佛住世时有神通，并留有佛经三藏十二部；现在能有多少人相信与读诵呢！还痴迷于红尘世界中的生死轮转呢！不知人身难得，佛法难闻；得人身者如佛手中一把土，失人身者，如地球上的土；听闻佛法，是百千万劫都难值遇，一失人身，万劫不复。于红尘世界中，佛、菩萨了悟不迷，是过来人。声闻、缘觉半悟半迷，是寻路出离的人；即于世间有悟，于出世间有迷。众生是只迷无悟，留恋酒色财气，不肯出离的人。</p><p>　　佛接着说，再如眼有翳疾的人，眼妄见虚空中花；若遇良医治愈翳疾，妄见的虚空中花自然灭失。但尚有愚人，于妄见虚空中花的灭失处，等待花的再生。富楼那弥多罗尼子，你认为这样的人，是愚痴呢？还是有智慧呢？</p><p>　　富楼那弥多罗尼子回答说，虚空中本来就没有花，因眼翳妄见而生，又因眼翳愈无妄见而灭；妄见虚空中花的灭失处，已是颠倒妄想。还妄想强求空花重新出现，这样的人实在是愚痴，还是颠狂的愚痴。对这样颠狂的人，佛怎么还问是愚痴或是智慧呢？</p><p>　　佛说，如同你的理解，佛怎么这样发问呢？是因诸佛妙有性觉智慧本自真空，怎么能重新产生山河大地等有为法相呢？再如金矿石，杂质与真金混合；其真金应纯一无杂质，更不能形成杂质；但真金却如木成灰，不能重新为木；即金矿石中含藏大量杂质，不是纯一真金；若想提纯真金，必须经过冶炼。十方诸佛证菩提、入涅槃，也如冶炼真金一样，必须经过持戒修行，方能证悟。</p><p>　　众生如真金在矿石里，冶炼就是真金，不冶炼就是矿石。真金比喻成佛，冶炼程序比喻持戒，冶炼过程比喻修行。佛法<a href=\"/remen/lvyi.html\" class=\"keylink\" target=\"_blank\">律仪</a>流传于世间，佛肉身不留世间；但佛舍利留世相当于佛真身住于世间，见到佛舍利如同见佛化身。现在科技这么发达，研究不了舍利是怎么形成的，也无法知舍利于身时的喜乐；为什么佛有舍利，修行证果位的人有舍利，其他人怎么都没有呢？多神奇呀！留有神奇住世，证明佛的肉身就是世间净土，圣人的肉身也是世间净土。佛在菩提树下示现成佛至示现涅槃整个过程，是佛行、法行、僧行的过程。</p><p>　　佛接着说，又如同你所问，地水火风的本质特征，怎么能圆融无碍，无处不在呢？疑惑水与火的本质特征，不能相互包容，只能相互毁灭。还有无际虚空与坚实大地的本质特征，都圆融无碍，无处不在；怎么不见共同处与相互包容相呢？比如虚空空体，没有体相；但不拒绝一切有体相者的融入，也不拒绝一切有体相者功用的发挥。怎么是这样呢？在无际虚空中，日光照耀就充满光明，大片云遮不动就充满昏暗，风吹就有空气流动，雨后天晴就出现清宁，气凝于虚空就形成雨雪霜露的浊相，气凝低空于大地相接时就形成雾霾，气凝重形成水时就澄清映光反射等。对这些现象，你是怎么想的呢？这样特殊方式的诸有为法相，是缘于相对而产生，还是缘于虚空而产生呢？如于相对而产生，尚有日光照耀时，就产生光明，十方世界应同时光明；为什么于虚空中可眼见圆圆的太阳呢！如是缘于虚空而产生，虚空应光明自照而常明，为什么于中夜、云雾等时，不能产生光明照耀而昏暗呢！以此应知，这样的光明，不是缘于太阳而产生，又不是缘于虚空而产生；但产生这样的光明，又离不开太阳与虚空。既是地水火风空五大本质特征相互作用的结果，又是法藏世界中妙有神力作用的结果；如同人体，是四大的组合体，又有存在空间。若不能观察内含法性，只是观察外在法相，从根本认知上就已虚妄颠倒，没有办法能认知地水火风空五大的本质特征，犹如期待虚空中花再结出虚空之果一样荒唐。为什么还要问，地水火风空五大的本质特征相互毁灭呢！若透过外在法相，观察内含法性，才能从根本上，觉知真心中存在的唯一妙有性觉智慧；而妙有性觉智慧真心中，始终就不是水火等诸法相。为什么还要问，水火的本质特征相互毁灭呢！真心中妙有性觉智慧就是这样，你妄认虚空产生光明，就有虚空于你心中显现；你妄认地水火风法相时，就有地水火风于你心中显现；如你妄认地水火风空法相时，就有地水火风空于你心中同时同处都能显现；即随业应现，召感其身的时间与空间。为什么于同时同处都能显现呢？如于同一处水中，映现日影，二人共同观水中日影，当二人分别向东向西方向行走时，各有日影相随，一东一西，始终没有准确位置。你不应难为人地说，一日怎么能分别东西各行呢！各人相随一日影，应为双日影，怎么又各自映现一日影呢！如此辗转虚妄认影，没有办法找到虚妄的凭据。你认为尘相色有与虚空相互倾夺，有尘相无虚空，有虚空无尘相；这种现象于法藏世界中，佛的法性随尘相色有与虚空而无处不在。以此缘故，于法藏世界中，风动与睛空、日光与云暗等，都是相互对应的法相；众生迷恋虚妄法相为真实，并于其中产生心中烦恼；与性觉相背离，与尘相相结合；所以，显现物色尘相与众生心劳相，才存在世间有为法相。佛以妙有智慧，不灭不生，合于法藏世界；即包藏法界。而法藏世界中，只有妙有性觉智慧，圆融普照法界。所以，于法藏世界中，一心生万法，万法为一心；一即一切，一切即一；唯一佛法性，法性无碍。于小物体中，可显现大境界，于大境界中，可显现小物体；寸有所长，尺有所短；各有所属，法相无碍。佛的不动道场，于十方法界无所不在；佛法性身，又含藏十方无际虚空。于法理无碍中，在一毛顶端处，可显现大宝法王的佛刹；坐入一微尘里，佛可显现全身，为众生说法。于真心中灭失尘劳法相，一切又合于性觉；所以，觉知佛性真如，即妙有性觉智慧的佛性。</p><p>　　水火不相容，但于各自独立存在中又相互转化。虚空无碍地水火风，地水火风之间，既有对立，又有统一。如人业缘，今天我欺你，明天你辱我，于争斗中还有包容忍让。地水火风可以在一人身上同时显现，因人体是四大和合而形成，人的业感因缘也是和合产生；如酒桌上有猪、羊、牛、鸡、鱼、虾等动物肉，既食肉又喝酒，还说三道四尽是非等；所产生的业感因缘不是单一的，所召感的世界与形体也是纷繁复杂的。心识召感到哪一道时，又有哪一道业报产生。现代人的观念更新了，环境条件变化了，业感因缘复杂了；这些都能产生天人感应，感应天地也发生变化，产生新的物种。众生有什么业，为度脱这类众生，天现什么法相。在法界中，佛可化身无量；十方分身，是根据佛在法界度众生的需要应现。没有佛无量分身，法界这些众生，永无出期。这个地球于坏空时，即现混沌相；于成住时，再现生发相。于世界循环中，佛佛相续；一尊佛出世，有无量众生得度；又有无量众生成就佛道。</p><p>　　佛接着说，于法藏世界中，佛性本自具足功德，所显现的妙有之心，不是五蕴的色、受、想、行、识心，不是五大的空大、地大、水大、风大、火大，不是六根的眼根、耳根、鼻根、舌根、身根、意根，不是六尘的色尘、声尘、香尘、味尘、触尘、法尘，不是六识入界的眼、耳、鼻、舌、身、意识入界，不是十二因缘的有明与无明、有明尽与无明尽、有老与有死、有老尽与有死尽，不是声闻乘的苦谛、集谛、灭谛、道谛，不是佛乘六度的布施、持戒、忍辱、精进、禅定、般若，不是彼岸，不是如来名、应供名、正遍知等十种名，不是大涅槃，不是常、乐、我、净。以上这些不是，都是法性空相，不是法性实相；包括世间与出世间，都是法藏世界中真如佛性的妙有。法性实相不是说知、理知，只有证知、悟知才能了知、究竟知。</p><p>　　在佛的法性中，形成宇宙循环，度尽六道中不同层面的众生。佛的法性之中具足一切，一切又都是空相。就如地球，释迦牟尼佛在这坐道场，佛的法性身包藏宇宙。等<a href=\"/remen/milefo.html\" class=\"keylink\" target=\"_blank\">弥勒佛</a>来时，这个地球将遭遇劫难；劫难时岩浆喷发，生物毁灭。劫难后又现人类等众生及山河大地等。到那时就不是毗卢遮那佛的法性身，而是弥勒佛的法性身；等到贤劫尽的时候，这个世界，三禅天（含三禅天）以下将全部毁掉。就如科学家预测的大爆炸，一切天体重新组合。依佛愿力，重新化现宇宙。苦集灭道是声闻乘，声闻人智慧不足，没有发菩提心，不能续佛慧命。没有经过行菩萨道这一过程的磨炼，功德不具足。菩萨历经千生万生，弘法利生，度脱众生，不辞劳苦，替众生承担业等，积聚了无量无边的功德。声闻乘没有做到这些，功德不圆满，生死烦恼没有彻底根除，只是相对的了结。</p><p>　　持戒、布施、忍辱、精进、禅定、般若，是行菩萨道的人所行六度，于自性没有六度，又具足六度。于自性无戒可守，无戒可犯，又<a href=\"/remen/juzujie.html\" class=\"keylink\" target=\"_blank\">具足戒</a>。于自性无布可施，又具足布施；佛的布施是法布施，让人种福田，改变召感环境。于自性无精进，又具足精进；每部经开始佛都结跏趺坐，处处给众生做榜样。于自性无禅定，又具足禅定。于自性无般若之名，又具足般若之实。众生具足佛性，只是不修行，没有证得佛性真空；于心识中缺少的是功德，多的是业报。真空无尘埃，上无佛道可成，又无众生可度，佛性与宇宙同体。有人说，无佛道可成，还修行什么呀？无佛道可成，去相存真，才是真修行。修行是证得自性清净，恢复本来面目。于自性无苦集灭道，世间又有苦集灭道；性上无色声香味触法，世间又有色声香味触法等。</p><p>　　佛接着说，于法藏世界中，佛性本自具足功德，所显现的妙有之心，于真空中存妙有；妙有是佛愿力随众生业力显现法相，法性又于显现法相中不动。法相显现处，即是五蕴的色、受、想、行、识心，即是五大的空大、地大、水大、风大、火大，即是六根的眼根、耳根、鼻根、舌根、身根、意根，即是六尘的色尘、声尘、香尘、味尘、触尘、法尘，即是六识入界的眼、耳、鼻、舌、身、意识入界，即是十二因缘的有明与无明、有明尽与无明尽、有老与有死、有老尽与有死尽，即是声闻乘的苦谛、集谛、灭谛、道谛，即是佛乘六度的布施、持戒、忍辱、精进、禅定、般若，即是彼岸，即是如来名、应供名、正遍知等十种名，即是大涅槃、即是常、乐、我、净。以上这些即是，都是空性显实相，即是诸法空性中世间实相；包括世间与出世间，都是法藏世界中真如佛性的显现。虽要显现即相，还要远离即相；虽要远离不是（空无），还要显现即是（妙有）；是即相又不是即相，不是即相又是即相。</p><p>　　这里即是，住于中道，又空于中道；不著于两边，又空于两边。两边是相对，相对即有为。执著空无为佛性断灭，执著两边为佛性空无。众生执著空无为不信仰佛法，外道执著两边落入有为法。</p><p>　　佛接着说，为什么世间欲界有情想、色界有法想、无色界有识想的众生，及现已发菩提心、证悟出世间智慧的大阿罗汉与辟支佛，用各自的觉知心，无法预测度量佛无上菩提；用各自世界的语言文字，无法进入了见自性的诸佛知见。如有琴瑟、箜篌、琵琶等乐器，虽可发出美妙音声，但须有艺人的妙手弹奏；若无艺人的妙手弹奏，美妙音声也不能发出。富楼那弥多罗尼子，你等未发菩提心的阿罗汉等与众生，也都是这样；于犹如至宝的性觉真心中，各个功德圆满而不能证知。就如佛按动手指，指印入性海而净心发光；而你等众生，手稍有举动，染心便随手动，尘相与心劳并起。由此尘劳之心，转为不精进修证无上正等正觉的佛道；反而喜乐小乘，心念声闻，得小为足。</p><p>　　这里出世间的声闻、缘觉，是发菩提心的大阿罗汉，是回向菩提心入世的辟支佛；这样的声闻、缘觉，虽证悟出世间智慧，但于佛前有愿力拥护佛法、护持佛法，又入世住世。但未往生净土入菩萨位，智慧有限；住圣位菩萨尚不能了见佛性。艺人的妙手弹奏为证悟佛智，美妙音声为佛智妙用，琴瑟、箜篌、琵琶等乐器为众生本具佛性。声闻人不发菩提心，得小为足；如小农意识的生产者，三亩地一头牛，老婆孩子热坑头，满足现状；而心无大志，不求大富贵。</p><p>　　富楼那弥多罗尼子向佛请法说，我与佛犹如至宝的性觉、圆融无碍的智慧、真空妙有的清净心，没有二样，同样具足功德；而我于往昔遭遇无始劫来颠倒妄想的缠缚，长久沉溺于轮回之中。现在虽证得阿罗汉圣果，但仍未证悟究竟；今日方悟知，只有佛才证得智慧圆融，灭尽一切诸颠倒妄想；独存妙有真如常住。我再大胆地向佛请教，一切众生是什么因缘才有颠倒妄想，自然遮蔽妙有智慧，而久受沉沦漂溺呢？</p><p>　　法师讲法要讲了义法，了义就是究竟；讲法不了义，易误人误己。虽证悟有不同，知见有不同；但法理要相同，法义要相通。不但要讲清法体相，还要讲清法体性；相性相合，理义相融；才能己悟又利人悟。</p><p>　　佛说，富楼那弥多罗尼子，你虽疑心尽除，但余惑迷根尚未尽除。佛再以世间当前的一些事，比喻说明，助你与大众尽除余惑迷根。你岂能不知，于室罗筏城中，有一人名演若达多，于清晨朝起，用铜镜照自己脸面；在镜照中，喜爱欣赏镜中人的头型与脸面，眉清目秀。突然心中生嗔，误怪自己不能眼见自己的头型与脸面。以为镜中人的头型与脸面，是魑妖魅怪，不顾体面而狂乱奔走。你是怎么想的呢？此人是因为什么而无故狂乱奔走呢？</p><p>　　修行人久处极静状态中，经常有这样的境界，有时只知有头而不知有身，有时只知有身而不知有头，有时又身与头全不知有。这是真实存在的真实境界，身空、意空的自然显现。出现这样的境界，既不要恐惧，又不要执著；只是初行微空境界，与真正的定境界还有一段距离。</p><p>　　富楼那弥多罗尼子说，此人是心狂乱，并没有其它的缘故。佛说，虽真心妙有性觉智慧圆融，但因妄心的狂乱，将具足圆融智慧的妙有颠倒。颠倒生心，可称名为妄想；既是妄想，狂乱还有什么因吗！如有什么因，为什么还称名为妄想呢！自心狂乱生出的一切妄想，辗转相互为因；从无始劫来，于迷惑中更加迷惑。虽值佛闻法，仍不能返本还源。这样的迷惑无因，无因迷惑又本无自有；已知迷惑无因，妄想就没有固定的依归处。这样，在没有生妄想时，就没有妄想可灭失。证悟佛性的人，如觉醒时，描述自梦中影事；无论这样的人，心智有多么聪明，有什么强势因缘，也没有办法，将在梦中所见宝物取出或将美境示人。何况余惑迷根没有依归处，又没有固定不变之体，怎么不能尽除呢！再如演若达多，岂有什么真实的因缘，自惊怖无头狂乱呢！若于突然间，狂乱之心立即歇息，演若达多的头不是从身外而得；若狂乱之心没有歇息时，演若达多的头也没有遗失。被妄想迷惑的心性，就是这样；妄因还以什么为存在呢！富楼那弥多罗尼子，你只要心不随从、心不分别，世间相续相、业果相续相、众生相续相；心中没有这三种相续相，就断三种相续之缘，三种相续之因就不能生出。而于你心中，如演若达多的狂乱之心能自歇息，歇息即是菩提心。殊胜清净智慧的真心，于法界中本来就存在，不是得人身才获得，何须隶属于人身劳累，又伤筋动骨的修证呢！对此，可比喻有人于自衣中，系藏如意宝珠而又自不觉知，因生活贫穷而露宿他乡，流浪乞食；虽身实在贫穷，但如意宝珠不曾丢失。于突然间，遇有智慧的人，告知衣中系藏如意宝珠，便随心所欲，得大富贵；才悟知如意宝珠本来自有，不从他处获得。</p><p>　　执著妄想；即自无始劫来，见什么爱什么，爱什么染什么，染什么恋什么，恋什么就没有尽期。如爱酒的人见着酒就走不动道；爱财的人为了钱，可以不择手段。谁也不肯转身往回走，都是顺着贪欲走。无明生烦恼，非一日有，非一劫有，而是无始劫来就有。众生在迷茫中做迷茫的事，一迷再迷，迷迷相传。古代人多不做对不起自己良心的事，作事有<a href=\"/remen/daode.html\" class=\"keylink\" target=\"_blank\">道德</a>底线；而现代有的人，不管用什么手段，钱到己兜就行，自我享乐就行，利用父母生的人体，胡作非为。用一句时尚的话说，是人类整体道德标准错位。很多人认为，信佛是下生的事，为下生作准备；实际即生就有功德，即生就有戒益法益所得；世间净土是圣人的肉体，圣人的肉体已经发生变化，享受到出世间的妙乐，享受到极乐世界人的福报。同样是人，你享受着了吗？还以淫为乐，以酒为乐，可悲可叹。证菩提往生到佛国土的菩萨，观自己往昔轮回，像演戏似的，一幕幕可怕呀！所以，菩萨都发愿回来救度众生，救度一个是一个！人的妄想有三种缘，即根是杀盗淫；业习又跨越无量劫不灭失。三种缘于众生心中，即世界是颠倒的法相，业果是颠倒的缘相，众生身是颠倒的尘相。只有转身后，真心显现，才能觉知一切清净无相。聚集的恶业又非一种，众生有八万四千种烦恼，召感八万四千种果报。杀盗淫是因，召感的三界是果。在三界中又结各种不同的缘，又造不同的因，又结不同的果。人心清净时，就是狂心顿歇；但须修证，方可觉知自性。若离开修证，狂心还是不歇，认贼作子。众生都不想认贼作子，但又天天认贼作子。修行是人生第一大事，有修就有证，没修就没证。修证是心从世间有为法中解脱出来，从业果循环中解脱出来，从六道轮回中解脱出来，无生世间、无受业果、无轮回众生的因与缘。</p><p>　　有人问，对“何须隶属于人身劳累，又伤筋动骨的修证”怎么思解？首先，佛说法的对象是，富楼那弥多罗尼子等阿罗汉，不是凡夫；阿罗汉的殊胜清净智慧真心，已证无漏，于世间无学，可以不须隶属于人身劳累，又伤筋动骨的修证；发菩提心后，于色界的大阿罗汉身直接往生佛净土，入菩萨位。其次，佛说法的法义是，通过人身修证，心性无染后，殊胜清净智慧的真心，于人身可以分离开，相对的独立存在；发菩提心后，直接往生佛净土，入菩萨位。再次，佛说法的法理是，不要执著人身劳累与伤筋动骨的修证；但不是舍弃人身与修证。而是将重点放在心性证悟上，去除分别心，远离诸妄缘，进而达到无修而修、无断而断、无证而证、无道而道的境界。使人身修证与心行证悟相互结合，心行不可偏执。最后，佛说法的广义是，众生不要贪著人身诸有，不要妄执断灭；要知人身心垢秽而又可证清净身心，要知人身无常而又可证真常法身。先从法理悟入，后从法义修持，再从身心证入。因此，这绝不是有人想捧着佛经去寺庙自杀的理由，也不是有人理悟即可成就佛道的依据，更不是用来攻击修行人证悟的利器。</p><p>　　有人问，于世间应如何衡量菩萨行人的境界？佛在《<a href=\"/fojing/huayanjing/\" class=\"keylink\" target=\"_blank\">大方广佛华严经</a>》中说的完全是菩萨境界，善财童子五十三参参的都是化身成就的大菩萨。若能读诵受持，境界与法理自明。对于这个世界行菩萨道人的境界, 一切言行造作千万不要以世间法为标准去评论、衡量。因不知菩萨行人何因、何缘、何愿而来此世间弘法利生，荷载什么佛旨圣命。若衡量有误，业报不可思议！</p><p>　　这时，阿难礼佛后请法说，佛您刚才说的杀盗淫三种业缘之根如能断除，三种相续业相之因就不能生起，如演若达多的狂乱之心能自歇息，歇息即是菩提心。殊胜清净智慧的真心，于法界中本来就存在，不是得人身才获得；这是非常清楚明白的因缘法；为什么佛又说须立即舍弃因缘呢？我是从听闻十二因缘后，致志修行，才证得心智开悟；此法义不仅是我年纪青少，并是有学声闻才这样认为；今日于此法会中的目犍连、舍利弗、须菩提等人也是这样行走过来的；他们都是从外道老梵志处修自然法，听闻佛说十二因缘后，才发心出家修行，证得心智开悟，并证得阿罗汉的无漏果。今日于此法会中，佛说菩提心不是从因缘生出；难道王舍城中的拘舍梨等外道所说的自然法是最高的义理吗！敬请佛以怜悯的大悲，开示我等迷惑与烦闷心。</p><p>　　这里，阿难将因缘法与菩提心混淆在一起，认为菩提心是修行因缘法而证得；若不是从因缘法生出，就应是从自然法生出。实则，身心依因缘法修行，发菩提心，才能证悟觉知本有的菩提心，并不是生出菩提心；本有的菩提心妙有存在。若认为是从自然法生出，在法界中自然存在，就不须修证，理悟即佛，人人是佛，佛将不佛。所以，无缘大慈是缘起，同体大悲是缘生；缘起是大愿大力，缘生是大行大智。否则，虚幻不实，妄起妄生。</p><p>　　佛说，就如演若达多狂心的因缘, 若狂心得以灭除, 再不能称为狂心；静心由自然而生出, 静心的因缘又来自于自然；于此若离开因缘说静心会理屈, 若离开自然说静心会词穷。但演若达多的头既没有失掉，也没有回复。是什么因缘才心生恐怖、疑惑头失而狂乱奔走呢？如头自然没有失掉，是因照镜因缘才狂乱奔走，为什么不自然狂乱奔走，而因照镜因缘才狂乱奔走呢？如头自然没有失掉，生恐怖心与狂乱奔走都是妄想生出；但没有见到妄想发生什么变化，怎么是出自于照镜因缘呢！如恐怖心与狂乱奔走都是自然生出，心本来就应恐怖与狂乱奔走；但没有狂乱奔走之时，狂乱之心又潜伏在哪里呢！如静心是自然生出，头本身自然没有妄想，为什么还狂乱奔走呢！如清醒自知，本来的头正常存在，又心知狂乱奔走是迷惑而不正常，因缘生与自然生就都为戏论。以此缘故，佛说断世间相续相、业果相续相、众生相续相这三种缘，就能生起菩提心。菩提心生起，生与灭的妄心自然灭除。这样的生灭妄心转化为菩提心时，灭与生都至尽头，再不须依功法修行道业。如菩提是自然心生起，这样的自然心就应明白，是自然心生起菩提心；自然的生灭心就要灭失，于生死妄心生起的是菩提心之名；这种分别菩提名之心，也随自然的生灭心而灭失。于世间没有生相与灭相，如太阳东升西落的规律，可称名为自然规律。又如有体相的多种物体，和合形成一体时，可称名为综合作用的结果；若多种物体各自独立存在时，每种物体都存在自然特征；即将调味品与蔬菜加工为一道菜时，形成一道菜的特征；在未加工为一道菜时，生姜有生姜自然特征，白菜有白菜的自然特征。既是自然，又不是自然；既是因缘和合，又不是因缘和合；既远离因缘和合与自然，又远离不是因缘和合与不是自然，空无两边之名相，住于中道无所著，才没有戏论法；方悟真实法义。</p><p>　　世间的因缘是颠倒的因缘，修行人既依因缘，又应舍因缘；依因缘是依法缘、善缘，舍因缘是舍尘缘、情缘。世间的自然是颠倒的自然，修行人既顺其自然，又不能著其自然；顺其自然是顺其法理、法性，不能著其自然是不著其根、尘。菩提心不是因缘生，又不是自然生。狂心是无量劫来的业习，受外界客尘的偶入，引发狂乱；表面看似自然，实则不是自然，是业习因缘和合的妄想。狂心怎样才能歇息下来呢？静坐念佛,都摄六根。都摄六根，就是六贼不放逸；不放逸就是身口意不妄想胡为。狂心顿歇就是，心念不起，明心见性。这时，真心显现，识得自我。狂心顿歇后，修行速度非常快，心不再去攀缘，客尘烦恼彻底放下，念一句佛号，清清楚楚，声声达极乐；否则，念佛就在脑袋里转，脑电波太近了。狂心不歇息的人，修行似身负千斤，寸步难行，或是想进实退。所以，修行人一定要证得开悟，争取早日将这黑漆桶打破。世间的各种杂合，各有各的物性，各有各的主宰，又可混为一体，各有各的作用，放到一起又产生新的作用。如煤炭有煤炭的作用，木头有木头的作用，二者是两回事；但放到一起又能共同燃烧。这个世界是佛的愿力与众生的业力和合，用佛的愿力度众生，法界就示现自然；通过转化众生的业力实现佛的愿力，依愿力度脱业力众生。自然与非自然，都是佛力化现；因缘与非因缘，都是众生业习召感。如不和合时，佛的功德力还是功德力，众生的业力还是业力。</p><p>　　有人问，练瑜珈是不是修行？瑜珈术是佛住世时弥勒菩萨传下的法；现在的瑜珈没有口诀，只是练外在的形式，像体操似的，只锻炼身体。要结合口诀练瑜珈，才为修行。有人问，何为明心？何为见性？明心为去妄存真，舍诸妄想、妄相、妄入。见性为证悟正等正觉，净见、了见、究竟见。明心见性为见自性佛，佛与众生一体同悲。有人问，佛为什么说法？佛为一大因缘故出于世间；一是佛愿力；二是众生缘。愿力为因地行菩萨道时，所发誓愿；愿力弘深，才显现十方法界。佛缘为示现世间，开示悟入有缘众生；众生缘为法缘，具有无量善根方得救度。有人问，如何观心？身定觉心，心禅观身；心定觉性，性妙生心。有人问，缘是什么？善缘为功德，恶缘为业习；清者为心清，浊者为心浊。佛接着说，虽理悟法义，但距离证入菩提佛果与证入常乐我净的涅槃境界，还很遥远。阿难你若不经历无量劫的辛勤修证，虽能记忆诵持十方诸佛所说十二部经，理悟清净妙有法理，如恒河沙劫仍不能证入佛境，只有益于你语言文字的戏论而已。你虽谈说因缘与自然，于法理上很清楚、明确、了知，于人间可称你为多闻第一；但你历劫执著多闻博论的习气，至今日不能远离，还遭遇摩登伽女的淫难而不能避免。如你能证入佛境，定力十足，还须佛说楞严神咒，才使摩登伽女的淫心立即歇息吗！现在的摩登伽女，在<a href=\"/fozhou/lengyanzhou/quanwen.html\" class=\"keylink\" target=\"_blank\">楞严咒</a>神力加持下，已速超一果罗汉、二果罗汉，证得三果罗汉。身心爱河干枯，见美色已不生淫念，才能一断证三果罗汉，才能心净不与你纠缠。所以，阿难你虽历劫记忆诵持，佛说秘理密义又含微妙庄严的法藏；秘理为佛口传心授法理后，口不能言说；密义为佛口传心授的法义，心无法猜测。秘理密义，又有微妙不可思议的、庄严不可侵犯的神力。但仍不如一日修证无漏道业，断除妄想、分别、颠倒、执著等习气，才能远离世间情爱与憎恨带来的二种痛苦。如摩登伽女，往昔宿业中有淫女的习气；今日仗楞严咒神力，才销其宿业中爱欲的习气；现在法名为性<a href=\"/remen/biqiuni.html\" class=\"keylink\" target=\"_blank\">比丘尼</a>。性比丘尼与罗睺罗的母亲耶输陀罗，共同悟知宿世业习因缘，皆知历世贪著情爱因缘为苦；现在受佛法熏染，启修无漏善业；以此缘故，性比丘尼证得出离情爱的缠缚，耶输陀罗蒙佛授记为未来佛。而你现在为什么自欺，还留恋于见闻法理与分别法义呢！</p><p>　　从初发心修行到成佛需要三大阿僧祇劫，太遥远了。人只觉得时间漫长，其不知人生短暂。人的神识离开肉体以后，时间非常漫长；如一饿鬼一劫不得出离，多可怕。天人在快乐之中又不觉得时间长；地狱里的一日一夜是地球的二千七百年，因为受苦，又觉得时间更加漫长。末法时代的人，只知念佛号和读诵经典，不知修行证悟。其实，二者是统一的，不可分割；否则，只种善根，往生善道，不证圣道。昨夜定中我见赤脚的摩登伽女，赞叹我讲的此经。摩登伽女是化身菩萨，示现淫女，淫心顿歇，便示现证三果罗汉。贤劫千佛出世都有化身菩萨示现淫女，菩萨行人妙义难测，不是世人所知。“外现众生像，内怀菩萨行。身为末法人，心行正法事”。怎么修无漏业？就一句，都摄六根，净念相继。静坐一须臾，胜造七宝塔。这一须臾修无漏业，功德就不能漏失。</p><p>　　阿难与大众，闻佛开示教诲，心中疑惑销除，心悟世与出世诸法实相，自觉身轻意爽安稳，获得前所未有的法益。阿难又伤悲流泪，礼佛后长跪请法说，佛是无上大慈大悲，是清净法宝之王，能用善巧方便的方法，开示我的迷惑心；又能用种种比喻因缘，方便提示与赞赏，引导一切沉沦欲爱的众生，出离苦海。我现在虽承蒙佛妙音说法，悟知法藏世界中，妙有性觉智慧真心普遍十方法界（佛法性身），含藏佛十方国土（佛化身）, 培育清净七宝严饰的妙觉王刹(佛报身)。佛又呵斥我多闻博论没有功德, 修行无漏善业不得力。我现在犹如漂泊旅途中人，突然承蒙天王恩遇，赐予华丽明亮的大屋；我虽获得广大豪宅，但不知可入之门在哪里。敬请佛不舍弃我等声闻，以大悲心开示法会中诸愚昧无智的人，捐弃小乘的有余涅槃，毕竟获得佛无余涅槃的从初始修至证菩提的心行之路。让诸有学声闻，悟知从哪里都摄六根，降伏妄心，销除往昔的攀缘心，得入总持之门，入佛正知正见。阿难请法后，五体投地；法会大众也一心站立，静候佛慈悲妙音法旨。</p><p>　　地狱的人可不可恶？可恶！可不可度？可度！地狱苦受本身就是度，受苦了苦；否则，恶业无法灭除。什么人都可度，只要有肉身在就可度；离开肉身难度，度与不度在于大因缘。于佛说大乘经中，十方诸佛呵斥声闻、缘觉二乘，旨在劝发菩提心，行菩萨道，证悟出世间智慧。而于小乘经中，佛说声闻、缘觉为究竟，是方便说；否则，无一教三乘。对凡夫而言，声闻、缘觉为皈依处；十方诸佛、菩萨都是从声闻、缘觉中发菩提心，而成就佛道。多闻博论，空说佛法，不能入佛知见。若欲证悟，还得都摄六根修行，除掉习气。一位居士七十多岁开始修行，不识字也不读诵经典，专心静坐念佛十年，满头白发多变为黑发，身体开始转化。</p><p>　　有人问，修行不须读佛经吗？读诵可以，但那是修证以外的事。因为累劫多闻，不如一日修无漏业。我师父对我说过，佛经可以先不读诵，三藏十二部也读诵不过来，等把佛经研究明白了，人也老了；趁着年轻，就精进修行。修行有证悟后，再读诵经典，一读立即明白法理实义。我师父有智慧，我就照师父说的行作，果然是走捷径。我每读此经，功德都回向给我的师父，感谢师恩。没有师父指引修行路径，就没有我今天能讲法。有证悟后，才能抛弃文字相，不被文字所转。</p><p>　　有人问，你为什么讲经？我是被请法心切的弟子逼上讲坛；又因众生习气重，功德不够，邪知邪见太多；所以，共同提高，培育功德，增长正知正见，为修行扫清障碍，坚定修行信心。在座的有一位居士文化程度不高，五十多岁，三年前见第一面时，我就告诉他静坐念一句“南无阿弥陀佛”。静坐念佛三年后，再与我探讨法理；否则，不必再见我。到今年正好静坐念佛三年，才有今天再相见的缘份，要不然，缘早就没了。</p><p>　　有人问，怎么才能入佛的知见呢？佛知见是无上正知、正见、正行。不发菩提心，声闻乘不得究竟；要舍弃声闻乘，要发菩提心，要勤修六度，要行菩萨道，证出世间智慧，才能入佛知见。行菩萨道的人，正反两方面都示现；如地府中十殿阎君，都是菩萨示现。我于定中去过地狱，阴森恐怖，铁蛇、铁狗不讲情面，狱卒拿着钢叉、飞刀、飞枪等刑具，剖割罪识之体，不可言说。地狱惩恶是销掉众生业报，再给恶人行善的机会。</p><p>　　这时，佛哀悯法会中初发菩提心的缘觉、声闻人，又为当下与未来众生发菩提心，特别是为佛灭度后末法时代的众生发菩提心，开示无上佛乘的妙有修行路径。阿难与大众，你们已决定发菩提心，于勤修佛妙法的楞严正定中，要不知疲倦；还要先明白觉知初发菩提心的二种决定义。什么是初发菩提心的二种决定义呢？第一种义是，你们如捐除舍弃声闻乘，修行菩萨乘，入佛知见，应审慎观察因地初发菩提心的因缘与证入菩萨境界时，有什么相同与差别。如于因地以意识的生灭心为初发菩提心的因缘，并以此欲求佛乘的不生不灭，是没有可能的。依此法义的缘故，你应用智慧观察于器世间，一切造作都是有为法，都会随从无常变化而灭失。你再用智慧观察于器世间的有为法，有什么不能变坏灭失的呢？你始终听闻不到坏掉虚空的事。什么缘故呢？虚空没有作为。所以，虚空始终没有坏掉灭失。于你身中，坚硬的骨肉为地大，润湿的血津为水大，暖热的体温为火大，动摇的呼吸为风大。由此四大相互结合，形成身相的六根；又分别注入七识、八识，与六根结合在一起；于眼为视，于耳为闻，于鼻为嗅，于舌为尝，于身为觉，于意为察；并从始至终不相分离。由根尘偶合与色受想行识对应形成五种重叠，即五种浑浊。什么为浑浊呢？如同清净水，本来清洁无染；而尘土灰沙之类物体，本质特征是滞留障碍；净水与土尘二种物体的本质特征是互不相同。有人将土尘投入净水之中，土尘失去滞留障碍的本质特征，净水失去清洁无染的本质特征。净水与土尘二种物体都失去安静的面貌，呈现混合不清为浑浊；你身心中的五浊也是这样。你用眼见虚空，虚空无际；什么是虚空之虚，什么是眼见之见，二者无相，很难区分；虚空之虚存在而没有体相，眼见之见存在而没有觉知；眼见与虚空交织在一起，形成虚妄的时间分段，于五蕴中为色蕴区宇。这是第一重浑浊，为劫浊。身是四大和合为体，有见闻觉知的功用；见闻觉知的功用，又被各器官隔离开而分别存在，又对液体、体温、呼吸、骨肉的变化都能觉知。觉与知交织在一起，形成虚妄的身心感受，于五蕴中为受蕴区宇。这是第二重浑浊，为见浊。你心中记忆、识别、读诵、习练的功用，逐渐形成各自独立存在的知见，并于身心中容纳与展现色、声、香、味、触、法六尘相；这样的知与见，离开尘相无法形成，离开觉知无法存在。知与见交织在一起，形成虚妄的意识印象，于五蕴中为想蕴区宇。这是第三重浑浊，为烦恼浊。你心中的念头从早至晚，前生后灭，生灭不息；想尽一切办法，让美好与身体永存世间。但业力运转每日不停，心识随业习流转六趣国土。想与业交织在一起，形成虚妄的七识不由自主，于五蕴中为行蕴区宇。这是第四重浑浊，为众生浊。你的见闻觉知功用，都是身心感受，于心识感受上本来没有差异；但由尘相的不同隔离，六根功用的不能超越，心识感受没有形态又产生差异；根尘不同的感受，于心识中相同相知，于功用上相背相异。相同与相异，于心识感受上失去固定标准。受与识交织在一起，形成虚妄的八识业习种子，于五蕴中为识蕴区宇。这是第五重浑浊，为命浊。</p><p>　　人身是有生有灭的，都生灭于器世间。室外的山林、树木都是器世间的物体，器世间的物体在法则当中也是生灭的。人可以利用器世间法则，在有人身时去修行，修不坏之性我，增长出世间的智慧。出世间智慧在哪里？在静坐禅行的证悟中，离开静坐禅行找出世间智慧，一点都不会有。虚空永远不会变化，器世间的一切存在都可以变化。化工厂上空排出的有毒气体，污染虚空却无法破坏虚空；排出的气体经风一吹又销失了，虚空不坏。人的身体可以灭失，人的性我不灭也不失。人身有四大，皮肉是地，体液是水，体温是火，呼吸是风。四大是经常离散的，又是经常聚合的。行菩萨道的人要先破五浊，不受五浊才能行菩萨道。行菩萨道的人知道不被五浊所染，不负因果，无戒可守，也无戒可犯。五浊怎么回事呢？就像把土洒在清水里，水就浊了；土就是无明烦恼，人身之中就有五种浑浊。劫浊于不同时间阶段，地球劫难主要有火山岩浆喷发地震等，人间劫难有刀兵水火风灾等，人身体重病和人畜共患的瘟疫等；表现为破坏人身体健康带来的烦恼。见浊于根尘觉知中，眼前这些色彩斑斓，五颜六色，让人迷恋色相，生邪知邪见，表现为破坏人精神健康带来的烦恼。见浊破坏人的正念、正觉，使颠倒心更加执著，恶业加重，业习越积越深。所以，末法时代，法没末是众生心末，入不了佛知见；喜欢乖巧，赞叹权贵，天天为名闻利养去争，没有人争做老实的修行人。烦恼浊于执著习气中，主要是五蕴炽盛，牵引着人从名到利，从憎到爱，从种种犯罪到物欲横流的享乐，为了财富去抢、去偷、去杀、去贪、去颠倒黑白等。前念生，后念灭，念念贪嗔痴慢疑，念念召感到烦恼，被外缘、外力牵着走，不能清静。烦恼浊召感的恶果不可思议，不是浊可怕，而是召感到六道轮回里不停歇，念念注入八识田，业习种子根深蒂固可怕。众生浊于七识的作用下，身心不由自主的行作，念头生灭不停的变化，心识又随业习生于六趣众生。诸位知道《<a href=\"/ctwh/gdxs/smzg/fsyy.html\" class=\"keylink\" target=\"_blank\">封神演义</a>》中的商纣王，到女娲宫烧香，见到女娲娘娘漂亮就起邪念，若娶这样美女进后宫做妃子多好呀。又提诗留句，邪念惹怒女娲娘娘，天神要惩罚这位无道昏君，便派九尾狐狸精破坏商纣天下，最后亡国，多少人头落地。那是一场战争，一个朝廷的毁灭，民不聊生，生灵涂炭，这个七识我爱可怕不可怕。我贪财物也是业报，骗来、抢来、偷来、贪来的财物，一受地狱报，二受畜生报；因缘和合时，要返本还息。如有的人不孝，打骂父母，这种人死后生为猫头鹰，猫头鹰人见人烦，孵出的小猫头鹰第一件事就是吃掉母猫头鹰。众生浊是业习循环，召感不同的众生，不同的种类。受持戒律的人知道起心动念处，生一邪念，就是犯戒。修行人戒住身口不犯；用念佛占据思维，戒住意不犯；都摄六根，才能免掉五浊；否则，可怕至极。命浊于八识业习轮转中，是劫浊、见浊、烦恼浊、众生浊共同作用的结果；有人命运好，得大富贵，万事顺达；是往昔做过善事，无量劫积福而来；是孝敬父母，供养过佛、菩萨、神、天，助人为乐，今生才得大福报。但命浊不都是这样，命运千差万别，五岁的小男孩得肺炎死亡，一些人三、四十岁病死或意外死亡，现在的医学非常发达却救不活命；还有的人生来贫穷、残疾等，都是无量劫来业力召感的命浊。召感五浊和去除五浊，都在人的一念之间；要用正知、正见、正行，把邪知、邪见、邪行破除掉，不去攻击他人，不去侮辱他人，不去算计他人，守住自己一念清净。无形的知见行，能召感有形的果报。因为用思维想象追求生活的美好，与法界清净美好相背离。世间人衡量人生的标准错位，不知宇宙人生的真相。动物的五浊更可怕，动物的地狱在人的口里；如把肉剁成馅，不是千刀万剐吗；有的活着下汤锅，活着被扒皮等。这个世界是五浊恶世，五浊困扰着三界；所以，娑婆世界难堪难忍。持戒修行的人天天与自己的业习斗，与自己的生死斗，与自己的命运斗，争取时间，早日解脱于五浊的困扰。</p><p>　　佛接着说，阿难你现在还想用六根见闻觉知的功用，远距离的去契合佛常乐我净的境界吗！你应首先选择什么是死生根本，进而修行销除；再皈依不生不灭的圆融清净的自性，而成就道业。即以虚妄的死生根本，回归于圆融清净的自性，降伏妄想，恢复自性本觉，返本归真于智慧觉照没有生灭的自性；这就是因地初发菩提心的因缘。然后修行证悟，按次第圆成道果。如同要澄清浊水，先将浊水贮于洁净不动的器具内，长时间静止不动，土尘自然沉淀，清净的水出现于眼前。这样的澄浊还清；即去妄归真，可比喻为初伏客尘烦恼。再去除浊水中的污泥，使清水再得以纯净；可比喻为永远断除，死生根本；即根本无明。染心得以纯净，净心智慧生起；根尘识入一切变化显现，不再生烦恼心；一切心行，都契合于常乐我净的清净妙德。</p><p>　　人的自性与佛性无二无别，但心中功德不同，不能破除无明烦恼。成就佛道是逐渐修行，次第证得果位；哪尊菩萨都是靠修证积聚功德，降服妄心，从证一果罗汉次第圆成道业。证得果位的人，心中清净的境界，平常人理解不了；不是人有果位感，而是身有定力，心有智慧，身心具足圣果妙德。静坐就是过滤心中的尘沙，让思维静下来。就如一见面，相互问静坐的怎么样啊？有人说，这几天心里清净多了，头也不那么昏沉了。怎么回事？浊水储于静器，初伏客尘，身心刚刚有点感觉。有人闭关四年，问他身心有什么变化吗？回答是没有。一听就不谈了，光修学佛理了。清净妙德，不是说来的，是修证来的。修行人定力十足，才能不为烦恼所转；如不持戒修行，顺着世间去行作，易！但越行作离道越远。如想持戒修行，难！难易境界不一样，差在心性功德上。静坐禅行功夫坐到了，定境现前，智慧生起，自然转境。</p><p>　　佛接着说，第二种义是，阿难你与诸声闻、缘觉欲求无上佛道，必须发菩提心；于行菩萨道中，生起广大勇猛心，决定捐弃小乘法中一切有为相。应审慎详观烦恼的根本在哪里，从无始劫来，发生业习并润泽生死轮回，究竟是怎么造作、怎么苦受的。你发菩提心，行菩萨道；如不能审慎详观烦恼的根本在哪里，就不能悟知虚妄的根尘在哪里颠倒；如不能悟知颠倒在哪里，还怎么降伏烦恼心而圆成佛果呢！你再观察世间解开绳结之人，如不知绳结在哪里，还怎么能知解结呢！谁也没有听闻过，虚空被你毁坏裂开；是什么缘故呢？是虚空没有形像，也没有绳结可结。而你显现于面前的眼耳鼻舌身及意识心，是六贼的媒介，协助贼人自劫家宝；即漏失功德。由此缘故，一切众生从无始劫来，于有情世界相互缠绕绑缚，相互追讨业债，谁也不放过谁。于器世间不能离开，以有为法不能超越三界。</p><p>　　无始劫来，由身口意造作的种种善业恶业，谁做谁受，证悟的人知你我谁是谁，往来不相代。谁修行善业，谁成就罗汉、辟支佛、菩萨，最后成佛，谁受妙乐！谁造作恶业，谁堕地狱、畜生、饿鬼，谁有苦受！众生烦恼的根本是无明颠倒，由此造作的业力召感有形的身体，眼耳鼻舌身意，这六根都有欲求，就有六尘、六识入相对应。既有无量劫来的习气所染，又有现世所造。众生知与不知，天天都在有为法之中，受对立统一规律的支配。无为是在有为之中产生的，静坐是有为法，但是能产生无为的智慧。在世间做事，一切都在有为之中，做完了就放下，用清净念力销除执著力。如无一众生可度，无一法可说，上无佛道可成，下无众生可度，都是在世间有为法中产生的无为境界，不是出世间的无为境界。无为是证来的境界，而不是用嘴空说。发菩提心不是嘴说的，是身心证得的一种境界。遇到事时，菩萨怎么对待，我就怎么对待，在心行上体现菩提心。不用嘴说如何发菩提心，天天一切言行和佛、法、僧事相吻合，和行菩萨道相吻合，是真发菩提心。众生的烦恼在有为的世界与有为法之中，人人都有根尘欲望，谁都想吃好、穿好、住好、闻好、想好等；但事实上，都是无明颠倒生起的业习。定中产生空的境界，心不起念，处处是般若、处处是禅。这时，才将无明颠倒空掉，正心生起；颠倒很可怕！《济公传》中说，“众生是颠颠倒倒、倒倒颠颠”。行菩萨道的人要逆世而行，逆世不是厌世，不是顺世。众生恋世多激情，轮转生死浩浮盈。如是顺流背本己，无明神识六道中。顺世而走，没有出期。学佛入世逆世行，逆世离世非厌世。不是厌世，是世界观不一样，是对待事物的心境不一样。见着事物生烦恼、生爱慕之心，是顺世。世间一切事物都是无常的，不可贪恋，不可执著，是逆世。识破无常因缘情，世间的有为法都是由因缘产生的，识破因缘又不弃舍因缘，随顺因缘又不被因缘所转，才能自度度人。首先是自度，然后才能度人。人若顺世而行，那就一无是处。观察世间因缘，解铃还须系铃人。结结之间，只有系的人能够解开；结在眼耳鼻舌身意。人天天为自己忙碌，怎么是六贼自劫家财呢？明明是人，却不做人事，昧着良心说话，昧着良心做事，把自家本来具足的功德往外丢；又随业习轮回生死，造作无量恶业，这不是自劫家财吗！修行人在寻自性的观世音，把自性中的观世音菩萨请出来，那才是积聚功德。把自性寻找出来，和观世音菩萨无二无别，那才是自增家财。有位七十九岁老居士天天四点半起来静坐八小时以上，她说“我坐的身体没了，脑袋里面空了。”跟佛经上说的一样，是修行人必然产生的境界过程。为度众生，出家一回，天天上殿；可度走自己没有？通往极乐的船票到手了吗？不一定！还是六贼帮助打理，自劫家财，无量劫来天天如此。《地藏菩萨本愿经》上说，南阎浮提众生起心动念无非是业，无非是罪。信佛与修行明明是好事，有些人却认为不好，吃不到众生的肉就馋，为吃到就杀。花钱买的肉不也是生命吗？鱼虾不是鲜活的生命吗？为满足口福，夺去众生生命，是不是贪口福。这鲜活的生命多可贵，佛教人慈悲不杀。造业都给机会去忏悔，一些国家已经取销死刑，都是因为生命太宝贵了！众生无始劫来，互相缠缚着；如一个螃蟹容易从渔民的背篓爬出去，两个螃蟹就不容易，相互争扯。想静坐念佛，有人来闲谈，把时间谈掉了，是缠缚；一人信佛，周围人不让信，是缠缚。处处在在，时时刻刻，都在缠缚着。人总想用自己有为的思想，有为的行作，有为的因缘改变他人，相互缠缚在这个有为世界里。有为的业报，神识不能超越器世间的吸引力，出不去三界。五行相克，身体有内五行，器世间有外五行；超越三界，须还内五行于器世间，不受有为法制约。</p><p>　　佛接着说，什么是众生世界呢？世为时间变化流动，界为方向位置；分有情世界与器世界。阿难你现在应悟知，东、西、南、北、东南、西南、东北、西北、上方、下方为界；过去、未来、现在为世；即十方三世。时间与空间，是一切众生神识虚妄法相形成，众生身中与外界有交易不断，与世界有相互涉入；即身有需求，世界有应；根尘相对，识出识入。世界虽确定十方，人只注目东、西、南、北；上方与下方没有办法确定位置，中间没有办法确定方向。四个方向与时间三世，相互一重叠为十二；十二与十世，相互二重叠为一百二十；一百二十与十方，相互三重叠为一千二百。总括统计，从始至终，人身六根各具功德一千二百。你以所在位置确定为中间，再判定六根功德的优劣。如眼根观前不能见后，左右旁观各见三分之二；统计判定，功德不全；只能是三分功用，一分无德。所以，判定眼根只有八百功德。如耳根周听十方动静声音，没有遗漏与障碍；所以，可以判定，耳根具足一千二百功德。如鼻根嗅随出入吸的通畅，而于呼与吸交替中间有停止，三分缺一；所以，判定鼻根只有八百功德。如舌根虽功能有二，只说其一；即舌能宣传弘扬世与出世间的智慧，虽有地域分别，但说法理没有穷尽；所以，可以判定，舌根具足一千二百功德。如身根有触觉功能，识别疼痛与舒畅；与触和合时能觉知，与触分离时不能觉知；分离时是一，和合时是二，三分缺一；所以，判定身根只有八百功德。如意根默然不见形体，但能容纳十方三世一切世与出世间法，可圣可凡，没有不能包容，又没有边际限制。所以，可以判定，意根具足一千二百功德。</p><p>　　中国讲天圆地方，方指东南西北四个方向。地球分为东南西北四方，而不是说地球是方的。天体是圆的，地球是圆的。星球与星球相互排斥，互相吸引，一个星球的变化引起宇宙磁力变化，其它星球相应发生变化。佛接着说，阿难你现在想逆生死烦恼的五欲流，返还五欲流的源头，穷尽生死烦恼，至不生不灭处；应考量验证受用之身的六根，哪个和合、哪个分离、哪个深入、哪个浅出、哪个圆通、哪个不圆满。如能于六根中，悟知哪根圆通，并依圆通之根修行，就可逆无始劫来心识中妄想业习的五欲流，证得返还源头的圆通。与依不圆通之根修行相比，有一日等于一劫的倍增之效果。佛今日将六根应有的清净圆通明示予你，各根本具功德数量就是这些，随你详参择选可入圆通之根。佛能详述其法理，以增进你的道业。十方诸佛于六根、六尘、六识入的十八界处，一一修行过，都已证得圆满无上菩提；于其中各界处也没有优劣差别。但你现在<a href=\"/remen/genqi.html\" class=\"keylink\" target=\"_blank\">根器</a>质劣低下，不能于其中各界处，证悟圆通自在的智慧；所以，须要佛为你宣说，让你择选一门，再于一门深入。深入一门证悟清净后，除尽妄想；六根于心识处是相通的，相随也一时清净。</p><p>　　要逆生死流，就得返本还源；但不要南辕北辙，心向外求。要辨清方向，找到路径，确定目标，心向内求；即从根、尘、识入的心识处深入。根与尘相应时，可偶立因缘，也可不偶立因缘；偶立因缘即一切皆空苦无常，生死烦恼；不偶立因缘即不被烦恼客尘所转，身心清净。不立因缘才能对是非有正确的判定标准；知是为正心、正知、正见，持戒修行；知非为知<a href=\"/remen/pojie.html\" class=\"keylink\" target=\"_blank\">破戒</a>过失，知妄心可畏而不颠倒。如平常人对信佛人不理解，和众生的贪欲处处相背；所以，普贤菩萨十大愿王中有恒顺众生这一愿。恒顺众生，是顺中有逆，逆中有顺，又无逆无顺。否则，顺着无明颠倒，随着烦恼业转。顺逆是顺善逆恶，顺善就是逆恶，舍一得万报；顺恶就是逆善，一失人身三途苦。顺善与顺恶往两个方向背驰，善是离佛越来越近，恶非离佛越来越远。无逆无顺，空于中道，必然回家见佛。由于众生缺乏智慧，修行需要一门深入。不要一会修禅，一会修密，一会又修净土；今天念<a href=\"/fozhou/dabeizhou/quanwen.html\" class=\"keylink\" target=\"_blank\">大悲咒</a>有功德，明天读诵《妙法莲华经》有功德等等；不是一门，都参杂了，愈快反慢。修行人往西走，一参杂就不走直线，往左一步、又往右一步，速度就慢了。修净土的，就抓住六字洪名，静坐念佛，别的都随缘或放下。只有一门深入，六根才不放逸。一清净一切清净，一究竟一切究竟。否则，今天研究这个法门，明天研究那套佛理，不是专一其心修行，是心杂乱修行，法无文字言说，故心不清净。如要挖井，处处都挖，那是翻地；选一个地方一直挖下去才能成功。</p><p>　　阿难向佛请法说，什么是逆生死烦恼的五欲流，深入一门修行，一门清净就能使六根一时都清净呢？佛说，阿难你现在已证得一果罗汉，入圣人法性流，不入色声香味触法的五欲流，已断除三界众生见惑；见惑为八十八结使，其中欲界三十二品，色界二十八品，无色界二十八品。但八十一品思惑还没有断除，还不能知根识里无始劫来积累的虚幻习气；这样的习气，要因地修行证悟才能得以断除。更何况其中有生、住、异、灭相，各相中又可分很多头绪。生相为心生业相、见相、境界相。住相为心生智相、相续相。异相为法执取舍相、计名分别相。灭相为业相，又与业相联系的苦相。</p><p>　　在家人、出家人有几位证得一果罗汉的？为什么证不得？一须臾坐不下来，能证得吗！佛经翻烂了也证不了一果罗汉，一天经没念，持戒修行也能证得一果罗汉。读诵佛经没有过失，但世人贪著功德，不能一门深入；思维心、分别念、执著想等把至宝变成垃圾；对营养物质贪多不能销化吸收，不能代谢放下，就不得清净。证得果位的人自知，修行有道可成；是身心行道，是心性证道；道果不同，功德不同。但证道不觉道，觉道不说道。不觉道为不执著，觉道为心觉自性。</p><p>　　佛接着说，阿难你现在再观察，六根是一还是六呢？如说是一，耳怎么不能代替眼见，眼怎么不能代替耳闻！头怎么不能代替脚走路，脚怎么不能代替口说话呢！可见六根不是一根。如六根决定是六根，那佛现在于法会中，宣说的微妙义理的法门，你的六根是哪一根来接受呢？阿难说，我现在是用耳闻，接受佛说妙法。佛说，阿难你用耳闻，与身口没有关系；怎么用口请问法义，身行礼拜呢？以此缘故，应悟知既不是一根，而是六根；又不是六根，而是一根。始终不能说，本是一根或本是六根。你应知六根既不是一根，也不是六根。由无始劫来，在无明颠倒的作用下，沉沦六道，生死交替；所以，于圆融清净的心性中，随业习合理幻生一根与六根。你虽证一果罗汉，于见惑中销除六尘相；但仍没有于思惑中亡失一尘相。如同太虚的空间，存在各种各样的星体，有不同星体存在，形成虚空差异；即名相上的差异。如去除不同星体，再观察虚空，虚空仍为同一，没有差异。这样的太虚空间，怎么人为的形成同一或差异呢！更何况名相上的是同一与不是同一呢！而于你心中，应彻底清楚六根为一体多用，多用唯一心，同虚空存在群星又不障碍虚空一理。</p><p>　　身体是一还是六，名义上是六，可以合为一用，是统一体。六根长在一人身上，一人身是一整体；六根各有各的功能，功能又是不可替代的；人身即是小宇宙。修行人通过都摄六根，接受到宇宙的能量，一日一食、三日一食、七日一食，或定中不食等，身能正常，是能量积累与能量守恒的结果。</p><p>　　佛接着说，由于光明与黑暗二种尘相交替，于妙觉圆融的心性中，连接清净显影形成识见，识见功用映入色相；识见与色相结合成眼根。眼根了然可见，属于清净四大。为什么眼体为清净四大呢？因眼体如葡萄粒，表浮于外，由肉体（地）、血液(水）、体温(火)、氧气(风)四种色尘组合形成, 功用是转动、散注、远近、视色。由于动与静二种尘相对应，于妙觉圆融的心性中，连接清净显音声，听闻功用映入声尘；不同音声与听闻结合成耳根。耳根了然可闻，属于清净四大。为什么耳体为清净四大呢？因耳体如新叶舒卷，表浮于外，由四种色尘组合形成, 功用是留转、散放、分辨、闻声。由于通与塞二种尘相变化，于妙觉圆融的心性中，连接清净显嗅识入，嗅识入功用映入香尘；不同香气与嗅识入结合成鼻根。鼻根了然可嗅，属于清净四大。为什么鼻体为清净四大呢？因鼻体如鹰垂爪钩，表浮于外，由四种色尘组合形成, 功用是流动、散入、呼吸、嗅香。由于恬淡与味觉二种尘相比较，于妙觉圆融的心性中，连接清净显味识入，味识入功用映入味尘；不同味觉与味识入结合成根。舌根了然可尝，属于清净四大。为什么舌体为清净四大呢？因舌体如初升半月，藏于口内，由四种色尘组合形成, 功用是转动、择入、泌液、尝味。由于离与合二种尘相摩擦，于妙觉圆融的心性中，连接清净显触识入，触识入功用映入触尘；多种触觉与触识入结合成根。触根了然可觉，属于清净四大。为什么身体为清净四大呢？因身体如腰鼓有腔，表浮于外，由四种色尘组合形成, 功用是支撑、安逸、运动、觉触。由于生与灭二种尘相连续，于妙觉圆融的心性中，连接清净显识知，识知功用映入法尘；见闻觉知与法尘结合成根。意根了然可知，属于清净四大。为什么意体（大脑)为清净四大呢？因意体如幽冥暗室，深藏不露，由四种色尘组合形成, 功用是思想、觉知、反应、识法。</p><p>　　修行人探索宇宙奥秘，探索人生真相，是用身命财为代价的。舍弃世间的一切荣华富贵，证得出世间的无为智慧；一般人做不到，能做到的是大英雄。在家人修行比出家人难，在家人修行是烈火炼金莲；出家人修行是水里长清莲。因哪里最有烦恼，哪里最适应修行；由于火候最旺，温度最高；而一般人被那里的名闻利养领走了，身心容易放逸。</p><p>　　佛接着说，六根功用虽由妙觉圆融的心性连接清净显现，但于性智上又幻生识智，于心觉上又幻生识觉；识智与识觉受尘入因缘扰动，产生妄想颠倒；使心性失去了本有清净慧觉慧知；并与妄想颠倒联系在一起，发挥如电波磁流一样的作用。无为功用被有为功用所代替；所以，阿难你现在如离开光明与黑暗的尘相，有眼根而不能见物体；如离开动与静的尘相，有耳根而不能闻其音声；如没有通畅与阻塞的尘相，有鼻根而不能发挥嗅功用；没有变化与恬淡的尘相，有舌根而不能发挥尝功用；如不分离与不和合，有身根而等于没有功用；如没有生与灭的法尘相，有意根而了知功用安立寄存于哪里呢！你的六根虽具功用，只要不随十二种有为尘相所转；即动与静、合与离、恬淡与变化、通畅与阻塞、生与灭、光明与黑暗。并于六根中，随修证拔出一根，脱离与功用的联系，降伏欲求，转化身心境界；降伏妄想而返本归真，发挥心性本自具足的智慧光明，心性光明发挥智慧的功用，其余五根的功用联系，应随一根功用的拔出，同时证悟解脱。这时，六根不随六尘生起知见，心识智慧立即显现，智慧又不随六根所转；只寄存于六根发挥智慧作用。此时的六根，可互相发挥功用；即用耳听字、用眼嗅香等。</p><p>　　六根都有执著，感受时思维才能发挥作用，离开对立面，处在静止状态；根不作用，功能还在。身体是有为的，意识也是有为的；器世间也处在有为状态。在有为的世界里，用有为的身体，修行有为法，去证无为智慧，是行菩萨道。有缘不须结，有结即有为。与人结缘是有为法，修证要结法缘，不结俗缘；执著有为就不是行菩萨道。善缘世间法，同修是法缘；行做善事，到寺庙上香舍钱，都是有为。佛法经千劫，度人人自度；出世无所求，心空性自明。无为是行菩萨道的人，舍掉有修、有证，只管耕耘，不问收获；行做功德事，无有功德想，这才是世间行菩萨道的人破有为的方法。天天给佛叩头，是有为，是克服人的骄慢心。静坐念佛入定，得空中三昧时才有无为的智慧产生。修行人在境界上，自然有一种无为的智慧显现，无为的智慧才是出世间的解脱，出世间的菩提。行菩萨道的人要知道只有修有为法，证得无为的境界，才能出离三界；否则，离开欲界奔色界，离开色界奔无色界。人本身就是法界之物，身体里的六根有需要，顺着走就是魔境，逆生死流又无顺逆才有出离三界的可能。</p><p>　　佛接着说，阿难你岂不知，今此法会中阿那律陀，失目而用头能见三千<a href=\"/remen/daqianshijie.html\" class=\"keylink\" target=\"_blank\">大千世界</a>。跋难陀龙王，不用耳闻而用角触能听闻一切音声。殑伽主河神女，没有鼻能嗅诸香。憍梵钵提，舌根不正常而能知味觉。主虚空舜若多神，无身而能觉触。还有摩诃迦叶，行住坐卧常于定中，早已灭失意根作用而意根圆通，不由意念而能了知诸法。阿难你现在如证悟圆通，去除六根的功用以后，心中自性就可发出如玉莹光。六浮根与六妄尘及器世间一切变化的尘相，都如热汤销冰一样，瞬间化为空寂；自性应心念立即化成无上慧知慧觉。再如世人，对物像都集中于眼见；若有人见一人时，突然合眼，黑暗出现于眼前；但此人用手去摸这人的外表，虽不用眼见，也能分辨清楚头足与肢身，与用眼见的觉知相同。这是缘于光明而有眼见，形成黑暗就不能眼见；但心中仍有影像显现。而心性智慧的功用，不须光明相，自然发挥无相光明的作用；就是在黑暗相现前的状态下，也永远不能出现昏暗，心见不受光明相与黑暗相所影响。六根功用与六尘相既已销除，还有什么性觉智慧不能形成圆融妙有的功用呢！</p><p>　　修行人如久习于禅，诸根功用不外溢，心静下来时，于定中发现自体内里发光，初始阶段似烛火发光，后来一片光明；于行住坐卧中，闭眼也不见黑暗相，内里仍一片光明。这时，恢复心性智慧，观自身根尘与诸世间颠倒的变化相，才如热汤浇雪一样，把颠倒尘相、颠倒知见自正于中道。心性真实存在，但须积聚无量功德，才能明心见性。否则，只见他人过失，被颠倒尘相所转，而不能见闻山水无非广长舌，都在说佛妙法音声；也不能见闻自身心法体光明，更不能觉知禅悦为食的真谛。</p><p>　　阿难向佛请法说，若如佛所说，欲求不生不灭的常住佛果，因地所发菩提心，一定要与所证圣果品位的名称项目相对应吗？与菩提心相对应的果位中，有七种称谓；一是菩提，即觉悟佛道；二是涅槃，即不生不灭；三是真如，即清净无妄；四是佛性，即真心自性；五是庵摩罗识，即白净心识；六是空如来藏，即本妙真心；七是大圆镜智，即自性智慧。虽称谓有别，但清净圆满、坚固凝聚的佛性识体，却如同金刚王一样，常住不坏。而人体中的真心自性，尚未证悟七种称谓的功德，随六根所幻化的见闻功用，如离开光明与黑暗、声动与音静、通畅与阻塞等自身尘相，毕竟没有所依皈之体；犹如意识心，离开大脑就一无所有。怎么能将这样毕竟断无灭失的幻化心，以为是因地所发菩提心呢？并以此欲求获得佛果的七种常住功德呢？如真心自性离开光明与黑暗，心能见毕竟空相；若没有自体尘相，心念自然灭失；我前思后想，反复推理求索，还是没有我的真心自性及固定依皈处。那还在哪里因地所发菩提心，欲求无上正等正觉呢？如是这样，佛先前所说清净圆融常住的真心自性，是否违背或超越诚实语，最终成为戏论呢？佛还怎么是真实语者呢？敬请佛以大慈心，开示我等愚昧吝法的声闻人。</p><p>　　佛说，阿难你虽搏学多闻，但还没有证得诸根漏尽，心中徒劳妄知因地所发菩提心；一旦颠倒真相出现于你面前时，实在不能识别。佛若将真心自性的真实相说出来，唯恐你的诚肯求道心，尚不能立即接受信伏。佛现在尝试用尘俗诸事作比喻，帮助你销除心中疑惑。</p><p>　　空的境界，对身心而言，是离于尘相。真心自性生起功用时，才知自性本空。这就是六祖大师讲的“本来无一物，何处惹尘埃”的境界，自性本来清净。我有一宝密似行山，晶莹透澈，就是明心见性。六祖大师为正法时代，最后一位现世有证悟的法师。在像法与末法时代，一些乘愿再来的菩萨与发菩提心的大阿罗汉，仍然有证悟境界。现在也有一果、二果、三果、四果罗汉住世修行。用声闻有为法可证得阿罗汉，但证不得无为佛果。因为，声闻乘修的是生灭法，有为法；不是苦乐法，无为法。一些在家人，初始信佛，信心百倍，信了二、三年就不再信了，对自身没见什么利益；既不食肉、不饮酒、又不贪财色等，人生不白活了吗？还是在世一天享乐一天吧！后世的心也好，识也罢，它是它，我是我；它解脱了，肉体不就受苦了吗！有漏就有欲求，有欲求就是颠倒。这种身心颠倒，至地府转轮处，还争着抢着喝迷魂汤呢！真心自性不渴不饿，对世间的一切尘相无欲求，才能圆成道业。非想非非想天人还有识想；出世间的境界，连想的名称都没有；自具无想净念。</p><p>　　这时，佛让长子罗睺罗敲钟。钟鸣一声后，佛问阿难说，你有听闻吗？佛传长子的是密法，密法不在文字言说上，文字上找不到密法，文字上的密法是显密。真密无一句话可说，无一文字可立；口传心授，以心印心。如无大因缘者，难值难遇。于《佛说大乘<a href=\"/fojing/jingangjing/39210.html\" class=\"keylink\" target=\"_blank\">金刚经</a>论》中，有详细解说。阿难回答说，我与法会大众都有听闻。钟静无声后，佛又问阿难说，你现在还有听闻吗？阿难又回答说，我与法会大众都没有听闻。这时，罗睺罗又敲钟，钟鸣一声后，佛又问阿难说，你现在又有听闻吗？阿难又回答说，我与法会大众都有听闻。佛说，钟鸣时，阿难你是怎么听闻的呢？钟不鸣时，你怎么又不能听闻了呢？阿难又回答说，敲钟声鸣我与大众都听闻到了；过一段时间，钟鸣声销失时，就为不能听闻。佛又让长子罗睺罗敲钟。钟鸣后，佛问阿难说，你听闻有钟鸣声了吗？阿难又回答说，我与法会大众都听闻有钟鸣声。钟鸣声销失片刻，佛又问阿难说，你现在听闻还有钟鸣声吗？阿难又回答说，我与法会大众都听闻没有钟鸣声。又过一段时间，罗睺罗又敲钟。钟鸣后，佛又问阿难说，你又听有钟鸣声了吗？阿难又回答说，我与法会大众都听闻有钟鸣声。佛说，阿难你说什么为有音声呢？什么为无音声呢？阿难又回答说，敲钟的声鸣，我与大众都听闻有音声；过一段时间，钟鸣声销失时，就为没有音声。佛说，阿难你与大众现在为什么违反常理胡乱说话呢？大众与阿难同时向佛请法说，我们怎么违反常理胡乱说话呢？佛说，佛问你们有无听闻，你们就回答有无听闻。佛又问你们有无音声，你们就回答有无音声。一会听闻，一会音声，怎么回答没有一定呢？为什么不是违反常理胡乱说话呢？阿难你于钟鸣销失无音声后，你说没有听闻；如真实没有听闻，耳根听闻功用已灭失，应同于枯木，再敲钟有鸣声，是怎么听闻的呢？能闻知有与没有音声，自然属于声尘；有音声或没有音声，岂能是你的耳根听闻功用；难道有没有音声是为你而有与没有吗！如真实能听闻没有音声，怎么能说没有听闻呢！能知没有听闻的功用又在哪里呢！以此缘故，音声在听闻过程中自然有生有灭；不是为你听闻音声而有的生与灭。现在，你的耳根听闻功用，是有还是没有呢？你还在颠倒的认为，有音声才为听闻，没有音声就认为没有听闻；难怪你愚昧迷惑的以常住真心自性为断灭呢！你始终也不应说，真心自性如离开动与静、闭塞与开通，就没有听闻功用。犹如熟睡的人，于熟睡的床枕上，听闻功用依然存在；其家人的槌洗衣声或舂米声，熟睡的人另外认为是其它音声，或为击鼓、撞钟；又于梦中责怪自己将撞钟误为木石的音声。熟睡的人突然醒后，即知槌洗衣声或舂米声；将梦中疑惑此音声为击鼓音声告知家人。这人于梦中，岂能记忆什么动与静、闭塞与开通吗！其身虽熟睡，其耳根听闻功用不能昏睡。就是有一天你的身体销失，生命结束时，其真心自性听闻功用怎么能随之销失灭掉呢？只是一切众生，从无始劫来，周而复始的随色声香味触法而起心动念，追逐妄想而流转生死；仍不能觉悟其真心自性清净、妙有、真常。因不能逆其生死流，身心追逐尘相的生灭；而于生生中又杂染流转生死的新业。如你能弃舍生灭的业习，清净持戒修行而保持真常心；久常静坐禅行，真心自性的智慧光明现前时，根与尘相对应的识入心，就随之销失而脱离生死流转。这时，心中有想有相就为尘劳烦恼，心中有分别、有情感就为染垢。如心中想与情都能远离，而你的择法眼即时清净光明，还怎么能不成就无上佛道呢！</p><p>　　真心自性虽无眼、无耳、无鼻等六根，但具足六根功能，又超越六根功能。想听的听不到，不想听的还能听到，是耳根颠倒不能做主；真心自性是闻而不闻，不闻而闻。如人死后，虽然耳朵还在身上，但功能销失。人的心识离体后，主持各根功能的魄散后就是这样。科学家断定人的死亡，是测脑电波，脑电波销失了才算真正死亡。脑电波在，等于思维功能在。虽不能说话，但内心有感知。众生生生世世杂染，六道轮回，是颠倒的眼根、耳根、鼻根、舌根、身根、意根，这六根起的恶念、贪念、邪念等，随着业力入于因果律中。心识离开肉体时，回观自己的肉体太可怜了，一点意义都没有，肮脏、臭秽。思维想象中的种种尘相，化为业力习气。文字上的佛经法义等名相，都装进人的心识里，种植善根；而不能解决生死大事。修行人是自古华山一条路，持戒修行，明心见性。开悟的人易修行，在于知身是假合和不真常，而真心自性才是真常。\t\t\t\t</p></div>"
},{
    "title": "【大佛顶首楞严经卷五】",
    "author": "净慧大师",
    "date": "",
    "html": "<div class=\"B1_text\"><h2>【大佛顶首楞严经卷五】</h2><p>　　有的人就读不读这部经的卷名争的面红耳赤，有人说可以不读，有人说不读就不如法。何必执著于文字呢？讲经可以不照经文一字一句去讲，把经文的义理讲出来就可以，重要的是让大众明白如何行作。我讲法时要读诵经名，诸位知讲到第几卷了，让人心里有数。如诸位自己读诵这部经，可以把经文一气呵成读诵完，可以把卷名舍掉不读诵。世间人执著心太重，什么事都想争论。读与不读卷名，要应时、应地处理，只要适合大众的心理就行。末法时代结束的时候，这个世界灾难来临。这部经是降魔的，这部经陨没时，人的身行就与禽兽相似，乱伦。有这部经在，有楞严神咒在，人还知因畏果，有一点廉耻，魔法还受佛法限制。魔王提倡的性解放、性自由也受到限制。这部经是修行人必读的一部经，可以先读，可以后读，也可以边修行边读。要是成天在文字上研究这部经，永远也研究不了。科学家、教授也研究不明白，因为不是世间的智慧所及。用世间有为的智慧与有限的智慧，研究出世间无限的智慧，根本没谱。对人体里面有个心识，还有诸魄，还有个晶莹剔透的自性，科学家说科学无法证实。用肉眼或仪器观，永远也观不到。世间的有为法，有对就有错，有得就有失，有正面作用，就有负面作用。</p><p>　　阿难向佛请法说，佛虽已说第二种决定法义，从人身六根处开始解结；但现在观察世间解结之人，如不知其结形成的根源在哪里，我相信解结之人，始终也不能解结。我与法会中有学的声闻人，都是这样。从无始劫来，心识与无明同时共生共灭；我虽证得人中多闻的善根，名为出家僧人，但犹如隔日复发的疟疾，时明白又时不明白。敬请佛以大慈悲心，怜悯沉沦苦海中的众生，开示我与有学的声闻人，今日的身心怎么是结呢？又从哪里开始解呢？也让未来的苦难众生，知结解结，不落于三界中，得免轮回之苦。阿难请法后，代表大众五体投地，泪如雨下，抬头凝神静听佛说法开示。</p><p>　　第一义为出世间修无为法，成就佛道；第二义为世间修有为法，成就声闻缘觉；再发菩提心，行菩萨道。阿难原以为声闻缘觉为第一解脱门，现在才知出世间成就佛道为第一解脱门；所以，说有第二义门，实则唯有第一义门。世间存在三灾八难，各种痛苦像海洋一样广大，没有边际。有想就落三界，有情就堕轮回。有人说如这样，人连人情都没了。在佛教里不讲人情，讲慈悲怜悯，讲同修共度，讲自利利他。在事实上说，有情就有爱，有情就有私，有私就是邪法；有亲就有近，有近就有远，有远有近就有区别，有区别就有我，有我罪即生。</p><p>　　这时，佛怜悯阿难与法会中有学及未来众生能出离三界，作十方诸佛眼目及佛法栋梁。佛摩阿难顶给予加持鼓舞，世界六种震动。无量数的有佛世界，各有宝光从佛顶发出，都到佛说法道场，与释迦牟尼佛的宝光连接，大众叹未曾见闻过。</p><p>　　震动就是有种感应，就像电波一样传遍十方佛国土。释迦牟尼佛的宝光与十方佛宝光怎么能接上呢？修行人都能证悟到与宇宙同体的境界，佛的智慧境界更是无量无边。修行人身心感应道交时，所感应的无限大，是指娑婆世界无限大，超越不了。佛能超越娑婆世界，与十方世界诸佛往来。修行人身心的感应范围有限，佛的智慧无限。</p><p>　　正于此时，阿难与法会大众同时听闻，十方诸佛同声说，阿难你不是想心知与心识共生的无明在哪里吗？想找到使你轮回生死的根本结吗？就是你的六根，眼耳鼻舌身意。如离开人的六根，没有他物。你不是又想证悟无上菩提佛果，速证身心安乐、生死解脱、寂静妙有、常住不灭吗？还是你的六根，如离开人的六根，没有他物。</p><p>　　有人问，佛法在世间的哪里？在众生的烦恼处。烦恼即菩提，将六根带来的烦恼反过来就是菩提。有人问，信佛的人怎么还生病？信佛人和平常人没什么两样，只不过是受持戒律，依法修行。但仍然是业报众生，今生以前的恶业仍然是有报果的。只是停止造作新业，其它成就仍须修行。所以，不要以为在家人信佛了，或是人出家了，就和佛菩萨一样，就不生病了，那是不可能的。由于信佛人是初学、有学，六根没有转过来，仍然被根尘牵着走。有身体就有需要，就有占有，追求五欲之乐。如能把六根反过来，眼不见美丑，耳不闻是非，鼻不嗅香臭，舌不贪众味，身不染触欲，意不思诸法，证悟到心空性空的人，才能不生重病。怎么反过来？光用嘴反不过来，实修实证的人自然会反过来。</p><p>　　有人问，人都一样，同有六根，同是修行人也没什么特殊的呀？没有出世间的智慧能分辨出什么特殊来呀！肉眼凡胎怎么能分辨出修行人特殊不特殊呢！同样是人，功德有区别。六根是烦恼生死的根本，出离这个世间也靠六根，人的身体也是承载佛法的法体。人的身体是依法则而来，天地造化，宇宙相通，能够接受宇宙能量。可以顺世往前走，越走越远；也可以逆世走，回到本源，脱离苦诲。脱离苦海的不是人的肉体，是人的心识。事实上，人的肉体转化过来以后，给人带来的喜乐是无穷无尽的，要比平常人那种快乐，强百千倍。所以，让修行人舍离静坐，等于抢占了最喜乐的时间，生命中最宝贵的财富。圣人静坐就是在享受喜乐；既法喜充满，禅悦为食；众生静坐是这疼那痛，这反差有多大。静坐有所得吗？在这个世界上即有所得，又无所得。并不是有所得就是挂碍，而是在有为法中，身心得到了无为之乐。有修证的高僧大德，知此世界上最美好的事，是法喜充满；最快乐的事，是禅悦为食。无所得是，不执著，不挂碍。</p><p>　　阿难向佛请法说，我虽然听闻十方诸佛的法音，可心中还是没有明白，怎么理解让我生死轮回的是这六根，让我证得安乐妙解脱的还是这六根；如离开这六根，没有他物呢？佛说，根与尘是同一根源，绑缚与解脱，也没有第二处地方。根在体内，尘在体外，根本身又是尘。根尘既是分开的，又一时一刻也没离开过。什么时候也离不开尘，所有的食物是尘，吃、穿、用等都是尘。根和尘是一，又是二。包括死时，一把骨灰都得留在这个世界上；人的身要是没有心识住体，仍然是器世间之物。根尘相都是有形物体，与宇宙相同；世间物体与动物的区别是有心识，心识分高级与低级。又一时一刻也离不开物质世界，只有心识无业才能离开娑婆世界。绑是自己缠缚的，解也需要自己去解，依佛法修行，一门深入就是解。如解开一个结，依次几个结都开。一个解不开，依次都解不开。解结是一个淫字；这个字解不开，永无出期，其它结都解不开。这里不能深讲，深讲在家人害怕，是不是要离婚，家庭出问题呀！大可不必。为什么？在家修净土的人可以放一放，在家参禅的人又很少，修密的人有对治的办法。所以，在家人大可不必惊慌。正法时代有末法，末法时代有正法，末法之中有像法，像法之中有正法，都不是绝对的。</p><p>　　有人问，正法时代有像法、末法吗？正法时代有多少不信佛的人，有多少谤佛、谤法、谤僧的人。那不是末法是什么？佛住世时，修行人是正法，依正法修行。正法时代、像法时代、末法时代虽然各有各的特征，同样不能说正法就是单纯的正法，像法就是单纯的像法，末法就是单纯的末法。虽处末法时代，但谁依正法住世的精神修行，谁就能比佛住世时修的还快。因为法越到末梢的时候，越是真修行速度快的时候。磨刀的磨石越好，磨擦力就越强，刀才能越锋利。现在要以正法精神去修行，修一个成一个。要是随着末法转，当然很难成就。正法时代也有很多修行人放逸呀！一样贪图安乐，一样静坐时怕腿疼、腰疼！末法时代有正法存在，末法时代有无数的菩萨来到这个世界，护持佛法，拥护佛法，续佛慧命，在他们身上都是正法，都依正法精神住世，都依正法精神修行。菩萨的道场都在讲佛教正法，不要为自己生在末法而叹息。解开自己的心结，缠缚自己的绳索仍然掌握在自己的手里，没在他人手里。</p><p>　　佛接着说，六根对六尘的识入功用是真心自性依因缘、自然幻化而生，犹如虚空花一样，虚妄不真实。因尘相显露而易知，又因根著尘相而有知；根功用与尘相产生的识入，不是真心自性；如同两根芦苇交织在一起，一根芦苇倒伏时，另一根芦苇也随之倒伏。所以，你现在根功用与尘相立即产生的识入反应，就是产生无明的根本。如根功用与尘相，既产生识入反应，又没有产生识入反应，就是涅槃之乐，证悟无漏的真正清净。怎么其中又允许他物发生作用呢！</p><p>　　无明烦恼产生的根本是根尘识入；心识在六根中如在仓库里，没有修行的人心识不能独立发生作用，代替心识发挥作用的是六根。身口意造作一切善恶业都在心识里贮存，无始无终的去承受。修行人要把内尘与外尘这些相转化空掉，进入一种定的境界，需要一个修行过程，才能达到知见无见，知见无知。把外边有为的一切尘相放下、空掉、转化、舍弃或弃转，用定中三昧代替，用慈悲代替，这样就可以达到佛的境界，达到涅槃的境界。涅槃是什么？性我无来无往，不生不灭，超越三界，达到无漏真净。无漏是于世间无为而证得，有为永远也得不到；出世间的无漏无为，又源于世间证悟。世间的一切诱惑，财色名食睡等都不起作用，如油与水不溶，这就是无漏。无漏的人修道特别快，为什么说往生极乐世界的人，须三果罗汉圆满，才有资格谈往生，而且要往生到边地品。因为圆满三果罗汉后，为不来果，但漏根未除；而极乐世界的菩萨漏根已除。漏非常重要，起一念心就漏了。不管顺还是逆都不行，爱也不行，憎也不行，都必须放弃，达到无漏，不被世间所染，才能出世间。无漏真净就是内无六根，外无六尘；根尘不偶。《<a href=\"/fojing/xinjing/\" class=\"keylink\" target=\"_blank\">般若波罗密多心经</a>》上说，无眼耳鼻舌身意，无色声香味触法，就是无漏真净，入深禅次定的境界。修行人于定三昧中用心识去观，心性脱离六根之缚，不受六尘所染，不受五蕴控制，独立存在功用。对世界任何事都不感兴趣，包括到各层天旅游观光，对各层天上的人与物都不感兴趣。有为就有生灭，无为就无生灭。人的身体缘生缘灭，就像幻术一样，来回变化，不真实。如空中有花而无根，没有生存的土壤，没有生存的条件。自性是真空，则真空不空，不空妙有。人的语言虽是虚妄不实的，但是要用语言说出来，把真实的境界描述出来，把真如本性描述出来，真相与假相同时存在。人的肉体是假的，真实的心性藏在里面。由于假的身体虚妄不实，心性也跟着虚妄不见。真里有假，假里有真，假与真之间没有实性，互相依靠，谁也离不开谁，系的结和解的结都是一个淫。解开的就是圣，解不开的就是凡。众生都离不开肉体，都离不开六根，迷时贪诸有，贪就是无明的根本。出家人还贪呢，贪名闻利养；正法住世时有很多人住山林，干什么呀？放下尘缘，求得解脱。解脱说起来容易，做起来非常难，非一日之功。修行人必须履行程序，依法而行，在依法而行中，有证、有悟；再发菩提心，把获得证悟的方法供养给众生，让众生也知修行证悟。</p><p>　　这时，佛说偈语；真心自性空于修行有为法，所以缘生缘起如虚幻。心空即无为法、无缘起、无生灭，有为法与有缘起如空中花一样虚妄。虽说有为法与有缘起虚妄又显现诸真常，世间虚妄与真常混淆为妄想妄行。犹如不是真常又不是不真常，为什么有为见就是固定见！有为见与尘相的识入中都没有真心自性，所以比喻为两芦苇相交织。形成结与解结的同是六根，是圣人还是凡夫离开六根都没有第二条路。你详细观察根与尘识入中的功用，虚幻识入与相有都不是真心自性。身心迷惑与暗晦就是无明的根本，真心自性发起光明便得解脱。因地解结次第先择一，六结解一余结也亡失。如选择一根证悟圆通，诸根圆通入法性流而成就无上正觉。阿赖耶识中的微细思惑，形成的习气如暴水洪流。心识真实存在又随妄想不真，佛恐声闻更迷惑，不能经常为大众开示。寻找自心还须从自心开始，否则不是幻法也形成幻法。如不从自心开始修证无非是虚幻，如从自心开始修证就不是虚幻且妄想不生。妄想不生而虚幻的有为法还怎么安立，转妄成智的心识妙法就如莲花。如金刚王一样的宝觉，来自于如幻三昧的妙慧正定。此能速超有学证无学，是至高无上的无比法。十方诸佛都依此妙修行路，一门深入而证悟常乐我净的境界。</p><p>　　结结有顺序，解结次第开。淫结不开，其它的结解不了。淫结不开，其它的结越系越紧。一结解开，六个结全开，六根就圆通。圆通方为入流；证一果罗汉是入流，入圣人流而出凡夫流。从一果罗汉至成佛，是入流成正觉。觉时观察自己无量劫来沾染上的习气，习气成瀑流，如江河大海一样奔腾。深讲淫结，众生迷茫恐惧，所以不讲。在家人信佛了，什么事都往信佛上赖，夫妻吵架，肯定是信佛信的；夫妻离婚，肯定是信佛人的事，众生的根性就是这样。所以，不深讲是有道理的。自己的心结，还得自己去解。众生是自度非人度，是佛度；听完佛法，还得自己去修、去证，自己独立行作。自己不去修证谁也替不了，法师只能在修行过程中帮助解惑，这是真实的法。持戒是有为法，又是心无为行；定是肉身暂时境界，有世间定和出世间的定，多数人修的是世间定；慧有世间智慧与出世间智慧。</p><p>　　这时，阿难与大众听闻佛无上大慈的教诲，赞颂偈语精彩如莹玉光明，微妙的法理清楚透彻，心量与眼界大开，心中似充满光明，感叹从未听闻过。</p><p>　　阿难礼佛后请法说，我今日听闻佛无遮大悲（没有遮掩）的说出，自性清净、妙有、常住、真实的法义偈句，虽心量与眼界大开，但心仍没有达到六结解其一结而诸结亡失的境界。对解结的舒展过程与顺序，还请佛以大慈悲心，再怜悯法会中大众与未来众生，布施<a href=\"/remen/ganlu.html\" class=\"keylink\" target=\"_blank\">甘露</a>法雨，洗涤心中无始劫来沉淀的污垢。</p><p>　　这时，佛整理一下僧衣，从桌子上拿起夜摩天供养的一条花巾，于大众前用手系一个结后，问阿难说，这是什么呀？阿难与大众都回答说，此为花巾之结。这时，佛又将花巾系一个结后，问阿难说，这是什么呀？阿难与大众又都回答说，此为花巾之结。佛于此花巾上一一系六个结，手持此系六结花巾，问阿难说，这是什么呀？阿难与大众又都回答说，此是佛手系花巾之结。佛说，佛开始手系花巾为一结，于一条花巾系第二、第三结时，你们怎么还说是结呢？阿难回答说，此花巾编织时虽是一体，但如我想，佛于此花巾上系一结为结，系百结时仍为结；可现在只有六结，既不是七结，又不是五结；怎么佛系第二、第三结时，不能为结呢？佛说，阿难你知此花巾原本一条，佛于花巾上系六结，为一巾六结。你仔细观察，花巾之体相同，因系六结而有差别；你是怎么想的呢？开始系结为第一结，乃至六结产生。佛现在欲将第六结称为第一结可以吗？阿难回答说，六结如存在时，第六的名称始终不能称为第一。即使我历经生生世世，尽其明辨力，也不能改变第六结的名次。</p><p>　　佛说，正是这样，六结虽不同，但回顾六结所成因缘，乃一巾造成，若将六结的名次弄颠倒，当然不行。而你的六根也是这样，本来毕竟相同，却产生毕竟差异。阿难你一定希望六结不能形成，喜欢恢复一条花巾；但怎么行作才能使其恢复呢？阿难回答说，此花巾之结如存在，要想恢复一条花巾，是与非很快就于其中生起；因此结不是彼结，彼结不是此结。佛现在若将六结全部解除，但结如不产生，就没有彼结与此结，也就不能称为第一结，第六结还怎么形成呢？佛说，六结解一余结即亡失，就是这样。由于你从无始劫来，心性随无明产生颠狂迷乱，发生虚妄的颠倒知见，又妄知妄见不息，又尘劳执著妄知妄见。这样同于瞪目伤晴的尘劳，虚空妄生乱舞狂花；于心性的清净智慧中，颠倒知见妄生妄起；一切山河大地与生死涅槃等，都如瞪目妄生的颠倒狂花。</p><p>　　巾上六结，比喻人身六根。从开始至把六根全反过来，得从意根开始，淫根是以意根为基础的。众生现在不但一个都解不开，还越拉越紧。不但今生不得出离，生生世世都不得出离。怎么越拉越紧呢？造作恶业。所谓的恶业是假名恶业，恶业是可停、可转、可破，不是自性固有。恶业将来有因果循环，众生认为鱼虾猪马牛羊就是让人吃的，要不然老天生出动物干什么！不知是业报众生。身口意有贪嗔痴，贪嗔痴对应的是杀盗淫。因果循环是今生你吃它，下生它吃你；今天你骂辱他，明天他骂辱你，以恶对恶，恶果自食。今天生病是前世造的恶业所感，前世造的恶因，今世必遭恶果，是自恶恶自，自作自受。善因结善果，是自善善自，也是自作自受。说恶不是攻击谁，说善也不是赞叹谁，善恶都是自作，终将还要自受，千劫业不亡。今生偷、诈、奸、欺不择手段贪来的财物，用的很舒心；下生作牛作马都要去偿还，他人不能代替偿还。今世做善生天，下生自己去享受，他人也代替不了。善恶不是攻击与赞叹，是为自性解脱而说。说谁杀猪宰羊造恶业，那不是攻击，说的是因果真相，是真实过程。心被无始劫来的妄念尘劳所引诱，没有停止，是妄见尘劳不息，是心狂乱颠倒。人造恶业，因为不信真有报应。今天想做一件恶事，若知明天加倍报应，谁也不敢做了。因为众生愚痴不知，是可怜悯者。菩萨畏因，凡夫畏果；凡夫出事受报了，才知害怕；菩萨在起念时就知害怕，怕生恶因，将来要结恶果受报。起恶念，恶不到他人，只能是搬起石头砸自己的脚。诸业既是因为果，又是果为因，来回轮转，循环不止。山河大地是众生的业报所感，也是佛为度化众生所化现出来的；众生不理解，认为地球这么大、这么坚固，又有浩瀚星空，佛有多大力量能化现出来呀？其不知宇宙的变化规律与一尊佛的愿力相适应，佛的愿力与众生的业力相适应。极乐世界是阿弥陀佛的愿力所成，娑婆世界是释迦牟尼佛的愿力所成。佛的愿力是什么？度脱不同业报的众生，度脱不同的众生就要化现不同的世界。环境空间诸众生，相依互存共兴亡。无明业感万千像，一体同悲人不详。众生业报如此，示现世界是颠倒相。众生在颠倒之中，醒悟的欲出离，不醒悟的就迷下去。只能说释迦牟尼佛慈悲，愿力化现这个世界。愿力是因地行菩萨道时所发，如我所发的大愿中有，“愿我来世得菩提时，若有在朝为官吏之人，因贪脏罔法，挥霍无度以及滥施国政，欺民害民，或指使他人，毁佛塔像，禁教逐僧等，造做种种恶业，当堕地狱。设得人身，争讼多病，被人轻贱，当命终时将为横生，酬还业债，若闻我名，至心称念，由是力故，所有恶业，悉皆销灭，无讼无病，被人尊重，不受横生，乃至菩提”。这些众生怎么度？就得示现这样的星球，有适应这些众生生存改造的地方。类似罪犯得上监狱里去，提供改造的环境。人召感共同的业报，来到这个地球。尘劳不除，一个结解不开，其它的结永远也解不开，顺世越拉越紧。八十岁的人还喜欢美色，想入非非的；生一回人可要够本呀！找个女保姆，还想牵着人家的手等。这是业习现象，下生轮转畜生道，自己还觉得是一种本能需要；实则可怕至极。有证悟的人，知因果可怕，原来害他人就是害自己，占他人便宜就要百千万倍偿还的，是在借高利贷。</p><p>　　阿难向佛请法说，既然心识的这种尘劳妄见与六结相同，怎么解开销除呢？佛以手将六结花巾拉动，停止于胸前左侧，问阿难说，这样停放等于解开销除吗？阿难回答说，不等于解开销除。佛以手将六结花巾拉动，停止于胸前石侧，问阿难说，这样停放等于解开销除吗？阿难回答说，也不等于解开销除。佛说，佛现在用手左右拉动六结花巾，都不能彻底解开销除；阿难你设想一个方便办法，怎么才能将花巾六结解开销除呢？阿难回答说，应于巾结的中间部位，双手指向两端用力拉动为解，巾结才能分散为解开销除。佛说，正是这样，如想解开销除巾结，应于巾结的中间部位，用力拉动才能解开销除巾结。佛所说佛法从因缘生，不是取决于世间因缘和合的粗俗尘相。佛于不同时间、不同对象所说世与出世间诸法，是履行因地所发愿力的无缘大慈为缘起，是佛性与众生自性的一体同悲为缘生。佛的智慧无量，就是娑婆世界内，乃至如恒河沙数以外的世界，虚空中一片云中落下的雨，都能尽知滴数；世间当前存在的松树为什么是直的、荆棘为什么是弯曲的、鹄鸟为什么是白色的、乌鸦为什么是黑色的等，都彻底知其根本由来。所以，阿难你随自心选择六根中的一根，证悟圆通；如一根之结解开销除，六根对应六尘的识入相自然灭除，诸颠倒的妄知妄见当即销除灭亡。</p><p>　　六根之结直接作用于心，是绑缚心性的尘相结，但还不是心结；心结包含第七识的我执、我见、我慢、我爱习气垢结，也包含识蕴中无量劫来的积淀垢结。解开心结，先解开根结，根结尽开，心结自除。怎么解开根结，人从因缘生，就得从因缘处下手。世间的一切相都是因缘所至，佛法似是世间因缘生，实非世间因缘生。佛与众生有佛性与自性一体同悲的大因缘，众生依此大因缘才受佛法化。缠缚众生不得解脱的因缘是一个情字。菩萨是觉悟有情，倒驾慈航示现有情众生；佛是慈悲众生，以无上正等正觉，法化众生。众生身有六根，是业感因缘，受世间法则约束。要想解脱先除尘相，身心转化色声香味触法为除尘相。修行人修证过程就是除尘相过程，除尘相过程就是弃转习气的过程；既除内尘相，又转外尘相。当根对应外尘不起念时，内尘相就不作用于心，才能诸妄销亡。</p><p>　　佛说，佛再问阿难你，此花巾六结呈现在你面前，你能同时解开巾结缠绕，销除六结吗？阿难回答说，不能同时解开销除。因六结是按顺序手系产生，现在也应按顺序而解开销除。还有六结同一巾体，系结不是同时；而解结时，怎么能同时解开销除呢！佛说，六根之结的解开销除，也是这样。如开始解六根之结时，应先证得人空，再证得法空。人与法二空时，自心智慧生起，成就法中无我的解脱状态。证得法中无我的自在心性时，五蕴皆空则根结不能产生。</p><p>　　解开心结，首先，求得心净行净；然后，进入定空；再由定空生起智慧，才能解开心结。身体的哪种需要都要命，渴了不喝水要命，饿了不吃饭要命，人为财死也要命，色胆包天更要命。身体要转化、空掉，再将身心中各种强烈欲望化成平淡或空无，自然就转化了。不吃肉馋不馋？不馋。为什么不馋？转化了，身心不受。其它的都是如此，同一法理。所以，一空诸法不生；一空诸念不起，<a href=\"/remen/sidajiekong.html\" class=\"keylink\" target=\"_blank\">四大皆空</a>。四大皆空是身空，五蕴皆空是意空，无善无恶是心空，空而不空是性空。 一路空下去，外边的六尘全部转化，六根不染六尘，不起烦恼，真心能不显现吗！一定显现，觉知空中存妙有。一显现立刻悟知这个世界缘来如此，是个迷局。在迷魂阵当中，喝了迷魂汤；在迷魂阵之中，迷失方向，天天认贼为子，六根就是六贼。认为自己的六根有最大的需要，就成天满足需要，跟着需要的感觉走，永远也不得出离迷魂阵。今生这个身很好，下世再换个毛身，一路下去到畜生道更自由。人还有个道德约束与社会法度，还有这个管着，那个管着，落入畜生道没有这么多管。自然界那些动物，只有天地法则约束，天敌惩罚，人去猎杀等。一道众生有一道天敌，自然有克制的。为什么是这样？天设的业报因果循环法。没有哪一道不受克制的，老鼠就有猫和蛇克制；蛇就有鹰克制等。互相吞啖，你吃我，我吃它，没有最厉害的。有人说，人靠人活着，鱼靠水活着。我讲人与鱼又靠自己活着，是靠业因缘支撑活着。修行人不要在迷惑中活着，还要在明白自在中活着。</p><p>　　佛接着说，人法二空，是行菩萨道的人，由正定中证得的无生法忍。心中无明无生处，颠倒烦恼无生处，有为生灭无生处；又现众生像，法忍于世间。一切客观规律都属于有为诸法，行菩萨道的人，对这些有为法都不染著，只随缘顺应，顺应中，去利用；利用中，弘法利生。遇世间的打骂奸欺，容忍让过不去计较、不生嗔恨心。遇世间的欲望满足时，不生欢喜心。如生嗔恨心与欢喜心，为没有证得法忍。即遇顺境、<a href=\"/remen/nijing.html\" class=\"keylink\" target=\"_blank\">逆境</a>时，有忍于身，无忍于心。菩萨六度中有忍辱，得无生法忍的人才能超越三界，超越三界的人得证无生法忍。</p><p>　　阿难与大众，承蒙佛的慈悲开示，对真心智慧性觉圆通的法理，得以明辨，再没有疑惑。阿难礼佛后请法说，我与大众，现在身心舒畅，快乐无比，虽又悟知一根尘识入相解脱，六根尘识入相随即销灭亡失的法义；但仍没有证得六根圆通，了见本有真心自性。</p><p>　　为什么有学声闻懂义不见性，疑问种种。是因为三果以下的罗汉包括三果，事事在在有个我，事事在在把我摆在头前，把我摆在中心。我字当先，我解脱、我证果、我涅槃、我将来怎么、怎么，都是我执法生。于世间行菩萨道的人，把我放下，我是什么呀？我身臭肉一堆，和平常人一样。我能为他人做点什么？把我往后排是我的快乐。众生幸福我才幸福，事事在在心放在无我的状态，劳作一点才是幸福，真正幸福就在于此。身心行处，是苦乐法。真心性我真空，不生不灭常住；愿心行处无声，自在解脱无形。如将我放在头前有法执就是有学声闻，未证人法二空。如将辩论字词、语言、法理为究竟上，就是凡夫。</p><p>　　阿难接着说，我们诸有学声闻，无量劫来漂流于生死苦海中，孤苦伶仃；是什么心愿遇佛结法缘，成为佛法中眷属弟子；如失乳婴儿，突然又遇慈爱的母亲。值此机遇，道业本应成就；但只得闻密法妙义，认为理悟就是开悟，等于自欺欺人；如不去真修实证，就与没有听闻佛法的人，没有什么差别。敬请佛再惠施大悲，赐教秘不可说又神圣庄严的法义，达到佛至高的开示。此语说完后，五体投地礼佛，并悄悄的退回座位，祈求佛能宣说密义。</p><p>　　于诸佛境界，本来无一法可说；于菩萨境界<a href=\"/remen/buerfamen.html\" class=\"keylink\" target=\"_blank\">不二法门</a>，有说都是多余的。我们末法众生，召感到末法因缘够可怜的，整日还在那争论呢！都混成这样了，还觉得我挺聪明的，我挺厉害的，我辩出个什么理来，我如何、如何呢！还不知自醒呢！可怕呀！众生按佛的境界对照一下，众生是不是可怜悯者，太可怜了。菩萨是乘愿再来救度众生，须付出重大的代价；在世间行菩萨道，是以身命财为代价；但觉悟有情，是因缘所感，是报佛恩呢！</p><p>　　有人问，现在我们这个讲法道场，与佛有关吗？有关。一是我们有机遇能得闻佛法；二是我们有机遇得到诸佛护佑加持。有缘闻法者，都是无量劫积聚善根，才有此福报，能顺利健康地坐在这里听闻佛法。我讲诸事时时刻刻都与佛有关，只是不知感佛恩而已，不知诸法实相而已。觉得我就是我，我富贵，我信佛，我才能听闻讲经。我不是讲过吗，把那个我，先扔太平洋去吧。都是佛、菩萨慈悲，才有善缘。这点福报是供养佛法僧三宝积来的，是行善法积来的，才有今天的果报。时时刻刻、冥冥之中都没有离开佛。把那个我放下，感佛恩、念佛法。佛这么慈悲，累劫救度，再不知报佛恩，真是可怜悯者了。佛与佛法难值、难遇呀！难值难遇还不算，还有个难信、难解。遇到了不信白搭，信了不解也不行；解不是靠理论去解的，是靠证悟去解，才是真解。</p><p>　　有人问，怎样理解冥授？众生时刻都没有离开佛、菩萨的恩惠和慈护呀。国家制度都禀承天意，即做善事、倡导正义，创造好的社会环境等。国家都顺应天意、民意；天意、民意哪来的？人间正义哪来的？人间正道哪来的？都来自佛的慈悯冥授。众生在冥冥之中，冥冥受报而已。光研究有没有佛呀，佛灵不灵啊，能不能让我发财、当官呀如何如何，竟打妄想，不知缘来如此，时刻没离开佛，都在佛的法性之中。无量劫造了那么多业，还给做人的机会，给听闻佛法的机会，给正福报的机会等，都是与佛结善缘所结的善果。</p><p>　　这时，佛对法会中诸大菩萨与无漏大阿罗汉等大众说，你们乘愿生于佛法中，已修证成就无学果位；佛现在问你们，你们因地是怎么发菩提心的呢？于六根、六尘、六识入的十八界中，哪根先证得圆通的呢？以什么方便证入正定的呢？</p><p>　　声闻、缘觉、菩萨这三乘，在修行上都是同一法理，须一步一步地往前走；只是在行走过程中，发心不同、证悟不同、愿力不同等。所以，此经既是度众生，又是度声闻、缘觉、新发意菩萨。菩萨乘愿再来，都演绎此经，弘传经义。修行人都受持此经、读诵此经；因离开此经，不知其然又不知所以然。修证过程就是寻找一把开启莲台的钥匙，念四字洪名与念六字洪名的差距也在这里。“南无” 二字就是开启莲台的钥匙，没拿到钥匙，心识不能融入莲台。</p><p>　　憍陈那五比丘起座礼佛后说，我们五人于鹿苑、鸡园修行时，观见佛于菩提树下最初成就佛道。佛成道后便来鹿苑教化我们五人，我们五人是闻佛三转<a href=\"/remen/sidi.html\" class=\"keylink\" target=\"_blank\">四谛</a>的音声，证悟苦集灭道的真谛，而成就无漏的道果。当时，佛问我们五人证悟四谛的真谛没有；我们五人回答，只是初步悟知。佛便给我们五人印证，称名为最初解。音声尘相的本质特征虽虚妄，但佛妙音圆通；我们五人便于佛妙音圆通中，证得阿罗汉果。佛问哪根先证得圆通，依据我们五人的证悟，以音声为最上选择。</p><p>　　憍陈那是释迦牟尼佛往昔修忍辱仙人时，割解忍辱仙人的歌利王。憍陈那做国王时领着一群妃子打猎，妃子们看见修行的忍辱仙人，围着哈哈一笑。国王生气了，以为修行人调戏他的妃子，就命令武士将忍辱仙人割解了。忍辱仙人说，割解我的身体我心不生嗔；由于心不生嗔，忍辱仙人的身体即恢复如初；并发愿将来我成道后，第一个度你。由于意根无嗔恨，心转掉了客尘。憍陈那既是当初护持佛并与佛一起出家的五比丘之一，见佛接受牧羊女的供养后，认为佛不能吃苦，不能成道，五比丘便到鹿苑、鸡园修行去了。有人问，修行就是吃苦吗？这是世间解，修行人不一定吃苦，吃苦未必就能成道。最主要的是依法修行。五比丘如没有佛做指引，忙修瞎练也不能成道。佛住世时，以佛为师，佛不住世，以戒为师。以戒为师还怎么修行，须有善知识引导。修行人都想出离世间，如没有善知识引导，想出离，门都没有。</p><p>　　有人问，五比丘修行为什么证果位这么快？佛住世时佛的弟子依佛法修行，肯修行就成就。依教奉行，才是真行佛法、正行佛法。佛住世时，佛的弟子们听佛音声，就老实修行，很快就证果位。把佛说的法视为最上，不起骄慢，不起疑惑，老老实实、本本分分依佛法行作；所以，才能成道快。现在的修行人为什么成道不快呢？老是骄慢，老是怀疑，老是贪求，老是放逸。</p><p>　　有人问，为什么是末法？六根被客尘所转。一切行作，计较功德有多大，福报有多大。其心没放在佛法上，没放在持戒修行上，而是把我放头前，越往前行越腐化。讲佛法干嘛呢？悟知理义，破我执我见！现在人听闻佛法后，若立即持戒修行，老老实实静坐，八十岁修行都不晚。大迦叶八十多岁才皈依佛，依法修行，现在还在云南鸡足山中住世呢。身体是活的，寿命是活的，只要心坚固修行，一百岁修行也可成就。听闻佛法后，我修过白骨观，观察自己的肉体最后还得留在这个世界，带不走。四大一解散什么也带不走，唯有业力随心识而去。修行白骨观后，就厌离这个世间，知道身体不究竟。</p><p>　　有人问，什么是三转四谛？佛三次去鹿苑，为五比丘说法。一转四谛为，苦是逼迫性，集是召感性，灭是可证性，道是可修性。二转四谛为，苦是你应知，集是你应断，灭是你应证，道是你应修。三转四谛为，苦是我已知，集是我已断，灭是我已证，道是我已修。四谛法是修行人基础，也是大乘法的基础；修行人须从四谛法修起，再心行大乘佛法。哪尊菩萨都是从修行苦集灭道中走出来的，从小乘人过来的，从空苦无常过来的；不要心轻小乘法。</p><p>　　优波尼沙陀起座礼佛后说，我也是观见佛于菩提树下最初成就佛道后，佛教我修行不净观；即观身不净的肿胀想、青瘀想、坏想、血涂想、脓乱想、虫啖想、分散想、白骨想、烧想。便观察自身及众生身不净，产生大厌离心。悟知诸色尘相，都从属于不净；白骨如微尘，最后归入虚空；所以，空相与色相没有差别，而成就无学道果，佛印证我为色性空。心中色尘相既已灭尽，自性妙色难知而圆通。我从观色相不净而证得阿罗汉果。佛问哪根先证得圆通，依据我的证悟，以观色相不净为最上选择。</p><p>　　香严童子起座礼佛后说，我听闻佛教我仔细观察诸有为相，我当时向佛辞行后，便来到一间清静的屋中修行，清淡饮食；见诸比丘于我居住处附近，燃烧沉水木香，香气静无声息的入于鼻中。我观察此香气，不是木、不是空、不是烟、不是火，去没有任何目标可执著，来也没有任何目的可遵从。由此证悟意根对应法尘的识入相销除，而成就无漏果位，佛印证我为香严名号。心中对气体识入的尘相已灭尽，自性妙香难知而圆通。我从观香气无著无碍而证得阿罗汉果。佛问哪根先证得圆通，依据我的证悟，以观香气无著无碍为最上选择。</p><p>　　有人问，怎么修谛观？往这一静坐，心往下沉，鼻观口，口观心；再观察自己气出、气入，这都是有为相。静坐三年，听不到自己的呼吸声，息出息入微细等。</p><p>　　药王、药上二位法王子，带领五百梵天眷属，来于法会；起座礼佛后说，从无始劫来，我二人是兄弟，同在佛前发愿为良医，生生世世救度众生。口尝此娑婆世界的草木金石等十万八千种药，由此悉知各种药是苦酸、咸淡、甘辛等味；如将各种药配伍，各自都发生变化；反应为是凉药或是热药，是有毒药还是无毒药，都能尽知。自从跟随佛修道以来，彻底知药味的本质特征，既不是空无，又不是固定不变。如没有药的味尘时，舌根与味识入等于没有；如离开舌根与味识入，就无法辨别药味。由此证悟舌根对应味尘识入的差别相销除，而证得开悟，蒙佛印证我兄弟二人为药王、药上二菩萨名号；今日，于法会中又为法王子。因观味尘虚幻而证悟性觉智慧，入菩萨品位。佛问哪根先证得圆通，依据我们的证悟，以观味尘虚幻为最上选择。</p><p>　　跋陀婆罗与同来的十六名开士，起座礼佛后说，我们从威音王佛住世时，就闻法出家修行。于每半月一次的僧人沐浴时，我们也随排例顺序进入浴室；于洗浴中，突然悟水的本质特征，水既不能洗灭尘垢，又不能洗灭身体；但于沐浴中，既洗掉了身上的尘垢，又没有改变尘垢与水的本质特征。即水净化或蒸发后，还是清净无杂染的水；身体洗去尘垢后，又产生新的尘垢。根据水的来去，悟得无常；水能洗身垢，不能洗心垢。我因触水而悟道、修道、证道。宿世习气没有忘失，乃至今日，跟随佛出家修行，证得无学果位，佛称名我为坚守。因妄触灭尽，自性妙触显现智慧，入菩萨品位。佛问哪根先证得圆通，依据我们的证悟，以观妄触虚幻为最上选择。</p><p>　　摩诃迦叶与紫金光比丘尼等众起座礼佛后，摩诃迦叶说，于往昔劫中，在此世界有日月灯佛出世，我得以亲近、闻法、修学。于佛灭度后，为感佛恩，我供养舍利，如燃灯一样续佛法光明；并以紫光色金涂饰佛像；从那世开始，于世世生生中，身常是紫金光色。这位紫金光比丘尼等众，是我往昔共同发心的眷属。我观察世间尘相不断的变化坏掉，唯有虚空常住不坏；我们就修观法尘空寂，于观空寂中灭尽身心；并于定空中能度过百千劫的时间，犹如弹指一挥间。我以修观法尘空寂，成就阿罗汉道，佛称我头陀行第一。心中尘相空尽，微妙佛法显现，销灭身心诸漏。佛问哪根先证得圆通，依据我的证悟，以修观法尘空寂为最上选择。</p><p>　　佛住世时，就这一对夫妻出家。二人共同发愿，在贤劫千佛出世时，生生世世都示现夫妻相；再出家做比丘、比丘尼。现在人一谈信佛就害怕，事实上可以夫妻共同信佛修行，共同成就道业。同时，身是紫金光色，为供养佛有此善业果报；而且生生世世身是紫金光色。现在人认为时间很漫长，入定在山洞里，于定空的境界中超越百千劫，不知不觉，顷刻间就过去了。因为没有时间概念，时间概念是人为的。头陀为抖擞，身心苦行为乐。这位摩诃迦叶，现在于云南鸡足山入定，待弥勒菩萨降世，转授佛的衣钵。我于多年前的一次定中，得以亲近这位尊者；于心灵交流中，这位尊者表示，他如骑独轮车的高手；比喻我为骑双轮车的能手；由于我的弘传正法，可有无量出家人与在家人得度。多年来，我不讲此境界，唯恐诸位生疑惑心，业果不可思议！今日讲出，也为弘法因缘。</p><p>　　阿那律陀起座礼佛后说，我开始出家时，经常喜欢睡觉，佛呵斥我“拙拙何为睡，螺蛳蚌蛤类，一睡一千年，不闻佛名字。”我闻佛呵斥为畜生类，啼哭并忏悔自己业障太重，七日不睡觉，双目失明。佛怜悯我，教我修行并证得乐见照明金刚三昧；我不用眼见，用头能观十方世界；实则是真心自性觉观洞开，一观了然；如见掌上一果那么清楚。佛印证我，已成就阿罗汉道。佛问哪根先证得圆通，依据我的证悟，以眼根脱离尘相、<a href=\"/remen/neiguan.html\" class=\"keylink\" target=\"_blank\">内观</a>身心光明为最上选择。</p><p>　　周利槃特迦起座礼佛后说，我记忆力差，没有多闻性；最开始值遇佛，并闻佛说法而发心出家；佛教我忆持四句偈语，“身语意业不作恶，莫恼世间诸有情；正念观知欲境空，无益之苦当远离。”我忆念百日，记前忘后；记后忘前。佛怜悯我愚笨，教我只静坐调出入息，观察自己的呼息粗细差别，乃至呼息穷尽，都产生于瞬间。其心豁然，心无限大和宇宙相通，心空性明，得证阿罗汉果。经常跟随在佛的身边，佛印证我已成就无学果。佛问哪根先证得圆通，依据我的证悟，以静坐反观气息循环的空理为最上选择。</p><p>　　憍梵钵提起座礼佛后说，我有口业，于往昔无量劫为沙弥时，经常嘲弄同修；有一次见一位老和尚吃食物很慢，就嘲弄这位老和尚吃食物如牛一样。一句话造的口业，当即忏悔后，生牛五百世；并世世生生有如牛倒嚼这种病，现在虽证阿罗汉果，但还有余业。佛传授我修一味清净心地法门，对食物不去分别味觉。我便一门深入，证得分别心灭失，入于正定；并于定中观尝味的识入知，没有体态，没有物形，无常、变化、既有、又无。应此一念清净，超越世间诸根欲漏。证悟内无身心，外无世界，远离三界；如鸟出笼，身心离垢销尘，法眼清净，自在神通；成就大阿罗汉道。佛为我印证，已证入为大乘无学道。佛问哪根先证得圆通，依据我的证悟，以心转味识入无分别为最上选择。</p><p>　　毕陵伽婆蹉起座礼佛后说，我从开始发心，跟随佛出家后，经常闻佛说世间空、苦、无常等不乐诸事。于乞食城中，边走路边想事，想自己所修法门，一溜神脚被毒刺扎伤。这时，我感知脚痛时，全身也深感疼痛。虽觉知全身疼痛，而又觉清净心不疼痛，没有疼痛感觉。我又想，一身中怎么能有二种感觉。摄住心念不久，忽然觉得身定心空，经过二十一日，诸漏已尽，成就阿罗汉道。并获得佛亲自印证，并授记未来世当得成佛，已证入为大乘无学道。佛问哪根先证得圆通，依据我的证悟，以感觉迟钝并遗忘身体为最上选择。</p><p>　　须菩提起座礼佛后说，我从久远劫来，已证悟心空无有挂碍，自能忆知如恒河沙劫来受生之事。虽于母胎中，就心知空寂，意根清净，没有入胎之谜；由于身心清净，诸法空寂，乃至十方世界空寂。出生后成人出家，愿让一切众生依法修行，也可证得身心空寂。受佛说法圆融的启示，证悟性觉真空，人法双空，无知而无不知，无见而无不见，成就大阿罗汉道；顿入佛法性真空性海，与佛同一知见。并获得佛亲自印证，已证入为大乘无学道。佛赞叹我证悟心解脱于烦恼，性觉真空于妙有，解空第一。佛问哪根先证得圆通，依据我的证悟，以诸相空尽、又空尽意根法尘为最上选择。</p><p>　　舍利弗起座礼佛后说，我从久远劫来，已证得明心见性清净；能观知自己受生如恒河沙劫诸事，世间的种种变化、宇宙人生的真相等，一见就知圆通法理，获得智慧没有障碍。一次在路上先后遇见迦叶波兄弟二人，并在一起谈论因缘；迦叶波兄弟二人说，“诸法从缘生，诸法从缘灭；我佛大<a href=\"/remen/shamen.html\" class=\"keylink\" target=\"_blank\">沙门</a>，常作如是说。”“一切诸法本，因缘无生生；若能解此者，则得真实道。”听此偈后，开悟心性无际。便开始随佛出家修行，心见性觉的智慧更加圆通，获得大<a href=\"/remen/wuwei.html\" class=\"keylink\" target=\"_blank\">无畏</a>神通自在，成就阿罗汉道，为佛前首座弟子；并悟知，一切得度众生，都是从听闻佛法发心修行，才成就道果。所以，佛子是从佛口生，从法化生；佛从口说法，迷惘的众生才闻法得度；从法化生是佛法愿缘度人，人不度人。佛问哪根先证得圆通，依据我的证悟，以心观智光、智光无极的知见为最上选择。</p><p>　　普贤菩萨起座礼佛后说，我已在恒河沙数佛那里为法王子，周游十方佛国土。十方佛的弟子都是菩萨，佛告十方菩萨修普贤行。并以普贤菩萨名称，建立菩萨十大行愿不管是出家人还是在家人，都要修行普贤行愿，天天都没离开，时刻都没离开，离不开行普贤菩萨的十大愿王。普贤行愿为“礼敬诸佛、称赞如来、广修供养、忏悔业障、<a href=\"/remen/suixi.html\" class=\"keylink\" target=\"_blank\">随喜</a>功德、请转法轮、请佛住世、常随佛学、恒顺众生、普皆回向”。极乐世界菩萨也修普贤行愿。</p><p>　　普贤菩萨接着说，不管是哪个世界的哪一位众生，虽业障深重，不能见身；但只要想修普贤行，我就立刻分身百千万，化身乘六牙白象，暗中去给摩顶加持，默默的拥护安慰，直至成就道业。佛问哪根先证得圆通，依据我因地发心的证悟，以妄心灭失、真心智慧生起、诸根分别自在为最上选择。</p><p>　　发心信佛修行是第一的，若自己不发心，永远不可能成道。只有听到普贤菩萨名号的时候，才知赞叹普贤菩萨，才有可能修菩萨行愿。哪一位修行成道的人，都离不开普贤菩萨的指引，不按普贤的行愿修行，谁也成不了道果。我于定中不只一次观见普贤菩萨的化身，并知受其暗中的护佑加持。普贤菩萨是，累劫愿行不见声，六度万行唯依真。<a href=\"/remen/huazang.html\" class=\"keylink\" target=\"_blank\">华藏</a>世界十愿王，法华会上显圣尊。六牙白象常走动，峨嵋引领后来人。千僧万德入乐土，娑婆诃时感圣恩。</p><p>　　孙陀罗难陀起座礼佛后说，我随佛出家受戒，修行戒定慧三学；但于修行正定中，心常散乱，定不住，前念灭，后念生，老是起烦恼，身心有漏。怎么去除散乱得定呢？佛教我与拘稀罗（舍利弗的舅父），双眼静观鼻端息的白相。即静坐念佛，观气出、气入是什么颜色。我从开始仔细观察时，经过二十一日后，才观知出入息如黑烟。身体不净，内心有是贪嗔痴三毒。逐渐观知身心内生起光明，身心圆通如洞开的世界，周遍虚空而又清净，犹如琉璃一样透澈；再观鼻端，黑烟尘相销除，鼻息形成白色，浊气变为清气。静坐的人细心观察都是这样。不论修行哪个法门，法法平等。只要下功夫修行，哪个法门都是第一，没有第二的。证悟心开智慧，诸漏已尽。诸出入息，化为光明，普照十方世界，证得阿罗汉果。佛为我授记，未来世当得成佛。佛问哪根先证得圆通，依据我的证悟，以观息相尽失、又息相光明灭诸漏为最上选择。</p><p>　　富楼那弥多罗尼子起座礼佛后说，我久远劫来，通过修证，早已具足辩才无碍；即辩法、辩义、辩辞、辩乐说无碍。常为众生说法，对苦、空、无常、不净的法义，深达实相；乃至深达如恒河沙数诸佛秘密法门。而且，于大众中方便开示，说法无畏。佛知我有大辩才，教我如何发挥大辩才的长处，以圆音弘扬佛法。我于佛前，协助佛弘法，因说法无畏，如师子吼；而成就阿罗汉道。佛问哪根先证得圆通，我以无畏的说法妙音，降伏魔障怨贼，销灭诸烦恼，证得无漏；所以，我以舌根说法圆通为最上选择。</p><p>　　优波离起座礼佛后说，我亲随佛离开王城出家，亲观佛于雪山精进苦行六年，亲见佛成道时于菩提树下降伏诸魔军，以法制伏诸外道，于世间证悟解脱，灭尽贪欲诸漏。我承受佛教心地法门，受持戒律，受持身、口、意<a href=\"/remen/sanjujingjie.html\" class=\"keylink\" target=\"_blank\">三聚净戒</a>与行、住、坐、卧三千威仪，受持戒贪、嗔、痴、慢等八万微细行，受持杀、盗、淫、妄四种性戒，受持酒、荤、垦土三种遮业；由于清净持戒修行，身心寂静，诸业灭除，成就阿罗汉道。我是佛法僧众中的纲纪，统领僧众，遵戒、受戒、守戒、持戒，维护戒律威仪庄严。佛亲自为我印证，已证身心清净，为持戒第一。佛问哪根先证得圆通，依据我的证悟，以持<a href=\"/remen/biqiujie.html\" class=\"keylink\" target=\"_blank\">比丘戒</a>证得身自在、再持<a href=\"/remen/pusajie.html\" class=\"keylink\" target=\"_blank\">菩萨戒</a>证得心通畅豁达、最后证得身心圆通、获戒益法益为最上选择。</p><p>　　大目犍连起座礼佛后说，我在乞食途中，遇见优楼频螺、伽耶那提、迦叶波，听闻他们三人说佛法因缘深义后，就发心出家修行；以此因缘，证得广大神通。当时，我来至佛所，请求出家。佛惠施于我，当袈裟着身时，鬓发自落，自然成为比丘相。我证得神通，可周游十方世界，来往自由，没有障碍。所以，佛称我为神通第一，成就阿罗汉道。不但佛赞叹我，十方世界诸佛也赞叹我神通第一；周游十方无碍为圆明，身心不染诸尘为清净，心性解脱为自在，降伏魔怨为无畏。佛问哪根先证得圆通，依据我的证悟，以妄想回归清净、心性智慧发挥作用、如澄清浊水、久习自然成就似清净莹光的道果、意根圆通为最上选择。</p><p>　　大目犍连证得四果罗汉后，见母在饿鬼道受苦，去救母而救不了，请佛为其说法。佛教他于<a href=\"/remen/fohuanxiri.html\" class=\"keylink\" target=\"_blank\">佛欢喜日</a>七月十五这一天，举办<a href=\"/remen/menglanpen.html\" class=\"keylink\" target=\"_blank\">盂兰盆</a>会，超度过去生的父母。佛在众弟子中，唯参加过大目犍连的荼毗，大目犍连怎么入涅槃的呢？是同另外一位尊者乞食回来，在途中见到一些婆罗门人，便对一同乞食的尊者说你先走吧，然后走在后面。这些婆罗门人说，这是佛的弟子，我们一起打他。大目犍连不躲也不闪，直至被打死。有弟子向佛请法说，大目犍连神通第一，怎么能被打死呢？怎么不用神通呢？佛说，神通不及业力。这说明要注重性我的实修实证，而不要注重假我的神通。同时，注重持戒。</p><p>　　乌刍瑟摩为护法金刚神，在法会中礼佛后说，我经常回忆于久远劫前，贪欲心重。当时，有空王佛出世；空王佛说，贪多淫欲的人，可形成猛火集中处；即人身时为欲火所烧，焚其心智，身心狂躁不安；命终后被业火焚其善根，堕大火地狱。空王佛教我观全身各关节与四肢冷暖气动。经过一段时间以定修观，化欲望的外力为神光能量内聚，用智慧之火转化欲望之火，出现清凉风月。诸佛都称呼我名为火头。我以定中生起三昧的智慧火，燃烧掉身心中的欲望火。所以，成就阿罗汉道。并于空王佛前，心发大愿。大愿为诸佛成道时，我愿为金刚力士护法，亲自降伏诸魔怨。佛问哪根先证得圆通，依据我的证悟，以仔细观察身心冷暖触受、三昧智慧于身心中流动无碍、欲火销灭、诸漏已尽、生大宝焰、证无上正觉、转化身心触受为最上选择。</p><p>　　身心中生起的禅悦，都是神光内聚的结果。从全身关节至骨、至髓、至筋、至肉、至脏等；既有无碍周流，又有清凉风月。这都是从修戒、定、慧入手的。无戒就无定，无定就无慧。理论上说心，永远也说不明白，用手术刀拿不到，显微镜下见不着，化验也化验不了，这心多厉害。因心有超世间的部分，不完全是世间的智慧。超世间的智慧用有为法去衡量，标准不真，无法寻觅心迹。正所谓是，命不离性，性不离命，性为命本，命为性用。</p><p>　　持地菩萨起座礼佛后说，我于往昔普光佛时出家做比丘，发愿勤于苦行，利益世间众生。并常于水路交通的必经处，田地险要关隘处等不利通行的地方；如妨碍车马人行凸凹不平狭窄处，我都填平整修路面，修建桥梁，运沙石土木等。这样勤苦修行经过无量佛出现于世，都未失初心。有时遇见老弱病残等人，于闹市或城门处，需要人帮忙提一下物品时，我就帮人运送物品，至目的地，放下就走，不收人财物，不需感谢。庄严劫最后一尊毗舍浮佛住世时，世间多有灾难饥荒，灾民逃荒时，见老弱病残等行走不便的人，我就背负其人行走，不论远近，送至目的地，不取一文。有时牛车陷于泥中，我用神力推劫车轮，为其解除苦难。一次国王设斋筵供养佛，我于当时站立平地处，等待佛的到来；当毗舍浮佛见到我时，佛便为我摩顶加持；并对我说，应平整心地，如自心地平，则世界地都会自然平。我听闻佛说法后，心即开悟。观自身中微尘与构成世界的所有微尘相同，没有什么差别；微尘的本质特征是由微细粒子组成，粒子与粒子之间不相触击摩损，乃至刀兵也无法损坏。我于自心法性中，悟入无生法忍，成就阿罗汉道；并发菩提心，入品位菩萨中，若闻知诸佛说如妙莲花一样的此经时，必开示诸佛知见境界；我必为大众先作为证明，法义准确；并为大众首座，引领大众同修共度。佛问哪根先证得圆通，依据我的证悟，以仔细观身内与世界二尘相同等没有差别、都是法藏世界中众生妄生尘相、证悟内外二尘销除而心智圆通、成就无上佛道、观地大心开为最上选择。</p><p>　　为什么能立刻开悟，因为有累劫修行的功德，不是一生。因果无差为累，天地循环为劫。心一开，立即感知这个世界是有为的世界，心性中有无为的智慧，与这个世界既相容又不相容。</p><p>　　月光童子起座礼佛后说，我记忆恒河沙劫前，有水天佛出世，教诸菩萨修行水观入于正定。我观身中水的本质特征，没有自相排斥处；开始观涕液、唾液之水，以及津液、精血、大小便、全身循环代谢的水为同一，与世界之水以及世间以外的香水海之水都没有差别。我于当时，初始形成水观；于定中只见其水，不见自身。一次在比丘静室里安然禅行，我的一位童徒从窗外窥观静室，只见清水遍于静室，其它什么也没见到；童徒幼稚，取一瓦片投于水中，激水有声，左顾右盼而去。我出定后，立即觉得心痛；如舍利弗于定中遭遇违害鬼击头一样，出定后立即感觉头痛。我想，自己早已成就阿罗汉道，久离病苦因缘；怎么今日突然生了心痛病呢？不能退失道果呀！这时，童徒来至我面前，述说此事经过；我便告诉童徒，再见水时，开门将瓦片取出来。童徒遵从师教，于我入定时又见其水，瓦片还在水中，便开门取出。我出定后，身复如初。我修水观值遇无量佛，至山海自在通王佛住世时，才亡失水观身，入于十方世界诸香水海；与佛法性合为一体，没有差别。现在于佛所得童贞入道，参与菩萨法会。佛问哪根先证得圆通，依据我的证悟，以观水的本质特征都具有流动性、证得无生法忍、再证入圆满的佛道、观水大心开为最上选择。</p><p>　　修行证悟一人一个境界，同门弟子也不一样。有的人坐在那里身如火焰，有的人坐在那里心如静水，有的人嘴香，有的人内觉身体舒畅，有的人头发根发悚，什么样的境界都有。但不管境界怎么样，世间都离不开色声香味触法。水性也属色声香味触法，只不过境界不一样。境界来自于禅定功德，境界又千差万别，但不离三昧。禅行可参话头，也可参水，也可参火，不管参什么，只要是参下去就有成道的时刻。</p><p>　　琉璃光法王子起座礼佛后说，我记忆往昔无量劫前，有无量声佛出世，开示菩萨大乘法义，用自心性觉妙有智慧，观此世界及众生身，都是妄缘，受风力所转化；即一切众生离不开吸氧。我于当时，观世界安立，受风力所持；观世界风动时，与观身活动及静止时，又与观心动念起时，诸活动中风力作用都一样，没有差别。我立即悟知，一切风力摇动，没有任何目标而来，又没有任何目的而去，更没有风力不能至的地方。世间一切颠倒众生，同于十方微尘一样虚妄不实。这样的虚妄不实，可遍及三千大千世界；若三千大千世界为一世界，世界中所有众生，如一器具中，贮有百蚊子，啾鸣乱舞，于一分一寸的空间中鼓噪狂闹，见到光明而飞不出去，由于颠倒狂躁，找不到出口的方向，没有出离的方法，永远没有止息。我受无量声佛教化后，勤修观风妙力不久，证得无声法忍。这时，心智大开，往生到东方不动佛国土，见不动佛；并成就为法王子。于十方诸佛道场奉行佛事时，身心发出清净光明，如观琉璃一样透澈。佛问哪根先证得圆通，依据我的证悟，以观风的本质特征独立存在、又复合存在、悟入自性菩提真心、入于正定三昧、与十方诸佛承传唯一的妙心相契合、观风大心开为最上选择。</p><p>　　虚空藏菩萨起座礼佛后说，我与佛在过去无量劫前，于定光佛那里就已证得身如虚空，非常广大又没有边际；此是报身证悟境界。当时，我手持四大宝珠，光明照耀十方世界无量诸佛刹土；并将身心转化形成虚空身；所以，十方诸佛称我名为虚空藏菩萨。又于自心性中显现大圆镜智，智光清净、无碍、周遍、平等；智光内又放出十种微妙宝光，横流纵灌十方尽虚空际。一切不同星系大宝法王的刹土安立于智光内，涉入在我的身中，我的身同虚空是一体，身心与虚空之间互不妨害，互无障碍；此是法性身成就的境界。我身又能善入无量佛国土，广行佛事，获得大随顺的法益僧益；此是化身成就的境界。这样大的神力，是由因地仔细观察空相而产生；既观察地水火风四大独立存在，又复合存在；众生妄想的生灭，无影无形的独立存在，又复合存在；与虚空没有两样，又与佛国土相同。并依此证悟，获得无生法忍。佛问哪根先证得圆通，依据我的证悟，以观虚空的本质特征没有边际而于正定中圆通妙有智慧、观空大心开为最上选择。</p><p>　　有人问，什么为复合存在？于世间一切物体、一切众生，都不能单一的、纯而又纯的存在；人本身就是一个复合体；如纯金中仍有不纯。再如人与人之间的关系，不是单一的关系，也是复合关系。这种复合关系可比喻为一道数学题；既有方程组合，又有数值的加减乘除，又有解析求证，又利用公式运算等。要处理好人与人之间的关系、家庭关系、团体内部关系以及社会关系等，就要摆正自己在算式中的位置和作用，按加减乘除规则办事，并按公式转换位置，不能任意胡来，扰乱整个算式不能和顺解证。任意胡来是愚痴的人，既伤害自己，又伤害他人。</p><p>　　弥勒菩萨起座礼佛后说，我记忆于往昔无量劫前，随日月灯明佛出家；但那时贪图世间名利，我很在意他人说我好与不好；又专门游历于富贵人与名门旺族之间。当时，日月灯明佛让我修<a href=\"/remen/weishi.html\" class=\"keylink\" target=\"_blank\">唯识</a>观，观想万物唯心妄生，万法唯心所变；从此，按照这个法门一路下去，入于正定三昧中。历劫以来，以此正定三昧力，奉事于如恒河沙数诸佛道场。世间名利的贪欲心歇息，又灭失为空无。至然灯佛出现于世时，我获得成就无上妙有圆满的唯心识定三昧，乃至尽虚空无量佛国土有无净秽，都是我心中变化所现；即有无净秽为心中妄生的分别。由于我明了这样唯心识观的缘故，悟知无量诸佛都是从自心性识中流出而成就。现在获得佛的授记，为次补处佛；即释迦牟尼佛退出教主后，由弥勒菩萨继补，为此娑婆世界贤劫中第五尊佛。佛问哪根先证得圆通，依据我的证悟，以仔细观十方唯心识所生、性识真心智慧圆通、智慧圆通又成就实相、性识真心不再依附于他体而独立存在、又周遍执持无量世界、获得无生法忍、观识大心开为最上选择。</p><p>　　有人问，怎么理解诸佛国土无二无别呢？阿弥陀佛的佛国土和卢舍那佛的佛国土与药师佛的佛国土等都一样清净，无二无别。我们现在见到的是卢舍那佛愿力所化现的国土；为度不同业报众生，佛所化现的国土不同；报身佛的佛国土都一样清净。有人问，本经的开头就找心，找来找去不找了，不知怎么找啦？佛的弟子都在示现找心过程，通过各自修行法门来找心。无论修哪个法门，一路下去都能找到自心。佛只能说心识在十八界处，又离十八界处；佛只能教找心识的方法，不能代替众生找心。佛法有八万四千个法门，修行哪个法门都能明心。如不去修行，永远也不能明心。靠文字经书，靠凝神苦想，这个心永不现前。</p><p>　　有人问，我今生就想成佛可以作到吗？理性即佛可以，但今生就想实际证成佛道是不可能的。须经无量劫的修证，具足无量功德才可以成就佛道。有人问，《妙法莲华经》中龙女怎么即身成佛了呢？龙女在未成佛之前，于龙宫中，只是说受文殊菩萨教化，并没有详述修证过程。只能是人人是佛为理性，护育善念示大同。请君莫问差别事，一体同悲菩萨行。</p><p>　　大势至法王子与相同品位的五十二位菩萨，起座礼佛后说，我记忆于往昔如恒河沙数劫前，有无量光佛出世，于一劫中相继有十二尊佛出世；即无量光佛、无边光佛、无碍光佛、无对光佛、炎王光佛、清净光佛、欢喜光佛、智慧光佛、不断光佛、难思光佛、无称光佛、超日月光佛。其中，最后一尊超日月光佛，教我念佛三昧。比如二人，一人心中忆念另一人，而一人早已将另一人从心中忘记。这样二人似曾相逢，又没有相逢；或似曾见过面，又没有见过面。二人相互忆念，忆念至深；如此忆念至生生世世，同于形影不离的相逢相见，没有不顺差别。十方诸佛怜悯护念众生，如同慈母想念自己的孩子，若孩子逃离，母亲虽想念孩子又有什么作用呢！孩子若想念母亲，母亲也想念孩子，就是历经生生世世，相背离不远，还有再相遇相见的因缘。若众生心能时时忆佛念佛，现在世或未来世，必定遇佛见佛，心性离佛不远，不用另找秘诀，自然证得心开。又如薰制染香的人，身自然沾染香气一样。这种如制香染香的法门，名为香光庄严。我于因地时，以忆佛念佛心，证入无生法忍。现在于此世界，摄受并接引证悟心开的念佛人，归于西方极乐净土。佛问哪根先证得圆通，依据我的证悟，以都摄六根、净念相继、得入正定、念佛心开为最上选择。</p><p>　　现在有的修行净土的人光知前段话，不闻后段话。将六字洪名改为四字洪名，不须静坐，说容易着魔等。断章取义，误人误己。都摄六根就得静坐念佛，参禅密行之人，如离开都摄六根这四个字都一事无成。不都摄六根不出现净念相继，更不能证入正定三昧；净念和念念不一样。念念是五蕴炽盛，大脑思维念。净念是心识在念佛，也就是心识念佛。出现净念的人，身体在那睡觉，心识在静坐念佛，那才是净念相继。大脑念六字洪名，不是净念相继。死人的大脑，还会净念相继吗！清清净净的心，念佛声声不断震娑婆。全世界都知道，大势至菩萨说佛接引的是这样的念佛人，不光是肉身的念佛人。现在一些人就挑省劲的来，费劲的不行，念六字还觉得费劲，只念四字。四字洪名只结法缘，不要妄想用最小的投入，获大回报；甚至有人只念三个字，弥陀佛。这等于顺口溜，不如法。一定要知道“都摄六根，净念相继”八字纲领。不管修行哪宗哪派都离不开这八个字，离开这八个字去不了极乐世界。参禅的人离不开净土，修密的人也离不开净土，必须持佛名号，持咒也如同念佛名号。静坐念佛，一路下去，达到净念相继，佛菩萨一定接引。没快没慢，只要身心功夫到了，一切自然显现。身心功夫不到；那个销息永远也没有，销息不是外来的，是内心中产生的。所以，修行净土的人一定要记住都摄六根这四个字，千万别怕腿疼，千万记住静坐念佛太重要了。否则，白白浪费这一生的时间，只种点善根，分明能拿一桶金子回来，结果空手而归。贪求省事继续贪，再来一回六道，多少世、多少劫过去了。大势至菩萨说的是净土法门，净土就是佛国土。一定要记住净念和念念不一样，念念往生困难。念念净念本不同，念念相续五蕴中。净念相继来自定，都摄六根是纲领。尸寒神痴早忘念，净宗送君助念团。不是自念不保险，净念无痴则不然。今生修行欲往生的人，那就静坐念佛，来不得半点虚假，只有笨功夫，没有巧招，巧招是逗自己玩呢。实际大势至菩萨说的法最好，众生愚顽，耍小聪明最误人。只有静坐念佛才能达到那个境界，不静坐念佛达不到。十念往生指的是静坐念佛的心念，一念就是十念、百念、万念；一念生起时，就是百念、万念，想断开是不可能的。佛、菩萨接引的时候，一念六字洪名入莲台，声声不断，断不了。十念为一念，一念生万念，净念功德满，接引最关键。往生极乐世界，是佛菩萨接引，而不是自己去的，自己去不了。净心一念难，临终业现前，体苦赛熬煎，痴醉不知念。这就是修行人说了句最实在的话，没有平时都摄六根，念不起来。为什么念不起来，人要死时业力现前，体苦赛熬煎，那身体的苦处太难忍受了。有人认为病苦是最苦的吧，实际不是；人这口气一断，心识在体内没有出离前，大脑的电波还存在，体温下降冰冷，那个苦如生龟剥皮。平常人死时，心识如痴如醉，儿子也不认识了，比精神病还疯颠多少倍。我讲一些境界，容易理解，定能生净念。定哪里来的，都摄六根来的。三昧在生前，人活着时没得念佛三昧，死了还有得三昧的可能吗！所以，人活着时加倍干，念念不间断。才能逐渐通往净念，念到心空的境界。大势至菩萨说都摄六根去念佛，观世音菩萨说闻思修，修空。什么是空？四大皆空是身空，觉得身体不存在了，一静坐，手没了、脚没了、身体没了，头没了，整个身体化入虚空不存在，就感知心中一声佛号，这是身空。五蕴皆空是意空，静坐时，不知是在哪里，只感知一句佛号，没有了我想，这才是意空。森罗万象和善恶都离开了，不去分别，又都觉知，这才是心空。空而不空是性空，菩萨是空而不空，不再来了而又来了，觉悟有情来了，才是不空。空中存妙有？化身是妙有，身有喜乐是妙有等。\t\t\t\t</p></div>"
},{
    "title": "【大佛顶首楞严经卷六】",
    "author": "净慧大师",
    "date": "",
    "html": "<div class=\"B1_text\"><h2>【大佛顶首楞严经卷六】</h2><p>　　这时，观世音菩萨起座礼佛后说，我记忆于往昔如无数恒河沙劫，当时有观世音佛出现于世。我于观世音佛前发菩提心，发愿成道后也号称观世音。观世音佛教我从闻思修开始修行，得入正定三昧中。我因地从闻佛法修证，于正定三昧中观入生死流的根本所在；所入正定三昧观心性本自寂然，闻所对应的动与静二尘相，既了然觉知，又如如不动，不为尘相所扰。随着这样渐修，定力增益，达到无闻而闻，不闻尽闻；有觉而觉空，觉空无极限而圆通；如觉空之空觉灭失，生灭根本随即灭失，寂然无生无灭境界现前。哪个法门都离不开闻思修。行菩萨道的人，读经、听法、心受是闻；证悟、觉了、妙义是思；戒行无作、广行慈悲是修。而初行人一听、一思，知一个法门静坐念佛，就等于闻思修了。从闻思修入手，既简单又重要。</p><p>　　观世音菩萨接着说，于寂然无生无灭境界中，忽然间心识性觉超越世间与出世间名相，十方世界无非是自性中妙有的圆通智慧；获得二种殊胜；一是上合十方诸佛本自妙有的性觉识心，与诸佛的慈悲之力，契合为一体。二是下合十方一切六道众生的心性，与六道众生的心性一体同悲，一体同仰佛恩。</p><p>　　观世音菩萨与六道众生的心性一体同悲，一体同仰佛恩。所以，观世音菩萨证妙觉品位后，倒驾慈航，度脱十方世界苦难众生，有求必应。观世音菩萨对众生的恩惠太大了，人人受之恩惠。在修行过程中遇到苦难，称念观世音菩萨，能获得护佑加持；修行功德不够，念诵《大悲咒》可增福德等。</p><p>　　观世音菩萨接着说，由于我亲近供养观世音佛，承蒙观世音佛传授于我，空、无相、无愿的广大慈悲的金刚三昧。由于我与佛慈悲力同一的缘故，仗佛威神而成就三十二应身，入一切佛国土度脱众生。如一切行菩萨道的人得入正定后，于世间继续修行戒定慧三无漏学，欲心悟现在世中殊胜难解圆通的佛法；我就现佛身为其说法，赞叹慈悲喜舍，让其成就佛道。如一切有学的声闻人，喜乐寂静，求证世间无生智慧，欲心悟现在世中殊胜难解圆通的佛法；我就现辟支佛身为其说法，让其从见思二惑中得以解脱。如一切有学缘觉人，欲求断除十二因缘的智慧，欲心悟现在世中殊胜难解圆通的佛法；我就现缘觉身为其说法，让其从缘生可灭的分段生死中得以解脱。如一切初闻有学而证苦集灭道空法的人，从一果、二果罗汉再继续修证入有余涅槃的道果，欲心悟现在世中殊胜难解圆通的佛法；我就现声闻身为其说法，让其从世间诸漏中得以解脱。如一切众生，欲求明心开悟，获得身心清净，我就现梵天王清净身为其说法，身口意不犯贪欲尘相的戒律，让其从世间贪欲烦恼中得以解脱。如一切众生，欲求做忉利天主，统领三十三天天众。我就现忉利天主身为其说法，广修清净十善业道，尊敬佛法僧三宝，让其得以成就天主威德。如一切众生，欲求身得自在，游行十方国土。我就现自在天天人身为其说法，广修十善业道，多行布施而积福，让其满足愿望。如一切众生，欲求身得自在，于虚空中飞行往来无碍。我就现大自在天天人身为其说法，广修十善业道，赞叹佛法僧三宝功德，让其满足愿望。如一切众生，喜爱统领鬼神，救济保护国土。我就现忉利天大将军身为其说法，拥护佛教，维修塔庙，让其满足愿望。如一切众生，喜爱统领世界，保护众生。我就现四天王身为其说法，受持八戒，保护<a href=\"/remen/liutong.html\" class=\"keylink\" target=\"_blank\">流通</a>经典法物，让其满足愿望。如一切众生，喜爱生往天宫，驱使鬼神。我就现四天王长子身为其说法，不杀、不盗、不淫、不妄语、不饮酒，让其满足愿望。如一切众生，喜爱人间国王。我就现人间国王身为其说法，济弱扶贫，公正善行，让其满足愿望。如一切众生，喜爱做部族长老，受人拥护爱戴。我就现长者身为其说法，正语、正业、正行、正命，让其满足愿望。如一切众生，喜爱谈论名言语句，清净自居。我就现居士身为其说法，正知、正见、正念、正身，让其满足愿望。如有男人，志愿出家，受持清净戒律。我就现比丘身为其说法，世间空、苦、无常、不净，赞叹梵行，让其满足愿望。如有女人，志愿出家，受持清净戒律。我就现比丘尼身为其说法，世间空、苦、无常、不净，让其满足愿望。如有男人志愿受持<a href=\"/remen/wujie.html\" class=\"keylink\" target=\"_blank\">五戒</a>，修行十善业，我就现优婆塞身为其说法，持戒积福，善业生天，让其满足愿望。如有女人志愿受持五戒自居，修行十善业，我就现优婆夷身为其说法，持戒积福，善业生天，让其满足愿望。如有女人志愿清闲，相夫教子，主持家务内政。我就现家庭主妇身、国王夫人身、女教师身为其说法，赞叹贤良淑德，让其满足愿望。如有男子，志愿保持童贞之身。我就现童男身为其说法，赞叹清净身行，让其满足愿望。如有处女，喜欢处女身，不求婚恋。我就现童女身为其说法，贪欲为苦，淫身不净，让其满足愿望。如有一切天人，志愿离开天界，求于梵行或拥护佛法。我就现天人身为其说法，广说出家因缘，赞叹护法功德，让其满足愿望。如有一切龙趣，志愿离开龙趣，求于梵行或拥护佛法。我就现龙身为其说法，广说出家因缘，赞叹护法功德，让其满足愿望。如有一切药叉类，志愿离开药叉类，求于梵行或拥护佛法。我就现药叉身为其说法，广说出家因缘，赞叹护法功德，让其满足愿望。如有一切干达婆类（乐神），志愿离开干达婆类，求于梵行或拥护佛法。我就现干达婆身为其说法，广说出家因缘，赞叹护法功德，让其满足愿望。</p><p>　　佛入涅槃后，佛菩萨度人，一般现僧像为人说法；而现佛像说法的，那就是魔。佛现佛像是为诸天王、诸菩萨说法，不是为世间众生说法。龙是乘急戒缓，受了菩萨戒而不行菩萨道，破戒堕落龙道。我提醒诸位，做不到的事不说；做到的事，十分说一、二分。千万不要做了一分说十分。说到做不到，最可怕；一句话可毁一生福，也可毁一世道。现在世间有没有龙王，我准确的讲，有！科学家为什么不能发现，因为龙有神通，龙宫非常明亮。受化人形的龙王邀请，我去过龙宫；又受到九龙护法。一些行善积德的人，死后到地府去做鬼差，地府一个培训班，观世音菩萨亲自说法，地藏王菩萨亲自主持。培训后才有资格做城隍、土地等神；所以，财神、山神、土地都有功德，都具有神力；修行人能够平安的静坐念佛，有诸菩萨、龙神、山神、土地、城隍、地空夜叉、四天王、灶王等护佑，只是在冥冥之中不知而已。有人想做点坏事，瞒这个、骗那个，结果是谁也瞒骗不了，只瞒骗自己。清净善念震娑婆，恶事一件自己录。昨天一位八十岁的老人说，听法太好了，这法怎么这么妙啊，叹未曾有，为闻知法妙太晚而追悔。而现在四、五十岁的人都在做什么呢？还在迷茫中，为追求人生而忙碌。</p><p>　　观世音菩萨接着说，如有一切阿修罗趣，志愿离开阿修罗趣，求于梵行或拥护佛法。我就现阿修罗身为其说法，广说出家因缘，赞叹护法功德，让其满足愿望。如有一切紧那罗类（疑神），志愿离开紧那罗类，求于梵行或拥护佛法。我就现紧那罗身为其说法，广说出家因缘，赞叹护法功德，让其满足愿望。如有一切摩呼罗伽趣（大蟒蛇神），志愿离开摩呼罗伽趣，求于梵行或拥护佛法。我就现摩呼罗伽身为其说法，广说出家因缘，赞叹护法功德，让其满足愿望。如有一切众生，喜欢人身，于人中修行佛法。我就现人身而为说法，少欲知足，利乐人天，出家修行，让其满足愿望。如一切非人类有形与无形、有想与无想众生，志愿出离各趣。我就各现应其身而为说法，因果循环不爽，失人身易，得人身难，让其满足愿望。这是妙有清净的三十二应身，入一切国土，以广大无边慈悲的金刚三昧无作妙力，救度无量众生，获得身心自在，成就道业。</p><p>　　我曾对诸位讲过，脾气大的人要注意，如不转化，堕落修罗身，生生世世去斗，没有尽期。什么时候把人的棱角、脾气磨没了，转化了，才能免离这一道。人有脾气，只能是与自己过不去，跟任何人都没关系，自负因果；所以，赶紧弃转习气；否则，自尝苦果。紧那罗是忉利天乐神，头上长一个犄角，唱歌、弹乐好听。摩呼罗伽就是大蟒蛇神；嗔恨心重是蟒蛇之因。有两条过万年的蟒蛇，通过人身向我请法，我为其讲如何弃转习气。二条蟒蛇听法后，求我二件事，一是免除蟒蛇的业报，能转世为人；二是求我住世，转世为人时再拜我为师。我答应请求后，求地藏王菩萨慈悲，给予它们转世为人的机会；并同意二十年后为人时收为弟子。二条蟒蛇听完后，叩头礼拜，立刻离开人体，并舍弃蟒蛇身，到地府接受转世为人的因缘。我不忘观世音菩萨累劫救度之恩，真实地写下了这一段普陀颂，前世有幸皈观音，修持当下活死人。扪心自问何所有，清风明月一乐身。一切供养皆有为，存世色像亦非真，累劫救度无以报，净念弥陀酬师恩。慈悲行愿为最尊，无慈无悲失慧根。五体投地拜师德，心随万行正法明。言真意切总是假，心心相印一灵真。金鸡报晓玄关外，昆仑顶上见故人。</p><p>　　观世音菩萨接着说，我以广大慈悲的金刚三昧无作妙力，与诸十方三世一切六道众生，一体同悲，一体敬仰佛法僧三宝的缘故；凡一心称念“南无观世音菩萨”名号的众生, 都能从我的身心中获得十四种无畏功德的力量。一是我虽不自观音声，又具足以智慧观一切众生的音声；能护佑十方受苦难烦恼的众生，观其音声，寻声救苦救难，立即获得解脱。二是知见回归于心性中，能护佑遭遇火灾的众生，逃离火难。三是听闻回归于心性中，能让遭遇水灾的众生，脱离水难。四是因已断除妄想，心中没有杀念，能护佑误入罗刹鬼国的众生，不受罗刹鬼的伤害；罗刹鬼的伤害为，多造成空难、海难、重大车祸等。五是心性反闻而又遍闻，六根销妄复真，同于闻声；能护佑众生遭遇杀害时，杀人的刀段段折断，使杀人的武器如割水、吹光一样失去作用。六是心性反闻而具足智慧光明，遍照十方法界；就使一切幽暗的本性功用不能自全而失效力，能护佑众生，让那些虽能近身的恶鬼类，目不能见或不敢见；如药叉、罗刹为食人肉鬼，鸠槃茶鬼乘人熟睡时魇人，毗舍遮鬼啖人精气，富单那鬼使人生病等。七是音功用的本质特征即圆通具足闻，声动尘相与音静尘相又销失；观听功用返入心性，远离诸妄尘相。能护佑众生不受禁闭、系缚、颈枷、锁链的约束。八是灭失对音声善恶的分别，离善离恶又圆通具足闻，对无处不在的善恶音声生起平等的慈悲心。能护佑人经险路，强贼盗匪不能抢劫。九是圆通具足闻又远离色尘相，心性不能被色尘相所拢动伤害。能护佑一切贪求多淫的众生，远离贪欲之苦，得身心清净之乐。十是具足闻音声，既没有杂染，又没有尘相；心性中无根之根的境界圆融，没有相对的一切对立。能护佑一切愤怒嗔恨的众生，远离嗔恨挂碍之苦，得心态平和之乐。十一是自性真空的无碍智慧中，销除一切尘埃相，身心融入法界为一体，犹如琉璃朗明清澈无碍。能护佑一切心智昏暗、心应迟钝、心理障碍、心念无善等众生，永远远离痴障之苦，得心灵朗明之乐。十二是自性真空无形体，又闻音圆融而化现一切形体；自性虽住不动道场，分身却能涉入一切有情世间与诸佛不坏世界，能于一时普遍供养十方无量诸佛，能于诸佛身边为法王子而续佛慧命；并能护佑一切无子众生，求男便得有福报、智慧之男。十三是六根妙用圆通，六根智慧功用没有二样，能含藏十方法界；并于十方法界安立大圆镜智；又于如虚空的法藏世间中，承传顺从无量诸佛救度众生的秘密法门，受领后一一铭刻而不能忘失。并能护佑一切无女的众生，求女便得端庄、柔顺、受敬而有福报之女。十四是在此娑婆三千大千世界中，有百亿个日月星系；在这些星系所居住的众生中，现在有住世法王子六十二恒河沙数，示现修行佛法，实则是垂范示教，用言行教化众生，以方便智慧随顺众生等，示现方式各个不同。由我所证得圆通的无根之具足根中，开发妙耳之门；再以身心微妙的智慧，周流遍至的含藏法界。能护佑持我名号的一切众生，与诸法王子福报相等而没有差别。众生持我名号，与持诸佛、菩萨名号所得功德，没有任何差别。这就是我修证获得的真正圆通；并以此法施的十四种无畏力，利益<a href=\"/remen/fuhui.html\" class=\"keylink\" target=\"_blank\">福慧</a>众生。</p><p>　　观世音菩萨有十四种无畏功德，称念观世音菩萨名号，与观世音菩萨结缘，就寻声得度。观世音菩萨住此娑婆世界中，在地球上，有普陀道场。遇到大火时，真心称念南无观世音菩萨，可逃离火难。遇到洪水时，称念南无观世音菩萨肯定活命。遇到无形的鬼类，头皮发悚，称念南无观世音菩萨立刻躲开。在战场上称念南无观世音菩萨，能躲开刀枪；一位将军，因平时称念南无观世音菩萨，一天夜里，正在床上睡觉，有人要暗杀他，突然觉得有个穿白衣的人，在他身前一抖，再<a href=\"/remen/jiandi.html\" class=\"keylink\" target=\"_blank\">见地</a>下有三把飞刀。他想要是没有观世音菩萨护佑，自己已被暗杀。所以，他为报恩在吉林市建了一座观音古刹；古刹仍存。观世音菩萨不是像上的观世音菩萨，是真实存在而又无相的观世音菩萨，只要诚心去念，就时刻护佑的观世音菩萨。有冤案或有牢狱之灾的人，称念南无观世音菩萨，很快得到昭雪或赦免。在险道、飞机、轮船上称念南无观世音菩萨，皆得平安。经常称念南无观世音菩萨的人，恶人、恶事自然远离。经常称念南无观世音菩萨，能守住清净戒律。好争斗、爱生气的人来脾气时，实在忍不住了，称念南无观世音菩萨，念念感到清净了，想开了，不生气了。一时可以转化，但不能从根本上转化。如想彻底转化得靠静坐念佛、积累善根。只有身心转化才能从根本上转化；否则，只是一时转化。愚笨的人称念南无观世音菩萨，慢慢就变得聪明了；称念南无观世音菩萨的人，求男得男，求女得女。修行人没有观世音菩萨护佑，太难成道了，有福报不足和业习烦恼等，障其修行路。所以，有的人称念南无观世音菩萨，有的人诵持大悲咒等，各依自己所修行的法门。观世音菩萨能施十四种无畏力，是一种神力，冥冥之中化解业力。有人被恶人跟踪，就称念南无观世音菩萨，也不知从哪来了个人把恶人惊吓走了，看似是一种巧合，实则是灵应。</p><p>　　观世音菩萨接着说，我因获得真正圆通，修行证得无上佛道的缘故，成就四种不可思议的无作妙德。一是由于我开始获得妙有妙觉的智慧心时，真心自性中尚遗留闻知的影子；此即菩萨的一念无明未破。对见闻觉知不能彻底分开隔离，便形成见闻觉知为一体的圆融清净宝觉；所以，我能化现无量众生惟妙面容，能说佛无量无边的秘密神咒。于其中可化现一首、三首、五首、七首、九首、十一首乃至一百零八首、千首、万首、八万四千坚固不坏首；还可化现二臂、四臂、八臂、十臂、十二臂、十四、十六、十八、二十、二十四乃至一百零八臂、千臂、万臂、八万四千结手印的臂；还可化现二目、三目、四目、九目乃至一百零八目、千目、万目、八万四千清净宝光目。清净宝光目中，可化现慈悲相、威严相、定境相、智慧相等，以大自在力救护众生。</p><p>　　真佛无形，观世音菩萨与十方诸佛一样，圆通无碍。人人修行，也可以证得，自性圆融，证得无上智慧。人人自性中都有这个菩提种子，只是需要水份、阳光、土壤等条件，也可以发芽、成长、成熟；诸条件是人的善行功德。<a href=\"https://www.guang5.com/fxrm/fxcs/341370.html\" class=\"keylink\" target=\"_blank\">千手千眼</a>，每一只手代表一种能量，每一只眼代表一种智慧，神力不可思议。观世音菩萨救护人，可见大悲咒图解，或现鬼王身、天王身、或带孔雀兵等，以大自在智慧救护众生。</p><p>　　观世音菩萨接着说，二是由于我真心自性中，所闻所思已于六尘相中获得解脱，如音声透墙体一样，不为障碍。所以，我的妙有自在力可化现一一形体，各能诵持一一秘密神咒，其形体与其咒力能施无畏于众生。以此缘故，十方无量世界的众生，都称我为施无畏的菩萨。三是由于我已修证真心自性中具足的妙有、圆通、清净，凡我游历的十方世界中，能诵持南无观世音菩萨的众生，都能舍身爱珍宝，求其哀悯，护佑平安、吉祥、安乐、健康等。</p><p>　　有人问，诸天王也求观世音菩萨护佑吗？诸天王等，也是众生，自知多大的权力也是暂时的。诸天王既求观世音菩萨护佑国土安宁，也求增长福慧功德，往生极乐世界。诸天王护佑众生，也拥护佛，拥护法，拥护僧。诸天王认为佛是至高无上的，是真正的宇宙主宰。修行人都在唤醒自性观世音，不是想的大而是自性与观世音菩萨无二无别。称念南无观世音菩萨，是让慈悲在心里扎根，知自我怜悯，不能在六道里轮回了；可哀悯的是自己无福德、慧德。</p><p>　　有人问，哪方受灾时，求观世音菩萨护佑吗？我从来不敢求观世音菩萨护佑什么，自己能去做的事情自己去做，实在做不到的，称念佛、菩萨圣号，产生多大的功德就回向多少，不强求所难。自己有那么大的功德，求佛、菩萨替承担业报吗？如自己欠他人财物，能求观世音菩萨替还债吗！对受灾的灾民要如法行作，可以捐财物解难；可以捐身力解难；可以举办法会，用产生的功德回向解难。</p><p>　　观世音菩萨接着说，四是我获得与佛同一心体，证于诸佛智慧的究竟境界，能于心中化出种种珍宝，上供养十方诸佛，下布施法界的六道众生。于六道众生中，如有人求妻可得妻，求子可得子，求长寿可得长寿；如有修行人求证入三昧可得入三昧，乃至求证悟诸佛不生不灭的境界，都可证得入不生不灭的境界。佛问哪根先证得圆通，依据我的证悟，以三昧中耳门圆通、光明普照、证悟与佛同缘生缘起、心得自在、慈悲为因而入涅槃流、于空无相无愿中得入正定、成就无上佛道为最上选择。观世音佛赞叹我善得圆通法门，于法会中授记我为观世音菩萨名号。由于我观听十方法界圆通无碍，光明遍照；所以，观世音菩萨名也遍十方法界。</p><p>　　菩萨行人的境界是供养六道众生，观世音菩萨的愿力，谁要老实信佛修行，想往生极乐世界，业报我皆代受。正所谓，三世如来一体同，累劫修心果自成。一光化现诸实相，慈悲喜舍度众生。有人问，怎样理解随业流转呢？不<a href=\"/foxue/changshi/153408.html\" class=\"keylink\" target=\"_blank\">修定</a>入不了三昧，不入三昧，产生不了智慧。没有智慧的人，不想脱生猪马牛羊等三恶道，也得随业而去，自己决定不了。不让自己的头发长，行吗；晚上睡觉不让自己做梦，行吗，都做不到。心识一离体，如聋如痴。死者家里又大办丧事，车油费、喝酒食肉的帐都算在亡人身上，致使亡灵业报加重。因为本身在世时，没教子女行善；所以，善有善报，恶有恶报。人的心识完全随业力召感，人的思维想这个那个，到地府的转轮处那没人听；再说心识不能选择，也没有那个能力选择，都是迷迷糊糊的苦受，随业流转。</p><p>　　这时，佛于师子座上，头、二手、二足五体同放宝光，远灌十方无量诸佛顶、诸法王子顶、诸菩萨顶；十方诸佛也于五体同放宝光，从无量世界各方来灌释迦牟尼佛的顶及法会中诸大菩萨顶、诸阿罗汉顶。这时，祗陀园中林木、池沼等，都演奏出梵呗妙法音声，无量佛光交织与宝丝网相似。所有大众赞叹从未见过，并普遍获得坚固不坏的金刚三昧。随即百宝莲花与青、黄、赤、白、各色天花如天雨一样，五色交错，异彩纷杂。此娑婆世界山河大地，同时隐没不现；唯见十方无量国土合成一个世界，梵呗咏歌，自然演奏。于此同时，佛对文殊师利菩萨说，你现在观这二十五位诸大菩萨与无学阿罗汉，各说因地修行与证道方便，都说真实修行能证悟圆通。他们的修行法门，实际上没有优劣之分，也没有先后差别。</p><p>　　这是什么法义？我对诸位讲，佛现的是一真如法界，毗卢遮那法性身，娑婆世界一小真。森罗万象法中物，虚空无碍性如真。佛佛法身同，虚空互相通。众生含灵动，觉者一真行。恭敬一佛，就是恭敬十方诸佛；供养一佛，就是供养十方诸佛。佛愿力化现一真如法界，现不同世界，既让众生了业，又让人转迷觉醒。修行人证悟后，用心去观察这个世界，才知周围的一切物体都在说法。用有求心，诵持观世音菩萨圣号，是凡夫行的有为法；证出世间智慧修无为法时才知，修行人的化身成就，是地藏王菩萨成就化身的愿力，观世音菩萨成就化身的慈悲力。修行人的法性身成就，须到文殊师利菩萨佛国土去成就。在世间，文殊师利菩萨示现智慧；在出世间，法性身离开娑婆世界时，就到文殊师利菩萨的佛国土。在文殊师利菩萨的佛国土，听闻文殊师利菩萨的法音。法音没有语言文字，文殊师利菩萨也不用口说法，用心去闻知文殊师利菩萨的法音。人在世修行，有佛法可学，有众生可度，也有佛道可成。出世间脱离众生相，脱离我相时，是上无佛道可成，下无众生可度；无想无相无成佛的执著心，受愿力牵引，自然就来救度众生，也自然成就佛道。另外，修行没有优劣、前后的差别，现在修行不晚，当下就种善根，当下就开始起步。迈出第一步，就有第二步，第三步；没有第一步，永远没有第二步。所以，当下第一步很重要。无始劫来在六道中追索，追索到什么了，只是业随身，万事转头空。人信佛可有先后，而佛法没有先后；习气有优劣，自性没有优劣；修行不分先后优劣差别，只在当下一念心。修行人一门深入，就是门门深入，就是无量法门誓愿学。开始时是一门深入，当道业有所成就时，无量法门都要学，不学不知法理，无法弘法利生。无量法门誓愿学是证得无学而学，一法门通，一通百通。修行要有顺序，分清不同阶段，不要执著于自我的一管之见，要和实际修行相吻合。修行要找善知识，只有走过这条路径的人，才能引导人走出迷途。</p><p>　　佛接着说，佛今天想让阿难早日开悟；这二十五个法门哪个更对阿难的根基呢？将来佛灭度后，这个世界的众生入菩萨乘，成就无上佛道，有什么方便法门，让众生容易成就呢？文殊师利菩萨奉佛慈旨，当即从座而起，礼佛后仗佛威神用偈说，性本觉悟，圆通妙智；如宇宙智海，包藏世界，无有边际。本性圆明妙智，却被无明业习牵入有形众生，根尘妄见又将自性遍照光明遮蔽，不能恢复智慧功用。如用自性之光观照无明，烦恼立刻销亡。业报众生由迷转妄，召感轮回生死的有为世界，沦为无常之体的知觉众生。无知无觉乃是真知真觉，有知有觉是假知假觉。假觉是无常变化，真觉是佛菩萨境界，性是真觉。性在众生身体里，众生觉察不到；性也觉察不到，众生身体只随心识流转。真性脱离知觉又具足妙觉。但是，没有圆满功德之前，性随无明，空在佛法性觉海之中，如海上的漂浮物，随波逐流，在三界中轮转生死，又有三恶道之苦。若性返本还源，佛性与众生性是一，同样具足圣性，没有区别。性返本还源的方便法门很多，有顺修逆修，都是同往圣性圆明的方便法门。但是初发心时，根据根基不同，有易入难出，也有难入易出；才有快慢不同，不能同时出离。</p><p>　　文殊菩萨接着说，色与妄想结合形成尘相识入，眼根功用不能观察透澈，只能分辨明与暗；因地发心怎么依此没有智慧的观察，而能早日获得圆通呢！音声代表杂乱的语言，又可产生很多名句的文字；一字一句的尘相，不能含藏一切真实法义；因地发心怎么依此杂乱的尘相，而能早日获得圆通呢！香气与鼻根相互和合才能识入觉知，如根与尘相分离，就不能有觉知；鼻根对香气的觉知，不能是恒常不变；因地发心怎么依此无常的尘相，而能早日获得圆通呢！味的本质特征不是固定不变的，要与舌根和合才能有识入觉知；舌根对味尘的觉知，不能是恒一不变；因地发心怎么依此变化的尘相，而能早日获得圆通呢！触尘与身触和合才能有识入觉知，没有识入就不能觉知，合与离的本质特征不能确定；因地发心怎么依此不确定的尘相，而能早日获得圆通呢！法尘与意根相对应为内尘，内尘要凭外尘才能有觉知，内尘对外尘的觉知是有选择而不是普遍涉入；因地发心怎么依此有选择的尘相，而能早日获得圆通呢！眼见的功用虽洞察自然，但见前不能明后，东西南北四维亏缺一半；因地发心怎么依此有亏缺的尘相，而能早日获得圆通呢！鼻根的呼吸取决于通畅，出入息时有交替产生，交替中有片刻停止，支离不完整，强停无法抗拒；因地发心怎么依此不完整的尘相，而能早日获得圆通呢！舌根对味是有所选择，并因味尘生起识入觉知，离开味尘就一切无所觉知；因地发心怎么依此相对应的尘相，而能早日获得圆通呢！身根与触尘相同，各自都不能圆觉自观，各有边际又不能冥合；因地发心怎么依此不能冥合的尘相，而能早日获得圆通呢！意根杂思乱想，不能有清净时，妄想妄念不能脱离；因地发心怎么依此不清净的尘相，而能早日获得圆通呢！识入产生于根、尘、对应三种杂和合，寻其根源没有体相，自体属虚妄不真实；因地发心怎么依此虚妄的尘相，而能早日获得圆通呢！心识能听闻观察十方世界，须有大因缘力，才能证悟明观心识，因地初发心不能证悟；因地发心怎么依此没有大因缘力的尘相，而能早日获得圆通呢！观想鼻端白气本来是权巧随机的方便，只能摄心静止，不生散乱；但有执著心，又不能长久摄心静止；因地发心怎么依此执著心的尘相，而能早日获得圆通呢！说法是鼓动音声和文字，须是无量劫的修行，证悟道业成就后，才能语言文句没有漏失；因地发心怎么依此鼓动音声和文字的尘相，而能早日获得圆通呢！持戒与犯戒都是约束身口意，没有身口意时怎么约束，本来不能周遍一切处；因地发心怎么依此不能周遍一切处的尘相，而能早日获得圆通呢！神通本来是宿世修行因缘所证得，与法理分别上没有关系；况且神通又缘于身体和意识，没有离开物相；因地发心怎么依此没有离开物相的尘相，而能早日获得圆通呢！</p><p>　　客尘是色受，心性虽然具足智慧，但是缺乏功德不可能彻悟圆通。由于客尘烦恼遮蔽自性，众生见无常色相而生有常想，音声杂染，分不出真假，真话少、妄语多，增加客尘。香味触法也都如此，贪著哪一尘，自性都不能明澈。六尘对六根的识入是对自性遮蔽与缠缚。自性中没有六根，但又具足识性智慧。听闻佛法是去迷妄，让心静一静。心静是由身体变化而证得，不转化身体的人，说心转化了，根本不可能，不能成立。彻知彻觉的人，都是从修行身体转化而来的。由眼耳鼻舌身意转化，才能趋于明心见性成道证果。否则，喊破喉咙我是佛，没人相信，自己都不相信，充其量是一个皈依的佛弟子。业力没转化，还在六道之中，随业力显现身心。守戒和犯戒是众生的身心；持戒修行也是众生的身心；持戒积福，为修行证悟积攒资粮。</p><p>　　文殊菩萨接着说，如以地大的本质特征修观平心地，地大为坚硬障碍的物体，没有通达之相；而且是有为法，不是圣性的无漏学；况平心地须累世修行，值佛观根施教才能成就；因地发心怎么依此不通达而有为的尘相，而能早日获得圆通呢！如以水的本质特征修水观，有想有念为妄而不真实，如如不动也不是性觉心观的境界；因地发心怎么依此妄而不真的尘相，而能早日获得圆通呢！如以火大的本质特征修观身心暖触，是身心厌离而不是心性真离，况身心离暖触须累世修行，不是初发心的方便契入法门；因地发心怎么依此须累世修行的尘相，而能早日获得圆通呢！如以风大的本质特征修动静<a href=\"/remen/zhiguan.html\" class=\"keylink\" target=\"_blank\">止观</a>，动与静都是相对存在，不是单一存在；有相对就不是无上性觉，而是无常变化之法；因地发心怎么依此相对存在的尘相，而能早日获得圆通呢！如以风大的本质特征修观虚空无二，虚空是昏沉暗钝相而没有觉知，没有觉知与自性的知见觉有差异；因地发心怎么依此昏沉暗钝的尘相，而能早日获得圆通呢！如以识大的本质特征修行唯心识定，心识不是常住不变，存在识心之心时，这样的心识就是虚妄；因地发心怎么依此虚妄的尘相，而能早日获得圆通呢！身心诸行是无常，心中之念原本生灭不息；以生灭的念功用为因，以往生净土为果，若不能达净念，现在有殊途的感觉；因地发心怎么依此生灭行念的尘相，而能早日获得圆通呢！</p><p>　　众生的身体是四大和合，是有为的，召感到地水火风的自然物性，但离不开世间。身体的肉、骨头属于地性，体温属于火性，呼吸属于风性，血液等属于水性。人往生离开这个世界时，地水火风带不走，自性是离四大物性而独立存在。命终时一火化身体得扔在这个世界，心识去往生。人的生命可以延长，寿命是活的，不是固定不变的。地藏王菩萨见修行人今生可能成道，那就别让再来一次了；可以延长寿命，这是慈悲；生死簿子上一改，延长十年、二十年都可以。有大因缘的人若真心修行，寿命限制可放宽，佛、菩萨会给修道的时间。要老实静坐念佛，别这也看不惯，那也看不惯的，身心不净，心念不真。</p><p>　　文殊菩萨接着说，佛出现于这个娑婆世界，形成真正教化众生的清净法体，在于佛妙音说法与众生的闻受；凡是想获得正定的人，实则是从有因缘闻受佛法中入门，一定能远离生死烦恼的绑缚而得到解脱。慈善的观世音菩萨，于如恒河沙数劫中，就已证入无量佛国土，以大自在的慈悲力，无畏的惠施诸众生。妙音的观世音菩萨，寻声救苦与清净说法的<a href=\"/remen/fanyin.html\" class=\"keylink\" target=\"_blank\">梵音</a>，如广大久常的海潮音；能救度一切世间的苦难众生得到安宁，并可出离世间而获得常住。我现在向佛陈述，正如观世音菩萨所说的那样，比喻有人居于静闲处，十方击鼓之声，同时都能听闻到，耳根的闻功用圆融而真实。而眼根不能见到障碍以外的物体；口鼻也是这样，一纸相隔不能知；身根与触和合才能知，离合无触受；意根的心念纷乱而没有头绪。只有耳根能隔墙闻音，远近与不同方向的音声，同时都可闻听到而不受障碍。其余五根功用都有亏缺，唯有耳根圆通是真实。音声的功用来源于动与静尘相的识入，所听闻的音声为有为法，没有音声又没有听闻；但不是真实的没有听闻功用。当音声销失后，耳根所听闻音声，没有真正销失，而留在意根的记忆里，并传入心识中。当音声产生时，耳根也没有产生音声，只是识入到意根的记忆里。以此缘故，耳根听闻功用可离开音声的产生与灭失而圆通，是真实而常住。耳根这种听闻的功用，就是人于睡眠的梦中，在没有思维时，仍然存在；觉知功用超出思维想象，是身等其余五根所不能达到。所以，在此娑婆世界中，只有佛的清净妙法音声，才能让众生明白宇宙人生真相。众生迷恋世俗世论的听闻，追循外在的听闻信息，随业流转于三界。阿难就是强记也不免被耳根所闻邪术所转；这岂不是身心受耳根听闻的声尘所转而沉沦吗！这岂不是身心没有获得入佛法性流而达到灭除妄想吗！阿难你要认真听闻，我秉承佛慈音法旨，仗佛威神之力，宣说如金刚王的不可思议的诸佛母体的真正三昧。十方世界诸佛，都有秘密修行法门。但是，欲望之漏不除，如畜生听闻人语一样，听不明白；密门入不了。</p><p>　　根基不够，失之交臂；因缘具足，福慧具足才能得入。佛法不是你法、我法、他法，不是家法；佛法在他身上不多，在你身上也不少。关键是这个众生该不该得入，有没有福慧。达摩祖师一字无，全凭心印下功夫。佛有秘密修行法门，这不是你说、他说、人说，是佛说。</p><p>　　文殊菩萨接着说，可众生只知听闻佛法或持佛的名号，不能自闻自性佛所说法。众生具有听闻功用，自性具足一切智和一切法。只要听闻佛法肯自求自证，一门深入，一根能返本还源，六根都可成就解脱。</p><p>　　一根解脱是从身解脱开始的，身解脱是触解脱，只有触解脱以后，六根才能解脱。身体不转化，说意根思维转化了，不现实，经不起实践的考验。</p><p>　　文殊菩萨接着说，众生的见闻觉知，如眼翳人见虚幻相，三界如虚空之花。世间纷杂的事物如幻术，像变戏法似的，处处都觉得新奇、好玩、美妙；其不然，都奔末梢去，不能返本还源，不能得解脱。有的人信佛一、二年，不信了，把佛忘了。</p><p>　　文殊菩萨接着说，若眼翳的病根销除时，尘相销除，觉知自性圆通而清净，身心清净至极，自性智光通达，寂然包含虚空，世间如梦中事一样，摩登伽女也如梦中事一样，谁又能把你阿难的身形留住呢；再漂亮的人也得随生随灭，肉体留在这个世间。如世间巧妙幻术师的造作，男女的相都是幻化出来的，幻化成男，幻化成女。男女互见诸根都有反应，有如机器人设的机关一样，控制人生。控制身体的机关归于寂静安然（死亡时），幻化的男女相都将灭除，没有真实的存在。六根功用也是这样，都是以一心识而存在，六根又和合为一体，功用受心识统摄。如一根功用呈现休息状态，恢复自性本来面目，六根功用与尘相偶合的识入虚妄相都不能形成；尘相的染垢也随之销除，成就圆通的智慧而清净妙有。剩余的微量尘相，还须在行菩萨道的有学中销除，达到彼岸智慧无极限时，即成就佛道；菩萨于三界无学，于成就佛道的大慈、大悲、大喜、大舍中有学。阿难与大众，听闻的关键是，你们要从向外听闻中颠倒过来，反向内求无闻而无不闻的自性。只有自性成就无上佛道，才是真实的一根圆通即六根圆通。</p><p>　　修行人要以一根出，身转化就是用定力化解这一个淫字。成道先把这一个淫断了，转化身体是从这开始转化的。身根转化不了，修行成道如蒸沙石成饭想。修行人要掌握这个转化的方法，出家人自不必讲，在家人修行有这个法门，也有对治的方法，示现夫妻也可以同修成道。把淫这个欲望，化转成身体器官中另外一种能量；变身体的娱乐为脱离低级趣味的法喜充满。那种低级之乐与法喜之乐，万分不及其一，无法比拟。平常人认为五欲之乐最好，一个媳妇不够找多个，提倡性解放、性自由。所以，末法时代业报重，就重在这。这一根不解脱，其它根不能得解脱。六根依附于一身中，身是六和合，人的一根要转了，六根都能转化，就可以成就佛道。我有时晚上睡觉，身体可离开床十公分以上，飘在上方。身体的喜乐，特别是大脑的喜乐，一生得一次都不白活。这些都是静坐念佛定力所致，不存在一丝一毫的虚妄。</p><p>　　我这么讲，诸位听了仍然是停留在佛学上来理解，不能与自己修行结合在一起。事实上，人延脑分泌出的荷尔蒙，是一种激素，这种激素被精所化之气转化。否则，荷尔蒙一下降，人体的一种欲望就产生。只有把荷尔蒙转化，人体的这种欲望才销失。荷尔蒙就转化成另外一种能量，人的体内就产生一种清气。这种清气在体内，清凉首先从肾部生起，上升至头顶，再下至足心；清凉再从足心生起，上至头顶。然后延脑分泌的不是荷尔蒙，是一种甜香。所以，身体转化的人，唾液似蜜甜，口也出清香。转化是从身转化开始的；这不但符合科学，也符合法理，修行实践证知也是这么回事。</p><p>　　信是道源功德母，信的功德第一位，听闻佛法是从信佛开始的。世间什么最远，什么最近，只要有距离，不管是千里、万里，这个距离仍然不为远。但是人与人之间的隔阂，是最远的；一生当中都找不到尽头。有的隔阂就是一生一世、乃至生生世世；这个人不解脱时，隔阂永远不得解除。人与人不能结恶缘，结下了，这个隔阂就没有尽期；旧的隔阂结束，新的隔阂又开始产生。一处解脱，处处解脱，身体是柔软的，骨胳都变化了；意识感知自心清净念佛的无声之音绵绵密密。</p><p>　　文殊菩萨接着说，这样的如金刚王一样不可思议的诸佛母体的真正三昧，是无量诸佛走过来的一路证入涅槃的法门，没有第二条路。过去世无量诸佛，依此法门已成就佛道；现在世诸菩萨，正在依此法门成就佛道；未来世一切修行人，也应当依此法门去成就佛道。我也是从此法门中修证而成就佛道。今天，我说诸法，不是为给观世音菩萨作证明，而是为未来世的众生作证明。佛问我以什么方便救度有学声闻人与末法时代的众生，出离世间，证入涅槃。我说以观世音菩萨圆通法门，为最上选择。其他二十四位圣贤所说诸方便法门，都须依靠佛力加持，才能遇事转境，弃舍尘劳；不是长久修行法门，随人体生灭而有间断；只是对初行人，随根基深浅而方便说法。顶礼佛法僧三藏，三藏无漏妙义不可思议；请佛能加被未来世众生，于此法门不生疑惑心，并方便易入而成就佛道；再以此法门教化阿难等有学声闻与末法时代沉沦的众生，依此闻根入思而启修，一根证入圆通而超过其余五根。我的真实心，就是这样。</p><p>　　不管修行什么法门，都离不开观世音菩萨护佑与观世音菩萨的闻思修法门。修行人离开观世音菩萨的慈悲救护，寸步难行；今天想念佛，明天就有事干扰。只有称念南无观世音菩萨，观世音菩萨于冥冥之中，将这些干扰化解了，让人安稳的去修行。修行的同时，要去做有功德的事，布施利益众生，积聚自己的功德；从而达到修福、<a href=\"/remen/xiuhui.html\" class=\"keylink\" target=\"_blank\">修慧</a>两个方面都具足。</p><p>　　这时，阿难和法会大众，听闻文殊菩萨的大开示后，身心了然，如梦方醒。缘来有学的声闻缘觉，靠自修自证，可以证得阿罗汉、菩萨、佛果位。犹如有人因事远游他方，不知家在哪里并不能找到回家的路；现在才彻底明白家在哪里，并找到了回家的路。依照佛法去修行，才能找到回家的路；三果罗汉是有漏之身，没有找到回家的路，不能往生极乐世界；还得一路修行下去，才能到家；否则，无家可归。</p><p>　　同时，法会大众、天龙八部、有学声闻缘觉、一切新发意菩萨等，有如十恒河沙数；听闻文殊菩萨的大开示后，都悟知本心，舍离一切尘垢，证得清净法眼。即红尘世界，一切有为法为垢，根有想有相为尘。法眼净是明辨法理，知向自性求法。性比丘尼（即摩登伽女）听闻文殊菩萨大开示后，立刻证阿罗汉果；无量众生都发菩提心。</p><p>　　听经的功德不可思议；佛、菩萨的加持力不可思议，冥冥之中加持，不知不觉中就已成就道果。所以，听经、听法的功德可以化掉业力，是增加福报的一种因缘，难值难遇。特别是听闻佛法时，都有佛菩萨降临道场加持护佑，产生的能量，以光的形式，照触身心，在冥冥之中化掉身心的业报习气，才能即时证果。</p><p>　　阿难整理一下袈裟后礼佛，对诸大菩萨与诸大阿罗汉所说的圆通智慧，在心中留下深刻的印象，悲喜交加，为利益未来世一切众生的缘故，向佛请法说，广大慈悲的世尊，我于今日已悟知成就佛道的法门，从这一法门中修行，再也没有疑惑。但我经常听闻佛这样说，自己虽未证得度脱，而要先度脱他人；菩萨的发心是，自觉已证悟圆通，并能觉他人圆通；即佛出现于世间，我虽未证得度脱，但愿度脱末法时代的一切众生。可是，末法时代的一切众生，逐渐远离佛与正法，邪师说法如恒河沙数；那时，初发菩提心的人，想摄持自心修行而得入正定，怎样才能让其安立道场，远离诸魔事，不能退失初发菩提心呢？</p><p>　　谁证果、谁没证果都不是自想的，是自修自证的。以前阿难想这位证果、那位证果，佛是我哥哥呀，怎么没让我证阿罗汉果呢！现在我明白了，依法不依人，成佛是自修自证。千万别疑惑，一疑惑果报不可思议，就落因果。有人长这种怪病、那种怪病，就是过去生见人信佛，谤发菩提心的人这么有过、那么有失的果报。特别是谤毁受持大乘经典的人，果报是生生世世长大片黑痣、白癜风等；恶意攻击就是黑痣，用话热讽就是红痣；用话冷嘲就是白痣。</p><p>　　这时，佛于法会中称赞阿难说，这样请法很好！如你所请，对初发菩提心的人，应怎样让其安立道场，并为救护末法时代沉沦陷溺于苦海的众生，当为解说。阿难与大众，一心听闻，并发心依教奉行。佛说，阿难你经常听闻佛于大小乘戒律中，广说修行三决定义；一是摄心为戒，即戒可止恶积福；二是因戒生定，即身心清净才能入于正定；三是因定发慧，即入三昧正观；这就是身心修行戒定慧的三无漏学。什么是摄心为戒呢？一切世界六道众生，如能从身中去除淫心，就能不随其生死流转而相续不断。你如要修行证入正定三昧中，求得心性出离三界尘劳，淫心如不去除，尘不可出，劳不可离。就是禅定现前，并有多种智慧，也必然落入魔道；上品魔王，中品魔民，下品魔女。这样的一切魔类，也都有徒众，各个自称已成就无上佛道。当佛灭度以后，于末法时代中，多有魔民如燃烧的烈火一样旺盛于世间，广行贪淫并自称为善知识，让诸众生堕落情爱的邪见深坑（即地狱），自迷自失能成就佛道的正路。你须要教导世间人，如想修行证入正定三昧中，须断除淫心，身断心断，身断心不断仍是淫心未断。这是佛与过去佛清净明确教诲的第一决定义。以此缘故，修行人如不断淫心，修行禅定如蒸沙石求其饭想，经百千劫仍是热沙石；是什么缘故呢？沙石不是成就米饭的原料。你若以淫身希求证得佛道菩提妙果，在修行中就是得到一些妙悟，仍是贪淫的根器，心识形成淫习的种子，从而轮转于三恶道中，必然不能出离尘劳。怎么可能证入佛的涅槃路呢？必须使身心产生淫欲的关键彻底断除，心识中的习气也彻底断除；才能有希望证得佛的菩提妙果。这么说的是佛说，赞叹淫欲的是魔说。魔王就是波旬，末法是人心没落，淫欲心重，才是末法。</p><p>　　对于佛法是千劫多闻，不如一日修无漏学；无漏学就是戒定慧。身口意求戒为受戒，摄心不放逸为守戒，精进修行为持戒。必须是持戒，修行禅定，才能证得智慧。解决生死问题，必须是从断淫开始；断淫是初行人的根本，万恶淫为首。菩萨都是从初行人开始的；走过这条路再回来时，就另当别论。所以，化身菩萨才能度人，才不落因果；示现淫女身度众生，而不落爱见坑。淫心不除，要入生死流，随生死相续，众生贪著诸乐永在生死流中，不得出离。如淫心不除，入不了三昧，产生不了出世间的智慧；淫心不除，只能有世间的初定和世间的智慧。因为根尘有偶的业力召感，因果都是魔王、魔民、魔女，修行过程中身体没有转化，不去掉淫心；只能是魔王那里又多了一个眷属。魔道都有魔力，淫心与魔通，魔王也护持接引，走向魔道。走向魔道的人就失去菩提路，宁可千生不悟，也不可一日着魔，破淫戒修行必堕落魔道。堕落魔道的人，转出魔道后必堕地狱，必受地狱之苦，非常可怕。修行戒定慧，就是断心淫，菩萨行人心起一念犯戒，何况身有。如修行禅定，身心不断淫，就如蒸沙石成饭想，那是沙子，永远不是饭本。天天喊信佛就是没静坐，就是没去真实的修行，还在原地踏步，只种善根。欲界天有，男女成淫；两眼相识成淫；两人相思成淫。天人淫，失定力；世间人淫，失道力。末法时代，魔民来此世间，都自说成就佛道，或自称是佛，广行淫欲，是伪善知识，引领众生落爱见坑，失菩提路。世人若修行戒定慧，身心俱断淫，才能与佛菩萨接上缘，才能与佛道相通。</p><p>　　佛接着说，诸世界众生，如修行慈悲，其心不杀，不相互吞啖，就能断生死流；修行戒定慧，可以成就佛道；否则，杀心不除，不可能出世间尘劳。不断杀的人，即使禅定境界现前，并生起多种智慧，也必然落入神道；上品为大力鬼，中品为飞行夜叉的鬼帅，下品为地行罗刹。这样的一切鬼神类，也都有徒众，各个自称已成就无上佛道。当佛灭度以后，于末法时代中，多有诸鬼神如燃烧的烈火一样旺盛于世间，自言食肉修行可得入菩提路。佛现在让比丘食五净肉，此肉不是五蕴众生之肉；而是佛神力化生清净之肉；没有生命业习根本。况且，婆罗门居住的地方，天气闷热潮湿；再加之土地多是沙石，粮食与蔬菜不能很好的生长。所以，佛以大悲神力于冥冥中慈悲加持化现。形态似肉，食可获得肉味；但不能形成业习。可是，于佛灭度后，有的修行人食众生肉，还自称佛弟子。真是无可奈何，只能自作业、自受报。阿难你应知，凡是食肉的人，就是证得心开，表面似是证入正定，实则都是大罗刹类转生人身所致。这样的人，命终后必然沉沦生死苦海中，不是佛的弟子。这样的人，相杀相吞，相食之业没有了尽，怎么能证得出离三界呢！你须教导世间人，如想修行证入正定三昧中，须断除杀生，身断心断，身断心不断仍是杀心未断。这是佛与过去佛清净明确教诲的第二决定义。以此缘故，修行人如不断杀生，如人自塞其耳，高声大叫，在想他人也一定不能听闻；必是酬还业债，没有出期。这样的人，实则藏头露尾，掩耳盗铃。持清净戒的比丘与行菩萨道的人，行路不踏青草；怎么能自发大悲心而又去杀食众生血肉充饥呢！受持比丘戒的人，不穿蚕丝所织之衣、皮鞋、皮衣，不食奶类食品等。这样的修行人，才能真正脱离世间的宿业命债，而出离三界。是什么缘故呢？身穿丝、皮之衣，口食其肉，都与其结下业缘；如人食五谷等，足不能离地。修行人必须清净身心，身心不穿不食，不与众生结杀缘；佛说如这样的修行人，才是真正欲求解脱的人。如这么说是佛说；不这么说的是魔王波旬说。</p><p>　　修行人食肉就是杀，都落入鬼道；鬼有三十六道。佛住世时，佛用神力化一种肉，这种肉没有生命，假名为肉，实是太岁。修行人多的地方，如粮食欠收，出现饥荒，就容易出现太岁。修行人食众生肉，等于食自己的肉。怎么这么重要，众生互相食、互相杀，落因果而循环。动物有动物的业力，是人行恶的果报，不是让人食的，让人感觉到妙，让人回心转意；人不但不回心，反而把动物食掉，使人的业报加重。食与杀业是一样，与鬼道冥通，等于罗刹。清净修行的人绿草都不去踩，何况食肉呢！不同层次的修行人，境界不一样。修行人穿皮鞋、皮衣服都不行；都要酬还业报。末法时代，诸鬼神转生人道，自称是佛，是菩萨，在世间很有影响力，广说食肉也可证得菩提。这样的人命终后，都堕为大罗刹类，沉沦苦海，相杀相啖，求出无期，不是佛弟子，而是魔眷属。</p><p>　　佛接着说，诸世界众生，如身心不偷盗，就能不随其生死流转而相续不断。你如要修行证入正定三昧中，求得心性出离三界尘劳，偷盗心如不去除，尘不可出，劳不可离。就是禅定现前，并有多种智慧，也必然落入邪道；上品精灵；中品妖魅；下品邪人，为妖魅附体迷惑。这样的一切妖邪类，也都有徒众，各个自称已成就无上佛道。当佛灭度后，末法时代，妖邪炽盛世间，转入人道，自称是佛、菩萨，实是潜匿不露、暗行奸欺的伪善知识；自称已得菩萨秘传口诀，以弘法利生为诱珥，实为名闻利养；采用恐吓人心的手段，想方设法贪窃他人财物，让信众散失家财。佛教比丘乞食，就是为去掉贪心，修行而成就佛道。诸比丘等自不制做熟食，寄于残生，如旅游暂时停泊于三界，示现一生往返，当离去时再无返回矣！即让比丘用有限的时间和生命去修行，得到出世间的无限生命。有时间静坐念佛，尽此一报身，以后生就不再来世间了。修行人如见他人的财物，想据为己有的，起这一念的人，都为贼人。这样的贼人，穿着出家人的衣服，依附于佛教，假借佛教招牌行骗，将所造种种业都说为佛法，实则不是心出家。还毁谤受持具足比丘戒的人，为小乘道。由此疑误无量众生，随堕无间地狱。于佛灭度后，如有人发心决定修行正定，能于佛像前身燃一灯、烧一指、热一柱香，以这样的决定心酬还无量劫来的宿债，以佛力愿为其承担宿债，让这样有决定心的人出离世间；永远解脱于诸漏产生的生死苦海，成就菩提路。否则，就如佛往昔让人吃喂马的麦子，今生国王也供养一次喂马的麦子一样，必还宿债。你如教化世人修于正定，断偷是佛与过去佛清净明确教诲的第三决定义。以此缘故，修行禅定的人，偷心不断，就如同漏桶装水，历经无量劫也不可能装满。出家人，除了穿的衣服和钵以外，不储分文。乞食剩余的食物要分给其他苦饿众生；身体的骨肉脏血都要与众生共有，众生需求时都可供养。身心不断偷盗的人，不要用佛所说的法，来掩护自己的过失，为其过失辩解；并以此误导初入<a href=\"/remen/fomen.html\" class=\"keylink\" target=\"_blank\">佛门</a>的人。如修行人能身心断尽偷盗，佛将印证这样修行正定的人，是真正的证入三昧。如这么说是佛说；不这么说是魔王波旬说。</p><p>　　盗就是偷，偷的范围很广泛，投机取巧，获得一切不义之财或日常占他人便宜都属于偷。偷心不除，最后生死相续，落因果，要酬还业债，必须把欠债还上，才能出离三界；否则，出离不了三界。有证悟的人，恰恰与世俗相反，可别供养我财物，怕占便宜，怕落因果，还不起债呀！偷心不除的人，落入邪道。有的人还没到我这里来呢，头一天定中就能见到三条腿的精灵、妖魅等。修行人一定要除掉自己的偷盗心，是便宜不占，是不义之财不取；若他人遗弃的财物可以拣来用。世间有赢有输的赌博，都有因果，果报是堕落邪道。有的人见他人受供养，起嫉妒心；修行的不怎么样还收这么好的弟子，供养他还不如供养我呢！这也属于偷盗心。偷心就是贪心，贪心就是占便宜的心，不劳而获的心，这种心一起，现在缘虽末成熟，将来果必成熟。</p><p>　　有人问，素食的人还有业报吗？素食的人不要有无罪过想，还有为粮食死掉的众生。如吃水果，果树上有无量众生被农药杀死，能说无有因果吗！如食用的大米、白面等，水稻、小麦生虫子能不喷药吗！喷药死的这些虫子谁负因果；间接死的这些众生都与食者有关系；所以，众生无边誓愿度。人吃的这些食物都是众生付出生命的结果，众生是业报，人获得食物是正报。真正是食君一粒米，重如须弥山，吃了不修道，披毛戴角还。</p><p>　　佛接着说，世间六道众生，虽然身心已断除杀盗淫三业，慈行、舍行、梵行，三种善行圆通；但如有大妄语业，于正定中不得清净，必然成为爱见魔类，失去如来种而不能成就佛道。所谓的大妄语是，没有成道自说已证道，没有证得果位自说证得果位。有的人为争世间尊贵第一；对人说已证一至四果罗汉、辟支佛或至十地前诸品位菩萨，受到大众的礼拜供养等，是人为一阐提，即永断善根的人。如有人以刀砍断多罗木，永不再生一样。这样的人，不能再恢复正知正见，不能成就正定三昧；而要沉沦三恶道的生死苦海。于佛灭度后，特别是末法时代，佛赐诸菩萨和发菩提心的大阿罗汉，入于世间，示现种种身份的人，救度一切沉沦众生；或示现出家身、白衣身、居士身、宰官身、童男女身、淫女或寡妇身、嫖娼偷盗贩毒屠宰等恶人身，与其共事，劝其止恶；称赞佛教，修行正定。这样的人，始终不自说是真菩萨、真大阿罗汉；从而随便泄露佛法旨密因，让没有修行的人知其身份。唯一可以除外的是，命终后为弘法利生留有遗嘱；如藏传佛教寻找转世灵童的遗嘱。凡自称是佛、菩萨、罗汉的人，是惑乱众生，大妄语业成立。阿难你如教化世人修于正定，断除诸大妄语是佛与过去佛清净明确教诲的第四决定义。以此缘故，如不能断除大妄语的人，如刻人粪干为旃檀香形状，想求其香气，是不可能的。佛教比丘与一切修行人，直心是道场；于行住坐卧四威仪中与一切行作中，不能弄虚做假；还怎么能自称已得菩萨的秘传口诀呢！比如穷人妄称国王，自寻杀身之祸一样。更何况又妄称法王呢！修行人如妄自偷窥圣果，是因地不真，果必弯曲；这样的人，想求证菩提圣果，如自用口咬自已的肚脐一样，怎么能获得成功呢！如诸比丘与一切修行人，心如弓上直弦，一切真实。这样的人，如修行正定，永远没有魔事；佛将印证这样修行正定的人，可成就菩萨道的无上知见觉。如这么说是佛说；不这么说是魔王波旬说。</p><p>　　妄语是未证谓证，未有说有，欺瞒众生，果报是不得清净成就，沉沦为魔道，即喜欢出风头的一种魔，失去修行的善根。妄语、绮语、两舌、恶口果报是不得如意眷属，落爱见坑，即有仇、有怨。今天想修行，明天就有来找麻烦的人，投其所好。总而言之，就是影响修行，让人失去静坐念佛的机会。未证道果说自己证得了，即为贪求供养，属于偷盗的一种；又为误导众生，要堕拔舌地狱。修行人证道不觉道，觉道不说道。是不是一果罗汉、二果罗汉别去想，证得果位佛菩萨知道；开悟的法师知道，证得不说也假不了，假的说了也真不了。有的人证得了果位也不说，怕恭敬供养。妄语能断佛的种性，烦恼上更加烦恼；不但成就不了三昧，还出不了三恶道的生死苦海。证到哪里说哪里话，没证到千万别说，说了就是妄语，因果就可怕；我讲佛法有过失，我自负因果；与诸位没有关系。乘愿示现的人，若不是小偷，劝小偷止恶也听不进去；如不是杀猪宰羊的，劝屠宰之人止恶也不信。只有同行人说别杀了，动物有灵性啊；别偷了，作事要讲良心啊，才有效用。佛教公案有多少杀猪的静坐念佛，每天在佛像前念《金刚波若波罗蜜经》多少遍，用此功德超度明日所杀。猪羊被杀是定业，但如法行作不落因果，是菩萨化现表法的。临终时说明天不杀了，把刀一扔，晚上静坐往生了。他人一见便知这是菩萨呀！度我们来了，明天我也不杀了。所以，菩萨度众生就这么度，不是用嘴空度，是以身命财为代价救度。不说谁是菩萨，谁是罗汉，不泄露佛教秘密，是真慈悲；否则，不见道的人会说，他怎么是罗汉呢？怎么不像啊！凡夫能见证得了吗！乱说就造业，果报是要堕落地狱。所以，修行人如履薄冰，命若悬丝，小心谨慎；不是怕谁知道，是怕疑惑生谤，堕落地狱。临终时告诉弟子，转世因缘。没有一位真正菩萨会告知人，自己是菩萨。当人真知他是谁时，想再见他，门都没有了，见不到了。妄语属于盗的范围，既盗财物又盗功德。\t\t\t\t</p></div>"
},{
    "title": "【大佛顶首楞严经卷七】",
    "author": "净慧大师",
    "date": "",
    "html": "<div class=\"B1_text\"><h2>【大佛顶首楞严经卷七】</h2><p>　　佛说，阿难你问如何摄心，佛已说要从修行正定入三昧的四种决定的妙义法门。证得阿罗汉果位后，发菩提心，行菩萨道，就要在行住坐卧中，除掉淫杀盗妄的恶习，才能使心明如皎月。此四种律仪冷若冰霜，身心自然不生一切枝叶。枝叶是心三口四。心三是贪嗔痴，心中若有贪嗔痴，自然产生身行的杀盗淫；口四是妄语、绮语、两舌、恶口。由于持戒清净，四事不忘失，不淫、不杀、不盗、不妄语，于正定三昧中自然生起智慧，心三口四恶习产生的根源就没有了。身心对六尘，就不立因缘。无生因何有果，一切魔事何处发生。一切魔事都围绕五蕴进行，身心不受色想行，识中不落因果，自然无魔事。所以，有证悟的人讲，天下无魔事，心中皆佛事；魔事是心魔，佛事自性佛。</p><p>　　佛接着说，如修行有杀盗淫妄宿习不能灭除的人，佛教这样的人诵念楞严咒，可销宿习。楞严咒，是佛顶光明无上神咒；是佛顶光明无限相，是佛无为心中无量宝光，是佛坐光辉永放宝莲花上，为慈悲有宿习的修行众生所说心咒。一心持咒的人，逢凶化吉，遇难成祥，人身平安，财宝无忧。</p><p>　　佛接着说，阿难你与摩登伽女很多劫有恩爱的因缘，恩爱的习气也不是一生乃至一劫的累积。佛一说楞严咒，销除了摩登伽女多少劫的习气，恩爱之心销失，于生死苦海中永远得解脱，已成就阿罗汉道。听闻佛法，去掉习气，销除业障，增长智慧，功德不可思议；摩登伽女当时证阿罗汉果。有淫心的人无心修行，心乱神动，坐立不安，身心放逸。要销除淫心，必须依静坐念佛之法，转化根尘，使身体产生一种清凉物质，化激素荷尔蒙为甘露，只有这样才能坐得住，净心念佛。</p><p>　　佛接着说，摩登伽女有淫习气，无心依佛法修行，在楞严咒神力的冥冥加持下，获得无量福慧，很快就证得了无学的阿罗汉果位。何况在道场的声闻大众，如发菩提心，有坚固不变的决定心，想成就无上佛道，就如同飞扬的灰尘顺风飘动一样容易，没有任何艰难能阻拦住。在末法时代，如有坐道场弘法、受戒的人，自己必须首先持清净比丘戒或菩萨戒，才能坐道场，讲无漏学，讲大乘法。大众也要选择持戒清净，修行有证悟，众望第一的高僧大德为师；否则，所讲法不了义；所受戒律仪必然不能成就。如法受持戒律，戒师要穿清净衣；然后全神贯注，摄心一处，诵此楞严咒一百零八遍；其次确定范围，建立弘法受戒道场。否则道场不清净，魔事清除不了。如是正法道场，清净法师必请十方诸佛菩萨来此道场加持，大放其光，灌其头顶，现其祥瑞，香气四溢，感应道交，心情朗明。</p><p>　　佛接着说，在末法时代，有发愿清净持戒修行的比丘、比丘尼或是在家男女居士，必须除掉贪淫心；来清净道场，闻法受戒。发菩提心，或发愿行菩萨道的人，出入道场要洗浴洁身；连续十二个小时修行道业，专一其心不睡眠，连续二十一天，佛就现身摩顶授记，安慰身心，令其开悟，让其见到自性。</p><p>　　但是这样的人，都是从静坐念佛开始的；没有静坐念佛为基础，永远也达不到这一境界；必须好好静坐念佛，乘愿再来的菩萨修行都得如此。我对诸位讲，十八年前，我没读诵过此经，也未闻知此法。我每日静坐念佛超过十二小时，禅行三年夜不倒单。如此静坐一段后，某夜一时，先是胸部膈肌跳动，呼吸随即停止；过一会腹脐部跳动，心跳停止，只见本师释迦牟尼佛带领文殊菩萨，普贤菩萨以僧像现前；佛为摩顶，并让菩萨为我披诸魔不侵的五彩霞衣，玲珑剔透。佛虽无言语，但我心感知佛慈悲安慰，要我修行苦乐法，隐修菩萨道；传示弘法与出世的日期。出定后神清气爽，百倍精进，不知疲倦。我讲这些不为炫耀，只为证明佛所说法真实不虚。末法时代的人，只要依法修行，持戒清净，精进禅行，佛也会现前慈悲加持。</p><p>　　阿难向佛请法说，我蒙佛力加持，慈悲教诲，现在心已开悟，心境明朗。但我自知，现在还没有修证到无学的阿罗汉。我一定要精进修行，证得无学道果。请佛慈悲，为末法时代的修行人，开示如何如法建立清净道场，有什么清净规则。佛对如何建立道场说了具体的清净规则。这些规则，略去不讲，请自己诵持。</p><p>　　阿难说，我出家得佛怜爱，虽听闻过很多佛法，但未证得无为法，也没躲过梵天的邪术魔咒，是佛的楞严神咒解救了我，还有大众没有听闻到神咒，请佛再为宣说。悲悯救度法会中的修行人及当代与未来轮回生死的众生，能承蒙佛微密妙音而获得身意解脱。这时，佛愿大悲，放无量光，化千叶宝莲，有十恒河沙金刚藏王菩萨擎山持杵和金刚密迹护持，佛宣说神咒。（楞严咒内容略去。）咒为密语，不宜详解。楞严咒只能略解为五方<a href=\"/remen/fozhou.html\" class=\"keylink\" target=\"_blank\">佛咒</a>，东方为销灾延寿药师佛的金刚王咒；南方为宝生佛的天王咒；中央为毗卢遮那佛的诸佛咒；西方为阿弥陀佛的菩萨咒；北方为成就佛的鬼神咒。五方佛咒破五方魔军。楞严咒的作用有百种，略说为七种；一是诚心持咒，能使身口意业清净，容易成就修行道业；二是诚心持咒，可增益修行的福慧资粮；三是诚心持咒，可破修行人自己的宿恶习气；四是一人或众人持咒，可减可灭一人一方的一切灾难；五是诚心持咒，可驱妖除鬼；六是诚心持咒，可降伏一切妖魔邪咒；七是诚心持咒，能满众愿所求。楞严咒是咒中之王，末法时代的正法道场，必须用楞严咒才能护持。</p><p>　　佛说，楞严咒是护持众生的秘密语言，是佛顶之光如大火聚一样威猛无比，神力广大；是佛法性所成就。十方一切诸佛从此咒中出生；又依此咒的威力，得成无上正等正觉；降伏众魔军，制伏诸外道；于无量国土坐在宝莲台上，转法、教化、救度一切众生；为众弟子摩顶授记，续佛慧命。十方一切诸佛，又依此咒的威力，于十方世界救度群苦；如地狱、饿鬼、畜生苦，盲聋喑哑残疾苦，怨憎爱别求不得等五蕴炽盛苦，医不得药、犯罪被判死刑、与鬼或妖通奸、被水、火、风灾逼难、恶兽毒虫所伤、落山坠崖、被投毒、暗害、车撞、上吊、投水等大小诸横事而死的苦，王贼风、水、火、苦，饥饿贫穷苦等一切苦厄，都因持咒而销散，又能预防一切苦厄的发生。十方一切诸佛，又依此咒的威力，示现供养善知识，让声闻等小乘之人心不害怕，受其教化，既示现成佛，又示现入大般涅槃。佛入大般涅槃后，诸弟子在作佛事的时候，诵持此咒，让清净修行的人，能严持戒律，正法住世，得以解脱。此咒的无量功德妙用，无量劫也宣说不完；所以，称为大佛顶、最尊最胜、最高最上无以伦比的楞严神咒。三果罗汉以下的修行人，若不能诚心诵持此咒，想身心清净的静坐念佛，远离诸魔而成就道业是很难的。</p><p>　　楞严咒是破魔的咒，威力无比；当魔事降临的时候，诵持此咒可破魔事，所发生事件可有转机。若不会诵持，可将此咒戴在身上，魔王、魔子、魔民都害怕咒的威力而远离。末法时代，不持此咒静坐念佛，身心易招魔事。持此咒要从心里去掉杀盗淫妄；内心没有魔事，外边才不召感魔事，才能清净坐道场，制住邪魔外道；否则，静坐不住，道场易成魔场。现在讲法的人很多，讲正法的人凤毛麟角。因为讲正法的人，必是依正法修行破魔而有证悟的人；否则，讲不出正法。修行人诚心诵持此咒，能破除来自方方面面的麻烦事，才能保证顺利的修行，获得定境；否则，刚一静坐，魔事就来了，干扰不能坐。有的静坐一会，脑袋里产生无数的幻象，什么景象都有，千奇百怪，有的让人欢喜，有的让人恐怖。若被这些幻象所迷，认为天眼开了，会修到邪道去，不是智慧；幻象不真实，必须空掉。出家住茅棚的修行人，必持此咒，到哪去过夜，先诵此咒三遍或七遍之后才能静坐；否则，静坐不住，有魔力排斥。在家人修行要诵持此咒或身上佩戴此咒，才能静坐念佛，依法修行；否则，邪魔鬼秽和魔人魔事一个接一个全来了，很快便摧毁身心而不能修行。诸佛菩萨等都在护持此咒，同时护持初学之人不受魔事惑乱，让鬼秽远离。</p><p>　　佛接着说，一切世界中的诸众生，可随本国所产的树皮、树叶、白纸、白布等洁净物品，书写此咒，贮藏于香囊；如人思维混乱而不能诵忆，可随身佩带、供养于宅中；这样的人，其有生之年，一切诸毒所不能害。此咒能救护世间诸众生，获得大无畏，并可成就诸众生证悟出世间智慧。佛入大般涅槃后的众生，读诵受持佩戴此咒有功德；破魔事，药不能害，毒不能侵，可化解一些灾难。这是在世间上的作用，护持修行人证得出世间智慧。不把世间人的内外魔事破除掉，自性虽无魔事，却被业习所牵，难返本源。诵持此咒，修行人心得正受，诸毒入口成甘露；一切降灭的<a href=\"/remen/suming.html\" class=\"keylink\" target=\"_blank\">宿命</a>瘟神，心毒如砒霜；可是见到诚心持咒之人，心不起恶，毒气自销；是诸鬼王感佛恩，既守护神咒，又护持持咒之人。</p><p>　　佛接着说，阿难你要知道，此咒常有无量金刚藏王菩萨及眷属等众，日夜守护。若有众生心念散乱，不能修行正定，心默念或口诵持此咒，金刚藏王菩萨会常随其人身边，护持其正法修行。如是发菩提心的人，金刚藏王菩萨就能以慈悲精进之心，在冥冥的蕴识中，快速启发神识生起智慧，记忆起无量劫来之事，对佛法不再有丝毫的疑惑心。从初发心的第一戒开始，至成佛前，都不生到有形有色和无形无色的捷疾鬼、食人鬼、饿鬼等诸鬼趣中；不生贫穷下贱之处；生生世世都生快乐福地，得到十方诸佛功德的布施；并常生在值佛住世的时代，永远不舍离佛法。如是破戒的人，金刚藏王菩萨以大悲神力，恢复戒根清净。如是未得戒的人，金刚藏王菩萨以大悲智慧力，使其很快得戒。如是不能精进修行，缺少智慧，不持斋戒的人，金刚藏王菩萨以慈悲坚固力，使其自然精进，增长智慧，自持斋戒。如是持咒，之前所犯禁戒的罪过，不问轻重，一时全部销灭。如是持咒，饮酒或食用葱、蒜、韭等五辛之物，诸佛菩萨也不记其过失，天仙鬼神也能宽恕其过失。穿衣污破之人，不能坐坛说法，不能入道场听经，也不能作佛事；如是持咒，与说法、听经、作佛事有相同功德，不会有什么区别。造作了杀父、弑母、杀阿罗汉、破和合僧、出佛身血五逆罪的人；以此持咒功德，如猛风吹沙一样，极重之罪，销灭无余，不留分毫。</p><p>　　佛接着说，没来得及忏悔无量劫来一切轻重罪业的人，若能读诵、书写、身戴或住处供养此咒，所有宿业犹似热水浇雪，即被融化；依法修行，不久就能证得无生法忍。如是求生男生女的女人，若能意念或身戴此咒，便会生育有福德智慧的男女孩。如是求长寿、求福报的人，读诵或供养此咒，便会如愿增寿增福，命终之后还会生到有福报的国土，不生贫穷下贱之地。如是有饥饿、瘟疫、战争、抢劫、争斗等一切苦厄的城市、城镇、村屯，书写此咒安放四门或四方高净之处，也可以供养在当地有神灵的庙里；并让人民奉迎供养或人人身戴此咒，一切灾厄，都会自然销灭，确保人身财产平安无事。</p><p>　　佛接着说，无论什么地方的人，只要如法持咒，龙天欢喜，保证一方风调雨顺，五谷丰登，社会稳定，人民安乐；又能镇住一切变化的恶星灾障，让大小横事中途夭折，牢狱之具，不著其身，昼安夜眠，心身安康。二十八宿为统领，四方各有七星。凡是有如法诵持此咒的地方，恶亦远离，永不侵入。所以，佛慈悲宣说此咒，是为保护三果罗汉以下的诸修行人，能够身心安稳的修行正定；让一切诸魔和不祥的鬼神及本人宿债远离诸修行人，使道场清净，持戒清净，对清净的佛、法、僧不生疑悔；让如法持咒的诸修行人，肉身便证得心通；否则，为十方佛在说妄语。</p><p>　　有人问，道家讲练气，佛教里有没有练气法门呢？道家讲精化气，气还神，神还虚，虚还无。修行人身不犯杀盗淫，特别是在淫上得到解脱，要进一步加深对淫的理解。如一种花有毒，克制这种毒的是这颗花下面的一种草，就是这种不起眼的草能解毒。什么物质克制荷尔蒙，一般不愿意讲这个问题，不愿意讲是怕有些人误解。但是不说破了，又很难让人理解；克制荷尔蒙的物质就是精气。精化出的气，在身体内开始产生暖热，后来产生清凉的感觉。男人、女人是一模一样；不论是男人、女人，缺少性腺，不可能修行成道。所以，佛法在世间密宗修行的法门中，也有精化气，气还神，神还虚，虚还空，空还妙有，妙有生喜乐等。当然，各种法门又有不同修行方法；虽方法不同，可目的是一个。</p><p>　　有人问，修行人不断淫能不能开悟呢？修行人不断淫不能开悟，如蒸沙石成饭想，神识不得解脱。即不能断淫，不能得定，不能开悟，神识就得不到解脱。静坐念佛容易成功，就是容易接近精化气这个路子，都摄六根不放逸。人的身体是一环扣一环，互相克制的。当然，有化身成就的菩萨示现人身度众生时，可以除外。</p><p>　　有人问，七魄住体，心肝脾胃肾能理解，另两魄在哪里呢？一是性腺；二是延脑。修行人活着往生极乐世界后七魄离体，先走的是哪个，后走的是哪个，还是一起走。如没经历过，都无法得知。七魄住体的人，肯定不是跳出三界外，不在五行中的人。</p><p>　　有人问，楞严咒的核心内容是什么？对修行人而言，此咒的核心内容，首先是破五蕴魔的。然后才是其它作用。对世人而言，哪里诵持楞严咒，哪里就太平；灾难不起，灾星不临，瘟神不降。一些神灵的职责，如世间的警察，亦善亦恶，对善人是善，对恶人是恶。二十八星宿也是如此，掌管人间善恶，对善人就降福，对恶人就降灾。人善亦善，人恶亦恶。所以，有说人善人欺天不欺，人恶人怕天不怕。</p><p>　　这时，法会中有无量护法金刚，在佛前顶礼发誓说，我们誓愿诚心诚意来保护如法持咒、修行佛法的众生。诸天王也在佛前顶礼发誓说，我们誓愿要尽心至诚保护如法持咒、修行佛法的善人，让其一生如意。诸捷疾大将军、食人鬼王、臭恶鬼王、热病鬼王、变形鬼王、啖精气鬼王、猪头鬼王、象鼻鬼王等，也在佛前顶礼发誓说，我们誓愿护持如法持咒的修行人，让其所发菩提心，快速得到圆满。诸日月天子、风、雨雷师、电伯、当值的天官及眷属，也在佛前顶礼发誓说，我们誓愿保护如法持咒的修行人，让其安心布置道场，身心无所畏惧。诸金刚藏王菩萨，也在佛前顶礼发誓说，我们所修功德，久已圆满菩提果。但是，不愿入涅槃；而是誓愿常随此咒，救护末法时代的修行正定的人；无论此经和如法持咒人在什么地方，我们都会像侍卫一样，常随左右；不让魔王和大自在天的天魔乘修行人某方面的漏洞，而侵袭干扰；让其一切小鬼小神离此如法持咒善人的八百里以外，除非小鬼小神发心亲近善知识，听法受教，求修禅定之法；否则，对侵扰如法持咒善人的恶魔和魔眷属，以金刚宝杵杵碎其头，粉碎如微尘一样。</p><p>　　在此世间，末法时代众生业报转重，如法持咒的人减少，天灾人祸不断，诸恶星、魔王、鬼神等，在冥冥之中掌控灾祸。如国王和人民都信奉佛教，如法持咒，这些天灾人祸都会化转于无形，中途销失，不降临如法持咒的国土或地方。人若一分修行，自有万分感应，让一切天灾人祸都远离，这是诸佛菩萨、诸天王的护法心。</p><p>　　阿难礼佛后请法说，如我这样的众生，智慧不足，根基愚钝，喜欢多闻，不知实修。用有诸漏的身心，只求博学世间解，没有依正法修行正定，求证得出离世间的菩提果。今天，蒙佛慈悲教诲，使我明白了正法与助行的修持方法，身心愉快，如获得了很大利益那么高兴。在世间修行，证得无漏果位后，至不生不灭的佛果前，如何发菩提心？什么是从修正定至欲爱干枯、智慧现前的菩萨果位次第的四十四心呢？四十四心即十信心，十住心，十行心，十回向心和暖、顶、忍、世第一的四加行心。什么是等觉菩萨呢？阿难请法后，恭心静然接受佛的教诲。</p><p>　　正修是修持戒定慧，明心见性，出离世间，证得菩提。助行是如法持咒，创立弘法受戒等道场，举办各类法会等。在末法时代，正修离不开助行；离开助行，身心难得清净，魔事干扰正行。助行不舍正修，离开正修虽身心清净，魔事干扰少，而难证果。所以，要正修与助行结合，以正修为主，助行围绕正修进行，相得益彰，易于成就圣道。</p><p>　　佛说，阿难所请法非常好，是为现在及末法时代的众生求法。是一切众生修行正定，发心至修菩萨乘；从凡夫地至证得菩提果的正法修行路线；现在就为大众宣说。妙有佛性本自具足圆通智慧，人人佛性具足，与佛无二无别，若能离开名相，本来就没有世界与一切众生。一切众生由于原始一念无明，才生出颠倒的世界。颠倒妄想生出有生灭相的世界与众生，又生无明烦恼。如人能依法修行，灭除自业召感的生灭法，灭除心中的颠倒妄想，真如佛性才显现出来。无上菩提和大般涅槃，只不过是二种相依而存的名号而已。佛与众生只是迷悟不同，迷而有业，无有远离生死的功德；悟而灭业，才有远离生灭又示现生灭的功德，广度众生。阿难你今天想修行真正的正定，直接到达证菩提得大涅槃，就要先识得这个世界众生生与灭的颠倒因缘；颠倒的妄想不生，因缘不立，才能达到不生不灭真正的正定。要想知从哪里修行，就得知众生从哪里开始颠倒的，世界从哪里颠倒的。众生自性本来具足福慧，圆明觉妙，只因妄念生起颠倒，召感了有为的世界。由业召感到身体，有身体、有需要、有贪求，贪著于名相。有身体、有需求，才示现了满足身体需要的这个世界。有为的世界有地水火风诸自然现象，是众生业感的，是众生心里的妄念产生的。众生心里有什么妄念，世界就有什么样的众生；妄念有多少，业感众生的种类就有多少。众生心是颠倒的生灭相，这些颠倒是虚妄不实的；在无常力的作用下，没有体性，没有所依。要是真正忏悔业可以销掉，做善事就有善报，做恶事就有恶报，如影随形。真与非往复循环，在相上一个人一个样，每个人对相上都有不同的想法，千差万别，但都是颠倒的，执著于名利。真如本性与非而不实的业习纠缠在一起，难以分辨真与非。如对真话听不进去，对假话非常愿意听；告诉他信佛吧，信佛好，若依法修行，将来能出离三界。不信的人会说，别给我讲了，我啥都不信。若说乱找女人，有转世畜生报，他不但不听还再也不来往了。所以，妄想对假相，竟遭轮回，辗转生死。</p><p>　　佛接着说，世界的颠倒是有为的东西南北，与过去、现在、未来世相续不断的变化，变化的妄力召感众生有十二类。佛国土清净的世界是不颠倒的，证得菩萨不再颠倒；否则，很难不颠倒。因为众生内有六根、外有六尘，产生成十二区宇分别。眼见色生心，外尘入心，动念就颠倒，起的恶念，随恶业轮转；起的善念，随善业得到善报；轮回生死诸道，没有出期。所以，世间人的六根对六尘，永远循环往复的发生变化。这十二种变化又以个体为单位，为一体作用循环；业有共业，受报为个体。六根为业因，六尘为业缘，因缘和合妄想生妄相。世间十二类众生，出生的方式各别。十二类别有，卵生、胎生、湿生、化生、有色、无色、有想、无想、非有色、非无色、非有想、非无想。这就是六道众生，欲界、色界、无色界，十二种出生方式。</p><p>　　人属于胎生，鸡鹅鸟禽类属于卵生，蜻蜓、蚊子属于湿生，天人属于化生。人用科学手段只能验证地球上众生的遗传基因，各道众生的遗传基因图谱又不一样。基因是如何确定的，人类能不能随意创造出一个物种或植物的基因？其它星球上的生命状况是怎么样的？天人一想就能化生吗？极乐世界莲花化生有可能吗？天界男人生小孩可以吗？科学无法解释，也无法解决。只有佛教了义，生命状态可以在宇宙中永恒，处于无生无灭的常乐我净状态。否则，万年也有死，于生灭中永生。由于世界是颠倒的，人的妄想有八万四千种那么多；各有各的思维想法，又处处思维，就召感这个世界的无穷变化，有动物等诸类的产生。由妄想召感有相，有相又生因有果。人不要小瞧自己当下这一念；就当下这一念，生什么念因将来就召感什么念果，这个世界就有什么；人一动念为想，就落入八识田里去，就有成熟那一天。信佛人都知道一句南无佛进入八识田，如今生没有成熟，迟早有成熟的那一天，迟早有得度的那一天，只不过得度的时间有远有近；有的今生成就，有的后世成就，有的一劫成就，有的后劫成就。总之，只要今生念南无佛了，以后世肯定成就。因为动一恶念召感恶果，动一善念召感善果；所以，听经念佛都不空过。</p><p>　　佛接着说，由于世界的颠倒，人的有相乱想；才召感十二类众生出生方式不同。世间才有：一是贪著虚妄乱想，才有鱼鸟龟蛇类；二是贪著杂染的情缘乱想，才有人畜龙类；三是贪著我执我见的乱想，才有蠕动爬行的虫类；四是贪著喜新厌旧的乱想，才有脱化蛹蛾飞行之类；五是贪著留碍的外缘而不内修自性的乱想，才有如荧火虫一样身体发光的物类；六是贪著厌世暧昧的乱想，才有如主旋风一样的神鬼类；七是贪著神明灵通的乱想，才有城隍、土地、魑魅魍魉等类；八是贪著愚昧暗钝的乱想，才有鬼死为渐的金木瓦石类；九是贪著虚伪的乱想，才有依水泡成身的水母和各种寄生虫类；十是贪著符咒邪术的乱想，才有山精树怪虫毒鬼等作崇的妖怪类；十一是贪著性情迷妄的乱想，才有如蜜蜂一样螟蛉类；十二是贪著仇恨杀伐的乱想，才有如夜猫子等不祥枭类。这个世界人畜杂居，蠕动含灵，还有龙类。</p><p>　　虽然人肉眼看不见龙，但确实存在。龙宫非常华丽、整齐，也有座位，和人说话也现人形，龙有土龙和海龙。龙类瞧不起人类，因有人身不知修行。龙王信佛，教导它的龙子龙孙都信佛。龙的前世都是修行人；是一种假和合。人的肉体是一种假和合，各种动物的肉体也是假和合。由于起心动念处召感的果报不同，生成的身体、体态不同。体态不一样，召感的业报就不一样，一体同悲人不详。自性上是一样的，同一佛性，召感到的果报却千差万别。这又是谁也代替不了谁，谁也管不了谁的<a href=\"/fojiaogushi/yinguo/ygby.html\" class=\"keylink\" target=\"_blank\">因果报应</a>。别看小鸟飞、虫子爬，这些动物都含灵，谁若不准蛇、鱼、鸟类等存在，绝对不行。世间没有动物的存在，人类也无法生存。了知佛法，把握好当下一念处。否则，召感到哪一道都不怎么好，都够苦的。人身难得今已得，佛法难闻今已闻，必须要修出个大头小尾来，今生这一报身，好坏就这样了，下生召感到极乐世界，离开这个娑婆世界。往生到佛国土去，往生到兜率内院去，清清净净的在宇宙中，永远也不回来再生再死。这个地方不值得一想，谁愿意贪恋酒色财气恩爱情仇，谁就永远留在这个世界；谁愿意贪著根尘的五欲之乐，谁就在这永远的贪著。明白佛法的人，持戒修行；自度度人。先度自己，现在是思维心，别想恶事，把烦恼看破、转化，放下、解脱。自己得度，才能度人。否则，说度人是空话。\t\t\t\t</p></div>"
},{
    "title": "【大佛顶首楞严经卷八】",
    "author": "净慧大师",
    "date": "",
    "html": "<div class=\"B1_text\"><h2>【大佛顶首楞严经卷八】</h2><p>　　十二类众生是由身心颠倒，召感颠倒的世界；人的无明业习，把真净明心遮蔽了；以后召感的各种身形不一样。对此说起来容易，真正能悟知难呀！就人道而言,觉得做人有难处，一些幸福和痛苦等都得承受；又人生短暂，诸多不遂人愿。就动物而言，于自然界中生存，环境条件更加残酷；风餐露宿，寒冷湿热，相互吞食，人类捕杀等；如蛇有冬眠，小虫叮咬，还有天敌生物链。就十二类众生而言，有形体与无形体，都各有其痛苦。各类众生又不只是一生；生的延续时间漫长，成百千劫来计，什么时候业报销除才转出那一道。所以，人生善缘值得珍惜！</p><p>　　佛说，一一类众生，各个都有十二种颠倒妄想，如用手揉眼一样，产生眼前的狂花乱舞；使本自妙有圆通清净智慧的心性，随之颠倒；并产生这种具足虚妄不实的乱想。阿难你现在要修证成就佛道的正定，就要从心中颠倒的根源处下手，于颠倒的根源处，建立起三个程序，才能逐渐将颠倒销除，使乱想灭失；如净器中贮存甘露，先要除去有毒的蜜垢。即把人的身心比喻成容器，容器里有很多毒汁。天设五毒身，贪嗔痴慢疑。除去五毒，要有三个次第；一是严持戒律修行，去除其助恶因缘，保持身心清净；二是依法真修实证，增长善业，除掉杀盗淫妄的业根；三是六度万行，违逆造作现业的习气，不再造作新的现业。</p><p>　　佛接着说，助因是十二类众生佐身的助恶因缘；产生于一切众生自体不能自全，都是依靠外界食物而生存，不能独立于外部世界而存活。人看似独立存在，不食物品会饿死；没有阳光、空气、火、水、地等，一刻都不能存活。十方众生都以食而住，都得吃食物，吸收营养和能量，只不过是吸收营养的方式方法不一样。十二类众生共有四种食用物品的方式；一是段食，早、午、晚三次，分时间阶段用食；二是触食，用鼻子嗅到气味就是用食，鬼神类就得其能量的满足；三是思食，欲界、色界的天人是思食，想食用什么就有什么食物自然生出；四是识食，无色界的天人无有形体，一想食物就得其能量的满足。但是，一切众生食甘甜美味有营养的食物能正常生存；而食用有毒的食物，就会死亡。</p><p>　　佛接着说，修行正定的人，去除身体的助恶因缘，必须永断食用五辛之物，这是第一个修行次第。五辛之物，即葱（元葱）、蒜（小蒜）、韭菜、薤、兴渠（小洋葱）。为什么不食？一是生食爱生气，熟食增加体内荷尔蒙含量，人的嗔恨心、淫欲心增强；二是臭秽，天仙不护佑，而得鬼类常舔其唇，与鬼同体，每日都销损福德，长期不利益身体健康。大力鬼王、魔王得其方便，现佛身来为说法，使其自毁禁戒，赞叹淫欲，喜欢嗔恨，大语狂言；这些人自然是魔王眷属，魔福尽时，堕无间地狱。</p><p>　　饿鬼类分多种，细菌都属于饿鬼类。最大的饿鬼，喉如针尖，颈部一个大瘤子，腹大如鼓，食物入口化为火焰。济公和尚酒肉穿肠过，怎么理解。济公吃狗肉能把狗的神识度脱；另外，济公是乘愿再来，已得生死解脱，心能转境。济公示现的不是佛菩萨身，而是罗汉身。</p><p>　　佛接着说，修行正定的人，去除身体的助恶因缘，必须永断淫念，这是第二个修行次第。断淫、断肉、断盗，严守清净戒律；这样的肉身可以得到清净，不造作现世业。先持声闻比丘杀盗淫妄四禁戒，比丘尼再增加触、入、覆、随为八禁戒；然后持菩萨戒，其心不起。否则，难出三界。严格禁戒，依法精修，在世间无有宿债需要负担和拖累，身心清净，业习清净，用父母所生的肉身，便能证得定中三昧，灵能离体，观十方世界，神通游历十方国土。</p><p>　　修行正定的人，视淫欲如毒蛇，宁可去死，也不犯淫戒，连一念都不起。众生永远也理解不了，没有那个境界，很难转化这一念。所以，须转化身体；修行是真实的，见到淫欲比死还难受。因为矫正颠倒后，身体法喜的禅乐比淫欲要快乐百千万倍，如拿一百万元兑换一元钱，亏大啦！宁可舍掉那一元钱不要，也要留住百万富贵之本。行菩萨道的人持清净戒律，身心同时把淫捐弃；不淫、不杀、不盗，是自觉自愿的。在未来世就不偿还宿债。偷人的、骗人的，转世得先偿还。不是用财物还，须脱牛变马还。有个出家人观察到，有人就偷了几个鸡蛋，转生得为鸡去还。宿债是用身命作代价偿还的，劝世人千万别占他人的便宜；有宿债的人，有口气在，今生可以忏悔掉；否则，转生要用身命去还，相食相杀，没有出期。所谓是，实有天堂它星球，统领天人有天王。仗佛威神多往返，时差相异修善人。真有地狱宇宙中，银河系里有黑洞。仗佛威神亲目睹，幽冥受苦做恶人。极乐世界娑婆西，莲花藏里银河系。三品九辈是报身，阿弥陀佛愿力积。佛佛法身同，虚空互相通。众生含灵动，觉者一真行。这都是亲历十方所感，真而切真，不是虚言。我真实地讲，哪个世界什么样子，到哪层天上去，走一走，用什么语言沟通，如何行走等，一观便知。有的星球就得蹦着行走，不蹦走不了路，一个星球是这样，其它的星球不是那样。所以，修行一段时间，得入定中三昧，智慧生起时，唯心自知，来不得半点虚假。</p><p>　　佛接着说，修行正定的人，去除身体的助恶因，违其现业，这是第三个修行次第。</p><p>　　违逆造作现业的习气，逆世而行，净心寻源。不再造作新的现业，保持清净戒心法体，心无贪欲；六根不追逐六尘而放逸，只守住身心当下一念，南无阿弥陀佛。边干活边念佛是游戏，做什么事都是游戏，不去贪著。这样逆世而行，不掺合是非之事，不去造作。</p><p>　　有人问，弃转习气怎么这么难呀？在这个世界上很难，有时在不犯戒的前提下，随顺一下可以；但动心动念犯戒不行，起念分天地，十界任君择。有人就爱听好的，呵责两句觉得面子挂不住，怎么能销除习气。有人身在，习气可以销除，可以转化身体并弃转习气；否则，离开人身时，一是地狱苦，二是饿鬼类，三是畜生类，以极大的苦报，帮助去掉习气。</p><p>　　佛接着说，由于心无贪淫，身不流逸；化转体内能量回归，触尘就不能缘入，身根也不能与触尘相偶对应。就可转化体内能量的欲望流，返还为一体能量的清净流；一根完全返本还源，六根功用自然转化为解脱；自然违逆现业，不作新业。</p><p>　　旋元自归；各宗有不同理解，就身修而言，总的可理解为，化转体内能量回归。其中，净土的都摄六根，静坐念佛是；禅宗的夜不倒单，长坐不卧参修是；密宗的精化气、神还妙有，持咒密行是等。身回归促进心回归，心回归反作用于身回归；身心清净，才有正定等。</p><p>　　佛接着说，心见十方国土，如皎月洁白的光一样清净，寂然无声；如在透明的琉璃容器内高悬的明月一样，身体法喜充满，心境畅快自然。数载苦寻觅，突觉身无边。万象心中物，瞬间宇宙同。具足圆满妙智的自性，与佛与众生平等无二，一体同悲；摆脱了有为世界与有为身体的缠缚，于生死烦恼的无常中，解脱出来而获得真常，无欲又无求，安隐而自在；一切诸佛的密因法要，圆满功德，清净妙智的境界，都在妙有的自性中。这样的人，是证得了无生法忍；觉自性无尘，身心对世间诸法生灭不起分别。这就是从开始逐渐修行，次第前行，随着所修功德的增加，显现不同证悟的智慧，证得一果罗汉至成佛的不同圣位名称。修行正定的人，身心不随波逐流，随境转而放逸，循环颠倒的各根功能自然归于圆明正行的智慧；即眼耳鼻舌身意的见闻嗅尝觉知的功能，归为戒法清净功用；对杀盗淫妄与六尘失去作用；转尘境为智境，尘不缘根，根不偶尘。这样修行才得定，返杂流为一源，专一其心，六根功能暂时休息，定境现前。</p><p>　　三个修行次第，都是转化身口意，转变身体的助因。不食五辛酒肉；守护身口意不犯禁戒，保持清净；不造现业与世相违，根尘不偶，修定得智。这三个次第不给自己后世造业，；否则，偿还业债时要以不同形态身命为代价。特别是习气不转的人，改形换态，用那种生命状态接受惩罚，直至业习销失。人千万别强要面子，千万不要以为面子值钱，要有谦下心；行菩萨道的人见谁有些过失时，能指点几句是一种慈悲；若人不知领情，反生嗔恚，就是习气作怪。身口意不得转化，难守戒律。千万记住，今生修行要老老实实的修，什么事别装明白，听闻佛法为自己听，先求己度，再去度人。</p><p>　　佛接着说，这样以三个次第修行戒定慧的人，欲海已干，情爱枯竭，人的性根功能销失，对异性在境界上不再有反应。此身为最后生，不会有再生；即尽此一报身，同生极乐国。这时人心如止水，净如虚空，光明透澈，智慧充满。具足圆明妙智的自性，晶莹如山，净洁如十方佛国土，只有智慧，无有挂碍。由于欲爱的习气初步干枯，无明力尚没有彻底清除干净，还不能与诸佛智慧相结合，只能是往生到佛国土继续修行。</p><p>　　这里所说，即是带业往生，尚须二大阿僧祇劫修行，才能彻底将无明业习清除干净，与诸佛智慧相结合，法水之流才融为一体。这里的带业带多少，一果罗汉尚须修行八万劫；二果罗汉尚须修行六万劫；三果罗汉尚须修行四万劫；四果罗汉尚须修行二万劫；辟支佛尚须修行一万劫。阿弥陀佛四十八大愿中十念往生是净念往生，在净念的十念时间里，从人的肉体出离入大势至菩萨手捧莲台，保证够用；绝对不是人的思维十念；也绝不是人的思维能十念佛号，必须持戒修行销除业习，才能带业往生。</p><p>　　以下要讲菩萨的品级，一般人很难全面掌握；所以，简要讲一讲，菩萨有六十个品位，即十信位菩萨、十住位菩萨、十行位菩萨、十回向位菩萨、四加行位菩萨、十地位菩萨、等觉位菩萨五个次第、妙觉位菩萨。新发意菩萨称外凡菩萨；十信位菩萨称内凡菩萨；十住、十行、十回向菩萨称贤位菩萨；十地菩萨称圣位菩萨；等觉菩萨称佛位菩萨；妙觉菩萨称佛位大菩萨。一般在世间只说十地菩萨、等觉菩萨和妙觉菩萨，不说其他。所以在讲经典时，有时随顺世间说，但要以此为标准。</p><p>　　佛接着说，初行干慧地的人，即以此智慧心，在定三昧中，弃舍有为的两边，行于无为的中道，圆融无碍的妙智开始显现，心随真如妙智而圆融；在此基础上，继续修行于空，在空中又重新观察真如妙性，才相信妙法坚定不移；一切妄念灭除的干干净净，一丝一毫也不存在；纯正真实的相信佛法之心，不再退失。这就是十信菩萨的一信心位。</p><p>　　真如显现，信心坚固，智慧明了，对世间诸法的因缘果报，既说法圆融，又见通透；明明白白的做人做事，持戒修行；身心五蕴和三界诸有为法，不再障碍，而是助道。在定中，能忆念起自己的神识于往昔无量劫来，得什么身，受什么报；善恶习气，皆如在眼前一样，一清二楚，没有遗失忘却之事。这就是十信菩萨的二信念心位。</p><p>　　妙智圆通无碍，纯洁而无杂染，真实存在的真如本性，精确无误的发生功用，转化无始劫来的习气，流入唯一正智；以精正无偏的智慧，修行前进达到心无杂染习气的真净。这就是十信菩萨的三信精进心位。</p><p>　　再以纯正的智慧观察法相，人法二空。这就是十信菩萨的四信慧心位。身心执著于持戒修行明澈通照的智慧，身心寂然，三界寂然，常于定中觉知佛法妙义而凝神致专，定力十足。这就是十信菩萨的五信定心位。于定中自性生出的智慧，再继续不断的深入观察智慧妙性，唯有进修，无有退转。这就是十信菩萨的六信不退心位。</p><p>　　心精进修行于法，身行安然戒守于道，保持清净的智慧，不失定力；与十方诸佛的气氛相交接，在心里产生护持法体，使佛法脉不失；在身行上自觉赞叹佛法，拥护道场，弘法利生，开坛授戒，利益众生，让佛法发扬光大，正法久住。这就是十信菩萨的七信护法心位。</p><p>　　保护住觉知的智慧，能以妙观察力发现，诸佛真正的慈悲众生，示现种种方便救度众生出离苦海；从而发心修行慈悲喜舍，承传佛的事业，如佛一样救度众生，所行一切皆为报答诸佛救度之恩。这时，心性如镜与佛智慧之镜，相互对应，光光相照，镜中有镜，镜中有影，重重叠入，互摄互念；佛心中有我，我心中有佛，一切功德皆回向于佛。这就是十信菩萨的八信回向心位。</p><p>　　心镜摄入的佛光，不为人知；自心的功德回向，不是在嘴上回向，而是在心性上。这样，经常获得佛法真常不变的无上妙义和清净，使有为的身心安稳的住于无为法中，戒体庄严，无有一念落于过失。这就是十信菩萨的九信戒心位。</p><p>　　安住于清净的戒体，获得自在神通，随愿游于十方世界；所谓神识离体清明，随心所愿处行。天堂地狱可去，光速万倍太虚。这就是十信菩萨的十信愿心位。</p><p>　　佛接着说，阿难应该知道，这样修行戒定慧，证得十信位的菩萨，以真正的智慧方便力，将此十信心融会贯通，心中生起愿心，将充满智慧的佛法，发扬光大，由十信为十用，信心智慧与用心智慧相互涉入，相互结合，变化成圆融的一心，将佛法功用于世间，让众生觉迷为醒，知道自度而出世间。这就是十住菩萨的一发心住位。</p><p>　　由于心中生起明澈的智慧，心如清净的琉璃，智慧如净琉璃器中的纯度很高能发光亮的黄金，非常珍贵；这时，充满佛法妙智的心中，愿意履行承传佛法而行菩萨道；愿心如天地一样厚重，承载万物。行菩萨道如治理心地一样，平等慈悲众生。这就是十住菩萨的二治地住位。</p><p>　　心中的妙智与行菩萨道的妙用，相互结合为一体，心知为道用，道用为心知，知与用无碍；即将佛法妙理与自心修行结合在一起，游十方国土供养佛，受教多闻；履十方国土，广作佛事，自利利他，对十方国土一切无有留恋与障碍。这就是十住菩萨的三修行住位。</p><p>　　修行能与化身佛的道场同住，围绕化身佛，接受化身佛气质和道场氛围的直接教化和影响，如中阴身受业牵，自寻业感相同的父母；即五蕴传递的业感信息，与父母的业感冥冥相通，自然吻合一样，生到值佛住世的国土，将成为佛子。这就是十住菩萨的四生贵住位。</p><p>　　即秉承善功德力，游戏住于必有道果的胎藏中，觉知是佛种性的后代。方便智慧，自然具足；如胎儿自然成熟，人相圆满，如诸根不缺一样，处处是佛法道场，事是为方便智慧，显现佛子的菩萨行。这就是十住菩萨的五具足住位。</p><p>　　这时，容貌有如佛一样的庄严相，心中的智慧也如佛的庄严相一样庄严，自然成就正知、正见、正觉；心中正法常住。这就是十住菩萨的六正心住位。</p><p>　　身行体貌与正法智慧之心合一，精进修行，功德日益增长，求证佛无上大行妙智的决定心，坚持经常，无有退转。这就是十住菩萨的七不退住位。</p><p>　　随着身心功德的日益增长，性如天真，心如顽童的十身灵识诸相，一时都可以具足。这时，性真而福德力不足，顽童而智慧力不足。十身灵相是佛相身、菩萨身、智身、法身、虚空身、缘觉身、声闻身、业报身、众生身、所在国土身。这就是十住菩萨的八童真住位。</p><p>　　这时，在佛法体内受教培德的菩萨，如身形圆满，<a href=\"/fjrw/hcrw/dgfs/48036.html\" class=\"keylink\" target=\"_blank\">瓜熟蒂落</a>的新生胎儿，成为佛的眷属，即佛子，也可为法王子。佛子从佛口生，从法化生。有人只讲前半句，教出圣贤；却没讲后半句，修成圣贤。教为佛说法，化为如法修证。二者合一，受教启修，才可自成圣贤。世间法理如此，出世间法理也如此。这就是十住菩萨的九法王子住位。</p><p>　　这时，如童贞的佛子，身行外表已为成年人，可以按成年礼仪形式，告之已由孩童长大成人，可以承担佛教事业。类似于刹利王的世子成年后，要举行成年仪式，升座、装饰、音乐，并取四海之水装入金瓶，由父王灌世子头顶；意为接受父王的委托意愿，守住本分的国土，光大父王的威德。这就是十住菩萨的十灌顶住位。</p><p>　　佛接着说，阿难应该知道，这样修行戒定慧，证得十住位的菩萨，已经成就能行佛事的佛子，具足无量佛的妙智福德；但不是全部功德。能欢喜的随顺十方众生，以欢喜心的法施于乐修声闻乘之人，以欢喜心的财施于逆缘助道众生，以欢喜心的无畏施于苦难众生等。自己身心欢喜，所行也让一切众生欢喜。这就是十行菩萨的一欢喜行位。</p><p>　　清净持戒，自然福德庄严，受众生尊重赞叹；<a href=\"/remen/ganhua.html\" class=\"keylink\" target=\"_blank\">感化</a>众生止恶向善，乐受三皈斋戒，乐供养佛、法、僧三宝。这样善能自增功德，又善能让众生得到福田利益；所教化的众生，依法修行也能得到生死解脱。这就是十行菩萨的二<a href=\"/remen/154932.html\" class=\"keylink\" target=\"_blank\">饶益</a>行位。</p><p>　　能自觉苦、集、灭、道真谛，能觉十二因缘法真谛，能觉世界诸法无常，能觉常乐我净的佛性真常；又能教化他人去信、解、行、证，达到他觉。在自觉觉他的修持过程中，对一切逆缘助道的众生不违其愿，对打骂欺辱、诋毁杀伤等一切反面帮助不拒之千里；越是反面的财富越珍贵，没有烈火，哪有真金；真功德是从正反两方面获得，在心无忍身有忍中圆满。这就是十行菩萨的三无嗔恨行位。</p><p>　　于十方世界，随佛种性出生，精进修行，无有止足，无有过去世、现在世、未来世的时间观念，以平等的慈悲心，以通达无碍的智慧力，善入十方世界，随佛教化众生。这就是十行菩萨的四无尽行位。</p><p>　　能了知践行一切密行所发愿心的合同，禅行无量法门，既知千山可有一洞，又知千洞可为一山；虽然风景各有不同，洞天却别有千般。初行人要一门深入，通达后又要修无量法门；方知水流千河归大海，随缘讲法一佛乘。证到哪里讲哪里话，知哪里境界有不同。讲法不误己误人，无有偏差。这就是十行菩萨五离痴乱行位。</p><p>　　由于禅行无量法门，明了无量禅机法理，智慧通达，能于同一事理中突显出来与众不同事相，和一一不同的事相中，以智慧观察力找到相同的根源或共同发展的规律。一真转万俗，万俗化一真；事理互不碍，心明自融通。善以观察力发现，同事不同理，同理不同事，事理又相同。这就是十行菩萨的六善现行位。</p><p>　　如是智慧观察力，不但能观察一世界的事相，也可以观察十方虚空中充满微尘，一一微尘中又现十方世界，十方世界又现尘观界的无量世界的事相，事相各别，理性通达；又不对纷繁复杂的事相理性产生执著和挂碍。如在此世界，一位禅行者，可能是医生、工程师等，既通达本行业的专业知识，又明白社会方方面面的常识，但又不能妨碍静坐禅行，禅机佛理又融合到职业和社会的方方面面中去，一切方便智入，没有留恋和挂碍。这就是十行菩萨的七无著行位。</p><p>　　心中生起的无量智慧，显现出来就如在眼前一样观的真实。显现出来的种种智慧，都是彼岸无极限的智慧。在一切行作中，都能自尊自重。在世间人这一道中，心里有一种世人无法想象和理解的知足感与幸运感，一切为轻，禅行智慧为重。这就是十行菩萨的八善重行位。</p><p>　　种种圆通无碍的彼岸无极限的智慧，使诸言行自然符合诸佛戒规法则，建立清净的戒坛与弘法道场，依智慧力光大佛教，教化众生，所行圆满。这就是十行菩萨的九善法行位。</p><p>　　一心的一切行，一行的一切心，都是自利利他，清净无杂，圆满无漏。觉知一真如无为而本自超然存在的自性。在世间方知一言一行皆有因缘，一饮一啄又是前定；千劫我相今在何处，一朝醒悟方知性真。这就是十行菩萨的十真实行位。</p><p>　　佛接着说，阿难应该知道，这样修行六度，证得十行位的菩萨，由于长期自主修行六度，积累无量功德，在功德力的作用下，自性中六种超越自然而神秘的智慧力得以通达，即漏尽通、天耳通、天眼通、他心通、宿命通、如意通。佛的神通具有十力，菩萨的神通具有十自在，阿罗汉的神通只限于三界之内。由于功德力的不同，神通的作用力也有区别。在出世间，是诸佛满足诸菩萨获得神通之愿。如阿弥陀佛往昔为法藏比丘时，所发的四十八愿中，有六种神通愿。在世间，是行菩萨道的人，依佛法证得的六种神通。二者皆可以利用神通智力，圆满的完成各种佛事，又使藏性的正觉之体更加纯洁，内远留恋情想，外远患苦诸相；菩萨有情才觉有情，菩萨有法相身才救众生苦。既知众生无边誓愿度，自觉当然度众生；又知众生非众生，是佛、法、愿、缘度众生；非我、非人、非相、非想度众生，是众生自度。心归无为，性向涅槃，回向菩提，不舍有情。怨亲平等，悲悯一切；不见凡愚弊恶，唯佛、唯法、唯智、唯愿。这就是十回向菩萨的一离众生相回向位。</p><p>　　于过去世、现在世、未来世中不坏一念心。即承传一切佛事，求一切佛智，慈眼等观众生，修集广大福德力，成就一切智慧力，坏众生当世可坏掉的三恶道之业。同时，远离我想、我相、我所、我著，以诸善巧思维方便力，度脱众生永离魔业，永离生死的有为法，永离诸恶趣。这就是十回向菩萨的二不坏回向位。</p><p>　　见一切色相与触法，对美貌与陋容，不起爱憎，无诸过失，无诸忧恼，身心清净而悦乐，本觉寂静而三昧乐湛然，不染世法，乐出世法。知一切法如虚空，无来无去，不生不灭，妙有真实，愿发诸佛无上觉心，速成无上佛觉；愿世间一切含识众生，都出离世间而成就佛道。这就是十回向菩萨的三等一切回向位。</p><p>　　愿以诸善行功德力，供养三世一切诸佛无处不至，至一切处，至一切物，至一切世间，至一切众生，至一切国土，至一切法，至一切虚空，至一切三世，至一切有为与无为，至一切语言音声，至一切佛所；愿以信解无碍的大智慧力，如诸天供养具而为供养。在至一切处的诸境界，不舍含识，不著果报，不起分别，普善回向。这就是十回向菩萨的四至一切处回向位。</p><p>　　以修行忏悔法的功德力，破除一切诸业重障；并勤请诸佛说法，依法精进修行，悟一切不可思议的境界，能于一切佛所，于一切众生处，生随喜心，其心广大如虚空，知一切业与果报罪福无主，一忏、二愧、三精修后可远离。愿一切众生早得清净，愿一切菩萨早证菩提，愿一切诸佛早出于世，愿一切法界早转法无碍。这就是十回向菩萨的五无尽功德藏回向位。</p><p>　　以正法威德，名扬四方，让一切众生感德从其教化；以自在功德，得福德庄严，让一切众生心生爱敬；以大身坚固力，具足一切布施，让一切众生早得法味；以清净的智慧，法雨遍法界，让一切众生自调伏；以平等的慈悲恩泽满世间，让一切众生戒相庄严破魔军，自证菩提，自取涅槃路。这就是十回向菩萨六随顺平等善根回向位。</p><p>　　随自修积集的无量善根，能为承载诸佛法之器，能作十方众生福田，心得自在，常住诸佛道场；不乐生天，不贪富贵，不著诸行，让虚妄中的众生安住善法，清除垢染，心善无邪；以一切善法平等随顺一切众生，能灭除一切魔怨，神足无碍、身无碍、耳无碍、慧眼无碍，于一切法无所得，无我无法二分别心。这就是十回向菩萨七随顺等观一切众生回向位。</p><p>　　正念心明了坚固，远离种种迷惑相，专意修行求于佛智，大悲心增长，心佛合一难分离，护持正法安世间，教化众生不知疲倦。证得无量清净法门妙智，能广宣诸佛法妙义，以自在心和无畏力，善巧方便教化成就无量菩萨。证得无量三昧，于一切法无碍，辩才无碍；觉知心不在内，心不在外；法中无我，性中无法；一切世间的众生，真如本性相等；一切众生又是哀悯者，虚妄思维无实义。这就是十回向菩萨八真如相回向位。</p><p>　　对于一切善法，心生尊重。即对了脱生死法心生尊重，对能统领众生向善法心生尊重，对都摄六根不放逸法心生尊重，对忏悔业障法心生尊重，对随喜功德法心生尊重，对礼敬诸佛法心生尊重，对谦下心平等恭敬众生法心生尊重，对众生顶礼塔庙善行法心生尊重，对请佛说法或请善知识开示法心生尊重，对能行布施、持戒、忍辱等一切大乘法心生尊重。精修过去诸佛法，成就未来诸佛法，了知现在诸佛法；满足过去诸佛平等慈悲，成就未来诸佛平等慈悲，安住现在诸佛平等慈悲；行于过去诸佛境界，住于未来诸佛境界，等于现在诸佛境界，得三世一切诸佛善根，具三世一切诸佛种性，住三世一切诸佛所行，顺三世一切诸佛境界；又无有执著，无有缠缚，心得解脱，一切所修成就。这就是十回向菩萨九无缚解脱回向位。</p><p>　　清净的自性智慧显现，明了世间与出世间诸法实相，可以作人天法师，生起大慈悲心；广行法布施利益众生，所说诸法都让众生发菩提心；既为众生的导师，又是善生的善友。以所圆满成就的自性妙德，安住于无量法界平等清净身、清净语、清净心、清净行、清净愿，于无量法界安住于道场，说清净诸法，断一切众生疑惑，灭一切众生无量业。这就是十回向菩萨的十法界无量回向位。</p><p>　　佛接着说，阿难应该知道，证得十信、十住、十行、十回向四个十的一心清净的菩萨，按照不同的次第，成就了妙力而存在的圆融一体的四加行；即暖地、顶地、忍地、世第一地。这四加行从证得不同果位次第的声闻就开始附于法体，增加与道交的觉知而存在。不同位次的菩萨，也有不同的四加行。在这里，把不同位次菩萨的四加行中共同存在并感受到的境界，加以概括，突显出来。让众生知道，不同位次菩萨的法喜充满，妙乐无穷，都是从四加行演化而生。如世间人无四加行境界，空说自己是什么罗汉、菩萨等，是虚妄不实，自欺欺人，自负因果。不同位次菩萨的共同存在并感受到的境界是，春日里明媚暖乐，夏日里清凉风悦，秋日里光明爽眼，冬日里雪花晶身。修行自有四加行，各自阶段有不同。世间第一你莫喜，更有喜乐在上重。在声闻乘的四加行是暖相、顶相、忍相、世第一相；在前四十个位次菩萨的四加行是暖法、顶法、忍法、世第一法。具体地讲，即以觉知自性的功用，作用于自我之心，性于心内动而未出。使法体全身发热，如火烤木。声闻人从部位发暖至全身发暖，前四十位次的菩萨从五脏六腑内至外的全身发暖，进入十地的菩萨从骨髓里至脏腑与全身发暖。又以自心觉知，法体所行如佛走路一样，轻盈飘逸，既不觉法体在走路，又知法体在走路；如站在山顶，身在虚空中，脚还没离开山顶。声闻人知身轻腾飞于山顶；前四十位次的菩萨觉身轻飘然于山顶；进入十地的菩萨觉身如虚空一体，似飘然于山顶又离于山顶。心如明月皎然，法体清凉如佛体的感觉，身心畅然，无有善与恶的念头；世间的人与事等，都与身心畅然没有关系；这种身心畅然不受主观意识控制，又不是来自外界的强加，是自然而然获得清凉。声闻人从部位清凉至全身清凉，前四十位次菩萨从脏腑内至全身清凉，进入十地的菩萨从骨髓里至脏腑和全身清凉。心中念头的数量减少，在世间如寒冬一样无情，觉知到身心的清凉悦乐，心中无好与坏、美与丑等一切有为法的名字，觉知自己是所在世间第一喜心悦意的人。声闻人的世第一是难发菩提心，乐享天福而惧诸苦；前四十位次菩萨的世第一是喜禅悦而不惧诸苦；进入十地菩萨的世第一是住于禅悦无量三昧中，以苦为乐，修苦乐法。</p><p>　　佛接着说，阿难应该知道，一切佛法都以十地为本，以十地为究竟，以修行十地为成就，入诸佛智地。</p><p>　　诸佛智地中，一地为欢喜地。此地菩萨以大悲为首，即布施无极限。智慧广大如虚空，念诸佛、念诸法、念诸菩萨、念诸菩萨行、念佛教化众生等心生欢喜，亲近一切佛心生欢喜，远离凡夫地心生欢喜，永离一切恶趣心生欢喜，永离一切怖畏心生欢喜。随信念力入佛无量境界求佛大智，修行慈悲喜舍。知一切菩萨都是自修证得。这里的远离内凡地，说的是远离内凡菩萨位，超越贤位菩萨位。此地菩萨多作这个世界的大国王，豪贵自在，护持正法，以大施统领众生，以爱语利益众生，以大行念佛、念法、念僧导引众生，不离六度。</p><p>　　诸佛智地中，二地为离垢地。此地菩萨对众生以爱语为首，对自己以持戒无极限为首。具足正直心、柔软心、堪能心、调伏心、寂静心、纯善心、不杂心、无顾恋心、广心、大心。广修十善业道，远离一切杀生、怨恨、恶恼想，有惭有愧。远离一切偷盗、侵损想，一切不予不取。远离邪淫、贪欲想，心无邪想，目无邪视。远离妄语，梦中都说实语。远离两舌离间想，求大和顺。远离恶口的毒语、粗语、苦语、恨语、贱语、冷语、热语等想，一切语让他人欢心。远离不义语想，戏笑无乱言，一切法语顺道。远离贪物想，不愿不求。远离嗔恚想，慈心哀悯众生。远离邪见想，不行占卜，不取恶戒，行于正道。这里的远离是性远离，心无所想，慈容不同类的众生，慈悲同类众生；此地菩萨多作转轮圣王，为大法主，以善法护佑众生。</p><p>　　诸佛智地中，三地为发光地。此地菩萨对众生以利行为首，在佛法中以忍无极限为首。观一切有为法实相，无常、诸苦、不净、不安稳、不久住、生灭败坏等。又观一切众生无救、无依，与忧悲苦恼同住，与爱憎愁戚同行。以清净无极限的忍辱智慧，慈悲的方便力生起，用有为法破有为相，让众生惊醒而求无为。此地菩萨多作忉利天王，普利益众生。</p><p>　　诸佛智地中，四地为炎慧地。此地菩萨在众生中，以受拥戴为首；在佛法中，以精进无极限为首。修行正法，依于正思维、正语、正业、正命、正精进、正念、正定、正见。以慈悲的方便力，除去众生身见；以慈悲的爱语，利于众生共同修道；于众生中为首领；为一切依止者。此地菩萨多作须夜摩天王，以无量菩萨为眷属。</p><p>　　诸佛智地中，五地为难胜地。此地菩萨以禅定无极限为首。实知苦集灭道圣谛，实知一切有为法虚妄、诈伪、诳惑愚迷的众生，实知一切声闻、缘觉不为究竟；能破一切外道邪见。此地菩萨多作兜率陀天王，能让一切众生住实谛中。</p><p>　　诸佛智地中，六地为现前地。此地菩萨以般若无极限为首。实知一切法无相，实知一切众生受生皆由执著，实知出世间第一义谛唯一佛乘，实知三界一切所有，唯是一心所立因缘，智慧光明现前，不住有为法中，得入空三昧，能破诸魔。此地菩萨多作善化天王，度脱无量声闻。</p><p>　　诸佛智地中，七地菩萨为远行地。此地菩萨以方便无极限为首；自性能生出无量智慧的妙用为方便无极限，是十波罗蜜中的第七波罗蜜。善修空、无相、无愿三昧，善净无量身、语、意业，善求无上佛道，得甚深智慧；远离身、语、意业，又为度众生示现常行身、语、意业。以智慧方便力示现生死而恒住涅槃；以智慧愿力示现受生三界而不为世间法所染；以随顺佛智力示现入声闻、缘觉；以清静智慧境界示现住魔境界，示现行魔法，示现外道，示现一切行世间法；而不舍佛法，不舍无为行，善集助道法。此地菩萨多作自在天王，度脱无量缘觉。</p><p>　　诸佛智地中，八地菩萨为不动地。此地菩萨以愿无极限为首；愿求上上胜智，为愿无极限，是十波罗蜜中第八波罗蜜。一切心、一切忆、一切想都停止休息；一切相、一切差别寂静；一切功用、一切烦恼都不现前；住于十自在的报行中；即命自在、心自在、财自在、业自在、生自在、愿自在、解自在、如意自在、智自在、法自在。得不退转法，知一真如性如佛同，报行自在不动。此地菩萨多作大梵天王；为一切智依止者。</p><p>　　诸佛智地中，九地菩萨为善慧地。此地菩萨以力无极限为首；能破一切外道异论及诸魔众与魔法；是十波罗蜜中第九波罗蜜。实知诸法中正法与邪法相，实知诸定中正定与邪定相，实知诸佛密因咒力相，实知诸佛修行法门解脱相，说法无碍，辩才方便，不为诸问所难。此地菩萨多作二千世界主大梵天王，度脱一切声闻、缘觉。九地修行圆满的菩萨，妙生莲花，升座莲台，两足放光，面门放光，诸佛赞叹；依佛法修行结束，无为的功德圆满；以后是证佛道，不论修道；但在菩萨位次上，仍然是修行位次的菩萨。</p><p>　　诸佛智地中，十地菩萨为法云地。此地菩萨以智无极限为首；如实了知一切法，智充满十方法界；是第十波罗蜜。大智从自性起识，识界如虚空。九地前的菩萨知有自性，而自性不起识；所有识界为心识。以自性中未尽的慈蕴，生起大悲云；以妙有的自性愿力，生出大悲法雷；催伏诸魔怨，入遮覆无明的常住无灭的法性之海。一切身、语、意境界不可测知，一切解脱、变化、神力不可测知，一切供养、愿力、智行不可测知。此地菩萨多作魔醯首罗天王；善说三乘佛法，无量菩萨围绕为眷属。</p><p>　　十地菩萨行圆满成就，证入佛位菩萨。菩萨的大慈、大悲、大喜、大舍、大愿、大行、大智和无量波罗蜜门、无量陀罗尼门、无尽辩才门、自在神通等与佛同；但是逆涅槃流而住菩萨位，顺行佛法至远无终，入于等觉与妙觉之交汇处；成就为等觉菩萨。虽成就等觉菩萨，但不舍觉悟有情初心，广度众生。</p><p>　　菩萨位次从十信、十住、十行、十回向、十地中，一一五个十重复，四加行位与等觉位为二个单有。各位次菩萨功德圆满时，才进妙觉，成就无上的佛道；等觉为始觉，妙觉为终觉。各位次的菩萨，都以坚固心和妙智力，观察十种如幻的法相，渐次证入，圆证菩提。十种观察；一是观一切业如幻；二是观一切法如焰；三是观一切身如水中月；四是观妙色如空中花；五是观妙音如空谷响；六是观诸佛国土如干达婆城；七是观佛事如梦；八是观佛身如影；九是观报身如镜中像；十是观法性身如幻化。这样五十五个位次的真正菩提路，都是以正戒、正定、正慧三大增进法门而成就，都是由自修自证而得渐次进入。能这样观菩提路的人为正观；否则，是邪观。五十五个位次菩萨（等觉菩萨五个位在这里为一位次，妙觉菩萨未计其中）的修行境界，既是住佛净土菩萨的不同证悟境界，也是此世界行菩萨道人的不同证悟境界。</p><p>　　这时，文殊菩萨礼佛后请法说，应怎么称此经的名字？应怎么供养受持此经？佛说，此经法无量，包括三乘，佛智慧无尽，指明了众生修证成佛之路。此经名为，大佛顶白伞盖无上宝印，十方如来清净海中的智慧眼；也可称做救护修行人离开欲爱的亲近因缘，救护如阿难与性比丘尼这样的人，得发菩提心，入心性智慧海，也可称做修行诸佛法秘密因缘，了悟自性不生不灭，证得菩提的最彻底的义理；也可称做大智慧方便，广无边际，莲花藏世界海中之王，产生诸佛的神咒；又可称做灌顶法语，成就诸菩萨万行的究竟坚固的经典。要知应这样供养受持这部经典。</p><p>　　阿难等大众，听了佛说了义究竟的经名，知道了不同阶段的修行人应该如何依法修行的义理，心中疑虑清除干净，断三界八十一品思惑中的前六品。</p><p>　　这时，阿难又从座位站起，恭敬地向佛请法说，佛慈悲广大，威德无比，妙音无有遮拦，非常善巧的开启众生的智慧，清除了心里难以觉知的微细思惑；由对佛教的茫然朝热，变为了醒悟的智理；如获得大利益一样，身心愉快。</p><p>　　有的人对佛教盲目信从，一朝热劲；而不读诵经典又难闻善知识教，义理难开，不知醒悟。这样的后果有，一是容易为邪师伪装善知识，用佛法作幌子所欺骗，成为魔王眷属。二是一朝热劲难以坚持长久，朝令夕改，半途而废；难以出离生死，仍为六道众生。三是热一阵子，又冷一阵子，一生仅凭灵感而追求时尚，不入修行正路，只种善根，不求出离。这里的盲目信从与一门深入修行是两码事。</p><p>　　阿难接着说，如此具足妙有智慧清净的真心，本来就于十方世界中无处不存在，法性又圆融无碍，乃至如山河、大地、草木、蠕动等一切含灵众生，都具有真如自性，也是如来成就佛道的真实之体。既然佛体是真实不虚，怎么还有地狱、饿鬼、畜生、修罗、人、天人等六道差别众生呢？六道众生是本来自然就有，还是从众生妄习因缘而产生的呢？再如为什么宝莲香比丘尼，已经受菩萨戒；但不守戒，私行淫欲。而且还妄说行淫欲也不杀、不偷、不抢，无有业报。结果是性病如火烧，从阴部至全身；命终堕落无间地狱呢？</p><p>　　在座诸位中，现在有人已受三坛大戒，受了戒可别犯戒，犯了要加倍惩处。因为是明知故犯；所以要罪上加罪。有的人，认为受了菩萨戒，自己就是菩萨了，拿着菩萨尺子去衡量他人。自己不是菩萨，能衡量他人是不是菩萨吗！我不反对谁受戒，我赞叹守戒。菩萨不是受戒来的，是得戒来的，是持戒修证来的。我于定中，无数次去过各地狱，实观地狱众生苦报，目不忍睹。人活着时，说话四六句，走路四方步，神气十足。可是一旦堕落地狱，神气荡然无存，垂头丧志，苦报连连。真有地狱宇宙中，银河系里有黑洞。仗佛威神亲目睹，幽冥受苦做恶人。地狱本由人心现，人生恶念有千般。自感地狱十八层，层层又有八加千。有人说子替母受苦报吧！不行！谁也替代不了谁！因为各自造业不同，果报不同。如世间的杀人犯，子欲替父顶罪，依法判决是不可能的，地狱也是这样法则。</p><p>　　阿难接着说，再如为什么琉璃大王，为雪婢生之辱，诛杀释迦族，欲使种族灭绝，而生身陷入阿鼻地狱呢？还有一位善星比丘，是佛堂弟之子，曾作佛的侍者，依文解义，不求真修实证，妄说一切法空；如把流浪汉的一无所有，说成是阿罗汉的空无等；也生身陷入阿鼻地狱呢？</p><p>　　这里的琉璃大王，诛杀释迦族，近因婢生之辱与远因尽捕池鱼，公案中有详细记述，不再细讲。在《大般涅槃经》中，对善星比丘有详细记述，这里也不再细讲。阿难接着说，地狱是否有固定的地方，还是各人有各人的业感私受而无固定的地方呢？请佛慈悲开示决定义理，让一切持戒的人都欢喜持戒，保持谨慎洁白的身口意业，对禁戒丝毫不犯。</p><p>　　佛说，阿难你问的快如佛意，为不让众生入诸邪见，应该细说。一切众生，实有的真如本性，清净无染。因无明遮蔽而生出颠倒的妄见和习气，有内分、外分。内分是诸爱，染著于世诸相、诸有，生起妄想妄情，积集的越来越多，永无休止。所以，爱水充盈，心想美味，口流涎水；心想亲人，眼流泪水；心贪求财物，血液循环加快；男女行淫，二根自流液体。诸爱虽有区别，但心想的内动力可使液体流动，表现是共同的。外分是众生对身外一切诸有和境界的渴求之想，身体产生的气动；也是身体以外客观存在的一切事物。持戒修行的人，身轻心净；修行密法，心持咒印的人，身体雄健，坚韧十足，心有羽化升天之感，梦有腾飞之想，梦中若能心念佛号，梦中的境界如佛国圣境。有这样境界的人，为亲近善知识，才能自轻身命；知身命事小，慧命事大；身命是一生一世，慧命是生生世世。外分诸想，虽有不同，但善境界气轻超然；遇恶境界心不转物的人，会浊气上升，暴跳如雷。一切有为世间，众生的轮回生死不断，顺从自己往昔善恶习气而生，死后随业力入变化流转异类身体。临命终时，一息尚存，体温未尽，一生所作善恶立即影现出来，与求生惧死的习气，相交织在一起，心里痛苦万状。</p><p>　　一生行善的人，临终时善境界现前，心中生起欢喜，于不知不觉中生往善道。生往善道的人，身体也不痛不苦。人在临死的那一刹那非常重要，亲人别急于换衣服，穿什么衣服就是什么衣服。在体温没凉透时别动，怎么呆着就怎么呆着，这时候只要一碰身体就痛苦难当。心脏停止跳动后，脑电波还存在，身体还能有感受。这时候，一生嗔恨就堕落地狱、饿鬼、畜生三恶道。所以，在世俗，谁家有信佛人是一家人的幸福，生作善事，临终时能帮助念佛，往生善道；又按佛教的方法处理后事，免追加罪业。</p><p>　　如有人做了很多善事，但心往外求，没有向内修，死后即生天上。神识离体后就向上走，走的过程中就现出一片光明，光明一现，闪出一条大道，童男童女就来接引。堕落地狱的人迷迷惘惘，心里非常痛苦，黑白无常拿着法器引魂幡把神识引出来，眼前也现出一片光明。由于作恶多，没有修善，眼睛一见光，刺的眼睛一闭，扑腾下去了。正是天堂有路你不走，地狱无门自来投。不是谁整的，不是阎王爷接谁来的，不是地藏王菩萨不慈悲，是自投的。问问自己，一生都做了什么事，怨不得他人。谁也不能把谁送地狱去，都是自业召感去的，这就是生天和入地狱的境界与过程。</p><p>　　佛接着说，如修行人只修观想，虽纯想专一，但未得正定，命终后神识腾飞，必生为天人。如是受戒皈依的人，既修福、又修慧，就往自己的心里飞。一般人可能没这个感受，感觉自己的神识是一个非常小的点，从这一个点往里飞，越飞越宽，越飞越大，没有尽头。这时自己的心和宇宙是相通的，可见十方佛国土，随愿往生，佛菩萨就在自己的心里。</p><p>　　内求是自性与佛性相通，才有向心里飞的感觉。既没修福又没修慧的人，自性没与佛性相通，想往心里飞也飞不了，没有空的境界，飞得了吗！没有禅定功夫飞得了吗！没有念佛三昧的境界飞得了吗！修行净土的必是净念相继，念得三昧，可以证得往生。修行禅定的人必须开悟以后，心性与佛性是相通的。修行密法的人，有的活着时神识就可以离体，十方遨游，就可以与佛境界相通，往生佛净土；身可以留形于世，弘法利生。佛法是不是真实的，当人证悟时，才知真实如此。有些人还半信半疑。我准确地讲，佛清净国土，千真万确的存在，又千真万确的可以往生；往生的人千真万确的享福，具足一切善行，报身还不回来了。那时，再看这个世界真是娑婆世界，太苦太苦了。三界众生都是因为欲、有、无明三种业流，产生欲爱、色爱、无色爱、见一切相、无明五种烦恼召至轮回生死不息。</p><p>　　佛接着说，三界众生皆因欲流和有流轮回生死。身体欲爱的情少而心里想的多，神识离体后也会轻盈飞举，但不能高远。如是一情九想，即为飞行仙；是二情八想，即大力鬼王；是三情七想，即为飞行夜叉；是四情六想，即地行罗刹，在四天王天以下自由飞行游动。在这些众生中，如有信佛的人，发起善愿或有善心，护持佛法；虽为飞仙、大力鬼王、飞行夜叉、罗刹，都可为天龙八部的护法善神，护佑在持戒人、持咒人、修行禅定人的周围，等于亲自住在佛的座下；待业销愿满时，生人天中，有机缘闻法修行，得证圣果。情和想各半的众生，神识离体后不能飞升，也不能下堕，生人道。平常人爱流为情，情流为欲，一半人的习气、一半兽的习气；所谓的男女情欲就是兽的习气。人道就是善恶各一半，情欲算恶的一半；有情就私，有私就恶。男女之爱，情多可了不得，如见男女乱来，就有人会骂是畜生。实际不是骂谁，而是必然召感畜生果报。情欲重一点的为鹿羊类；微轻一点的为鸟类、禽类，是情体幽暗而愚蠢。别以为情欲心重是好事，果报可怕呀！六情四想的众生，神识离体后，随业习流入横生的毛群或羽族类。入毛群的众生，为人时还有做事横霸的因缘。入羽族的众生，还有贡高我慢的因缘，经常瞧不起他人。生为羽类，还觉得比他人高，能在天上飞。所以，骄傲之心要不得，业报不可思议。七情三想的众生，神识离体后，随业习沉入水族。沉入水族的众生，为人时还有做事心思重，动心计的因缘，情多恶习多，想事深沉。水族众生，离开水就活不了，做事阴毒就深深的沉入水底，不见光明。八情二想的众生，神识离体后，随业习生为饿鬼。生为饿鬼的众生，为人时还有做事爱占他人便宜的因缘。饿鬼见人吐口痰都得抢着吃，到嘴又变成猛火，长期有饥饿感；长期想食还食不下去食物，肚大如鼓，咽细如针。而且寿命非常长，百千劫不得出离，苦不堪言。九情一想的众生，神识离体后，直接堕入风吹火猛的地狱中。微轻一点入地狱，重则入无间地狱。堕入地狱的众生，为人时还有乱伦或不分地点乱淫的因缘。大地狱四面是铁墙，没有窗户，只有一个观察孔，把人的罪识投入里面，人似梦一样，感知到了，火枪在上空飞，不敢往上走，地上有的狱卒用尖刀把肚子抛开，肠子外露，铜狗、铁蛇抢食。真修行到那一天时，到地狱去观一观，让作一点恶事都不敢作了。遭不起那个罪呀！毛骨悚然，无法形容，何况亲受。纯情无想的众生，神识离体，直接堕入阿鼻地狱。如心中又有五逆重罪，毁谤大乘经典，毁佛禁戒，未证谓证，说自己是佛，或冒充僧人，贪求众生供养，乱受众生恭敬，诳说无佛无法，无因无果；妄说戒是人定的，酒肉穿肠过等。这样人的罪识，于此方阿鼻地狱坏掉时，还要更生至十方阿鼻地狱，无有出期。众生造业不是一天造的，今天造点、明天造点，循造恶业，无量劫来不知造作多少了；既有自己造作的，也有和他人一起造作的，都是因地因时造作的。虽然是自业召感，自作自受；但也有主次，同入地狱中受报，地点、时间也有不同处。</p><p>　　众生情想十种业因，致使六根交织在一起，一体受报。修行证果的圣人不沦入五道，证果的人神识轻盈，活着时肉体就轻盈，各星球对神识的吸引力就销失了。什么时候到适应的那层天上为止，就化生享天福去了，或往生佛净土。修行人一静坐念佛，神识就轻盈，静坐一须臾，胜造七宝塔。静坐念佛或禅密修行，不仅改变人的身体，心中的习气都随着发生变化，减灭情想烦恼为清净身心，断除轮回生死的因缘。阿罗汉可断欲流、有流产生的烦恼，不能断无明流产生的烦恼；菩萨可断无明流产生的烦恼，而出离世间。佛接着说，这些果报都是众生自业召感，身心虽形成十种业习，但是六根交织造作；所以，才有六道众生。众生十种业习以什么为因缘呢？</p><p>　　一是淫习。二者交媾接触，相互作用，以求欢乐。这种欢乐是欲火之种，点燃了自身受苦报的大猛火光。对修行人是万恶淫为首，淫是火烧一禅天；就是人的欲火烧掉自己的一禅天功德。所以，召感到地狱果报的时候，有铁床、铜柱。铁床就是地板，被大火烧的通红，人想站立而又站立不了，想抱柱子躲身，柱子也是火热的。信佛修行的人须断淫，断淫才能修行得究竟，出离三界。十方诸佛异口同音地说，多见几眼美色，如同欲火；诸菩萨见美色，如躲避火坑一样远离。</p><p>　　二是贪婪物有。贪心为水，物有为寒，珠宝寒光作用于水，才有寒冰地狱。众生不知止足、不择手段的贪名、贪利，都堕落到寒冰地狱里去。往昔贪婪的习气和现世占有财富的欲望，相互促动，才召感有吒吒、波波、罗罗和青、赤、白莲六类寒冰地狱。才召感有冻裂罪识肢体，冻掉手足等事。修行人身心都不愿接受供养，何况贪求。众生的供养中含有无量众生以生命为代价的业力，不用修行佛法的神力化掉业力，难以成就圣果。十方诸佛异口同音地说，多见几眼财宝，如同贪水；诸菩萨见财宝，如躲避瘴气之海一样远离。</p><p>　　三是慢习。往昔傲慢积习与现世自持尊高的性格，相互作用。我慢为山，山大则蕴水流。傲慢的心如高山流水，奔驰不息；虽似高高在上，却又容易生出嗔恨心。瞧不起他人；比谁都强，比谁都聪明；慢易生嗔，傲易遭嫉；慢易轻师，傲易慢教；旧习新气相互鼓动，实际是聪明反被聪明误。欺辱弱小，强取豪夺，横行霸道，目空一切；所以，慢习业力召感有血河地狱、灰河地狱、热沙地狱、毒海地狱、铁丸地狱等。修行人心无贡高我慢；见到什么人都谦下、平等、慈悲，对穷与富、贵与贱、亲与怨、大与小都平等相待。十方诸佛异口同音地说，用眼不平等看待一切众生，如饮痴水；诸菩萨见慢，如避洪水一样远离。</p><p>　　四是嗔习。就是易气愤恼怒，脾气暴躁。往昔嗔恨积习气与现世怨恨心交织在一起，互相增益，相互逆动；恨天不公，恨地不平，恨国不兴，恨家不起，对人与事处处逆动，没有停息，不能自解。怒气为火，心怒火起；怒气之火如金一样坚硬，什么愚痴之事都能作出来；为报仇雪恨，解气平怨，可以奋不顾身，不惜一切代价，走向极端或恐怖，产生的杀气腾腾；才召感有刀山、铁棍、剑树、剑轮、斧、钺、枪、锯等地狱；遭受宫刑、砍头、斫骨、剉割身体、刺穿胸部、槌打杖击等痛苦。修行人遇逆缘或助道，心生感激，平心静气，熄灭嗔火。佛教中有性如灰的公案，观世音菩萨示现助道身来考试，结果灰中有火星，佛菩萨不予接引往生净土。十方诸佛异口同音地说，用眼见嗔，如见锋利的刀剑；诸菩萨见嗔，如躲避诛戮一样远离。</p><p>　　五是诈习。往昔欺诈的习气与现世诱骗的心念交织在一起，相互调和，想出愚弄人的手段，引起贪婪之心而不能止住；如用长木与长绳设计圈套，将猎物引入套牢，取其身命；又如清水灌田，让草木生长一样；使欺诈与诱骗相互延续，诈财骗色种种千般；才召感法网恢恢，疏而不漏；在地狱中有杻手、械足、枷项、锁颈、鞭打、杖击、棍棒等诸苦刑罚。业报结束后，还转生牛马猪禽等动物偿还诈骗业债。修行人见诈骗感言，偷诈奸欺巧豪夺，贪欲物色无限多。恶到地狱犹不醒，贪变畜生任蹉跎。十方诸佛异口同音地说，用眼见奸伪，如见贼人；诸菩萨见诈，如畏惧豺狼一样可怕。</p><p>　　六是诳习。往昔诳妄的习气与现世诬欺的妄心交织在一起，相互促进；作用是为己利益或团体利益相互攻击对方，没有的事说有，凭空想象，捕风捉影，诬良为娼，颠倒黑白，制造权谋诡计，陷害、诬罔、欺骗，才召感有粪尿泥小地狱，飞沙小地狱；在地狱中有被飞沙、尘、粪、尿等污物溺没、举起抛下、吹高跌下、漂浮沉下等痛苦的惩治。修行人见诳是天理难昭尽五浊，颠倒黑白惊魂魄。十方诸佛异口同音地说，用眼见欺诳，如同见到劫难与杀害；诸菩萨见诳，如用脚踩毒蛇一样厌惧。</p><p>　　七是怨习。往昔怨习气与现世常有理的心理交织在一起，在一贯正确和要面子的作用下，产生憎嫌怀恨。无论遇到什么人与事，都觉自己是天下第一受怨屈的种子，天下的任何人与事都对不起自己。而过失都是他人的，听不进一句衷言劝告；从不忏悔自己的过失，永不休止的抱怨他人长短；实则是阴险狠毒的人，心怀恶意如恶兽一样的人，利用奸谋暗算他人的人；才召感有飞石、匣储、车槛、相扑等地狱；让入地狱的罪识受其害人反自害的惩罚。修行人不见世间过，一切是非先找自己过失，有幸闻法觉醒，忏悔往昔业障。十方诸佛异口同音地说，用眼见怨家，如见违害鬼；诸菩萨见怨，如饮最毒的鸠酒一样可怕。</p><p>　　八是见习。以世间的理，不依佛法；主要是指执著于诸恶见，执著于以我为中心的身见，执著于一点而不观全面的偏见，执著于不信因果的邪见，执著于空想为有的见取，执著于持牛戒狗戒为生天因缘的戒禁取。往昔恶见习气与现世我执法执的心理交织在一起，相互作用如狼狈而又形影相随。由诸恶见产生邪语邪行，一切言行造作以世间的俗理，不依佛法；假以世间人作标准，不依佛菩萨圣贤为标准；假以现代文明作标准，不依道德伦理作标准。将佛法与世间法相违逆，表面上是追求新形势，事实是颠倒加颠倒。如一个人做的是恶事，善人都不耻言表，而见习重的人还认为是英雄；才召感地府有无常王使、书吏判官、记录文簿等，让入地狱的罪识相见核验；并受到审问、靠讯、查访；还有善恶童子，手持文簿核对记述，判定处罚等事。做事想欺瞒人天的人，如掩耳盗铃，自欺而不能欺人。修行人善见一切，诸法中无法我，以戒为师，心不轻仁，仁者无敌。十方诸佛异口同音地说，用眼观恶见，如见深坑；诸菩萨见诸虚妄偏执，如临有剧毒又深不见底的沟壑一样可怕。</p><p>　　九是枉习。枉即功劳是自己的，过失是他人的。往昔枉习与现世诽谤心交织在一起，在功名利禄的作用下，为达到个人目的，不惜嫁祸他人，诽谤无辜，邀功推过，压迫众人等。使人受不白之冤，申诉无门，受尽屈辱；才召感有合山、合石、碾、礳地狱；让入地狱的罪识受押、捺、捶、按等惩罚。修行人经常有莫须有的过失或替他人背黑锅，是了往昔业习，断未来果报。十方诸佛异口同音地说，用眼见谤，如见猛虎；十方诸菩萨见枉，如见雷击物一样可怕。</p><p>　　十是讼习。讼习就是昧着良心告刁状。往昔讼习与现世狡辩心理交织在一起，不坦白作事，用虚假掩盖事实真相；无理狡三分，得理不饶人；各执一词，混淆黑白；赖账侵财，讹诈谋利，昧良耍刁，诱人上当。谎言伪证，丧失公德；才召感地狱有监察业具，业镜台；让入地狱的罪识见到的自录其形，自说其言，使自己所造诸业自我暴露于光天化日之下，无言以对，自愿接受地狱的各种苦刑惩罚。修行人直心是道场，佛法无曲直；静时常思己过，众前不论是非。十方诸佛异口同音地说，用眼见隐私，如见黑夜里的贼人；诸菩萨观隐瞒罪恶如头顶高山，足踏巨海一样可怕。十习生万业，地狱业惑成；无处不是苦，尽是鬼嚎声。世人多不觉，妄乎凭侥幸；自作还自受，天理最公平。</p><p>　　佛接着说，一切众生业报都是由六根的识别功用造成的，业报之因都是从六根生出。一切众生的恶报之因是如何从六根生出呢？六根功能相互作用，一根造作，五根配合。一种恶报，也先从一根表现出来，又作用于其它五根。</p><p>　　一是见报召感或引起的恶果。人临终时，诸见业交织在一起，先见大火满天；然后亡者的神识乘飞烟就堕落无间地狱。眼见到的是色，火也是色。眼见色，心就随色而动，为色所转。不信因果的人，认为这个世界上没有因果报应，人死了就是什么也没有，动物死了就是供人吃肉。把动物和人在表面形式上区分开来，认为人就是人，动物就是动物；不知里面还有个相通的心性。人与动物都有一个神识，都有一个自性，都共同有喜生惧死的特点，只是业报身相不同。见到大火堕落无间地狱的，都是欲望之火旺盛。欲火旺盛的人必定贪著酒色财气；杀父弑母或造五逆重罪，都是为了满足贪欲造成的。所以，欲火无烟，业习为烟，自堕无间地狱；无间地狱一人也满，万人也不多。由于一切有为法有相对性，受见报所感，无间地狱里会发生二种相，一种明见相，二种暗见相。明见相是见到各种凶恶动物而恐惧，如火蛇、火狗、火牛、火驴等；暗见相是冥冥黑暗，不见一丝光明而心中感到恐惧。明见相如白日，暗见相如黑夜，是无间地狱的一天。眼根见火后，其它五根也要受报。耳听的娇滴之音，化为镬汤洋铜的沸腾声；鼻嗅的芳香之气，化为黑烟和紫色的火焰；舌尝的香甜滋味，化为入口的火丸和铁汁；触摸的珍宝和玉体，化为烧手的炭火热灰；心中爱恋的财富和淫乐，化为火星飞溅，又被狂风吹满虚空。</p><p>　　二是闻报召感或引起的恶果。临命终时诸闻业交织在一起，先见到洪水波涛无边无际，然后亡者的神识落入水中，随流堕入无间地狱。闻为水，闻业由耳根召引；闻声执音，妄加分别，被声尘所转，顺耳生欢，逆耳生嗔。欢则忘形，嗔则非为；顺我者昌，逆我者亡。受闻报所感，无间地狱里会发生二种相；一种开听相；二种闭听相。开听相是噪声纷杂，喧器如闹市，不绝于耳；使精神慌乱，处于不知所措的痛苦之中。闭听相是冥冥静寂无有一丝声响可闻，如魂魄沉没于幽深的山谷。开听相如白日，闭听相如黑夜，是无间地狱的一天。由于外面的声音入耳后，听善言则疑神疑鬼，听逆语则暴跳如雷，百般质问责难，兴师问罪；入无间地狱。耳根闻水后，其它五根也要受报。入眼化为雷雨怒吼声，欲震碎魂魄。耳根召感的业习如剧烈的毒气，入鼻则化为雨雾，潮湿中的毒虫爬满全身；入舌则化为脓血，臭秽不堪；入触则化为摸到畜生一样生厌，摸到鬼一样可怕，摸到粪尿一样恶心；入意识则化为闪电冰雹，心惊胆颤。</p><p>　　三是嗅报召感或引起的恶果。临命终时，诸嗅业交织在一起，先见毒气充满世间，远近弥漫；然后亡者的神识如从地中涌现出来，无路可走，无处可逃，于恐慌中堕入地狱。嗅为气，嗅业由鼻根召引；嗅香则喜，嗅臭则厌，被气觉所转。喜则胡思，厌则乱想；胡思颠倒，乱想迷真。受嗅报所感，无间地狱会发生二种相。一种通嗅相；二种塞嗅相。通嗅相是被强烈的臭气熏的无法忍受，扰乱心神，闹心到极点；塞嗅相是气息闭塞不通，憋闷气绝，昏迷于地。通嗅相如白日，塞嗅相如黑夜，是无间地狱的一天。由于嗅报之气暴戾，内嗔外粗，则能化为质问轻慢，要将对方踩于脚下，踏上一万只脚，永世不得翻身。入无间地狱，鼻根嗅气后，其它五根也要受报。入眼化为火炬；入耳则化为淹没镬水洋汤的沸腾之声；入舌化为臭鱼烂虾味；入触则化为腐烂而又有无数虫蛆睁眼抢食的大肉块；入意识则化为热灰一样的飞沙，笼罩在障气内而击碎身体。当修行到转鼻嗅习气时，会观察到地下都是毒气、毒烟；身体须从上面飘过，而不入其中，才能躲过嗅气之报。人的鼻子，要香与臭之气都空一边去；在思维中不产生高兴与不高兴，不著两边。在听闻佛法上，在文字语句上，谁讲的好、谁讲的不好，容易落入邪见。不能用这个标准来衡量，衡量的标准只有一个，讲的是不是绝对真理，而不是相对真理；在这个世界上讲的是相对真理，没有绝对真理。只有佛法在宇宙中是绝对真理，谁也改变不了，哪里都适用。评价佛法标准，必须是开悟的人，不开悟的一说就是不如法。因为世间法都是颠倒相，用思维颠倒相的标准，就偏离正道的正知、正见、正觉；有的人专门研究佛经，我问他，佛在没讲这部经前，佛的一些弟子，已经证得阿罗汉果，是怎么证得的；他回答不了。所以，信佛人一定要重实践，多坐、多行，少说、少起分别心、差别念。读诵佛经帮助人坚固其心，启智明慧验证自己有没有走偏路；佛经只解决培德与解惑的事，而不能代替修行。</p><p>　　四是味报召感或引起的恶果。临命终时，诸味业交织在一起，先见烈火烧红的铁网覆盖于上空；然后，亡者的神识慌乱逃窜中，倒挂铁网上，头悬其下，堕入无间地狱。味属金，味业由舌根召引；贪食美味，残杀生灵，网捕禽兽海鲜。受味报所感，无间地狱会发生二种相；一种吸气相，二种呼气相。吸气相是吸寒气冻裂身的皮肉；呼气相是呼出猛火，使身肉焦烂，热至骨髓。吸气相如白日，呼气相如黑夜，是无间地狱的一天。入无间地狱，由于舌根尝味时强迫生灵承受疼痛而生烹活割；所以，其它五根也要受报。眼见火烧其身如烧红的金石，耳听是锋利的刀剑之声，鼻息是憋闷如入火热的铁笼子，身触是身似受弓箭所射，意识是觉知火红的铁水如雨一样从空中落在身上。观察因缘的时候，观察世间的人，临命终时往上走生天的人，寥寥无几，大多数都往下轮回而去。我是亲身所观，一点虚假没有。餐桌上食用的肉食，是世界上的刀兵劫。众生之间互相吞啖、互相杀戮，循环不息。修行人开悟以后知道如何去持戒，如何去精进。对一切美味，心不动、念不起，唯一空定禅味。</p><p>　　五是触报召感或引起的恶果。临命终时，诸触业交织在一起，先见大山移动从四面合围而来，没有出路。然后，亡者的神识见到一座大铁城，里面到处是飞奔的火蛇火狗，虎狼狮子；牛头狱卒，马面罗刹，手持枪矛，将罪识驱入铁城城门，即进入无间地狱。触为火，触业由身根召引，多是卖淫嫖娼，乱伦强暴。受触报所感，无间地狱会发生二种相；一种合触相，二是离触相。合触相是见山移动至一起，挤碎身体，骨肉血如烂泥。离触相是刀剑刺身，如屠宰一样心肝裂痛。合触相如白日，离触相如黑夜，是无间地狱的一天。由于身根触觉媾和之欢，才召感山挤刀割之苦。其它五根也要受报，眼见是喷火的火山逼身；耳听是山体碰撞声，刀剑击打声、弓箭发射声、鬼的哭嚎声；鼻嗅是布裹袋装喘不上气时又捆绑拷问；舌根是犁舌拔舌、割舌断舌；意识是觉得一会下坠、一会上冲、一会热煎、一会火炙。身体最大的感受之欢是淫，男人感到女人好，女人感到男人好；六尘中最难断的是触，最容易造业的还是触。做恶事要到地狱里去，说你去地狱，你会很生气；因为说地狱，心里很恐惧。但是，不让去地狱，你会更生气；因为地狱里，极具诱惑力；不但有酒色，更有财和气；名闻加利养，五根有贪欲。人死后都盼儿女为孝做点善事；岂不知，人活着时造业，死后造业更重。儿女们办丧事讲排场摆阔气，送行去多少车好，大摆酒宴，杀害生灵，这些恶业，还得加在亡灵身上。十分罪业，又承担七分；儿女承担三分。</p><p>　　六是思报召感或引起的恶果。临命终时，诸思业交织在一起，先见狂风吹坏一切建筑物和树木，惊恐中无处躲藏。然后，亡者的罪识被狂风吹向空中，又盘旋着掉落下来，在飘荡中堕入无间地狱。思意为风，是五根总汇，即五贼的谋士；思意之业又为五根所造。受思报所感无间地狱会发生二种相；一种不觉相，二种不迷相。不觉相是心慌意乱如精神病，于不知不觉中奔走不息；不迷相是什么感受都清楚的觉知到，心如油煎苦，剧痛难忍受。不觉相如白日，不迷相如黑夜，是无间地狱的一天。由于意根邪思，身口结成思业，心中既知身在地狱，在地狱里又知方向，又知因何业受报。其它五根也要受报，眼见自造业，如见监控录像的证据，心受谴责；耳听是大石相撞之声使心受到冰霜土雾一样无情惩罚；鼻息是觉得身在火车中、火船上、火笼里难以喘息；舌根是痛苦的叫喊、哭泣、悔过；身触是腹胀为大、呕吐为小、仰卧翻滚，于苦中万生万死。</p><p>　　佛接着说，阿难你应知，众生堕落地狱的十种因缘是淫、贪、慢、嗔、诈、诳、怨、见、枉、讼十种习气；才产生身体六根极重的果报。都是因为众生痴迷世间诸相，执著我有妄想；只为表相幸福而追求造作，不知实相禅悦而持戒修行。如众生是六根于一生中共同造作恶业，恶贯满盈，无恶不作，十习样样具全，在阿鼻地狱受无量苦报的时间要长，不知什么时间是尽期，难得脱离苦报。如众生一生中六根各自造作恶业，似吃喝嫖赌抽，坑蒙拐骗偷样样具全，只是不同时间；这样的罪业要受极重的八种无间地狱的惩罚；较前轻受一半。如众生一生中只造作了杀盗淫，只是<a href=\"/remen/sangen.html\" class=\"keylink\" target=\"_blank\">三根</a>，不是六根；这样的恶业要受到十八种大地狱的惩罚；这十八种大地狱是八种火地狱，十种寒冰地狱。如众生于杀盗淫三业中，只有一杀一盗一淫，这样的罪业，要受到三十六种地狱的惩罚，较前又轻受一半，在一定的时间内，一半的时间受到十八种大地狱的惩罚，另一半的时间受到十八种小地狱的惩罚；如众生一生中杀盗淫只造作其一；这样罪业要受到一百零八种地狱的惩罚；在一定时间内，三分之一的时间受到十八种大地狱的惩罚，三分之二的时间受到七十二种小地狱的惩罚，较前又轻受一半。</p><p>　　由于众生各有造业不同，同一众生造业也有不同，在此世界中，有的住在同一地方，有的住在不同地方，但所作同业受报相同；都是因为无明妄想的习气，颠倒执著诸有相，而造作恶业。所作恶业，不是自性中固有，也不是人一生来世间就有，都是旧习与新想混合在一起，因缘汇合时瞬间发生。人生七分命运，三分自主；受皈依持斋戒后，三分命运，七分自主；会将作业因缘忏悔而破坏掉，逢凶化吉，遇难成祥。</p><p>　　佛接着说，诸众生如不是破坏佛制戒律威仪，犯菩萨戒和诽谤佛入般涅槃；而是造作其余的各种罪业，在地狱中长时期受热恼惩罚后，罪业销除；依照不同的习气，还要受生各种鬼类。众生如是破戒谤佛谤法，就要堕阿鼻地狱，求出无期。如是因为贪求财物而造作罪业，从地狱报完出来后，依照贪习，附于草木，成精作怪，名为怪鬼。如是因为贪求色相而造作罪业，从地狱报完出来后，依照淫习，随风成形，有时化现女妖，用色相勾引人；名为魃鬼。同时，所到之处，阴阳失调，云雨难成。如是因为贪求编造谎言，诳惑众生而造作罪业，从地狱报完出来后，依照诈习，遇畜生而成形；依附于狐狸类为妖魅，惑人失德；名为魅鬼。如是因为贪求嗔恨之快而造作罪业，从地狱报完出来后，依照嗔习，遇毒虫而成形，依附于蜈蚣、蝎子类；毒害迷惑人，名为蛊毒鬼。如是因为贪求往昔宿怨、怨恨难平而造作罪业，从地狱报完出来后，依照怨习，遇衰败之气而成形，依附于病人身上为肿瘤细胞或散行瘟疫病毒，名为疠鬼。如是因为贪求傲慢之乐而造作罪业，从地狱报完出来后，依照怨习，遇气成形，依然傲气十足，目中无人，鬼肚大如鼓，口大如盆，咽细如针，成天受饥饿苦报；名为饿鬼。如是因为贪求诬枉阴狠之欢而造作罪业，从地狱报完出来后，依照枉习，遇幽冥之气而成形；喜欢暗昧害人，乘人入睡时魇人，俗称魇；名为魇鬼。如是因为贪求邪见爱耍小聪明而造作罪业，从地狱报完出来后，依照见习，遇日月精华之气而成形，在旷野、山谷、沼泽处迷惑人，名为魍魉鬼。如是因为贪求伪诈取得名利成功而造作罪业，从地狱报完出来后，依照诳习，遇明月之气成形，受咒术驱使传送销息；名为役使鬼。如是因为贪求结党营私、恶助争讼而造作罪业，从地狱业报完出来后，依照讼习，遇人附体；即俗称鬼上身。传递吉凶销息，名为传送鬼。</p><p>　　佛接着说，阿难你应知，这样的人纯凭自己的情感对待一切，自私贪婪而堕落地狱又受诸鬼形，诸鬼有形无体；都是自心颠倒，妄意胡为，狂想丧善，召感苦果报应。如能闻佛法受教，悟善觉迷，持戒修行，身口意清净，证知自性与佛性相等，也可证得菩提，具足圆满的福德妙智；自性中根本没有一切情想无明。</p><p>　　佛接着说，阿难你应知，还有诸鬼类业报受尽以后，情想与苦受相抵销；方可轮回于世间为畜生身，偿还往昔为人时打骂奸欺、怨枉诬慢等原始宿债，受人驱使或宰杀，直至本与万息还清；还本付息时，如一鸡独食米山，一烛燃断铜柱，漫漫无期。现在人有福报，但要学会做善业，做有功德的事情；放生、听法、供养、布施、持戒、修行，这是用积聚的功德，回向社会，回向法界；干净做事，清正做人。依附在草木的鬼类，贪婪物欲的业报销尽时，余习不尽，生于世间多为枭类。遇风成形的旱魃鬼，贪著淫欲的业报销尽时，余习未尽；生于世间多为贪色好淫的禽兽；如鸳鸯、鹿等。遇畜成形的魅鬼，遍造谎言诳惑的业报销尽时，余习未尽；生于世间多为贪媚的狐狸类。遇虫成形的蛊毒鬼，贪求嗔恨之快的业报销尽时，余习未尽；生于世间多为狠毒的蛇类。遇衰成形的疠鬼，宿怨冤恨的业报销尽时，余习未尽；生于世间多为执著宿习的蛔虫类。遇气成形的饿鬼，傲慢盛气的业报销尽时，余习未尽；生于世间多为痴慢的猪类。遇幽冥之气成形的魇鬼，诬枉阴狠的业报销尽时，余习未尽；生于世间多为供人剥皮衣用的貂类和暗昧的驴类。遇日月精华成形的魍魉鬼，贪求聪明邪见的业报销尽时，余习未尽；生于世间多为应时的春燕和雁类。遇明月之气成形的役使鬼，喜欢用伪诈手段骗取名利的业报销尽时，余习未尽；生于世间多为占卜用的黄鸟、灵龟类。遇人而依附成形的传送鬼，结党营私的业报销尽时，余习未尽；生于世间多为顺从人类的鸽子、猫、狗类。</p><p>　　佛接着说，阿难你应知，十类畜生的业报都是为人时妄想颠倒所致，必须承受业报，苦受使欲火干枯，欠命还命，欠债还钱。如为人时依教奉行，严持戒律，修行佛法，因则不立，何有妄缘。宝莲香比丘尼、善星比丘与琉璃王所造作恶业和所受苦报，都不是谁强加的；都是自召自感，自作自受。众生三恶道的业报，如在发菩提心的清净心中，就如虚妄不实的幻境，何有了业。</p><p>　　佛接着说，阿难你应知，虽然由业召感至畜生身，来此世间向欠债人偿还宿债；但畜生的主人，即债权人也要善待还债的畜生，特别是牛、马、驴等，不能役使过分，打骂相加，不给饱料等。否则，畜生超过偿还宿债部分，此畜生转人道时，要向主人讨回超偿部分。这里有欠债不欠打骂的，也有欠打骂不欠债的，也有欠债不欠命的，也有欠命不欠债等。如主人有善心、有道德、有福报，在人道中就能偿还掉畜生超偿部分的宿债。如主人无善心又无福报，也要转为畜生道，用同样的方法，偿还超收的宿债。如主人用畜生多交换了财物或多役使其力，于冥冥之中绝对公正的偿还清帐，自然停止。如主人在畜生还债过程中，杀其身命，食其血肉；这样主人与畜生之间结下了恶因缘，生生世世相杀相啖，似转动的轮子，互为高下，永无停止。除非有大善因缘，值佛住世或听闻佛法，持戒修行止观，正定、明心，忏悔业障，才可终止轮回；否则，怨恨难解。</p><p>　　佛接着说，枭鸟类宿债还清后，转生人道，但是余习未尽。这样的人性格刚强，愚恶怪僻，道理听不进去，执持偏见，与习气相近的人为友。如有一种鱼没骨头，专门往黑地方、窄地方钻，渔民把瓶口打开盖放到水里，鱼就自己钻到瓶子里，进去不能转身就出不来了；有的人也是这样，遇事专门往窄处想、小处想、坏处想，就不往宽处想，大处想、好处想。人与人对事的看法与标准不一样；用一个标准感受世间与衡量世间不行。所以，平常人看谁信佛说，怎么那样愚昧！其实不知是谁愚昧。鸳鸯、鹿，宿债还清后，转生人道，但是余习未尽。在胎儿时容易怪胎，如连体、双头、连心、六根四肢不正常等，为人性格急暴，喜怒形于色，做事多表面且形式等。狐狸类宿债还清后，转生人道，但是余习未尽。为人庸俗媚世，曲意逢迎，花言巧语，虚无诚意。蜈蚣、蝎子类，宿债还清后，转生人道，但是余习未尽。为人暴戾野蛮，争强斗狠，肆意妄为，无仁善之心，不怀旧恩，翻脸无情。蛔虫类，宿债还清后，转生人道，但是余习未尽。为人卑躬屈膝，贫穷下贱，怨天尤人，记恨仇视，千恩不谢，难善于人。猪类宿债还清后，转生人道，但是余习未尽。为人散懒贪物，软弱无能；受人欺辱，虽心中不服可又无力反击，慢人反被欺，傲物反受贫；智愚常戚戚，偏有鬼敲门。貂、驴、马类，宿债还清后，转生人道，但是余习未尽。为人勤奋劳碌，性格倔强，好话难说好，善意难为善；常恨家不起，终生忙碌，眷属相争难如意。燕、雁类，宿债还清后，转生人道，但是余习未尽。为人才思敏捷，聪明好学，遵循规章，洁身自爱；同时，书气十足，求全责备，心有偏执，爱发议论。黄鸟、灵龟类，宿债还清后，转生人道，但是余习未尽。为人小有世间智慧，明理识时务，善于辩论是非，处理事务多有方法；同时，权谋伤思，暗计费神；自逞英豪，贪求名利；为功愚人，混淆视听；难明大义，常遭嫉妒。猫狗鸽类，宿债还清后，转生人道，但是余习未尽。为人通情达理，有好人缘，讲义气，有度量够朋友；亲友关系融洽，眷属和顺；做事人气旺，而且容易成事。同时，常感力不从心，受人指责和事佬；有屈辱又难言于口，解他人之难又难自心。</p><p>　　众生这些习气说不没、想不掉，有时只是嘴上克服，一遇实际就原形毕露。秉性难改，本性难移。因为众生的所知、所见、所觉，尽是颠倒；所以不知实相，不达实义，不明实理。要弃转习气，逃离苦海，必是逆世离世非厌世，识破无常因缘情，逆世就是人间正道，行正道就是自度度人的大英雄。</p><p>　　佛接着说，阿难你应知，这些众生要偿还宿债，相杀相啖，轮转生死。</p><p>　　佛出世时不能值遇，不知在哪道转悠，就是出生在世间为人，也不相信佛法；根本闻不到佛法。释迦牟尼佛在古印度时，也不是人人信佛，只是世界的一少部分人有因缘信受。那些人虽值佛住世，不信佛、不闻法；何况其它道的众生，难闻正法。又有很多值佛住世的人，由于业习太重，落入邪知邪见的外道。如释迦牟尼佛刚降世时，谤佛为魔通、妖通，这不是人！谤佛法为魔法妖法。这是佛说的法吗！一些业报重的人当时堕落地狱；一些徒众，由于也做一些善事，转生天上做动物，不得天人身。这些人再转人时，仍然脱离不了习气。即使有的人也信佛，但根基和习气的力量，对正知、正见、正觉的佛法听不进去，要说四字弘名也能往生，还不用静坐禅行，还不须严持戒律，破戒用口头一忏悔或重新受戒就没事了，都喜欢听闻这样的法。没有那么大的投入，能有那么大的回报吗！极乐世界是菩萨居住的世界，必须持戒修行，发菩提心，达到菩萨标准，才能有佛菩萨接引往生去那里。这些业习重而不闻正法的众生，在宇宙法则之中，轮回生死，是真正的可怜悯者。太可怜了！颠倒的世界，颠倒的众生，颠倒的知见，颠倒中轮回，还不知真相。</p><p>　　佛接着说，阿难你应知，有的人不依出世间无为法为究竟的正觉，修世间有为的定功；即不是依心受戒持戒，不是依心正定得三昧，不是依心正定三昧中悟得智慧，而是心外求法，心外身行不守戒，心外身口意清静而不是正定三昧，心外身轻意知有为灵感而不是自性智慧。依别出一门的修行方法，以求得世间长生不老的妄执心念；即以色身长生万年的不真常为常的虚妄理念；以长久存活于世间的想法，以精化气、气还神、神还虚的修炼方法，使身体强健轻盈，游行于人迹罕至的深山密林或海岛洞穴内。可以修炼成十种仙人，达到于世间相对的长生不老的目的。第一种为地形仙，长期服用各种药物，并修功练气，达到身体轻盈，延年益寿，走路快速。第二种为飞行仙，长期服用草木之籽和真菌药类，如松柏籽、枸杞、灵芝等，并修功练气，达到身体轻盈腾空飞行，延年益寿。第三种为游行仙，长期服用铅和汞等金属物质炼制的丹药，并修功炼气，达到身体轻盈能于空中飞行而游于世间。第四种为空行仙，修炼精化气的功法，长期坚持而不间断，达到身体轻盈，能腾云驾雾。第五种为天行仙，专门修炼精化气的功法，并长期辟谷，只咽唾液和食用草木津，达到身体轻盈，能飞行到四王天与忉利天上游历。第六种为通行仙，长期吸太阳与太阴的精华，早晚子午二时对着日月吸气，每次约二个小时，也有每次三百六十次的一个周天；饮露吸雾，并修功炼气，达到身体轻盈，可穿墙过壁，赴汤蹈火，无有障碍，天地之间，任由通行。第七种为道行仙，长期坚持念神咒，禁守神戒，并修功炼气，达到身体轻盈，天地任由往来；还能运用咒符道术，降妖除魔，求雨弄火，济世救人。第八种为照形仙，长期静思意念，聚神于头顶，气贯于全身；并修功炼气，达到身体轻盈，眼目放光，神出可搬运大小物体。第九种为精行仙，长期修功炼气，调动体内心火与肾水上流下降，神可聚形，夜静时从头顶出离，如婴儿并有红光，口可吐三昧真火，按天罡地煞数随行变化。第十种为绝行仙，长期修功炼气，功至绝顶，气贯长虹，可与忉利天人往来，食饮天物，知天地造化运转的规律，自神与主持世界的水火风神和山神土地等相通，故能排山倒海，变换四季，有五神通，不得漏尽。这十种仙都是于人中喜生惧死；自性没有摆脱业习力的牵引，无明未破。</p><p>　　佛接着说，阿难你应知，世间大多数人执著欲乐，生活在相对的有为法之中，相信仁爱之教，老实做人，诚实做事；讲究仁义礼等，虽相信佛法，但不知于生死苦海中求得解脱，自性出世间而常住。不能舍离夫妻之乐，恩爱之欢。但是，身心不邪淫，与人为善，做事光明磊落，诸恶不作。这样的人，命终之后，会生到与日月为邻的四天王天为人。地球人要生到南方增长天王天为人；那里一日一夜相当于地球五十年，人的寿命五百岁；人身高大，动植物也高大。如有的人，受三皈五戒，修十善业法；虽居俗家，夫妻欲爱微少而情薄，喜欢独居，心里有欲爱之念而无之实，身清而心不净。这样的人命终之后，会生到超过日月的忉利天为人。那里的一日一夜相当于地球一百年，人的寿命一千岁；人身高大，宫殿高广。如有的人，受三皈五戒修十善法；虽居俗家，夫妻之间逢场作戏，动少静多，喜欢独居，心里不起欲爱的念头。这样的人命终之后，会生到日月之光照不到的须焰摩天为天人。那里的一日一夜相当于地球三百年，人的寿命更长。如有的人，受三皈五戒，修十善业法；虽居俗家，夫妻之间已厌倦欲爱，对方有欲求还不拒绝，喜欢独居，身静心欲念。这样的人命终之后，会生到远离地球，三灾不起的兜率陀天为天人。那里的一日一夜相当于地球的四百年，人的寿命更长。</p><p>　　兜率陀天分内院外院，也可以说南半球、北半球；在南半球是凡夫天人所居住。北半球是兜率内院；兜率内院，一是有化身佛，二是有化身菩萨，三是有报身菩萨。据我观知，有些修行人今生要往生到兜率内院去。兜率外院的人对身触不感兴趣，这样水火风三灾才能躲过。因为这样人有静坐的功夫，静坐能降服淫欲心。千劫多闻不如一日修无漏法，修行无漏法只有静坐禅行；否则，习气没有转化，兜率陀天去不了。所以，信佛人要实事求是，切莫空腹高心。</p><p>　　佛接着说，如有的人，受三皈五戒，修十善业法，静坐而不得禅昧；虽居俗家，身静无有欲爱心，但为传宗接代，勉强办事，感受如同嚼腊。这样的人命终之后，生到五欲乐具随意变化而满足需求的乐化天，那里的一日一夜是地球的八百年，人的寿命非常长，天福多。如有的人，受三皈五戒，修十善业法，静坐而不得禅昧；虽居俗家，有夫妻名分，欲爱相交时，能了然超脱，无世俗男女的心念。这样的人命终之后，生到五欲乐具自在享受的他化自在天为天人，那里的一日一夜等于地球的一千六百年，人的寿命更长，天福更多。</p><p>　　为什么说圣人的肉体就是人间的净土？因为境界和肉体的法喜等于极乐世界阿惟越致菩萨的境界和身体的法喜；所以，对这个世界的淫欲之乐，境界上如猪狗一样低级趣味，动物都是这样；对世间的财物如过眼烟云，只是随缘而已。</p><p>　　以上为欲界六天，人心里还有爱念为静；欲爱为生死根本，心有爱念就不能出离欲界天。如信佛念佛的人，欲界天还没有出离，怎么能往生极乐世界呢！\t\t\t\t</p></div>"
},{
    "title": "【大佛顶首楞严经卷九】",
    "author": "净慧大师",
    "date": "",
    "html": "<div class=\"B1_text\"><h2>【大佛顶首楞严经卷九】</h2><p>　　佛说，阿难你应知，世间所有修行身心的人，不能久于静坐禅行，都为假用功力，不得正定。只是受戒，长期坚持身不行淫欲，包括行住坐卧时，心中不想，念头不生，身心清净。这样的人，不再爱恋染著于欲界；命终后生到离欲清净的梵众天为人。梵众天为色界天，色界共有十八天；色界天的天人，都是化生，无有女人，都是男人。如诸修行人欲爱的习气已经清除，厌离世俗欲爱之家，喜欢清净出家的心现前，对于出家人清净的戒律，生起随喜顺从心，守护戒体；这样的人，时刻都能依法修行清净的福德，命终后生到身心清净、天福无量的梵辅天为人。如诸修行人身行心想都如法，做法事具足威严，仪表气质庄严，用智慧的醒悟之语为大众讲法；这样的人，在世间能统领僧众；命终后生到有大福德而身喜乐的大梵天为天人；并能统领部分大梵天众。</p><p>　　以上三天为一禅三天，天人身体殊胜、喜乐殊胜、能力殊胜。没有欲界众生的一切苦难与烦恼，具足清净喜乐的天福。虽然没有行入于正定，未证得正定而生出智慧，但身心清净，不为诸欲漏所动；为初禅境界。初禅境界如山林灭火，明火灭而烬未灭；所以，劫尽时火烧一禅天。一禅境界是清净念佛的坚固力所现，不觉有身，山河大地都在念佛，清净念相续不断。所以，修行人须静坐禅行；否则，只能是初禅境界，怎么能出离三界呢！而在静坐禅行时，不要有寿命想，要有争分夺秒心，每分每秒都在和生死搏斗，有这口气在，要好好修行，绝不让片刻时间空过。</p><p>　　佛接着说，阿难你应知，按次第大梵天的上一层天为少光天。如诸修行人能圆满清净行，心如止水，寂静清澈；这时，自性的清净光通过自心微弱的折射出来；静坐或禅行的境界中，忽觉心头一亮；虽不长久，但经常出现。这样的人命终后，生到圆满梵行的少光天为天人。少光天的天人，身体发光但不能远照。如诸修行人能精进静坐禅行，随着定力加深，自性之光与自心之光，光光相照，闭上双眼，内里光明。这样的人命终后，生到无量光天为天人。无量光天的天人，身体发光，似琉璃色，光芒照耀无尽，可映射到其它世界；如日光照月映射到地球一样。如诸修行人继续精进静坐禅行，定力更深，能够通过自身的毛孔吸收宇宙的光能，维持身体的生命现象，身体健康，不觉饥饿，只觉神清身飘。这样的人命终后，生到光音天为天人。光音天的天人，身体光亮更强，以法光为教，以法音为体，在光中产生无量清净的妙音。</p><p>　　以上三天为二禅三天，天人超过一禅三天的身体、喜乐、能力殊胜。不再有一禅天恐忧堕落回欲界的心念，离欲爱渐远，无有忧虑，身心清净，享乐天福。虽然修定而未得正定，未证得正定生出的智慧；只是清净心中生出喜乐，代替了身体的其它欲望，降伏身体的粗漏，为二禅境界。二禅境界虽欲火灭尽，但喜水心流；所以，劫尽时水淹二禅天。</p><p>　　佛接着说，阿难你应知，如诸修行人能在二禅天境界的基础上，继续精进禅行，巩固并加深定力，在不觉有身的基础上，有时思维停止，出现无念的状况；这时，发现体内的光明中，发出微妙的念佛音声；这种音声不是用耳去听，是用意识去感知。这样的人命终后，生到少净天为天人。少净天的天人，执著于心光妙音一体的妙理，虽舍去欢喜心，得到少量的净乐；但仍是色身的寂乐境界，不是自性的寂乐境界。如诸修行人能放下执著妙理境界，继续精进禅行，在禅行中，觉知身清净如风，容入虚空，再不知身的边际在哪里，不知一念佛号在哪里；走路时身有羽化之觉，心旷神怡于九霄之上。这样的人命终后，生到无量净天为天人。无量净天的天人，色身清净，身轻心安；万事天下静，乐事有谁知，有一种寂静灭除心中烦恼之乐；但仍是色身的寂乐境界，不是自性无烦恼常住之乐。如诸修行人能放下执著色身的身空境界，继续精进禅行，在禅行中觉知身心与世界融为一体，世间的一切生物和物质现象，都有其存在的法理，是法性圆融的表现，是诸佛清净功德为度众生而化现，身心的有漏之乐不间断不停止。这样的人命终后，生到遍净天为天人。遍净天的天人身心喜乐禅味，觉知所依世界一切圆融清净，都是法性妙德成就，身心享受的喜乐无穷。</p><p>　　以上三天为三禅三天，天人超过二禅三天的身体、喜乐、能力殊胜。由于身安稳，喜寂静于禅中得无量乐，心安于具足喜乐的身体中，他人的苦与恼，不能影响身心的喜乐；所以，对人对事具有很大的随顺心；俗语说，穿新鞋不踩狗屎，聪明人不与愚人一般见识；谁造作恶业谁受报应，我禅行喜乐享天福；为不让众生因我起烦恼而随顺，为我禅行喜乐不受影响而随顺。虽然修定而未得正定，未证得正定生出的智慧；还是定中有息，不入三昧，自性智慧不生起，为三禅境界。三禅境界于静坐禅行中，有一息尚存；所以，劫尽时风刮三禅天。</p><p>　　佛接着说，阿难你应知，如诸修行人能在三禅天境界的基础上，继续精进禅行，会使定力更加深固，身心不受世间诸苦烦恼相逼，心能转境，随喜功德；在禅行中，一息停止，毛孔吸光，内动而外静，身心喜于禅坐。这样的人命终后，生到福生天为天人。福生天的天人，知身心禅乐是相对的有为法，不论多么长久也会有坏掉的一天，不再执著身心禅乐，舍去乐想，与之相对的苦思也离去；同时，不再向色身和所依报求福，开始向自心求福。如诸修行人能把禅行中的苦乐想舍掉，继续精进禅行，加深定力，把身体、喜乐、能力三种殊胜心转为清净的静坐禅行，使福报增长，得世间善巧，于方便中随顺众生。这样的人命终后，生到福爱天为天人。福爱天的天人，以舍掉苦乐心为圆融，以清净静坐禅行为清净，所享天福随心想而满足，身体所行自在，自然的随顺所依世界法则。如诸修行人能舍掉所增福报，即福爱天的天人能舍掉随心满足的天福，继续精进静坐禅行，增加定力，有二条不一样的天路可走；一是继续精进静坐禅行路；二是享乐天福并保持定力路。走第一条路的诸修行人，发精进禅行念佛心，以众生无边誓愿度，烦恼无尽誓愿断，法门无量誓愿学，佛道无上誓愿成的坚固力，保持清净光明的无量善行，增加无量福慧。这样的人命终后，生到广果天为天人。广果天的天人，身心发光无量，不舍禅定福慧；并以广大福慧愿力，求证无上圣果。走第二条路的诸修行人，以为走上这条路为最高的果报。有的修行人心有满足感，对静坐禅行中的苦与乐不以为然，产生厌倦；而偏执法理，以井底之蛙的目光观天；不知佛道是证悟成就，不是理悟成就；由于连续不断的研究法理，舍去禅行道业，心灰意冷，出现无念的枯木禅。这样的人命终后，生到无想天为天人。无想天的天人，由于以色身的生与灭为因而静坐禅行，不以自性无生灭真常为因而静坐禅行；享乐天福五百劫。在五百劫中，前二百五十劫保持定力，享受寂灭为乐的天福；后二百五十劫，定力逐渐销失，身心散乱；天福报尽，又入轮回。</p><p>　　以上四天为四禅四天，其中有二天并列，天福寿<a href=\"/remen/mingxiang.html\" class=\"keylink\" target=\"_blank\">命相</a>等；由于发心不同，而有区别。四禅天的天人，天福享乐无量无边，世间一切苦乐境界无法想象。但是，所修静坐禅行仍是以色身有所得心，不是心性证悟后出世间的无为法；虽然静坐禅行功夫纯熟，但还未证得圣果，为四禅境界。四禅境界于静坐禅行中，无欲火、无喜水、无息风，劫灭时水火风三灾可免。</p><p>　　这里我特别讲了诸修行人的静坐禅行境界，主要是提醒诸位注意：一是人人可静坐禅行，静坐禅行佛法是高可攀、远可至、行可证、证可得的解脱方法。二是诸修行人要精修静坐禅行，不要执著禅定境界，天人、声闻、菩萨的禅定境界千差万别；心有执著之想，落入天福。三是诸修行人静坐禅行至四禅时，所证不真常，所行不究竟，所知不了义，不要妄谈佛理；容易从四禅退至一禅；四禅天天人不退，而人道的四禅有退。四是诸修行人对四禅胜境莫作圣解，圣解要堕落地狱；四禅天人还是大凡夫，未入圣人流。五是禅行至四禅的人，有一个特征，静坐时呼吸停止，没有脉搏；修密的人与修禅的人有区别，行住坐卧中随时都有气停脉住的情况，时间长短由修行状况而定。六是此经对四禅天及以下的修行境界说的比较详细，对一至四果罗汉的证悟境界没有详说。千万别依此经去衡量一果以上圣人的修行境界。</p><p>　　佛接着说，阿难你应知，在色界天中还有五种不同的天体；即无烦天、无热天、善见天、善现天、色究竟天，可以总称为五不还天。五不还天为三界圣人所居，有一至四果罗汉所居天，辟支佛所居天与发菩提心的大阿罗汉所居天平行，但不是同一星球；报身卢舍那佛也居在色究竟天的大宝莲花中，周围有十地以上品位的菩萨围绕，与发菩提心的大阿罗汉所居天平行，但不是同一星球。居五不还天的圣人，三界中九地九品习气随着圣位的证入同时灭尽；苦与乐的境界在心中忘失，在四禅天以下无有选择安立宫殿居住的场所；只有在苦乐双舍后，清净心相同的圣人处安立宫殿居住。三界九地是欲界五趣杂居地（地狱、饿鬼、畜生、修罗、人），色界离生喜乐地、定生喜乐地、离生妙喜地、十念清净地，无色界空无边处地、识无边处地、无所有处地、非想非非想处地。三界九地中每地都有九品思惑；九品思惑是身、边、取、邪、戒、贪、痴、慢、疑。欲界地中为十品思惑，再加一品嗔；无色界无身，再减一品身，仍为八十一品思惑。在此五不还天以下四禅四天的天王，对五不还天的圣人也只能闻其圣名，不能亲自见面或听闻音声。</p><p>　　虽然四禅天的天王是化身菩萨化现，但所化现之身是凡夫相。就如同在此世间，旷野深山的<a href=\"/fojiaogushi/yinguo/26216.html\" class=\"keylink\" target=\"_blank\">佛教圣地</a>道场，都有阿罗汉居住，护持道场；而示现凡夫的圣人所不能见到一样。</p><p>　　有人问，这有可能吗？怎么见不到呢？山西五台山就有阿罗汉住世；这些阿罗汉奉佛旨并在佛前发愿护持道场，护持佛法；都是发菩提心的大阿罗汉，舍去天福，住于世间；至于以什么方式而住，以什么相而住，只能靠自己证悟才能详知；详知也无言，这是佛的秘密藏。天天见君不识君，似是有缘实无缘，人人身见非心见，只缘不是同路人。</p><p>　　佛接着说，如诸修行人，在世间为脱离苦集烦恼而修戒定慧，定境现前，四加行暖法出现，一切魔法不能改变修道的坚固心，永脱三恶道轮回苦。这样的人证得一果罗汉，命终后往生到无烦天为圣人。无烦天的圣人，苦想与乐心双亡，禅悦为食，各自独修而不与同修来往，心无烦恼，无有争斗心。如诸修行人，在世间修戒定慧，定境现前，已灭除苦集，把修行重点放在证悟智慧上，四加行以忍法为主。这样的人证得二果罗汉，命终后往生无热天为圣人。无热天的圣人，心净如水，清凉悦乐，独自修行，证悟诸法本空。如诸修行人，在世间修戒定慧，定境现前，佛理已悟，内无身心，外无世界，四加行以顶法为主。这样的人证得三果罗汉，命终后往生为善见天为圣人。善见天的圣人，于三界可入涅槃，可修可不修，非学非无学，报得天眼通，能观十方世界诸法圆融，一切清净。如诸修行人，在世间修戒定慧，证悟解脱知见，梵行已立，所作已办，诸漏已尽，远离生死烦恼，四加行以世第一法为主。这样的人证得四果罗汉，舍身后往生善现天为圣人。善现天的圣人，自性智慧现前，具足神通变化，自在无碍；如陶瓷厂的工程师铸土为器一样随心所欲。如诸修行人，在世间已证无学，值佛住世或遇大善知识教导，慈悲心生起，喜舍心相随，发菩提心，愿修六度，广度众生。这样的人舍身后，往生到色究竟天为大阿罗汉。诸法相佛理究竟知，色相穷尽，了知自性并发生功用，从色性悟知自性如虚空，一切色相相引相斥依空而立；色究竟而自性尚未究竟，要报佛恩，广行六度，虽住世间，可出离世间住于无为法中。</p><p>　　从梵众天至色究竟天的色界十八天的天人，都有一个共同的特性，色相男身，戒修清净，独行无伴，自行证入；虽脱离欲情，但仍有色身所依，受色身有为法的牵累，最终色身还会灭失。</p><p>　　休息时诸位互相探讨、互相议论，六道轮回到底是怎么回事。六道轮回不是佛在虚构，也不是有些人胡编乱造。诸位当中，就有曾经鬼秽附身，可以讲八国语言之人。这人一天德语没学，只有初中文化，第一次见到德国人就能讲出标准流利的德语来。用现代科学解释不了。这就是不分地域的人死后的阴魂不散，借着人体表现一下。现在这人身上鬼秽已被清除，再让她讲外语，一句也讲不出来了。通过身边的人和事，感知到六道轮回是真实的，佛法是真实的，不以人的意志为转移。神识是人生命现象的一部分，是客观存在的；禅定修到一定程度时，神识可到宇宙中遨游，可以到不同天体上，只是不同天体的时间差不一样，逗留时间短暂，一观就得返回。</p><p>　　有人问，平常人为什么不知不觉？我要反问，平常人天天在作什么呢！天天都在打妄想，在酒色财气的五蕴炽盛中，怎么能知觉呢！</p><p>　　有人问，也没少读经念佛呀，怎么还是五蕴炽盛呢？佛法靠的是行入证得；可不是理入见得。很多教授都能讲佛法，先引经据典，旁征博引，将他人证悟的话语罗列起来；然后一讲，一听都对，但没有自己证悟之语。所以，佛法不须说，证悟靠行入。行入平凡里，才见转身处。佛法在平凡的日常生活里都有，在平凡里要找到转身处，找不到转身处不行；找不到转身处，还是顺流背本己，生死苦海浩浮盈。还顺着红尘翻滚，在酒色财气、色声香味触法中兜圈。社会上的年轻人，对佛法尤不理解，说话容易谤佛法僧，千万不要与之计较。他是他，你是你，业力所感，各修各得，各负因果。</p><p>　　有人问，元音老人讲的法怎么样？我告诉诸位，自古白衣讲法极少；值佛住世时是维摩诘居士，唐朝有位庞居士，近代有位<a href=\"/wenda/jushi/lbn.html\" class=\"keylink\" target=\"_blank\">李炳南</a>居土，现在有位元音老人。但是，我知能讲正法的白衣都证得大境界。所以，对白衣讲法，千万别起轻慢之心。</p><p>　　佛接着说，阿难你应知，在色究竟天有顶有色的边际处，有二条不同的路。一条路是回心大阿罗汉，发菩提心，智慧圆融通达，可以出离三界，往生极乐世界，入菩萨乘。另一条路是得少为足的阿罗汉从善现天，超过色究竟天，通往无色界。无色界的天人有两种来处，一种是得少为足的舍色身心而不舍识想的阿罗汉；二种是从四王天以上，天人中所修炼成就的天仙。在色界天的阿罗汉，心知色身不能常住，在识想中厌弃色相；以定空观灭色归空，舍去色身，识想无相，不受色相障碍；只留空识以定力入于无色界，依空而住；为无色界空处。在色界天的阿罗汉，厌色舍空，色身与空想都以舍掉为清净无碍，唯心识为究竟；而心识为究竟的微细之想没有舍净，以定力入于无色界依识而住；为无色界识处。在无色界天的阿罗汉，色空双亡，识心灭掉，十方寂静自然，一切空灭无所有，唯有心识之空识，无有其它；只有空识以定力入于无色界而住；为无色界所有处。在无色界天的阿罗汉，唯留心识之识性寂然不动，其余的一切分别心、差别念灭除干净，于无中有识性，似有似无，似尽未尽；只有识性以定力入于无色界而住；为无色界非想非非想处。此处的识性穷尽色空，而不能穷尽法空；相对的有为，定力有销失的一天。所以，从色界五不还天中的四天到此天为钝根阿罗汉；从天仙到此天的外道，也是穷尽色身，不知趣向出世间法的归途，迷求有漏天的境界，无闻法我二空妙法。八万劫定力销失时，此天的心识之识性又堕入轮回。</p><p>　　佛接着说，阿难你应知，三界诸天人，都是由凡夫依法修行善业，所证得受天福的果报，是法则对善人的恩酬和回报。如停止于享乐天福而不发菩提心，求出三界修无为法，天福享尽时，定力销失，还要再入轮回。三界诸天的天王，都是十地中各地菩萨示现，以神通自在力，住于正定之中；按菩萨品位逐渐增进功德，并将所证功德回向十方诸佛与法界无量众生，以修十度而行住于菩提路。无色界的四空天，有识无身，无有善业果报的色相，都是依空而住。这些众生都不了知自有本妙觉性的真心，积习妄执，心生颠倒知见；才召感迷妄诸有的三界。</p><p>　　三界中除声闻缘觉发菩提心可出离世间外，其它的地狱、饿鬼、畜生、修罗、人、天人，都根据自己的业力，在诸法则的定数中沉溺，同类受报。就人而言，人是三界生，天赋人的性，地赋人的命，父母生人的身。人只知有个身我，不知天上有个性我，地府有个命我；一人三身，才有性存天理，心存道理，身尽情理；所以，性存天理皈依佛，心存道理皈依法，身尽情理皈依僧；佛法僧为一体，依法持戒修行；心存有为法想时，可享天福；心空无为时，出三界常乐我净。</p><p>　　佛接着说，阿难你应知，地狱、饿鬼、畜生、修罗、人、天人这六趣众生（天仙一趣，略去不讲），都是昏沉于生灭的有为相。六趣众生中有阿修罗，可分四种；一是鬼道阿修罗。因有善业因缘，护持佛法，护持经咒，护持戒场法会。以护法的福力得有报神通，居住的宫殿可于虚空中飞行，又可依虚空而住；具有神力，面貌丑陋；习气与夜叉鬼相似。二是人道阿修罗。从胎而生，胎因情有；因情欲心重，有天福而无天德；诸天王以少欲为天德。所以，被欲界诸天贬离天道，坠落为修罗。虽天福与天人相似；但居住宫殿选择在四王天之下，地球之上离太阳最近的星球，与四大部洲人类为邻；修罗王的宫殿为日月宫。这些修罗的身体，可与欲界天人相似，可以随意变为大身或小身；在太阳系各星球之间隐身游历飞行，人类肉眼所不能见。三是天道阿修罗。从欲界天道化生，有阿修罗王单独统治的星球，有天人同样的福报，受欲界诸天王管辖。但是，阿修罗王有大神力，洞彻天地，无所畏惧；加之，阿修罗兵都凶勇好斗；不服从天王管理，经常在阿修罗王带领下与梵天王、忉利天王、四天王发生战争，争夺权力；战争都由于阿修罗王无天德而失败，天人福报不受影响。四是畜生道阿修罗。从湿气而化生，生于海底的洞穴或海水进入地壳循环的洞口处。白天用神通游历于虚空之中；夜晚回到水下休息。这是福报微少，地位卑劣的阿修罗；福报与龙王相似。</p><p>　　以上四种阿修罗，都是为人时好争强斗狠，凶勇无畏，嗔恨心重；为国发动战争，建立战功；而不相信佛法，不修行十善业等；根据善业的多少，才召感入四种阿修罗道。四种阿修罗福报享尽后，随业又入诸趣众生；但习气不尽，在人与畜生及禽类中，又有心狠好斗之徒，嗔恨痴行之辈，无畏因果。建立善恶不同因缘，随因缘受生六趣中，随善恶业习，受不同果报。</p><p>　　佛接着说，阿难你应知，十方诸佛与大菩萨是觉悟的众生，是过来者，已见到本妙圆明的自性；若用自性的真心再回过来看六趣业报众生，生灭相如空中花一样不真实；五蕴妄想如水中月一样虚妄。可是，众生又为一个虚妄的名相，在无有尽头的思绪中冥想。都是因为业习因缘生灭果报；不依佛法持戒修心，不能认识并找到自性真心，于无量劫中枉受轮回之苦。究其根源，是众生没有智慧，只有业习，随顺杀盗淫的缘故。与此相反，不杀、不盗、不淫；转贪嗔痴为修十善业。前者随顺杀盗淫，业重而沉；后者转贪嗔痴，业轻而升；沉为三恶道，升为人天道。有与无相对而动转，才有轮回的法理之性。如贪官贪婪物色，则失官德，而不得人心；平常人贪婪物色，则失人德，而损人利己；人类都贪婪物色，则失天德，而召感劫难；即色迷心窍而随心所欲，经济危机伴随战火相生，怨天嗔地而天时不振，暴水狂风成灾。良药只有一剂，收敛欲望。如众生放纵欲望，杀盗淫三业旺盛。虽然业由众生各个私作；但众私则成共业。所以，有人间三灾八难，天堂、地狱、畜生、饿鬼、修罗不同受报。</p><p>　　众生无量劫来造作的业力因缘无量无边，无法寻求清楚。只能简说，从当下一念心开始，转恶向善。如有人想持戒修行，欲证得无上佛道，必须依戒定慧，去掉贪嗔痴三毒，远离杀盗淫三业。如不断杀盗淫而修行，假设能证得神通；而在有为法的作用下，习气不灭；就是落入魔道。魔王的宫殿住虚空中，修行人静坐念佛的清净之光会震碎魔王的宫殿，使魔王生嗔恨心来扰害修行人。修行人都会遇魔考。初修行人要遇到人魔，与周围人爱好习气等格格不入，而生嗔，为魔考。有点修行时，遭魔考一夜不让睡觉，有一种怨力让人心生恐怖，这就是天魔。这时如没有善知识指导破魔，一个魔王所施的魔法，就能让人丧失修行路或退失菩提心。魔王是菩萨作，现魔王身度脱魔道这一类众生。要随顺魔子魔民的习性度脱；同时，还要用善法控制，接受法化，逐渐出离魔道。菩萨度脱哪一道就现哪一道众生身，再苦再难也得去，菩萨愿力弘深，圆满自性的功德。魔王尽职尽责，从反面助道，若无魔考，修行人成就不了道，也成不了佛；所以，魔王是修行人的朋友，真善知识；只有历劫的魔，才成就了历劫的佛菩萨。</p><p>　　佛接着说，如不断杀盗淫，随想修行又欲销除妄想，不但销除不掉，反而更加虚伪不真；为世界上最可哀怜之人。虚伪妄想是自己造杀盗淫三业所致，不是修行佛法的过失。这样说法为正说；反之为魔说。</p><p>　　末法时代，有的人只把佛法当作<a href=\"/remen/zongjiao.html\" class=\"keylink\" target=\"_blank\">宗教</a>文化，只在文字语言上研究，不断广义上杀盗淫三业，只是以妄逐妄，倍加虚伪。</p><p>　　这时，佛对法会大众说，阿难你与诸有学声闻缘觉，现在已经舍去小乘的自了心，发起大乘的菩提心，欲求成就无上佛道；现在，佛已将真实的修行法，全部说清。</p><p>　　佛将天地造化的密因和宇宙人生的真相及轮回变化的因缘法则，说的清楚透彻，了义究竟。所阐述的世间与出世间的绝对真理，充满无量的功德，启发众生的智慧，震撼众生的心灵，是真实境界的结合，是世间一切理论无法与之相比。</p><p>　　从这里开始，将说修行人所遇的五十种五蕴魔。人在修行过程中天天有魔事，微细魔事不知因缘和所以然。如有的人被打、被骂，平常人会落于邪见，嗔恨报复。修行人会知这是往昔造的业因，今日作为报缘；既了去旧业，又经受一次魔考。打人骂人的人，还觉得自己挺得意；其不知已落入魔手，被魔所利用。我曾遇到一人，声称自己能为人治病，念“为人民服务”就行，振振有词。可没到三分钟，就落泪，讲不下去了；哭求“救救我吧，我吃饭、睡觉都不能自主。从你进屋，才清静一会呀。”这就是鬼秽住其体、控其窍，自己的神识主宰不了自己的意识，被鬼秽主宰。这类现象在出家人与在家人中都有，共同特点是贪心重、业报重，众生之间互相缠缚。</p><p>　　佛接着说，虽然将成就佛道的真实法说的一清二楚；但是，阿难等大众，还没有认识到依正法禅行正定过程中，存在的内外微细魔事。有的人魔境现前，心中辨别不清是胜境还是魔境，再加上自心不正，就把魔境误为正行的胜境，使自心落入邪见。这些微细魔事，有时是自心中的五蕴魔，再召感天魔，或再痴迷执著鬼神，或再遭遇魑魅等；都是由于自心无有智慧，想蕴过重，辨别不清，才家贼召外鬼，认贼为子，自劫家财。还有的人，在禅行过程中，得少为足，不再精进。禅行到四禅天的无闻比丘，胜境现前不能辨别，便妄言已经证得阿罗汉果。可是，当天福报尽，定力销失，天人的五衰相现前时，无闻比丘诽谤阿罗汉，认为阿罗汉怎么还如此。命终后，中阴身遭现作后有的业报，堕阿鼻地狱。阿难等大众，应该仔细的听法，佛要详细分别解说。</p><p>　　阿难你与诸有学声闻缘觉，欢喜礼佛，一心静听佛的教诲。佛说，这个有为的世界上有十二类有漏的众生，本有的妙明觉性，具足功德的真心，与十方诸佛，没有什么两样，也没有什么差别。只是无始劫来，被无明烦恼遮蔽。有颠倒妄想，迷恋相与相之间的理论性质，从中找出理相上的缺欠处；身心在欲望的作用下，生出痴迷欲爱财物的妄想；欲爱财物又使身心处处执迷。由于这样的缘故，才有物色的无常生灭，变化不止，执迷不息；才有与众生业力相对应的世界产生；所以，三界之内的无量国土，都是有漏众生居住的地方。有为世界的安立，都是由众生愚迷、顽劣、颠倒、妄想的业习相对应而产生。见性无为的众生，才能召感到无为法的世界，即佛净土中去。</p><p>　　佛接着说，地球在虚空之中，人也生活在虚空之中，人的心性也如虚空。证悟真心的人，会觉知无际的太虚空，如心内的一片浮云。虚空中的星球能坏掉，虚空永远不会坏掉。如有人返本还源，成就佛道，了见佛性如虚空，佛性虚空中含藏诸世界。如要精进修行禅定，得正定三昧时，自性真心就与十方诸菩萨和发菩提心的大阿罗汉相通相合，当下就处于清净自然的状态。这时，欲界六天的魔王、鬼神与四禅天以下凡夫天外道居住的宫殿，无故被震裂，大地震动，水中的河神海神，陆地的山神土地，空中的飞行夜叉、大力鬼王等，都惊慌失措。只是世间的平常人昏暗不能觉察所发生的变化，对鬼神惊慌所引起的天时变化还认为是阴阳失衡，或自然变化。这些魔王、鬼神都有天眼通、天耳通、他心通、宿命通、神足通五通，只是未得漏尽通。所以，留恋世间的物色享用和恩怨情仇等烦恼。见到所居宫殿被无故震裂，天魔、魍魉、妖怪、精灵、鬼神等都来扰害禅定时发出清净光的人，在三昧中干扰境界或示现魔境恐怖像等。禅行有魔境现前时不要害怕，自有佛力护持、护法保佑。只要自己定力坚固，诸魔如同刀断水一样无可奈何，空嗔恨、白费力。自然是邪不侵正，客难欺主。如自己的五蕴主人不给方便，心神安稳，魔境自破；如业力深重，心意迷乱，诸魔就得其方便，毁掉戒体。当下心境处于正定中，觉知清净，悟境由心生，不由外事干扰，自然无有疑惑；无论魔力有多厉害，也无可奈何。只要五蕴不起偶对，定中自起三昧智慧光明；自然照破诸妖魔鬼秽的幽暗之气，若有妄为敢接近者，自然销失能量而陨落，失去魔力。怎么能留在处于正定人的身边，干扰禅行呢！</p><p>　　佛接着说，如有禅无定，一边静坐一边打妄想，诸魔就对应禅行人的妄想而现出虚幻的境界，想美女有美女像，想金银有金银像，想仙境有仙境像等，五蕴偶立因缘，心随境而转。自为得意时，已落入魔道，必为魔子魔民。如摩登伽女，本来没有什么特殊的魔力，只是很渺小卑劣的欲界魔咒，想用淫像破佛戒律八万行中的一戒；由于阿难心中清净，未能毁坏戒体，尚不致于沦溺于欲爱的苦海。这时，摩登伽女持魔咒的力量，全身有如获至宝的感觉。可是，一遇文殊师利菩萨宣说的楞严咒，又如被罢官免职遭通缉的宰相，臣僚，东躲西藏，各处飘零落魄一样，既无可奈何又哀怜无助。</p><p>　　佛接着说，阿难你应知，如于道场静坐禅行，修行正定，一定要销除妄想杂念，专一其心念佛，身不觉诸根存在，又不再是思维念佛时，内心清静至极，外一切名相不起；外面名相的浊动和内心的清静不影响心中净念，思维有记忆或忘掉记忆，净念佛号始终如一。就在这时，可得定中三昧。此处得三昧的人，如睁眼走夜道，什么也看不清；虽本自清净妙圆的自性，具足光明；而定力尚浅，心光不能突破色蕴无明的遮蔽；处在色蕴区宇。随着定力日益增深，于定中心光明照，观察十方都是光明世界，不再有黑暗。得此处三昧的人，已经突破色蕴无明的遮蔽；有能力超越五浊恶世中的劫浊。这时，反观自己的往昔处于黑暗之中不见光明的缘由，都是把坚强固执的妄想当为人生根本。</p><p>　　劫浊，除心内浑浊产生颠倒知见外；外部表现是刀兵、水火风、瘟疫、疾病、地震等人类灾难，遭劫之人是业力因缘所致，是往昔心中贪欲太重，特别是贪财恋色的人易召感劫浊。</p><p>　　佛接着说，阿难你应知，于禅定中突破色蕴区宇的人，在继续精进禅行中，对心光明照感到神奇奥妙，身无有识别觉知，四大不为障碍。这时，心识处于光明中，自心的光明如杯中水溢出一样的境界现前。得此处三昧的人，是定力功用产生的善境界，是暂时的善境界；如停止禅行，随着定力的销失而善境界自然不生。这样的善境界，不是证得圣果的标准；如自为证得圣果，立即就会受到群魔的扰害。如同树开谎花，尚未结果，经不起风吹雨打。</p><p>　　证圣之人有佛法护佑、天王护持；而没证圣的人没有护持。末法时代的人，听到佛的正法，心生害怕、恐惧。这得什么时候能往生啊，这修行佛法怎么这么难呀！末法就在众生的心里，是人心末，不是法末；佛法是正法，一点没有像法、末法之分；是人的分别心。末法时代的人不肯吃苦、怕吃苦，有求心重，静坐禅行投入不多而想得到最大的果报，妄图贪取佛的功德为己有。</p><p>　　佛接着说，于禅定中突破色蕴区宇，四大不为障碍的人，继续精进静坐禅行，对身体内观，发现身体光明通透，可以透视清楚，身骨坐立，五脏挂悬，胃肠曲折；可见到肠内的蛔虫并伸手入体，将肠道的虫类用手拿出，人与虫都无有伤痕。这时，处于内外光明中，体内光明如杯中水溢出一样溢出体外。得此处定空三昧的人，定中身体发光，出定后身光销失；平常人看不见，但诸魔类非常清楚见。这样的善境，不是证得圣果的标准；如自为证得圣果，立即就受到群魔的扰害。</p><p>　　佛接着说，于禅定中突破色蕴区宇，内观身体光明通透的人，继续精进静坐禅行。这时，神识不主七魄，七魄可以各自为政，各显神通，轮换主持意根的想象与精神状态；除了正常发挥受报之身脏器功用外，还可以涉入到其他魄功能作用的器官中去代行功用，魄与魄之间互为宾主，相互代行功用。七魄可以互用，用眼可以听到外面的声音，用耳可以认字，用鼻可以说话等。可以不见有人听空中有说法的声音，或预知一些密事等。在正法时代的人可以得到这个境界，特别是住茅棚或闭关的人，容易得到。这样的境界，不是证圣的标准；如自为证得圣果，立即就受到群魔的扰害。</p><p>　　上述定中由初始一片黑喑，至体内光明并发光，于禅行中我都亲自经历过；这时，只记住一个信条，佛来佛斩，魔来魔斩，不去执著；自然通过这些过程中的阶段。这里所说的魄共有七个，魄以光能的形式住体内七个器官中，使各器官正常发挥功能作用。七魄是七个不同天体的天主，护持神识住体与人生命过程中的一种神力；分别住在心、肝、脾、肺、肾、性腺、脑垂体中。这是我自证而知，不知有无书籍记载。一些外道不知究竟，把魄元神误为人的本源，盲修瞎练，误人误己。在人与动物体内，神识是主，魄是客；主人暗钝，客为当家作主，才出现一切颠倒妄想的知见觉，枉在轮回中受苦。我讲这几句话，是请诸位记住，宁可千生不悟，不可一日着魔。</p><p>　　佛接着说，于禅定中突破色蕴区宇，七魄互为宾主的人，继续精行静坐禅行。这时，心似水澄清，见如皎月之光从体内发出，遍照十方都似地球一样颜色。向虚空望去，一切众生变化为佛的形像；似庙中有佛像一样，但能运动。忽见毗卢遮那法身佛坐于天光遍照的莲台上，能运动的千佛围绕，百亿国土的无量大宝莲花也出现于虚空中。得此处定空境界的人，是平时读诵经书、观看佛像加上联想，落入心识中反射出来的境界。这样的善境界，不是证得圣果的标准；如自为证得圣果，立即就会受到群魔的扰害。</p><p>　　佛接着说，于禅定中突破色蕴区宇，心如皎月之光的人，继续精进静坐禅行。由于不停的至心观察。清净的自心与虚空，抑制并降伏心中的其它境界的生起，防止打破这种清净的境界。忽然，虚空之中充满青黄红白等各色光芒，交织混合为一体。得此处定空境界的人，是自心过分的压抑所致，是暂时生出的境界。这样的善境界，不是证得圣果的标准；如自为证得圣果，立即就受到群魔的扰害。</p><p>　　佛接着说，于禅定中如破色蕴区宇，心中宝光充满的人，继续精进静坐禅行。由于心如澄清之水，明澈见底；心光与身光集中于一处；忽然于夜间，见到黑暗室内的各种物体，与白天所见没什么两样；而所见暗室中的各种物体也不因不见而销失，依然如故。得此处定境界的人，心光细致，密行清静，如探照灯照入虚空，近可观物，远深无尽。这样的境界不能保持长久，出现几次后就不再出现。这样的善境界，不是证得圣果的标准；如自为证得圣果，立即就受到群魔的扰害。</p><p>　　这样的境界我只有一次，于夜间静坐中，睁开眼睛，以为是白天；但光不是太阳光，只是明亮不见光源的光；向窗外望去，视觉如一管之观；方知是夜间，一思想时，明亮销失，恢复夜间常态。</p><p>　　佛接着说，于禅定中突破色蕴区宇，能见暗室诸物的人，继续精进静坐禅行。于禅定中忽然觉得身融入虚空，胳膊、脚、头不属于自己，刀砍火烧不觉疼痛，如同草木铁石。得此处空定境界的人，是心力排斥四大的境界，是心向力纯一的征兆，不能长期保持住。这样的善境界，不是证得圣果的标准；如自为证得圣果，立即就受到群魔的扰害。我定中出现这样的境界，出定后如梦幻一般；只觉得身体似心得自在的累赘。我见过位这样的人，身上有魔类占体，能赤脚站在红红的炭火上几分钟，炭火不能伤其脚。</p><p>　　佛接着说，于禅定中突破色蕴区宇，能觉身融入虚空的人，继续精进静坐禅行。达到心清静的极点时，忽见山河大地与佛国土一样，都是金银、琉璃、玛瑙等七宝，自然成地，只有光明，没有黑暗；无量诸佛遍满虚空，楼殿高广华丽，下可见地狱，上可观天宫，无有障碍。得此定空境界的人，是日常欣喜佛国土，厌想此世界垢秽，凝神贯注时间长而幻化而成。这样的善境界，不是证得圣果的标准；如自为证得圣果，立即就受到群魔的扰害。</p><p>　　佛接着说，于禅定中突破色蕴区宇，达到心清静到极点的人，继续精进静坐禅行。致使心遂高远，在夜间能见遥远的城市与街道，房舍树木花草等，环境优美；并能见自己的亲友相互嬉笑谈话。得此定空境界的人，是日常成道心急迫，欲度脱自亲眷属；由于这种念力作用于心，才出现隔远见闻的境界。这样的善境界，不是证得圣果的标准；如自为证得圣果，立即就受到群魔的扰害。</p><p>　　我出现过这类的境界，在一段时间内有过几次；只见自己的亲人怎么迁到这么美丽的地方居住，从心中发出一种声音他们听不见，用手去拉身体如影子一样虚幻无实。</p><p>　　佛接着说，于禅定中突破色蕴区宇，致使心遂高远的人，继续精进静坐禅行。心对佛法欲彻底悟明白，到底是怎么回事；这时，心中影现出佛与菩萨的形像，还可以随意变化形体；能说从来未听闻过的通达妙义之法。得此定空境界的人，是由于执著心外觅求佛法所致；是禅定的心清净光，震坏了魔宫，魔王眷属与魑魅等乘其方便，侵入心窍，生发迷心智的狂慧。这样的境界，是受魔王的操纵；如不作证得圣果想，立即放下执著，空掉境界，听信善知识的指导，就能回心向内；佛法的究竟处在于自性内具足一切；只有这样，才能摆脱魔力控制，魔事自然销失；不再出现。如自为证得圣果，立即就受到群魔的扰害。</p><p>　　我见过一位这样受魔扰害的人，修行十几年后，自称世间已无师，修炼起天师所传的功法了，实在可怜悯。</p><p>　　佛接着说，以上十种破而未尽，又破色蕴区宇的禅定境界，都是色蕴与心交织在一起，相互作用出现的境界。由于众生顽固迷劣，自不量德，以生死未了的凡夫因缘和虚幻不实的境界，自迷不悟，辨别不清善境界与圣果的关系；如自己言说证得圣果，则是大妄语成，必堕无间地狱。佛教诲法会及后世修行人，佛入涅槃后，特别是末法时代，要广说开示这样的法义禅理。</p><p>　　这些境界的出现，因人而异，有人只有其中的或三或五；但必然会出现，范围是十种。记住十六个字，放下执著，空掉境界，莫作圣解，继续禅行；在自心的深处，不给诸魔侵扰留下可乘之机，保持住、维护好正修正行，而成就无上的菩提路。</p><p>　　佛接着说，阿难你应知，这样的人突破色蕴对自心的遮蔽，在继续静坐禅行静虑和微细观照时，知自性心与诸佛心无有差别，见含有诸佛心的神识，如明镜照人面显像一样存在于自身之内。这是修行中知见上有所获得，而不能发挥神用；如人梦魇的感受，手足存在，所见所闻心里明白，心里感受很着急，而身体受邪制不能动。这样的境界，就是受蕴区宇。这样的人受蕴尽，可以超越见浊。这样的境界，究其根由，仍是以虚幻不实的颠倒妄想为本。再明确一点讲，这时的神识仍受业习之力牵引，自性智慧尚未发生作用。</p><p>　　凡是感知到的一切世物能作用身心的现象都为受蕴区宇；见世间人的一切善恶与动物等，心中妄起悲喜与嗔恨差别状况的都为见浊。各种境界的出现，都具有阶段性；必然经过，不可越过；如春种粮谷，不能越过夏季，直接进入秋收一样；没有经过夏季的成长，就有秋无收。经历过数次后，这样如梦魇的境界出现停止。大约七天以上一次；否则，人的身体不能承受；每出现一次，三天都感觉身体疲乏，困倦无神。</p><p>　　佛接着说，这样的人，在继续静坐禅行的定空中，自心发生大光明，照耀四方，无有黑暗。这时，心内自责，无量劫来枉轮六道，恨生生世世造诸恶业，不知闻法修行；早知今日，何必当初。对自己及至一切众生，心生悲悯，往昔与众生一样迷妄颠倒；乃至见蚊虫，犹如自己的子女，漂泊在生死苦海中，不能救助，觉得太可怜而流泪。此处是自责过分而内心压抑所致。如及时醒悟，无有过失之处。因为，这不是圣人证悟的境界，明白了法理就不再迷乱；所以，这种悲情境界，过一段时间，自然销失。如迷而不觉，自为证圣，则会有悲魔乘机入其脏腑，控制意根心识，见人就哭哭啼啼，失去正常静坐禅行的感受境界，而坠入魔道。</p><p>　　佛接着说，有的修行人，一见谁受苦就流泪，见死条小虫也难过悲伤。这样的人，在继续静坐禅行的定空中，见到殊胜祥瑞之相，如身临其境，心中自我庆幸，执著于名相，感激诸佛菩萨护佑，激情过分，忽然于定中生出无限勇猛之心，心猛如潮，心利如刀，志向如佛等同，急不可耐，狂热一时，恨不得三大阿僧祇劫的时间，能于一念之间得到超越。此处是心力过急，禅力过度所致。如及时醒悟，无有过失之处。因为这不是圣人证悟的境界，明白了法理就不再迷乱；所以，这种狂热境界，过一段时间，自然销失。如迷而不觉，自为证圣，则会有狂魔乘机入其脏腑之中，控制意根心识，见人就自我炫耀，世间人都不如自己，其心大慢，上庙不礼佛，或自称是佛；下轻众人，为我独尊。失去正常的静坐禅行感受，而沉沦魔道，最终堕入无间地狱。</p><p>　　特别是比丘尼或女人，好流眼泪、好起同情心。如是禅修密行的人，要注意了，把这些悲情赶紧空掉，各有业报因缘。平常心是道，也不高兴，也不悲痛，只有慈悲心，没有同情心。这样对待一切，不是没人情、没人味；而是，得无生法忍。此处紧了崩，慢了松，不紧不慢才成功，一紧一崩就容易精神上出问题；悟的人会想这是平常事，只是静坐禅行中的善境界，是路边的风景，不影响精进，心不留此。我听别人介绍过这样的人，自称是佛，要开龙华会；上庙不礼佛，不读佛经，轻慢世人。产生这种状况，有两种原因；一是未经明师；二是习气过激。</p><p>　　佛接着说，这样的人，在继续静坐禅行的定空中，眼观物色而心不动，念不起；在感受的禅定境界中心里明白。但是，静坐禅行相对处于停滞状态。天天静坐禅行不见新境界，还不想退归色蕴区宇的境界。这时，人的智力表现迟钝，表情木讷呆滞；想前进无路，欲后退归路已失，对一切所行失去信心而常感自卑，对一切佛事法理不感兴趣，似世人的忧郁症；如高大要干枯的树木，渴望得到甘露润泽和新的静坐禅行境界出现；而于一切时间里，沉于忆想的渴求之中，心想不敢散乱忘失而又空荡荡，还自为这是精进的表现。这是只顾禅行修心清静，执著于空相而净心念佛之力不能生起，缺少用智慧的方法对治执著，心不能顺其自然产生的过失。因为，这不是圣人证悟的境界，明白了法理就不再执著空静；只管耕耘，不问收获；这种渴求愿望的境界，自然销失。如执迷不悟，则会有意想魔入其脏腑之中，控制意根心识，就会日夜心不落地，杞人忧天，对一切人与事物销极的一面，总觉得揪心不快。失去正常的静坐禅行感受境界，而沉沦苦海，坠入恶道。</p><p>　　过去有的修行人，禅行到此处，为枯木禅，因得不到善知识及时点破心中迷暗，而舍身跳崖，误为解脱。</p><p>　　佛接着说，这样的人，在继续静坐禅行的定空中，自心智慧的力量超过了禅定的力量，智慧力来的突然，又大又快，如心中的我是佛，吾心即佛，即身成佛等念头突如其来，与自得胜境界联系在一起时，暗自疑想，自己是不是即身成为报身成就的卢舍那佛了呢？是由于心念力偏于想象中的成就，忘乎所以，把恒常不变的佛法和审视观察丢于脑后心外，沉溺于自知的我是佛等，陶醉于自见的一些禅定境界，自喜自乐。因为，这不是圣人证悟的境界，明白了法理就不再执著空慧；同时，加大静坐禅行定力，这种空慧所产生的妄想，自然销失。如执著空慧妄想，则会有低下卑劣的易知魔入其脏腑，见人就说自己已经证得出世间无上佛道；失去正常静坐禅行感受的境界，而沉沦苦海，坠入恶道。</p><p>　　这是典型的不知天高地厚，妄自称大，得少为足的境界。</p><p>　　佛接着说，这样的人，在继续静坐禅行的定空中，没有证知获得新的境界，原有的一些境界又已失去；历新未生，揽旧已灭，在新与旧空白的区际里，精进畏惧艰险，退后无有归路；于进退两难之际，心中忽然生起无尽忧虑，不知所措，坐卧不宁，心事重重，如坐火热的铁床上一样翻滚，如饮下剧毒药酒一样折腾。觉得人生毫无意义，死比活着好，遇事往死了作，甚至请求他人说，杀了我吧！想用这种愚痴的想法，早日求得解脱于忧虑。这是行中呆板滞固，缺乏智慧方便所致。因为这不是圣人的证悟境界，明白了法理就不再执著忧愁；同时，性情活泼一些，增强体能运动，游历名山道场等，排解心中愁结忧情，正常静坐禅行，忧愁自然销失。如不以为然，自为证圣的境界，则会有相等分的常忧愁魔入其脏腑；一分忧虑，一分魔力；十分忧愁，十分魔力；严重忧虑的人，魔控制意根心识，身不由己，手拿刀剑利器自割其肉，名则欣然舍寿，实则魔恼其心。较轻忧虑的人，自己走入深山树林河边等静闲处，不爱见人或不愿与人交流；失去正常静坐禅行感受境界，而沉沦苦海，坠入恶道。</p><p>　　佛接着说，这样的人，在继续静坐禅行的定空中，经常处于清净状态，心已经恢复安稳；心中又生起无限欢喜，欣欢悦意不能自控，见人就想乐，没人时自己偷着乐。这是身心产生轻安后，执著境界，沾沾自喜，不知用智慧将其空掉，保持平常心，自喜之心自然销失，如明白法理就不会因轻安自喜而产生过失，这不是证圣的境界，圣人喜乐的境界是自然的从身心发出，不因想而有，不因不想而无。对这样轻安感受思维自喜的境界，自为证圣，则会有相等分的好喜乐魔入其脏腑；有几分自喜，就有几分魔力；有的人见人狂笑不止，或于街路边自歌自舞，自庆自谓证得无碍的生死解脱；实则是好欢喜魔控制意根心识，纵情放意，心邪身狂所致；失去正常静坐禅行感受境界，而沉沦苦海，坠入恶道。</p><p>　　佛接着说，这样的人，在继续静坐禅行的定空中，经历过上述各种胜境界，自谓已经具足无上佛道；忽然之间从心里无端生起傲慢，即盛气凌人慢，同仁相轻慢，争强好胜慢，大言不惭慢，言过其实慢，恃强凌弱慢，邪见邪语慢，一时间全部都有，轻慢十方诸佛也不过如此，声闻缘觉更不在话下。这是知见自证胜境，不能以智慧观察辨别，一时找不到自救的方法。如及时醒悟，放下傲慢心，不会产生过失。这不是证圣的境界，圣人心法性平等；而傲慢心由思维想生。对这样自谓具足的境界，自为证圣，则会有相等分的好喜魔入脏腑，控制意根心识，狂妄无忌，不礼塔庙佛像，毁坏佛教经典；还大言不惭的说善语，佛像塔庙不过是金铜土木，人工所造，经书不过树叶花纸上的文字；证得肉身活佛才是真实常住。不礼拜肉身活佛而去崇拜金铜像体和土木泥胎，实在是颠倒愚痴。如有深信不疑的徒众，跟随一起毁坏塔庙，碎毁经书，并挖坑深埋。魔控其身心的人，不但自己和徒众要堕无间地狱，还混淆视听，贻误众生正信；失于正常静坐禅行感受的境界，而沉沦苦海，坠入恶道。</p><p>　　有人问，怎样对待人生，社会学家的回答是，低调做人，高品位做事；我的回答是，平凡做人，老实做事；把低调划入平凡，把高品位归于自然。</p><p>　　佛接着说，这样的人，在继续静坐禅行的定空中，自心观察妙识智慧，悟得心识中圆融法理，得大随顺心一切无有违逆，身心觉得轻稳安乐，无量愉快。对这种胜境不能空掉转化，随顺境界无限遐想；自为证得圣果，得大自在。这是因为自心慧力产生的身轻安与心清净，是殊胜的境界，不可执著遐想，醒悟法理，放下空掉，则不会产生过失。这不是证圣的境界，圣人的境界是性如虚空，心无杂染，身体法喜充满。对这样无量轻安的境界，自为证圣，则会有相等分的好轻清魔入其脏腑，控制心识，自言今生已经满足，具足功德，不必再精进修行，不再听信善知识的教诲，不再听闻佛法；甘守轻清境界，甘作无闻诸法的比丘。当定力销失后，轻清境界也随之销失，便对众生说，佛法骗人，诽谤三宝，贻误众生，要堕阿鼻地狱受大苦报；失去正常静坐禅行感受的境界，而沉沦苦海，坠入恶道。</p><p>　　佛接着说，这样的人，在继续静坐禅行的定空中，悟得光明法理，如虚空一样无有障碍；只见空相，不见实相。如世人有名无实，难以久常；反之，有实无名，也难久常。只有名实相符，才能久常。既见空相，又见实相；才知立因了缘，因果循环。对这种只悟法理空性的人，心中忽然生起，把心识化归虚空，心念处于永灭状态为常住，妄想不受因果律法则的调控，专一其心的向往入于虚空住灭；在诸法空无所有的作用下，心生断灭为长久的谬误理解。这是只悟法理空性生出的断灭想，是空慧而非实慧所致。如及时醒悟，放下空理，不会产生过失；如世间商人，对物品可漫天要价；但买主可以就地还钱。这不是证圣的境界，圣人的境界是既知空相，又知实相；空即是实，实即是空。对这样断灭想的境界，自为证圣，则会有空魔入其脏腑，控制意根心识；在魔力作用下自谓是大乘菩萨，悟法空无所有，何须持戒；开始诽谤持戒修行的人为小乘，借善言度人之机，广行饮酒、食肉、淫欲等污秽之事；魔力不但摄持自己，还能摄持身边无定力的人，相信其人有道而不怀疑、不呵斥。这种人魔鬼入心长久，会失常态，饮尿食粪如饮酒食肉一样；认为净秽无有差别，一空俱空；曲解法理，误人正听，诱导他人破戒作恶，破佛律仪；失去正常静坐禅行感受的境界，而沉沦苦海，坠入恶道。</p><p>　　佛接着说，这样的人，在继续静坐禅行的定空中，感受滋味的欲望非常强烈，从心里到骨髓都觉得刺激的欲味才能得到心里满足和身体平衡。这时，见到异性无限美丽，心中忽然生起很多爱恋异性的念头；这种念头达到自我无法控制的程度，便想方设法获得异性；一旦获得异性欲味刺激，便爱的发狂，贪无止境。如有善知识点破，及时醒悟法理，有念无实，立刻转化，不会产生过失。对这样的贪味境界，自为证圣，则会有欲魔入其脏腑，控制其意根心识，迷顽固执地说，欲爱是觉悟的菩提大道，诸圣先贤最后目的都是达到欲乐无限。把依法修行的戒体之身，转化并等同于在家人，平等行淫达到欲望的满足。并用修行佛法作伪装，不择手段的谎骗言说，与其上床行淫的人，才能得到法的甘露，销灾免难，逢凶化吉，得到密法，成为法王之子，方能得度等。由于欲魔的神鬼之力，于佛不住世的时代，特别是末法时代，一些愚痴的凡夫之人，本来就欲火旺盛，廉耻全无，以耻为荣，一百乃至成千上万的人与其行淫，并供养其人。当魔心对欲爱生起厌倦时，离开其人身体，其人失掉魔的神鬼之力保护，其他人也不再受魔的神鬼之力迷惑，都纷纷揭露其人的罪恶行径，必然受到国法的严厉惩罚；同时，凡是被误导的人，都与其人一样，命终后还要堕入无间地狱受苦报。这种人，魔离体后，失去正常静坐禅行感受的境界，沉沦苦海，坠入恶道。</p><p>　　这种身心反应变化，是每位禅行密修之人必须要经历的一个阶段，是功行气化还神过程中通过脑垂体，并改变脑垂体必然要产生的生理与心理变化前的反应。气化还神至脑垂体后，脑垂体的性功用将发生改变，欲念不起，欲望全无，见异性不再有异性感觉，厌恶欲味想。这里用了虚明二字，如现代医学疫苗的作用，是打完防疫针后产生抗体前的生理与病理变化，作用于身心；对禅行密修的人，本来是黎明前的黑暗，曙光很快到来。明白这个法理后，自然会有很多对治的方法，即刻销除这种因生理作用于心理的变化现象。这是修行禅定境界的人，过于安乐顺利，精不能全部化气，有剩余部分作用于身体产生对心理的压力，与气化脑垂体产生的虚明结合在一起，邪念力超过自我智慧的控制力；因为，盲目的跟着感觉走，被邪念力误导而流入诸异性的欲爱之中。</p><p>　　佛接着说，以上十种禅行定空境界，都是妄想习气与禅力相互作用，才产生的境界，本来是殊胜境界，可是众生顽固愚迷，自不量德；虽有因缘生此境界，可又不知如法对治；以遐想自谓证得圣果；善事转化为恶事，大妄语罪过成立，还要堕无间地狱受诸苦报。佛嘱累诸弟子，于佛入涅槃后，特别是末法时代，要广宣此经法义，不给诸天魔类留有可乘之机，保护诸静坐禅行的人依正法修行，依法义指导自己能成就无上佛道。</p><p>　　受蕴区宇是一切众生身心欲望得到满足的归宿，欲望是真实的，感受是真实的，非常容易产生执著心，并成为众生追求的终极目标；不证得禅定心空的人，很难突破。</p><p>　　佛接着说，阿难你应知，于禅定三昧中突破受蕴区宇的人，虽然诸漏未尽，但神识于定中可以出离肉体，如鸟出笼一样重获自由。如继续精进禅修正定，可以脱离凡夫地，逐渐进入五十四品位、等觉五品位、妙觉，共六十圣位的菩萨，化身成就，随意往来十方佛国土，无有障碍。化身即意生身，意生身可成就三类身体，一是乐意生身；二是性意生身；三是无作意生身。只有化身成就，才能往来六趣，广度众生。受蕴区宇已破的人，虽然正修可以按次第成就无上佛道；但是当下还受想蕴所约束，对诸法相心里明白而表述无序；如梦中人说梦话，虽语无伦次，但吐字成句，让清醒的人能明白梦话之意。梦中人虽不知有人听到，但梦醒有人问起，也可忆起所说。这样的禅定境界出现，就是进入想蕴区宇。如这样的人，心中念不起而尽灭，大脑中对物色的浮想销除，等于本觉妙明的心上去除尘垢，如镜恢复明亮，对一伦即十二类众生的生灭相能明白根由，生因死缘，业习果报都能圆音说法，如光遍照，让众生受益。证得这样境界的人，是想蕴尽；可以超越烦恼浊。烦恼浊是对世间八苦而产生的贪嗔痴慢疑相互融合，难以分别清楚的烦恼。对这样的境界，究其缘由，仍然是禅定作用于心，意识圆融法理，以妄想为本。</p><p>　　这时神识可自由出离身体，见自身如暂住的房舍，臭秽不堪，不过如此。但是，出体不离体，耳闻声响时，立刻返回身体。身体一激灵，定境坏掉，恢复人的思维；但神识出体的游历情况，可反射到思维，让人知其事，大约十天半月才出现一次此境界，缘因如梦魇状况一样，身体不能承受。这时的人，方知爱惜自己的身体，戒修己受，法行自得。</p><p>　　有人问，我很愚钝，怎么没有灵感？说自己愚钝的人对事多思，内增烦恼，外加敏感，是聪明遮蔽了心灵；感应强的人，多是面似愚钝，内增智慧，外加精进，于朴素自然的修行中，才产生心灵与道的感应。</p><p>　　佛接着说，这样的人，在继续静坐禅行的定空中，受蕴已尽，知受虚幻不常住的妙义，不再遭受以此而产生的邪见忧虑的困扰；于圆通的定境中生起智慧，在禅行进入想蕴区宇后，于正定心中喜爱圆融的法理智慧，为此而生起勇猛的精进心；为贪求而直奔终极功德善果，以舍去中间苦行的过程为善巧；如世间的欲速则不达之理。这时，天魔见禅行人有贪求，有贪求就有可乘之机，就有飞行精灵附在禅行有贪求人的身上。在魔力的作用下，这种人还自以为得大智慧，自言已证诸佛境界的常乐我净。如有四众弟子前来这种人处请法，这种人就升座说法；所说法是投其所好而偏离中道，极为善巧而脱正法，假以方便而无实性，炫耀卖弄而尽虚伪；可随求法者的爱好，利用魔的五种报通，于很短时间，变换身形；可幻形为比丘身、比丘尼身、忉利天天王身、妇女身，于暗室中还可身放光明。让无智慧的愚人受其迷惑，以为是菩萨降世，信其说法，接受教化，动摇正心，荡涤正念，不守戒律，不住威仪。这种人背地里贪求淫欲；表面上装模作态，口中好说什么地方或什么人有灾难，让听者心生恐怖而破财免灾；或好说什么地方或人有祥瑞吉星，让听者倾财供养；或好说什么地方有佛出世；或好说水火刀兵等灾难；出家人听其教化不再安稳修行；在家人听其教化不正常过日子，耗散家财，做大供养，以求护佑。这种飞行精灵，就是遇物成形的怪鬼，年深日久，接受日月光华的能量，成为天魔；乘机扰害扰乱贪求善巧的修行人的禅定境界。一旦魔愿得到满足，这种人禅定境界已破，魔就厌倦不自由的人体，离体而去。这时，被魔附体的人失去威德，失去魔通，原形毕露；被世人告发，妖言惑众，贪财恋色等罪过，师与跟随的徒众，要受到国法的惩罚。如静坐禅行精进的人，事先觉知善境界与功德是不可贪求的法义，就会转迷为悟，不受魔难，脱离轮回；如迷惑不知，一旦遭受魔难而败坏佛法僧的世间形像，必堕无间地狱。</p><p>　　俗话说，慢工出细活；特别是禅修密行的人，千万要注意过程的安稳，不求结果的快速；否则，前功尽弃。天魔中的飞行精灵，形如猿猴；但是三条腿，灵巧无比，飞行如风。精灵的魔力是顺从人的贪求，如顺风扯旗，于不知不觉中，加大人的贪求心，控制意根心识；魔借人口，宣说经法。</p><p>　　佛接着说，这样的人，在继续静坐禅行的定空中，没有贪求善巧，只是心想游历十方名胜道场，自由飘荡于山水参访之间；名则参访道场，实则费尽苦心，贪求经历；既赏心悦目，又增人生光环。这时，天魔见有可乘之机，飞行精灵附于静坐禅行有贪求的人身上，于不知不觉中，加大人的贪求心，控制意根心识，魔借人口宣说经法。在魔力的作用下，这种人还以为得大智慧，自言已证诸佛境界的常乐我净。如有四众弟子前来这种人处求法，这种人就升座说法。自身形态没有变化，而诸听法的人，忽然觉得自己身坐宝莲花上，全身化为如佛一样的紫金光色，人人欢喜，各个赞叹得未曾有，感到新奇神秘。这些新奇的状况，让无有智慧的愚人受其迷惑，以为是菩萨降世。这种人表面上装模作态，其心放逸，赞叹淫欲，背地里淫荡无忌，破佛戒律，不住威仪。口中好说，诸佛应世化现之事，某处某人当是某佛化身来此，某人就是某菩萨化现人间等事。让受其教化的人，心生渴望，彻底倾服，认为这种人就是佛来应世。在魔云笼罩的情形下，这种人邪见日益兴盛，菩提种智日益销陨。这种飞行精灵，就是遇物成形的魃鬼，年深日久，接受日月光华的能量，成为天魔；乘机扰害扰乱贪求经历的修行人的禅定境界。如静坐禅行精进的人，事先觉知贪求经历必遭魔事，就会转迷为悟，不受魔难，脱离轮回。一旦遭受魔难，下场同上，师徒生遭国法惩罚，命终后必堕无间地狱。</p><p>　　有人问，禅行有贪求心，天魔怎么知道，并这么快附入身体？这里有四个原因，一是天魔有五种报通，除漏尽通外，五种神通都有；二是禅行人定境中的清净光震坏诸魔宫殿，随即进行扰害报复；三是魔王、魔子、魔民的天性职责，就如眷属一样，日夜围绕在静坐禅行出现定空境界的人周围，在心生的一念一贪中，伺机覆行职责。四是，五十种五蕴魔事，是魔从反面助道，是每位修行人的必经之路，只是各宗的修行人有轻重缓急而已。虽躲不过绕不开，但也可以于无贪无求中直行通过。</p><p>　　佛接着说，这样的人，在继续静坐禅行的定空中，心中生起求得上契诸佛境界，贪爱下合众生之法；达到如绵绵细水洗浴身体一样默契合顺；而且，达到殚精竭虑的程度。这时，天魔乘机附体，控制意根心识，借口说法，其人不觉，自言证得无上诸佛境界。如有四众弟子前来这种人处求法，这种人就升座说法；自身与诸听法的人表面上没有变化；而在魔力的作用下，在没有说法之前，都能自然开悟，能观到思维中念起念落的交替过程，或自知宿命，或知他人宿命，或见地狱众生受苦刑情形，或见人间善恶诸事，或口说偈语，或各自读诵经典，人人欢喜，各个赞叹得未曾有。愚迷之人误为菩萨降世，还与这种人绵密亲近，恭敬供养。而这种人破佛戒律，不守威仪，暗地里贪爱淫欲。口中好说，诸佛有大小、先后（如有人自称是先佛，现在佛为后佛）、真假、男女；诸菩萨也是这样状况。这些听法的人，被魔力迷困，将本有的正知、正见、正觉之心洗涤除掉，很容易误入魔的邪悟之中。这种飞行精灵，就是遇畜成形的魅鬼，年深日久，接受日月光华的能量，成为天魔；乘机扰害扰乱贪求契合的修行人的禅定境界。如静坐禅行精进的人，事先觉知贪求契合必遭魔事，就会转迷为悟，不受魔难，脱离轮回。一旦遭受魔难，下场同上，师徒生遭国法惩罚，命终后必堕无间地狱。</p><p>　　佛接着说，这样的人，在继续静坐禅行的定空中，心中生起辨别分析万事万物物理的化学的变化原理与终始的根本规律；贪求辨析达到了殚精竭虑的程度。这时，天魔乘机附体，控制意根心识，借口说法，其人不觉，自言证得无上诸佛境界。如有四众弟子前来这种人处求法，这种人就升座说法；身体威严之相，似有神韵，让诸求法的人还没有听到说法，已经自然心悦诚服。凡是这种人说法，都将诸佛入涅槃身、证菩提身与出世间的法性身混为一谈，即现在的肉身是；只有世间，无出世间；只有世间肉身佛，无出世间法性佛。而且，肉身佛是父子相生相传不息，即是法性身常住不绝于后；现在所居的地方，就是佛国净土；除此以外，无有世间与出世间的净土，也无有佛的金色身相。诸求法的人，如相信并接受魔说邪法，就亡失掉以前有的求法正心，误将身命皈依魔王、魔法、魔民，还自得意，庆幸自得新奇；甚至愚痴迷妄的认为自己也是<a href=\"/sheli/roushen/36509.html\" class=\"keylink\" target=\"_blank\">肉身菩萨</a>。但究根溯源，还是利用魔法来破佛律仪，暗里贪求淫欲和供养。</p><p>　　昨天有人问我，您讲法时，我们感觉很有威严，也感应有神力加持；您还讲过，世间净土圣人的肉体是；那您是不是魔王？如不是魔王，那您是不是菩萨？因为您讲的法让我们五体投地，心悦诚服；很多人不但静坐听；而且跪着听。我不回避这类问题，准确地讲，我既不是魔王，又不是菩萨，只是一位再普通不过的喜净、乐禅、密行的凡夫而已。讲不是魔王的根据是，魔王借佛法破坏佛法，用邪见歪曲佛法，最惧楞严正法，以前没有、现在没有、未来也不会有魔王、魔子、魔民正解楞严正法，把魔法技俩和丑恶彻底暴露在照妖镜下，致使群魔现形，在禅修密行的境界里无立锥之地。讲不是菩萨的根据是，菩萨说法圆融无碍；我讲法时，尚有欠缺；承蒙不弃；既达不到圆融，又达不到无碍；与古圣先贤都不敢相比，自愧相差太远。讲世间净土圣人的肉体是，世间圣人的身口意清净，是心内求法的结果，集身空、意空、心空、性空的不同境界于一身中；同时，身心清净，法喜充满，悦乐无穷。</p><p>　　佛接着说，这种人口中好说，人身的眼耳鼻舌都是诸佛土，男女二性根才是真正的诸佛证菩提、入涅槃的常住地方。而不知的人，受业习牵引，还竟然相信这些污言秽语；全然不知魔用卑鄙下流之能事，引诱人破戒，达到失掉禅定境界的目的。这种飞行精灵，就是遇虫成形的蛊鬼，年深日久，接受日月光华的能量，成为天魔；乘机扰害扰乱贪求辨析的修行人的禅定境界。如禅行精进的人，事先觉知贪求辨析必遭魔事，就会转迷为悟，不受魔事，脱离轮回。一旦遭受魔难，下场同上，师徒生遭国法惩罚，命终后必堕无间地狱。</p><p>　　世间有贪求辨析习气重的人，很难遇善知识；是善知识怕这样的人日后着魔，以度人的初衷开始，中途以自害的结果告终。所以，既知今日，何必当初；不是不慈悲，是机缘不成熟。</p><p>　　有人问，什么是性命双修？性命双修是修性要借助于身体，使身体六根不放逸，持戒密行，见性并使性得到清净解脱。再通俗一点讲，是借用假躯壳、假身命去修真实存在的自性，恢复自性具足福慧，离开三界，自性作佛祖，性与佛通。本来是这么回事，可一些人在受蕴区宇里打转转，有些人还说眼耳鼻舌是净土，男女二性是菩提涅槃真处，行淫是销业等，尽是魔说秽语。修证菩提涅槃是从转化男女二性根功用开始，离开男女二性根修行不了；如中国古代的太监不能出家修行一样道理。</p><p>　　佛接着说，这样的人，在继续静坐禅行的定空中，心中生起爱慕悬想凭空中的感应，即贪求冥冥中的感应；便向四周人寻觅，八方流动观察，有冥感的高人，精诚拜访，推究研讨人如何才能获得心灵感应。这时，天魔乘机附体，控制意根心识，借口说法，其人不觉，自言证得无上诸佛境界。如有四众弟子前来这种人处求法，这种人就升座说法；诸求法的人，刚一见到这种人的身体容貌，就感觉到有百千岁；让诸求法的人心生爱慕染著，不能离开这种世间高人，甘愿屈尊舍身为奴或仆，满足衣服、饮食、医药、卧具四种生活所需。而且，心中高兴，日夜劳作不知疲劳倦困。在魔力的作用下，这种人能让诸求法的人心里知道；遇到了自己过去世的先师和今世的大善知识；诸求法的人，心中生起特别的法眷属的敬爱，朝夕相伴左右，难解难分，如胶似漆，人人高兴，个个赞叹，甚为稀有。诸求法的人愚痴无智，被魔迷惑其心，认为是菩萨降世，亲情相敬，近身供养，其心受教。师与徒众都破佛戒律，不守威仪，暗里贪求淫欲和供养。这种人口中好说，自己于前世的某一生中先度某人；因为，当时的那个人是自己的妻妾兄弟；有此因缘，今世又来相度。自己要与相度的人，共同相随回归某净土世界，供养某佛；或说另有佛净土，为大光明天，是十方诸佛休闲居住的地方；这是他人不知的秘密，唯有自己知；实际是魔王居住的大光明天。诸求法的人，完全相信魔说的虚幻诳诈之法，以致亡失本来的求正法之心。这种飞行精灵，就是遇衰成形的疠鬼；年深日久，接受日月光华的能量，成为天魔；乘机扰害扰乱贪求冥感的修行人的禅定境界。如静坐禅行精进的人，事先觉知贪求冥通必遭魔事，就会转迷为悟，不受魔事，脱离轮回，一旦遭受魔难，下场同上，师徒生遭国法惩罚，命终后必堕无间地狱。</p><p>　　贪求冥感的人，具有迷惑性，介于佛和魔之间，让人不好辨别，认为是善境界。但要察言观行，这种人所说是，诽谤三宝；所行是，破佛戒律，贪求物色。如谁自称是某佛、某菩萨转世，就请谁喝酒，灌醉后再听其说话，满嘴污言秽语，没有善境界，立马露馅。修行人就要好好修自己的，不要试探谁；修到一定程度，一入定境，开始是魔像和恐怖境界现前，后来就出现佛像；见佛像心生贪著也容易着魔。如梦见现佛身，要立即观察自己，心中有无贪求；否则，容易着魔。</p><p>　　佛接着说，这样的人，在继续静坐禅行的定空中，心中生起喜爱安宁平静，能深入定境，求知无量法理；为自己严格限定时间，每日必静坐禅行多少个小时；又严格限定期限，静坐禅行要达到什么程度；因而不畏辛苦，勤奋修行，乐于隐居在远离尘世的寂静的地方。这时，天魔乘机附体，控制意根心识，借口说法，其人不知，自言证得无上诸佛境界，如有四众弟子前来求法，这种人就升座说法。在说法过程中，魔于空无中突然呈现一颗大宝珠；或魔变化为麒麟，口里含着宝珠和玛瑙、翡翠等杂宝；或口里含着竹简、书册、符咒、信件等种种奇怪异常的物品，先送给这种人；以后麒麟就将这些奇珍异宝，直接放进这种人的衣袋里；或诱骗诸位求法的人，说什么地方藏有明月宝珠，并带领诸求法的人前去观看，果然见有明亮的珠光照耀这个地方。诸求法的人，人人欢喜，个个赞叹这种人的奇特神力；并相信所说邪法，喜欢食用补津益气的一些草药，或一日只食一麻一麦，不食人间烟火食物；而且身体健康，丰盈充实。在魔力的作用下，诽谤诸出家人一日三餐或日中一食所食饭菜，是不肯苦行；或辱骂徒众，用粗俗之言不回避男女众，用污秽之语口无遮拦；不知忌讳他人的讥笑嫌讽。口中好说，自己知道什么地方有宝藏；自己知道十方贤人圣士隐世修行的地方；带领徒众前去观看时，果然能见到诸魔变化的奇异之人，让诸求法的人更加相信所说魔法。这种飞行精灵，就是山神、树神、土地神、城隍神等主管山川大地树木的鬼神；年深日久，接受日月光华的能量，成为天魔。这些不同种类的天魔扰害扰乱贪求静谧的静坐禅行人的方式不一样；有的赞叹淫欲，以单一方式的淫欲破佛戒律威仪；有的暗里贪婪财色名食睡五欲。语言上好像非常精进，而实际上不静坐禅行；只是食用草木等，做一些无益于静坐禅行的苦事。如静坐禅行精进的人事先觉知贪求静谧必遭魔事，就会转迷为悟，不受魔事，脱离轮回。一旦遭受魔难，下场同上，师徒生遭国法惩罚，命终后必堕无间地狱。</p><p>　　有人问，您讲不能与古圣先贤相提并论，自愧不如；那为什么在您的证道偈中，把偈语写在六祖<a href=\"/fjrw/hcrw/hnds/\" class=\"keylink\" target=\"_blank\">慧能大师</a>的后面；六祖慧能大师圆寂后近二千年来，无人敢在后边写证道偈。您与六祖慧能大师相比是后辈，您却敢写证道偈，是不是造次？我讲，所问是从相上说，人有前辈后辈，大人小孩；所答是佛性无有前辈后辈，更无大小；何存造次！不妨把六祖慧能大师的证道偈和我的证道偈读一下，供养诸位；六祖慧能大师的证道偈是，菩提本无树，明镜亦非台；本来无一物，何处惹尘埃。我的证道偈是，菩提道上来，随缘现镜台；妙有续慧命，真空无尘埃。二者只有证悟境界上的不同，没有高低大小的不同；只有时间不同，没有法理不同。</p><p>　　佛接着说，这样的人，在继续静坐禅行的定空中，心中喜欢对世间一切因缘先知先觉，为此而勤行精进，冥思苦想，各处寻访高人，研讨妙理；这是行有所贪，心有所求，想证得宿命通。这时，天魔乘机附体，控制意根心识，借口说法，其人不知，自言证得无上诸佛境界。如有四众弟子前来求法，这种人就升座说法。在魔力的作用下，于听法过程中，诸听法人能各个自知往昔所造作善恶宿业；或对一人说，你今日虽然还健康的活着，而实则已经作了畜生；你若不相信，就让身边的另一人站在你身后；名为站着，实则踏住了你的尾巴；这个人竟然不能站立起来，似有尾巴被踏之感。于是，在场所有的听法人，都被魔力征服，身心礼拜，彻底钦佩，不再怀疑这种人的说法，受其教化。如在场有的人仍不敢相信这是事实，对此有所怀疑；这种人立即就知道，呵斥心不真诚；同时，能说出这人心中所想之事与过去不被人所知之事，证明有他心通；使人不再怀疑。还说在佛制定的律仪以外，加重精修的苦行方法；对知见不同的其他人，诽其不能苦行，谤其不能弘法；并用尖刻粗俗的语言责骂徒众，专门揭示人的隐私或旧时伤疤，不忌讳他人讥笑嫌讽；又经常预测他人的吉凶祸福，到时又准确应验，丝毫不差等。这种飞行精灵，就是大力鬼，年深日久，按受日月光华的能量，成为天魔；乘机扰害扰乱贪求宿命通的修行人的禅定境界。如静坐禅行精进的人，事先知贪求宿命必遭魔事，就会转迷为悟，不受魔事，脱离轮回。一旦遭受魔难，下场同上，师徒生遭国法惩罚，命终后必堕无间地狱。</p><p>　　佛接着说，这样的人，在继续静坐禅行的定空中，心中喜爱自在神通的种种神秘变化，一心钻研究竟变化的原理，贪求获取神通变化力的方法。这时，天魔乘机附体，控制意根心识，借口说法，其人不知，自言证得无上诸佛境界。如有四众弟子前来求法，这种人就升座说法，在魔力的作用下，先表演神通变化，用手执持火光，或将火光分开，放在诸听法人的头上燃烧，火光有几尺高；但是，诸听法人的头上觉不到火光热度，又烧不着头发；还可以表演于水面上行走不沉，如走平地一样轻松自然；还可以表演把座位安放于虚空停住，人入虚空坐在上面又很安稳；还可以表演人走入小于身体无数倍的小瓶子里面去；还可以表演将身形变小，坐在很小的囊袋之中；还可以表演无有障碍地穿墙过壁。由于这种人虽受魔力掌控，但仍有肉身宿念，害怕刀枪等伤害。另外，这种人如是在家人，自言是佛，竟敢接受出家人的礼拜。</p><p>　　在家人无论在什么情况下，都绝无条件地遵从佛律仪，不接受出家人的礼拜。根据世间史书记述，有皇帝、宰官等人，不懂佛教礼制，强迫并接受出家人的礼拜。这是对佛的不尊，对佛法的不敬，对佛教的亵渎，是人福报很快销尽，命终堕无间地狱。</p><p>　　佛接着说，这种人在魔力的作用下，诽静坐禅行为闲坐空参，谤而攻击戒律是小乘佛法；辱骂徒众，揭人隐私，无所顾忌。开口闭口都说神通自在，有时还可以魔幻出佛净土让众人见；这些都是鬼用神力迷惑人而已，都是魔幻而不真实。有时公然赞叹男女淫欲，美其名曰只有这样，才能采阴补阳，或取阳补阴，保持身体健康，法体常住；并采用各种猥亵、轻慢的方法，作为传法的形式。这种飞行精灵，就是存在于天地间的大力山精、海精、河精、土精和一切草木，累劫吸日月光华而成精魅；或是贪求邪术淫乱的龙魅，或寿终仙为精灵借体再活为魅，或应死仙人的身体被精灵附体等；年深日久，成为天魔；乘机扰害扰乱贪求神通的修行人的禅定境界。如静坐禅行精进的人，事先觉知贪求神通必遭魔事，就会转迷为悟，不受魔事，脱离轮回。一旦遭受魔事，下场同上，师徒生遭国法惩罚，命终后必堕无间地狱。</p><p>　　正法时代的修行人，证得四果罗汉以后，自现神通。那时的人，思维纯朴，用神通可以降伏其心。佛住世时，有一位四果罗汉要度脱一位歌女。这位歌女当时美貌无双，歌声动人，贡高我慢。但她生前恰恰是修行人；所以，这位四果罗汉有缘要度脱她。于是，现神通让她见到天女的舞姿和容貌都胜她千倍万倍，立即叩头，贡高我慢心去除，皈依佛门。现在人贪求神通，为的是名闻利养。末法时代真正的修行人不现世，不露世，隐世修行。隐世修行的人不刻意去度哪一方甚至哪一位众生；而是顺其自然，该讲法时讲法，该修行时修行，该现世时现世，随因缘而定，法无定法。</p><p>　　佛接着说，这样的人，在继续静坐禅行的定空中，心中喜爱保持寂静永远不动、万念灭失的状态；同时，对世界诸法变化的规律性研观其本，穷究其源，贪求诸法深广无形的空理。如因果规律的变化，世人只见今世果不见今世因或前世因，是谁将因转成果，又是怎么将因转成果；今世果已缘了，又怎么化为未来世的因，还需了缘。这时，天魔乘机附体，控制意根心识，借口说法，其人不知，自言证得无上诸佛境界。如有四众弟子前来求法，这种人便升座说法。在魔力的作用下，其身体突然不见为空无，正在诸求法人惊奇之际，又从虚空中突然而出；身体的空没与存出都是随心自在。这种人有的身体如透明的玻璃，看似有形，细看透明如影；如用照像机照像，不见身体，能见身后之物体。这种人有的手脚一伸出来，可冒出旋檀香气。这种人有的排泄的大小便如蜜一样甘甜美味。这是由于同类不同种的天魔，魔力作用不同所致。诸求法的人被魔力迷惑，听其教化。这种人由于意根被魔控制，心识一片空白，自然反应出不愿受出家人清规戒律的约束；生出断灭想。诽戒为紧箍咒，毁戒为空无；轻慢出家，践踏寺规。口中好说，哪里有什么因果，都是人说有就有，说无就无的事；人一死百了，什么神识都没有。哪有什么身后身，更没有什么凡夫与圣人的区别。虽然心中空寂无念，但贪著触欲；凡是与这种人行欲的人，也都被魔力控制，心空无念，也认为根本不存在因果报应那回事；人活一天，欲乐一天。这种飞行精灵，就是日蚀月蚀时，日月产生的精华之气，即天地间光合作用的一种能量，被金石、玉石、灵芝、人参或麒麟、凤凰、龟、鹤类接受；这种能量可让金石、玉石等矿物和灵芝、人参等根物附有灵性；似如《<a href=\"/ctwh/gdxs/smzg/xyj.html\" class=\"keylink\" target=\"_blank\">西游记</a>》中描述的天产石猴，《红楼梦》中的通灵宝玉，民间所说的灵芝童子和人参娃子等；千万年不销灭而具有灵识，成为天魔。凤凰、麒麟为天界禽兽，鹤、龟为地界禽兽，由于这类禽兽的寿命特别长，能将接受到的能量累积作用于本有的灵性，使寿命更长久，便飞行入空，成为天魔。乘机扰害扰乱贪求深空的修行人的禅定境界。如静坐禅行精进的人，事先觉知贪求深空必遭魔事，就会转迷为悟，不受魔事，脱离轮回。一旦遭受魔难，下场同上，师徒生遭国法惩罚，命终后必堕无间地狱。</p><p>　　探究深空妙理，无穷无尽；如空气里的水看不见形，落下后为雾为雨为雪为霜又为水形，于不见不知中蒸发又入空。对修行人来讲，属于心外有求，有求为贪，有贪为因，有果为缘；如本来一块白布，被人染污的五颜六色；再用有颜色的水去清洗，想恢复本来的清白有可能吗！</p><p>　　佛接着说，这样的人，在继续静坐禅行的定空中，心中忽然生起喜欢长寿之念，这个身体如永岁常住，万寿无疆该有多好。为此目的，不畏艰辛苦行，钻研妙法良方，达到无有数目限制的寿命。这时，天魔乘机附体，控制意根心识，借口说法，其人不知，自言证得无上诸佛境界。如有四众弟子前来求法，这种人便升座说法。在魔力的作用下，好说其它星球世界的状况，还可以于瞬息之间往来于世界之间，无有障碍；还可以拿来其它世界的物品作为信物，证明此世界无，彼世界有；同时，炫耀自己的神足通；还可以在一个地方或一个室内，虽是几步的距离东墙西壁，可是让急走快跑，几年都不能行完几步远的路程；利用魔力，将大地距离伸缩，近可远，远可近。还假意慈悲，口中好说，十方众生都是我的子女，十方诸佛也是从我这里化生出去的；我是本元佛，他们是分身化现佛，需要修行证得；我是出世自然而得佛位，不须修行证得。让诸求法的人，诚心信仰，认为就是活佛住世，受其教化，听其摆布。这种飞行精灵，就是被住在广欲自在天的魔王波旬指派的役使鬼和啖精气鬼；如这些鬼类中有发心皈依佛法僧三宝的，可以成为修行人的护法神；但多数没有皈依，就如世人一样，少数皈依。没有皈依佛法僧三宝的鬼类，受魔王驱使，专门扰害修行人。如见修行人心有贪求，便乘机扰乱禅定境界；见静坐禅行定境已破的时候，便现美女身，与这种人行淫，吸食精气，以保持魔体的正常魔力和美颜。贪求常住的人，不论其师是什么样的修行人，都是自因自缘，自作自受；所作所受与师无关。如师徒同有贪求，就是同作同受。魔附其体的人，能亲自观见魔王变化的金刚坚固身，为其传授长命之术；然后受美女引诱迷惑，以旺盛的精力贪婪淫欲；荒淫无度一年时间左右，精气竭尽，内脏功能失调，形如骷髅，皮干肉瘦。还自言自语地说，与美女行淫真是快乐无比；更加听从妖艳鬼魅的摆布；诸求法的人不知详情，受其迷惑，参与淫乱，难免国法的惩罚；而这种人还未接受刑罚，就以身干力枯而死。参与扰害修行人的鬼类，也因此获罪丧命而销失。诸修行禅定的人，应该事先觉知不要心起贪求，正心修行，才能脱离轮回；否则，起贪遭魔，自害害人，失去正定，堕入无间地狱。</p><p>　　用钻研的妙法良方，求得寿命增长为贪，以妄想心主观的弃舍分段生死，希望快速得到相的变易生死；让生与死之间无常色相的剧烈变化为细微变化，而达到色相常住。三界有形与无形众生都是分段生死，生与死之间有阶段性，死与生之间又有阶段性；这是法则决定的；人的主观意识无法改变宇宙法则；如不顾客观实际的主观盲动，必受到法则无情的报复。出离三界住无为法的众生，生与死之间、死与生之间在常住性相上无有剧烈变化，只是在心理境界上变化就已完成生命的更替过程，就为变易生死。变易生死的实现，是证得而不是想得，是自性具足而不是心外求得。</p><p>　　佛接着说，阿难你应知，这十种能入想蕴区宇的魔类，在将来的末法时代，有的现世作人；再出家为僧，住入寺庙，名则修行，实则破佛戒律；有的魔附人体，或魔变幻裸体美女，或魔变幻佛像入定境中及梦中，迷惑修行人放弃修行，自言已自然得到无碍的智慧。</p><p>　　在这里诸位要注意三点；一是佛法无碍，修行人正心、正念、正行自能破魔；而末法时代的众生贪习加重，自我召感。二是不要认为末法时代的出家人都是魔，绝大多数出家人还是持戒正修，只是极少数人是这种情况。三是在家人不要去寺庙观察此类事，只管上庙供养种福田，持戒修行。</p><p>　　佛接着说，这十种魔类，有一个共同特点，都赞叹淫欲，贪求利养，用淫贪魔法，破佛律仪。先是被魔附体并控制意根的恶师，后是被恶师教化的徒众，都被精灵附体，魅其意识，师与徒淫淫相传。近则在佛入涅槃的九生以后，一生一百年；即九百年后，诸魔与魔法流行于世间；远则在佛入涅槃百世以后，一世三十年；即三千年后，魔王魔法更加兴盛；会使一部分真心修行而无智慧的人，妄起贪习，自毁正心正定，沦为魔王眷属，命终以后先为魔民，待正知丧尽时，堕无间地狱。佛嘱累诸弟子，虽然证得无学，即阿罗汉果位也先不要入涅槃；而是要发菩提心留于世间，于末法时代，生起大慈悲愿力，用佛正法救度正心修行、深信佛法的众生；广宣此经，让正心修行、深信佛法的众生增长智慧，得正知正见正觉，不给诸魔留有可乘之机。佛已经将众弟子度脱生死苦海，能遵佛嘱累，就是真正的报答佛恩。以上十种静坐禅行的魔境，都是想蕴与贪求心交织在一起，相互作用出现的理悟知见。由于众生顽固迷劣，自不量德，遇此类境界现前，不能心转因缘，还自受迷惑而不觉知，自言证圣，大妄语罪过成立，必堕无间地狱受诸苦报。法会中的众弟子，须遵佛教诲，在佛入涅槃后，特别是末法时代，要弘传此经，开示众生明白此经法义，正心修行，不让天魔得到方便机会，保护法修戒体，成就无上的菩提路。现在修行人，时刻离不开此经，提醒自己觉知魔事，心无贪求，不给诸魔可乘之机，一定能证得圆满菩提。\t\t\t\t</p></div>"
},{
    "title": "【大佛顶首楞严经卷十】",
    "author": "净慧大师",
    "date": "",
    "html": "<div class=\"B1_text\"><h2>【大佛顶首楞严经卷十】</h2><p>　　我现在最大的乐趣是一天能静坐十几个小时；再有时间就读诵佛经，佛说法的境界太妙了；让人一生受益无尽。有人问，一读诵佛经就困是怎么回事？原因有二；一是精力不够集中或不能理解法义；二是佛经有护法神力，加持读诵佛经的人，而一些人不能适应，经常读诵就自然会清醒。</p><p>　　佛说，阿难你应知，静坐禅行正定，突破想蕴区宇，进入行蕴区宇的人，于日常生活中或睡觉时无有梦想，醒与睡都是一样，保持恒长如一的清净；心中觉得内里一片明亮，如太空一样宁静，犹如晴空无有浮云遮蔽；又没有粗俗的影像和重大尘事出现。双眼一闭，不觉有身，不觉何处，不觉东西南北；只觉一句佛号绵绵密密。想蕴区宇可尽，而心念佛不尽。</p><p>　　此时，要区别开，不要将心念佛号也误为想蕴而空掉。修净土的人通过这里无碍，而禅修密行之人，要特别注意，光知静空，不知心念一路空下去，容易偏离正道。这就是古代圣贤说的禅不离净和密净双修的法理缘由。</p><p>　　佛接着说，进入行蕴区宇的人，日常生活中，见山是山，见水是水；思维不去想山水之美，更不去想山风树木、水清鱼跃等事，即见即失，大脑不入印象，心中不留痕迹；如明镜可照万物，万物踪迹不留镜中；随因受照，随缘空掉。一切过去的陈年往事，嗜好习气都空不可见，唯见一精真灵识，自我的主人，住于躯体之内。</p><p>　　有人问，这时的人是不是有睡无眠呢？可以准确地讲，有睡有眠；眠是生理需要，只是身眠心不迷；闭目倦而无思为睡，有知有觉；在睡的基础上，大脑于瞬间松弛平缓，有觉无知为眠。睡而入眠的过程清楚，心不起杂念而知念佛，为不迷。</p><p>　　佛接着说，进入行蕴区宇的人，内观自己由业习牵引而生的根本，由接受业报而死的本源，从当下已经去掉遮蔽，逐渐显露出自我真容。向外观十二类众生，结束生命和竭尽全力的求生欲愿，虽然各类众生有所不同，还不能彻底明白其中的圆通法理；但能观知精真灵识是生命共性的根本开端和同生的基础，犹如夜晚旷野无边又广袤无垠草原上生成的露珠，在早晨太阳照耀下闪闪发光，清静无有杂扰；这一精真灵识在众生体内是维护生命现象的根本，人身六根为门框，有出有入；六尘为门，可关可开；六根六尘相互作用，产生出入关开的现象；而没有在表面显现的精真灵识，是连接门与框并保证正常出入关开的主轴与穴孔。这就是静坐禅行定空的人，进入行蕴区宇的境界。如这一清静如发光露珠一样的精真灵识，归入本自清净的法性海水中去，就一静一切静；牵引精真灵识受生的一切业习销失，如波涛平静，化为无杂染不流动的静水；达到这样境界的人，为行蕴尽。行蕴尽的人，可以超越众生浊；众生浊为众生此死彼生，彼死此生；生死不断，流无始终；超越众生浊为，二万至八万劫之内逃离生死，不受人、修罗、畜生、饿鬼、地狱五道众生相混淆的轮回生死。即使达到这样的境界，自然智慧尚未显现；是依幽深的禅定力，达到心识的安稳；仍然是以心外行蕴中的妄想为根本。</p><p>　　佛接着说，阿难你应知，静坐禅行正定的人，贪求心已经停止，具有智慧的正心开始显示作用，想蕴中的十类天魔已经无有可乘之机。证得此时的境界，色受想三蕴外魔已破；而行蕴妄计的内魔开始生起，立下十种外道计因。开始精细观察引起无量众生生死轮回动力的根本，特别是对人类的精细观察。人生的根本内动力业习为因，已经先于因来到世间，与之业力相适应的为外缘；内因外缘和合才有人生。观因察缘，每人的因行久远幽深观不尽，与之相适应的缘，蕴清观察不到边。精真灵识随因缘入生死流，在三界内扰动而无序；对处于扰动而无序状态中的精真灵识妄加计算度量的人，要坠入外道所执著的二无因论。</p><p>　　一是本无因论。这样的人，在静坐禅行定空中，观察人的中阴身，一旦得人身后，强烈的求生欲全部破除；由欲求得身，变为求长寿身。这时，于定空境界里，利用眼根的八百功德，神力极至可见八万劫以内的众生因缘，神识随业流转和停靠的环节，都是这里人死，那里人生；但是，只能观察到众生轮回的地方，人生人，羊生羊，众生各有生的规律与法则。而众生的业报与地府里如何转化，掌控轮回的规律与法则，却不能观察到。八万劫以外时间冥冥中存在的因缘，更不能观察到。再根据观察到的因缘，便有了自己的理解，妄下结论。认为存在于娑婆世界内的一切众生，神识的产生是无因自有，在宇宙中自然产生；一切众生的形体也是无因自有，自然产生。由此计数度量得出的结论，从时间上讲是抽象，从法则相对的内外两重性上讲是片面。所以，在心里销失了十方法界普遍存在的纯正的绝对真理；即时间上前后无始无终，空间上有世间与出世间（宇宙），于出世间无边无际。这样认识世界的相对时间与相对空间产生的生命现象，以及相对的生命现象的变化规律，就落入心外求法之道，迷失出世间的方向，惑乱不觉自有佛性。</p><p>　　二是末无因论。这样的人，在禅行定空中，只能观察生死现象，不能观察生死的本质；即只观察到外在因缘，观察不到内里因缘。见人自有生殖器官，就悟知人生人，鸟生鸟；乌鸦生来就是黑色，天鹅生来就是白色；黑色不是染料加工而成，白色不是水洗加工而成；天人、人是自然的直立行走，畜生类是自然的横行。八万劫来，这样的现象已成规律，于世间不能改变。如今天存在的身体形像走到尽头，还是此死彼生。因为观自己神识在世间的生死轮回，见不到出世间的佛性；所以，根本没有出世间成佛那一回事，虚空宇宙中根本无佛，佛是人心中的精神存在而已。根据局限的观察和相对的所知，认为今天人类所见到的世间一切物理现象，都是上天恩赐，自然生成，无因自生，无缘自成。而主观否认善恶各有因果，业习各自召感，人与动物的自性相同，一切皆因缘成就。由此失去正知、正见、正觉，而坠入偏知邪见的外道，迷失出离世间的方向，惑乱不觉自有的佛性；创立了第一种外道的立无因论。</p><p>　　这里，这种人的观察，从纵向的无量劫只见八万劫这一阶段，从横向的无际宇宙中只见世间；存在一定的阶段性和片面性。从微观上只知精真灵识的存在，而不知所以然的内在实质；如在显微镜下能见到细胞，而细胞内的质子，中子等遗传基因与图谱却见不到，何况密码的匹配融合，从宏观上只知从中阴身到人身，再由人身到中阴身简单的循环方式，而不知存在的所以然。</p><p>　　有人问，人与动物有什么区别？生物学家的回答是，直立行走；哲学家的回答是，语言文字；我的回答是，道德信仰。</p><p>　　佛接着说，静坐禅行正定的人，虽然天魔不得方便干扰；而内心却生起穷尽各类众生生死循环根本的念头。观察生死因缘因纵向的无始无终而只能观察某一阶段；观察精真灵识入生死流因横向的无边无际，而只能局限于世间。对处于扰动无序状态下的精真灵识，暂时变化和相对稳定现象妄加计数度量。这样的人，要坠入外道所执著的四种普遍恒常存在的理论。</p><p>　　一是穷心境性。这样的人，在继续静坐禅行的定空中，内心知精真灵识和外部环境一切法性都是没有生因而自然生成。定中神力能观察到二万劫以内的三界众生所存在的生死循环现象，都是生有众生相，死有中阴相；相无变化，蕴不散失。由此认为这是恒常不变的规律，便产生了心常与境常的理论。</p><p>　　二是穷四大元；这样的人，在静坐禅行的定空中，观察人的身体和世间万物，都是由地水火风四大元素所组成。四种大元素无论包含多少种小元素，大小元素之间无论如何发生变化；物性的本质不会变化，即物质不灭规律。证得这个境界，定中神力能观察到四万劫以内的三界众生，无论如何生死循环，构成众生身体的物质不灭。即人体灭时，肉骨归于大地，水份归于空气进入水循环，呼吸之气归于空中之风，体温热量归于温度，思维归于精真灵识，这些又都依时间与空间而存在，永远不会销失；便产生了物质不变的恒常理论。</p><p>　　三是穷尽六根。这样的人，在禅行的定空中，观察人体六根作用，都归于本有的功能。六根的功能归源于各主器官的功能；如肝主目、心主舌、肺主鼻、肾主耳，脾主唇、意主神。各器官的功能归魄的神力，魄的神力归第八阿赖耶识统摄。无论人体如何变化，这种身体的本质特征作用的规律永远不会变化。证得这个境界，定中神力能观察到八万劫以内的三界众生，无论如何生死循环，心识功用都不销失，自然常住，不会因时间的变化而引起心识功用性质的变化，由此认为这是恒常不变的规律，便产生了穷尽六根而识性恒常的理论。</p><p>　　四是即尽想元。这样的人，在静坐禅行的定空中，观察人的思维中想是如何产生的，本源是什么。人体的生理更生和死无，如流水液态的流动性不能停止；虽然禅行证得正知正定的境界，对自己生死的想法已经达到永远销失灭尽；但在理论上想是来源于自然；即来自于永不灭失的心识和生理的大脑。不知自性有识无想，源于自然又超越自然，具足无有极限的智慧。由此认为识想是自然不变的规律，便产生了心识与大脑是恒常想的理论。由此失去正知、正见、正觉，而坠落为偏知邪见的外道，迷失出离世间的方向，惑乱不觉自有的佛性，创立了第二种外道的立圆常论。</p><p>　　一灭永灭，一些外道认为这是真常的。真常的自性不能用肉体定境来计度，修行过程中肉体的转化和禅定不同境界只能说明是成就佛道的一种因。静坐禅行深定时，肉体只是法喜充满，到缘起缘灭时也必然留在这个世界。极少数人身体弘化后身高缩小，或剩个指甲头发等也是留，根据修为和愿力不同而定。色身必须舍弃，极乐世界是莲花化身，不需要这个肉身。肉身弘化掉是自然回到宇宙中去，把自己身体的能量释放到宇宙中去，而不带入极乐世界。</p><p>　　佛接着说，静坐禅行正定的人，虽然天魔不得方便干扰禅行；而内心却生起穷尽各类众生生死循环根本的念头。用阶段性和局限性的观察，对处于扰动无序状态下的精真识灵妄加区别，自己与他人及其它众生的计数度量，这样的人要坠入有我法二执的四种颠倒知见，恒常相对存在的理论；一是自证得常他无常；二是国土无劫坏为常，有劫坏为无常；三是精真灵识为常而身形无常；四是精真灵识向无色界升动为常，色界以下色身的受想为无常。相对存在的理论，是三界为一体，在永生与更生相互对立中存在，一半是常住存在，另一半是无常存在。此理论存在的基础有四种：</p><p>　　一是观妙明心。这样的人，在静坐禅行定空中，内观充满妙意光明的精真灵识，遍满三界内十方虚空，认为清澈自然的虚空，就是究竟自在的神识性我。由此则推理，性我遍十方虚空，凝结于光明中不生不灭而常住。一切众生于性我的光明虚空中生死无常；是众生的无常相，又是众生的无常性。</p><p>　　二是不观其心。这样的人，在静坐禅行定空中，不观自心，也不观众生，只观察三界内十方国土，一部分在一定时间的劫数内，有成住坏空的循环；由此认为相对时间内，不存在劫坏的世界为究竟的国土，性我居住在究竟的国土为不生不灭的常住；反之，为究竟无常的国土，众生的无常性就应该居住在劫坏的国土。</p><p>　　三是别观我心。这样的人，在静坐禅行定空中，不观他人与其它众生，只观自己精真灵识，纯净清晰微妙的性质很难把握，犹如浮尘微小而飘荡。在随风力飘浮的流转中，不能改变其性质。由此认为我心即佛，佛即我心；身体可以随时生死，而我心不灭；心即性我为常住，一切身命的生死都从性我流出，是客观存在的自然现象；在相对的法则中，性我常住，身我无常。</p><p>　　四是想知蕴尽。这样的人，在静坐禅行定空中，观深妙而蓄积具有流动力的精真灵识，静止是暂时的，流动是长期的。由此认为精真灵识能随定力的变化而流动，是常住不变；所以，舍色界以下色身的受想无常，上升无色界为随定力依识而住，乃至非想非非想处。这种常住与无常相对存在的知见，坠落为偏知邪见的外道，迷失出世间的方向，惑乱不觉自有的佛性，创立了第三种外道的相对存在理论。</p><p>　　有人问，赵州老和尚的禅心境界是什么？我只讲自己的悟知；即不论来人的想与相，心无分别。当和尚问来访的第一人，你是不是来过柏林禅寺时；若回答，法中无我，不想再来，请大和尚开示；当和尚问第二人同一问题时，若回答，我已发菩提心，还想再来，请大和尚开示；当和尚问第三人同一问题时，若回答，本不想再来，愿想还得来；来者有相无心，不来者有心无相；怎么去把握？赵州老和尚不会回答吃茶去！吃茶去！吃茶去。而是会于心无分别中起悲生慈，将会产生另外一种禅心境界。</p><p>　　佛接着说，静坐禅行正定的人，虽然天魔不得方便干扰禅行，而内心却生起穷尽各类众生生死循环根本的念头。用阶段性和局限性的观察；对处于扰动无序状态下的精真灵识，在不同阶段和不同位次中妄加计数度量；这样的人，要坠入四种相对有边的理论。四种相对有边的分位是；三世分位；见闻分位；我他分位；生死分位。四种相对有边的理论是：</p><p>　　一是心计生元；这样的人，在禅行定空中，观察过去世为人时，精勤修行十善业，才有今世于静坐禅行中知见的精真灵识；过去世的启修时间为自有明心的边际，即始为有边。现在世的心如川流水，不可止息，流向远方。未来世的心还没有到达，如流水后浪推前浪相续不断，奔向时间无限、空间无边的未来；即无终为无边。</p><p>　　这里的始是相对的，有边落入有为法；实则无始无边才是无为法，是绝对真理。这里的无终也是相对的，是欲始对立而提出的无终，也落入有为法中的无终；实则出世间无终才是无为法，是绝对真理。</p><p>　　二是观劫生灭；这样的人，在静坐禅行定空中，观察众生八万劫以内的因缘。于时间上对八万劫前众生的因缘不能观察见闻觉知，于空间上对八万劫前众生的生命起源不能观察来自什么地方；即相对的无边论。观察现实中存在的众生，虽然生命处于生灭法则中；但自然赋予各类众生本能的繁衍生息不会停止；即相对的有边论。</p><p>　　无为法是中道了义，空于两边。</p><p>　　三是计我遍知；这样的人，在禅行定空中，认为性我能遍知一切人的因缘，一切人不能知于人中有这样性我能觉知一切因缘的超人。由此认为一切人永远是人，不会得到性我的无边心，只能是始生灭死的有边心。</p><p>　　这里的关键是，这种理论否认一切众生皆有佛性，一切众生都可成就佛道，一切人的心都是可以变化的。这样的人，妄自尊大，不知世间有无量菩萨住世，以平常人的相，说平常人的话，作平常人的事，用平常人的心行佛法。</p><p>　　四是穷行蕴空；这样的人，在禅行定空中，观察世间一切法则，都是相对而生，相对而灭，相生相克；如有男有女，云销雾散，金木水火土等。以观察到的所知所见，在心里形成固定的统筹度量；即一切众生都是一半时间活动一半时间休息；以此推断，世间的一切存在，都是生与灭一体，生是灭、灭是生，灭为无边。所以，执著于空识，无有色身，不生也就无灭；以无色界为究竟常住。这种有边与无边相对存在的知见，坠落为偏知邪见的外道，迷失出世间的方向，惑乱不觉自有的佛性，创立了第四种外道的立有边论。</p><p>　　有人问，什么是三摩地？什么是三摩提？二者都是禅定三昧中的境界，三摩地为正定；是心平等，处于不为外力所动的状态。三摩提为正心；是禅定摄心，心不放逸。</p><p>　　有人问，修行禅定的人，证得正心、正定，为什么还坠落于外道偏知邪见呢？因为修行禅定的人，证得的正心、正定为世间智而有知见；未证得出世间自性智而无知见，于无知见中具足知见觉。所以，世间的正心、正定仍在有为法中，一有计度就著两边而落入外道；如无计度，则一路空行下去，空行中念佛，才能出离世间，入无为定三昧中去。</p><p>　　有人问，怎样看待社会文明？政治家的回答是，制度文明；制度文明来源于物质文明和精神文明。我的回答是，道德文明；一切文明源于人心，心灵文明才创立制度文明；心灵文明源于信仰文明，人有信仰，人生才有寄托和希望，才创造物质文明，创立精神文明。人若失去信仰文明就失去道德文明，也就失去了物质文明与精神文明的基础，人类将受到物质文明反面的伤害，也将失去人生的价值。</p><p>　　佛接着说，静坐禅行正定的人，虽然天魔不得方便干扰禅行，而内心却生起穷尽各类众生生死循环根本的念头，用阶段性和局限性的观察，对处于扰动无序状态下的精真灵识，妄加执著于自己的知见，开始怀疑佛法中自己未知的知见，不能接受善知识的知见；咬住死理不松口，别劲九头老牛拉不回。这样的人对佛知佛见，用自己的寡闻管见妄加计数度量，要坠入观心变化、观心无证、观心有证、观心有无俱颠倒中去；再坚持自己虚谈空论的颠倒知见，至死不改；如乌龟咬手指，死后都不松口，一咬到底。用自己的偏知邪见强词夺理，妄想矫正惑乱正知正见。四种颠倒是：</p><p>　　一是观变化元；这样的人在静坐禅行定空中，观察自己精真灵识，随善业因缘流动的方面认为是变化，前因后缘相接，连续不断的方面认为是恒常，觉知存在的方面认为是有生，觉知不到存在的方面认为有灭，生灭知见相互连续的方面认为有增，生死之间相互脱离的方面认为有减，觉知存在的各个方面认为诸有，觉知不到存在的方方面面认为诸无。不能全面、系统、了义、究竟地观察精真灵识的内含实质，只以片面的空虚之理并带着有色眼镜遍观法性再主观加以辨别，形成矫乱的偏知邪见。如有人前来求法，不论求法人求问什么题目，都用一套理论作答；即我观是生，也是灭，也是有，也是无，也是增，也是减。任凭千言万语来，我只一语去。让所有的求法人，丈二金刚摸不到头脑；对所求解的佛经章节语句统统忘掉销失，被轻谈虚说得晕头转向，不知所措。而这样的人，还洋洋得意，认为自己证悟的理论高深莫测。</p><p>　　现今时代，这样的人大有人在；闭了几年关，读了几部佛经，形成了自己的知见，便天下第一；能把前去请法的明白人说糊涂；还说最快七天，一般一年，最慢三年，保证让人立地成佛。我只讲现象不对任何人，只是千万不要自误再误人。佛住世时有快速成就、立地成佛的人；但那是个例，而且是乘愿再来的大因缘者；不是所有人都能如此。</p><p>　　二是谛观无证；这样的人，在静坐禅行定空中，对觉知存在的精真灵识方方面面都无所证得，似空似无；似空无所有，似无就是虚。认为静坐禅行的最高境界就是虚无，一切无所有。如有人前来求法，不论求法人求问什么题目，都围绕着一个无字作答，说尽虚空遍法界最终归于虚无，修行人最后结果一切无所有，连身口意都无所有。对其它的法义，无所言说。</p><p>　　三是谛观有证；这样的人，在静坐禅行定空中，对觉知存在的精真灵识各个方面都是诸有，一切修行人于世间有修有证，有证有得。如有人前来求法，不论求法人求问什么题目，都围绕一个有字作答；说尽虚空遍法界都围绕诸有而存在，修行人最后结果也归结为诸有。对其它的法义，无所言说。</p><p>　　四是谛观有无；这样的人，在静坐禅行定空中，对觉知存在的精真灵识，既观到有证的一面，又观到无证的一面。这时的境界，如一颗大树，只见其枝叶繁茂，不见主干挺拔。只见自心存在的两重性，不见自心存在的实质性，还是在心外的相想之间打转，不知舍弃想与相，向内继续求，出世间才见真性我，三界之内是假性我。这种不顾正知正见的法执，用自己所观察知见强加于人的理念，坠落偏知邪见的外道，迷失出世间的方向，惑乱不觉自有的佛性，创立了第五种外道的遍计虚论。</p><p>　　当今时代有的人，无修无证，见谁静坐禅行，就说是外道。对佛法中由禅定引发的极少数人的外道现象，不能正解，就一刀切，妄下结论，就一句四字洪名成就，其余都是外道。这样的人很可怕，不读三藏十二部经，只读一本经；再以偏概全，只见一斑，不见全貌。这里不是哪位法师讲法有什么过失，而是一些人无有智慧，断章取义，理解片面所致。</p><p>　　佛接着说，静坐禅行正定的人，虽然天魔不得方便干扰禅行，而内心却生起穷尽各类众生生死循环根本的念头。用阶段性和局限性的观察，对处于扰动无序状态下的精真灵识，内有因力，外有缘力，无有静止，如水一样流动现象，妄加计数度量。认为精真灵识必须依附体而存在，才能使其静止；否则，流动不止。不知出世间诸佛菩萨可以化身成就，完全可以达到离体而存在。由此坠入身死后有相的知见中，以知见颠倒产生行颠倒。在世间开始修炼身体，千方百计保持健康，达到长生不老；还说有色身才能有性我的存在，无色身，性我无法存在。或住于禅定精真灵识圆融遍含三界国土的境界中；还说是因为有色身的禅定，才有定的境界；离开色身的禅定，将无有定的境界。或认为色身即性我，性我即色身；还说性我在色中，色在性我中；色身随性我，性我随色身，二元往复，无法分离。相互依存，相续不断，保持色身与性我二元结构的生命体，永恒存在于宇宙中享乐。以这种知见计数度量色身死后性我与更生的色身循环，色受想行中各有四个循环，四个循环重复往来，于二十五有中可产生死后十六种色相。以此计数度量，精真灵识中也有相对存在；即具足一切烦恼，又具足一切菩提；二种性质同时存在于一体内，相互对立，又相互依赖；既不能完全彻底的证得清净佛性，又不能完全彻底的断除浊恶烦恼。由此产生宇宙中无佛道可证，佛只存在于心中；只有永恒的天堂，天人享乐无尽的天福。这种死后有相的知见，迷失出世间的方向，惑乱不觉自有的佛性，创立了第六种外道的五蕴中死后有相心颠倒论。</p><p>　　有人问，您讲《楞严经》为什么不讲楞严大定？得楞严大定还有五十种五蕴魔吗？楞严大定全称应为首楞严三昧，首楞严应为一切毕竟而坚固；楞严定为见知佛性。得楞严定的人，才能具足彻底降伏魔王的威力。得楞严定的人，只有十地以上的菩萨才能证得；因为，只有十地菩萨才能知见佛性，但还不能了见佛性。楞严定的境界为心如虚空，一切无碍，了知一切众生心三世无碍，知一切禅定解脱门，具足无量神通和无碍智慧。十地以上诸菩萨，依此楞严定的威神之力，可入地狱、饿鬼、畜生乃至诸魔、诸修罗道中去，随缘现镜台，为其说法，化度众生。现在诸位明了此经，不等同于楞严定；所以，没有讲。五十种五蕴魔未尽的人，未得楞严定，还相差阿僧祇劫那么长的时间呢！</p><p>　　佛接着说，静坐禅行正定的人，虽然天魔不得方便干扰禅行，而内心却生起穷尽各类众生生死循环根本的念头。用阶段性和局限性的观察，对处于扰动无序状态下的精真灵识和已灭除的色受想，妄加计数度量；这样的人坠入身死后无相的知见中；以知见颠倒产生行颠倒。在世间，自知色蕴已灭，身心于六尘无有执著，因无所立；又自知想蕴已灭，意识于财色名食睡无有执著，心无所束；又自知受蕴已灭，与色蕴和想蕴不能形成连续的组合，欲望需求的内动力销失，把身体的能量转化分散于各器官中去，形成身空、意空的禅定境界。虽然身体有生理现象，但在世间觉得再无生存的意义，把身体当作行尸走肉，与草木相同。不知是静坐禅行中身体状况进入转型期，五蕴不尽，禅悦未起；如再精进前行，待五蕴尽时，身体自然生起法喜；这时才知老天和父母恩赐的身体宝贵，静坐既可禅行喜乐，又可行菩萨道。而不知老实静坐禅行，妄起禅机的人，这时认为，人生有身体时，都无所得；更何况死后再有的身体又能怎么样呢！根据静坐禅行境界的当下实际状况，反复比较，生前死后所得诸身，都空无所得，心如死灰。在色受想行四蕴中，各有生与死二种空无所得相；并以此推论，佛法中的常乐我净与因果等一切，都是人一说而已，实际是空无所有，只是有名无实的理论。当劫来临时，人与万事万物都归断灭，不复存在。由此产生的生前死后都空无所得的断灭知见，迷失出世间的方向，惑乱不觉自有的佛性，创立了第七种外道的五蕴中死后无相心颠倒论。</p><p>　　佛接着说，静坐禅行正定的人，虽然天魔不得方便干扰禅行，而内心却生起穷尽各类众生生死循环根本的念头，用阶段性和局限性的观察，对处于扰动无序状态下的精真灵识，知行蕴未尽；在行蕴存在中，用已灭的色受想的无，来破自己静坐禅行中行蕴的有。这种心外妄自计数度量有无知见的人，认为身死后精真灵识处于似有似无状态，坠入知见颠倒产生的颠倒理论的外道中去。在色受想三蕴未破前，在静坐禅行中只有色有受有想；由于三蕴已灭，在静坐禅行中观精真灵识被行蕴所遮蔽，显现似有似无，动而不止，似无还有的状态。由此知见，对色受想行四蕴范围内，由前观后，由后观前，反复观察，观察到极点；得出了似有色受想行，似无色受想行，八种似有似无蕴相的结论。对色受想行四蕴，随便用一蕴来解释身死后的精真灵识处于什么状态时，都说有还不能清楚无的知见，都说无还能清楚有的知见确实存在。又以此知见推理处在行蕴中的精真灵识，流动变化，扰动无序；佛法认为这里有真我自性的存在，是谬误的以讹传讹。并以此为根据，心中生起通达宇宙万法的理悟，认为一切法则、众生、万物，都是有而无常，无常而暂有；最后归结于似无还有，似有还无，虚虚实实，根本没有把握的措施和方法。由此产生的似有似无的颠倒知见，昏茫而不着边际，走入无道可寻，没有出路的绝望境地。迷失了出世间的方向，惑乱不觉自有的佛性，创立了第八种外道的五蕴中死后俱非心颠倒理论。</p><p>　　佛接着说，静坐禅行正定的人，虽然天魔不得方便干扰禅行，而内心生起穷尽各类众生生死循环根本的念头。用阶段性和局限性的观察，对处于扰动无序状态下的精真灵识，最后的归宿是什么，妄加计数度量。这样的人，坠入七种断灭论中去；即七种断灭论为人身、欲界天人身、色界一禅欲尽天人身、二禅苦尽天人身、三禅极乐灭天人身、四禅极舍灭天人身、无色界四空天识灭处七种生命结束后，精真灵识的最后归宿，在宇宙中也随之销失，不真存在。认为精真灵识只能是依附于有色体无色识才有，体无识灭时，哪里还有精识灵真的存在。特别是根据禅定境界的变化，观察欲界、色界人与天人，生命结束后的精真灵识一少部分进入无色界，大部分精识灵真不知去处，认为断无灭失；同时，观察无色界因定力销失识灭后也不知精真灵识的去处，也认为断无灭失，这样的人，只观察人天的精真灵识，观察不到地狱里的精真灵识存在与轮回的状况；同时，又很难观察饿鬼与动物精真灵识存在的状况。这样的人，只观察三界内的部分精真灵识的存在状况，观察不到三界外十方佛刹众生的精真灵识的存在状况与诸佛菩萨自性存在的状况。由此有限计数度量产生的于后后无知见，迷失出世间的方向，惑乱不觉自有的佛性，创立了第九种外道立五蕴中死后断灭心颠倒论。</p><p>　　佛接着说，静坐禅行正定的人，虽然天魔不得方便干扰禅行，而内心生起穷尽各类众生生死循环根本的念头。用阶段性和局限性的观察，对处于扰动无序状态下的精真灵识，认为最后的归宿为身死心不死，心念相续不断。对此妄加计数度量的人，坠入外道的五种不来不往知见中去；即五种涅槃为，一是以欲界六欲天天人的天福正报，光明清净，心生爱慕，为究竟涅槃的境界；二是以一禅天的离生喜乐，苦恼不逼，天福享乐无尽，为究竟涅槃的境界；三是以二禅天的定生喜乐，忧愁不逼，天福享乐无尽，为究竟涅槃的境界；四是以三禅天的离喜妙乐，极大喜悦，得大随顺，天福享乐无尽，为究竟涅槃的境界；五是以四禅天的舍念清净，苦乐双亡，三灾不及，不受轮回，不见生灭，天福享乐无尽，为究竟涅槃的境界。这是由于众生长期迷妄颠倒，初见清净喜乐，愿力不远，念力不足，误把有漏天的安稳殊胜妙乐，为生死烦恼解脱所依的净土。在这样境界的误区来回打转，不能突破，还妄为自己证得无上佛道的究竟果位。由此有限计数度量产生的于后后有知见，迷失了出世间的方向，惑乱不觉自有的佛性，创立了第十种外道立五蕴中五现涅槃心颠倒论。</p><p>　　佛接着说，以上十种静坐禅行正心正定的人，都是在行蕴区宇里，将行蕴中出现的境界与贪求心交织在一起，相互作用下出现的理悟知见。由于众生顽固迷劣，自不量德，遇此境界现前，不能心转因缘，还自受迷惑而不觉知，自言证圣，大妄语罪过成立，待天福享尽时，必堕无间地狱。法会中的众弟子，要遵佛教诲，在佛入涅槃后，特别是末法时代，要弘传此经，开示众生明白此经法义，正心修行，不让自心内魔自起，造作无量深重罪孽，堕落无间地狱。要保护依法修行的戒体，销除因境界传出的消息而产生的偏知邪见。教其正行，身行正道，心行正见，开示佛法觉海中真实义理。在精进于无上佛道中途的静坐禅行人，不遭受走向枝梢和误入歧路带来的苦报。要教化众生有广大心，发菩提心；不要心有祈求，目光短浅，得少为足；以成就大觉法王为终极目标和出离世间的指南。</p><p>　　佛接着说，阿难你应知，静坐禅行正定的人，行蕴区宇已破，行蕴已尽。这时，在静坐禅行境界上，所观察到的诸世间法性幽深清净，和诸世间众生生灭共同所依及呈现生机的根本，即处于扰动状态下的精识灵真，于忽然之间毁坏，被完全的破坏掉；如失去总纲的网，沉入水底不见踪迹；又如圆大的物体失去纽柄，用手无法把握。与无量众生的宿业因缘，如深细很难摸到的脉搏，感应似悬浮搏轻，又感应似脉绝无搏。这时，于静坐禅行正定中，新的境界现前，进入识蕴区宇。出现于心安稳，如如不动，似不来不往的境界；自性中显现出的智慧，如漫漫长夜中迎来了东方黎明的曙光，并很快听闻雄鸡报晓的啼鸣。此时，内心的智慧，在身上的表现为，六根形同虚设，静如止水，不再奔驰放逸。内心的智慧与清净的身体相互吻合在一起，虽有六根对应的六尘，但根尘不偶，根转尘境，尘不入根。再用深远通达的智慧，观察各类众生得生受命的根本因缘。在观察中发现，如各类众生不受根本因缘的业习召感，于三界诸天同样可以持戒修行，获得身心清净，不入轮回；观察清幽的法界，妙秘的法性。这样的境界，就是识蕴区宇。这样的人，六结已解，一巾尚存；于众多因缘的召感中，已经不著两边，获得中道；六根在禅定力的作用下，销减魔力，磨合功用，达到眼耳鼻舌互为相邻又互相通，功用互换又自主功用的清净状态。这样的人观三界内清净的十方世界与自己清净的身心一样，如无瑕疵的晶莹琉璃，内根清净，外境明澈。静坐禅行正定的人达到这样的境界，可以破识蕴区宇，识蕴已尽；超越命浊。这时，如回过头来，反观识蕴区宇境界的根本因缘，仍然是处于似有似无，虚幻不实，以颠倒为本的妄想之中。</p><p>　　命浊为无量劫来，受无量生积累的习气，在有同有异、异同一体状态下作用于识，识随命转；既表现为一人一习性，万人各不同；又表现为受业习牵引而召感的不同形态的六道众生。</p><p>　　佛接着说，阿难你应知，静坐禅行正定的人，已经穷尽诸行蕴区宇里静坐禅行的定空境界，进入识蕴区宇。在识蕴区宇里，还有精进静坐禅行，求得回归本源。因为，虽然识蕴里的业习已经灭失，寂灭的境界现前；而与出世间寂灭为乐的境界相比，真精妙明的功德，尚未圆满。这样的人，身心清净，六根功能互用，能觉知世间诸众生之间虽然形体不同，而有相通的晶莹发光的识体；这个识体既圆融无碍，又是生机灭存的根本。在这样的境界里，如认为这个识体不能独立存在，必须有所依附，归位于有体，才是常住之因。对这样境界作殊胜理解的人，还没有证知出世间的常住无因，把三界的常住之因当作识体与色体的和合因缘，而有所执著。这样就与执著冥谛的外道成为伴侣；外道的冥谛为长生不老才是人的究竟所归处。这样会迷失无上佛道的菩提路，失去已经证得的正知正见。禅行正定的人，一旦在识蕴区宇里落入邪见，唯有值佛住世才能救度；否则，一言难入其闻，无人能度。这是识蕴区宇里生出的第一种邪见，妄立色身常住，而心有所得，成为自己追求并要达到的果位，违背并远离本自圆通的佛法，与出世间常住的不生不灭南辕北辙，背道而驰。本来可成为佛子，却因妄执成为外道种子。</p><p>　　佛接着说，静坐禅行正定的人，已经穷尽诸行蕴区宇里静坐禅行的定空境界，已经灭除诸习气，寂灭的境界现前；而与出世间寂灭为乐的境界相比，真精妙圆的功德，尚未圆满。这样的人，如以为证得这样的境界，就达到了自己所追求的果位，观三界如阅览自己的身体；又观诸世间一切众生，都是从自己识体中一一类出，轮回流动不止。对这样境界作殊胜理解的人，会坠入邪见能现这样的色身，也能现那样的色身，并执著于现身大自在的、大我慢的，又可现无边众生的外道为伴侣。这样会迷失无上佛道的菩提路，失去已经证得的正知正见。这是识蕴区宇里生出的第二种邪见，妄立有能力作为心，以虚妄能力成就虚妄的事相，妄为证得圣果，违背并远离了本自圆通的佛法，与出世间的不生不灭相背离，生到色界外道所居的大慢天，成为我能遍圆的外道种子。</p><p>　　佛接着说，静坐禅行正定的人，在行蕴已尽的境界里，如认为证得这样的境界，就达到了自己所追求的果位，并且有相应的国土为归宿和依止处；还怀疑自己的身心是从这个国土的识蕴中随愿力化现所产生，十方虚空也是从这个国土的识蕴中生起安立。既然世间一切都从这个国土识蕴中生起，所彰显无际为虚空，所流地为世界，就以三界作为自己所证真实存在的常住身，并把这个境界理解为不生不灭。而实际所证的境界是，识蕴未破，还在生灭法中，只是提前妄计为常住；自我狂惑为不生不灭，也妄迷于不生不灭；安稳的执著于已经沉迷的虚妄不实的境界。对这样境界作殊胜理解的人，会坠入邪见以识蕴为常并执著色身常住的自在天魔王波旬的伴侣。这样会迷失无上佛道的菩提路，失去已经证得的正知正见。这是识蕴区宇里生出的第三种邪见，妄立识蕴为常，妄依大自在国土色身为常，妄为证得圣果，违背并远离了本自圆融的佛法，与出世间常住的不生不灭相背离，生于欲界大自在天，成为颠倒知见的外道种子。</p><p>　　佛接着说，静坐禅行正定的人，在行蕴已尽的境界里，如认为境界里的所知所见，是自己的识蕴，尽虚空遍法界，圆融无碍；并依此知见妄立因缘，妄自推理邪解，认为一切草木也是自己识蕴中的产物，虽然不会说话，也有它们的交流方式，与人一样怀有情感，还认为人与世间的动植物同出自然法性，生命的根本都是识蕴。所以，人与草树没有什么两样。还认为草树枯死后，识蕴不灭，可以转化为人；人死后识蕴不灭，也可以转化为草树。虽然对情的表达方式不同，但都有知；如草树也有雄性和雌性，也有花粉的异性传播配合，才能产生新的种子，由种子再去繁殖。这里只把人与草木异性繁殖方式简单化，认为人与草树一样有情；混淆了人是由业识因缘召感而生；草树是罪识被神力震碎为渐后，由主草主树等不同的神，赋予器世间一切物质的能力属性。在识蕴的遮蔽下，不能了见、彻见宇宙间奥秘根源；只能凭事物的表面现象而无根据的推理选择，就妄断为遍法界普遍存在的真理；并以此确立自己的知见。对这样境界作殊胜理解的人，会坠入邪见似知而实无知，还执著无知，以被称为避去、有军的两种外道为伴侣。用自己虚妄执著的假明白、真糊涂的世间一切有情的知、见、觉，把自己引向识蕴中的死胡同；迷失无上佛道的菩提路，失去已经证得的正知正见。这是识蕴区宇里生出的第四种邪见，一切草树有情的虚妄知见，还把境界中出现谬误知见妄为证得圣果，违背并远离了本自圆通的佛法，与出世间常住的不生不灭相背离，成为颠倒知见外道的种子。</p><p>　　佛接着说，静坐禅行正定的人，在行蕴已尽的境界里，把识蕴未尽的境界误认为是圆融无碍的自性，并把六根圆融的功能互用，和自己证得的大随顺融会贯通为一体，便圆融的化现出世间一切现象。以此圆融造化之理，对祈求得到光明的人，便可示现出大火炬，照亮十方；对喜乐得到清净的人，便可示现出一潭清水静而无声；对欣爱得到游动的人，便可示现出习习凉风，爽而不吹；对心愿观尘凝思的人，便化现晴空静室，空旷神怡。总之，可以化现出满足不同的人喜欢得到或崇尚的事物。把这些识蕴圆融化现出的六尘影事，误当作自性圆融的因缘，妄作常住殊胜理解。这样的人，会坠入邪见，以大龟氏和婆罗门的外道为伴侣，用这种化现出万事万物的识蕴圆融，对事物本身是无生，可随时随地随因缘而灭；而把化生执著为能量的自然生。由此迷失无上佛道和菩提路，失去已经证得的正知正见。这是识蕴区宇第五种邪见，执著受人崇拜，心迷恋于物理造化，以妄求妄，骑马找马，还妄图冀求得到圣果；违背并远离了本自圆通的佛法，与出世间常住的不生不灭相背离，成为执著颠倒化现的外道种子。</p><p>　　佛接着说，静坐禅行正定的人，在行蕴已尽的境界里，把识蕴未尽的境界认为是圆融无碍的自性，妄自计度推理，认为光明充满的虚空，才是常住而不生不灭处，又是宇宙中万事万物生成、变化、存在处。以形色身体的永远灭失，仅以识蕴常住为归宿和所依止处。对这样境界作殊胜理解的人，会坠入邪见，误把无依无归的以识蕴存在的无色界四空天当作有依有归的清净国土，以非想非非想天的虚空之神为伴侣。从而迷失无上佛道的菩提路，失去已经证得的正知正见。这是识蕴区宇第六种邪见，执著四空天虚空为圆融心识常住的国土，成就了依空而住的心愿，却亡失了本可证得出离世间的圣果。违背并远离了本自圆通的佛法，与出世间常住的不生不灭相背离，成为执著于断灭的外道种子。</p><p>　　佛接着说，静坐禅行正定的人，在行蕴已尽的境界里，把识蕴未尽的境界，认为是圆融无碍的自性已证常住，便加强对色身的修炼，再留住固有色身的常住；把识蕴与色身结合为长生不老的有识之体，与宇宙同存，永不逝去。对这样境界作殊胜理解的人，会坠入贪求色有长存而又不能长存的偏执邪见中去，以无比长寿仙人为伴侣。从而迷失无上佛道的菩提路，失去已经证得的正知正见。这是识蕴区宇第七种邪见，执著识蕴为立命的根本，贪求色身长生的固形长寿为圣果报；因而成就了与长寿仙人一样的有劳有酬天乐果报。违背并远离了本自圆通的佛法，与出世间常住的不生不灭相背离，成为于执著寿命虚妄延长的外道种子。</p><p>　　佛接着说，静坐禅行正定的人，在行蕴已尽的境界里，观察识蕴是一切众生生命的根本，可以相互轮回通用。就是认为一切众生都有识性，喜生惧死；又都内有欲望，外有满足贪求的条件。在这样的境界里，见法界有缝隙可以利用，抓住机遇便可留住身形识体，得到客尘环境条件的享乐与满足。如人没有生命，再好的环境条件也与己无关；还不如生命存在一天，就享乐一天。由此心里产生恐其身体销损，惧其命灭，对尘世享乐尽失；便于此时，利用证得的识蕴圆融神力，于虚空中变现出莲花宫殿，广化奇珍异宝，多增妖艳美女，恣情纵欲，放逸其心。对这样境界作殊胜理解的人，会坠入妄以识蕴真常而实相不是真实的偏知邪见中去，以结缚和我所作之类的天魔为伴侣。从而迷失无上佛道的菩提路，失去证得的正知正见。这是识蕴区宇第八种邪见，执著邪思，贪纵欲心，妄以识蕴的尘劳享乐为证得圣果。违背并远离了本自圆通的佛法，与出世间的常乐我净相背离，成为执著颠倒欲乐的天魔种子。</p><p>　　佛接着说，静坐禅行正定的人，在行蕴已尽的境界里，对于一切众生生命轮回的根本因缘，已经观察明白，是由贪求造作的颠倒妄习所自我召感。在这样境界的观察中，可以辨识怎么修行是圣道，怎么造作是凡夫；在取舍的疏密中抉择，去伪存真；知因与果之间相互酬劳，因作果，果又为因，循环不止，报应不爽。这时，唯依精进，真修实干，以求证得圣果，于三界中不生不灭，常乐我净。由于只知自己修行证果，而没有发起清净的菩提心，上求出世间的唯一佛乘，下生愿心救度众生。只见世间诸苦相逼，为了断集中而来的生死烦恼，而又集中全部精力修行，以求达到灭掉诸苦，于生死烦恼中解脱出来，而证得道果。一旦达到了所求证的目标，就不再精进，开始休息，享乐天福，得少为足，自扫门前雪，不管他人瓦上霜，更不求继续修行，上报佛恩，下报众生恩。对这样境界作殊胜理解的人，就坠入定性声闻，即钝根阿罗汉；如是不能听闻佛法，开启智慧，就停留在五净居天享受极其殊胜的妙乐，与无闻比丘或增上慢的天人为伴侣。迷失无上佛道的菩提路，失去证得的正知正见。这是识蕴区宇第九种执著离苦得乐的知见，虽不是外道；但最终定力销失，天福享尽时，与无色界的外道仙人果报一样。违背并远离了本自圆通的佛法，与出世间的常乐我净相背离，成为被空束缚的种子。</p><p>　　佛接着说，静坐禅行正定的人，在行蕴已尽的境界里，如三界内证得身心圆融，生死往来无碍，对清净诸法性觉悟明了；在寂灭的法界空性中，不去继续精进静坐禅行，求得出离三界；而是继续探求深空妙理。如不能将法界的深空妙理探求明白，就以此执著为常乐我净的国土；而不发清净无为的菩提心，上报佛恩，下报众生恩。</p><p>　　讲到这里，奉劝诸位要读诵此经前几卷，要明了此法界是佛为度脱众生安立的道场，不是任何人享乐的终点，只是暂时停泊的港湾。必须发菩提心，成就自性佛的国土，才是了义究竟。</p><p>　　佛接着说，对证得这样境界作殊胜理解的人，如值佛住世就坠入为缘觉，如不值佛住世就沦为独觉。以色究竟天的辟支佛为伴侣，享乐天福，探究法理；如发菩提心而出离三界，了见佛性后，法理自明；否则，不识庐山真面目，只缘身在此山中。因而迷失无上佛道的菩提路，失去已证得的正知正见。这是识蕴区宇第十种执著探求自心和法界的妙理，成就清净光明的世间极圣果位。虽不是外道，但天福享尽，定力销失时，还要坠入轮回之中。所以，违背并远离了本自圆通的佛法，与出世间的常乐我净相背离，成为三界内接受不到法化的圆满天福的种子。</p><p>　　佛接着说，以上十种静坐禅行正定的人，都是修行至中途，因出现善境界不知弃舍空掉法理，而是妄自贪求执著，脱离正修，产生偏知邪见，并受其迷惑，得少为足，小富则安。究其根源，都是由于识蕴区宇虽然习气灭失，而习气之根未除；一旦机会成熟时，贪求习气又现，与识蕴相互作用，才产生各种不同天人的位次。众生习气顽固，心昧愚迷，又自不量德，遇到善境界现前，各有所爱，各取所爱，各执所爱，贪求的习气迷惑心智，在各自喜乐的不同天体上休息享乐；还妄自认为证得了究竟，回归到清净的国土；自言功德圆满，已证无上佛道，大妄语罪过成立。一切外道邪魔天福享尽时，受业习召感，堕无间地狱。声闻缘觉如停留在天福享乐上，不再继续增加功德，不再精进修行，当天福享尽失去定力时，又入轮回。法会中的众弟子，要存救世的慈悲心，秉承佛度众生的愿力，将此楞严修行方法和解脱之门，在佛入涅槃后，特别是末法时代，要广泛流传此经，开示众生，觉知佛法义理，不让天魔毁坏静坐禅行的正定，也不让内魔自毁菩提。保护、安抚、哀告、救度诸修行人，让诸修行人及时自觉消息，销除邪见因缘，保持身心清净，入佛知见，依法持戒修行，从开始启步就发心有远大目标，不贪小利小善境界，避免于中途迷失方向，走向歧路。</p><p>　　有人问，人生为什么会有很多失败？从有为法上讲，成功的同时，相伴生的就是失败。道家讲，无为而治，顺其自然；就是不人为的求得巨大成功，也就避免了人为的巨大失败。从无为法在世间上讲，一切无为蕴于有为之中，把有为的重心空掉，产生圆融的无为；根本就没有成功，哪里来的失败！如不倒翁，没有重心，又都是重心。</p><p>　　有人问，您是成功者，还是失败者？我没有成功，自然也就没有失败；如为随顺世间，我做人是失败者，认识自我是成功者。在无量的失败中，唯一的成功是，坐在家里，认识自我。如谁再问我，怎样才能成功？我只会讲，成功在于当下，在于找到回家的路。</p><p>　　佛接着说，破除上述五十种五蕴魔的修行法门，是过去无量劫中的无量诸佛，深心修行，开悟智慧，证得无上菩提道的修行法门。如修行人，破除识蕴区宇境界，自性的功能作用则会显现，在禅定三昧中，不受诸根的限制，自性出离三界，入菩萨乘，一路精进修行下去，直至证得等觉菩萨的金刚干慧。在修行菩萨道的过程中，自性中圆明的智慧，精心的福德发挥作用；如透明清澈的琉璃宝器内含有的宝月，明了如故。就这样按照次第品位逐步超十信、十住、十行、十回向、四加行、十地菩萨，达到等觉菩萨品位，成就佛的无上妙宝庄严。</p><p>　　佛有无上妙庄严<a href=\"/remen/sande.html\" class=\"keylink\" target=\"_blank\">三德</a>，即报身智慧德，法身福报德，化身无碍解脱德。自此功德圆满，本觉合一，超然于宇宙中，常乐我净。</p><p>　　佛说，破除五十种五蕴魔事的修行方法，是过去无量诸佛在因地修行止观时，妙觉观照，清析辨别的微细魔事。用世俗的话讲，是无数过来人于无量长时间内总结出来的颠覆不破的真理。告知后来人，一旦有魔境现前时，能够熟悉的认识觉知到；再将贪求执著的心垢清洗除掉，恢复清净的身心，胜境不作圣解，就自然远离魔事，内魔不起；从而不能落入邪见。</p><p>　　佛接着说，如身心中的五蕴魔事销失灭净，天魔自然被自性清净光摧毁身形，震碎宫殿；大力鬼神都魂飞魄散，失去神力；魑魅魍魉诸小鬼销声匿迹，不敢复出。在成就无上佛道的修行路上，再无得少为足、乏力休息、下劣贪求、执著善境、心迷身闷等事；而是勇猛精进，直奔大涅槃城。</p><p>　　佛接着说，如在末法时代，由于众生业力转重，愚痴无智，根基钝劣，不修静坐禅行，当然不知也不能辨别禅定中的各种魔事。再有，不读诵佛经，不听闻法师讲法，更无法知道佛于法会中所说破除邪见与魔事的法门。虽然有部分人，喜乐修行禅定，求得解脱，难免遭遇邪见与魔事的干扰。还有，对末法时代的诸修行人，一定要诵持楞严咒；对不能诵持的，要写于禅堂或戴在身上。只有这样作，金刚藏王菩萨及其眷属，才能日夜护佑道场，保证不给一切诸魔干扰破坏的机会。法会中众弟子，要恭敬此经如十方诸佛一样，依法修行，用身体禅行正修，作好最后的垂教示范，让正法久住于世。</p><p>　　这时，阿难听闻佛开示后，顶礼赞叹！同时向佛请法说，一是五蕴相中有五种妄想，为根本想心；为什么众生都以此妄想心为根本？二是要灭除此妄想心，是一次灭除，还是逐渐灭除？三是五蕴有无边际？请佛慈悲，既开示法会大众增长智慧，又为未来世众生作修行成就的法眼。</p><p>　　佛说，众生自性，本自具足福慧，不受生死和尘世诸苦，乃至三界虚空也无法留住。可是，无始劫来，都是因一念无明妄动，造作诸业，受业习召感，才召感有情世间与诸器世间，不同因果，不同报应。众生于诸世间，忘失本性，流转生死，迷头认影，无法出离。于妄想颠倒中，不知、不见、不觉自性的存在，而去执著虚无实义的因缘；讲虚无实义的因缘，是针对因缘无常而言。在心里充满欲望和贪婪的状态下，为得到物质和精神二方面的满足而奔忙造作，费尽心机，巧弄手段；在世间相对的法则中埋下了因缘的种子，成为迷因恋缘的人；这时，还不承认因是自己创立的，缘是对因的回应，缘又是因的开始；还自认为因缘是自然随机产生的。就如众生所处的时间与空间，表面上无法选择，完全是自然因缘产生，而实际也是由众生造作的业习幻化而生，以妄心与颠倒知见算计度量所幻生。</p><p>　　时空如何幻化；时间是人为算计设定的，有不同的计算单位。众生自己占有的时间是相对的；而静坐禅行入定真空的瞬间，不觉时日或无时间的概念；简言之，此世界时间是相对存在的，佛国土的时间是人为强加的；既是强加的，也是无限的、单一的、无为的。根据众生业习的不同，空间的存在也不同。此世界所处的空间也是相对的，是星球之间磁引力不同作用下的空间；在距离星球以远的外太空中，空间处在另外一种状态；在银河系内的太空中，都是处在什么状态，佛对不同天体上的众生和所处空间的法则性质说的很详细。那么，银河系以外的太空中，存在的外星系与空间又是处在什么状态，宇宙中又有无量的星系与空间，又都处在什么状态，以人类的智慧永远也无法回答；只有佛可了见、明见。可以讲的是，宇宙的星系不同，空间的法则与作用力也不同，生命现象的状态也不同。人类只有依佛法持戒修行，了见自性，才可以不受此世界虚空限制，自由超越并往来于相对虚空和无限虚空，以另外一种生命体而存在。</p><p>　　佛接着说，无始劫来，无法测知众生的妄想是从什么时间生起的，从产生根源上，只能说是妄想为因，颠倒为缘。如是根本不存在妄想颠倒的因缘，如何理解众生的存在？在无法知晓众生因何存在的状况下，怎么能推理为自然产生的呢！所以，佛今日在法会上，对众弟子说，众生轮回是因缘生，五蕴根本是妄想生。如人的身体，先由父母有欲望所想和欲望满足，因缘和合而生；如人的中阴身无有求生的欲望和欲望的满足，父母无有因缘，就不会有人的身体；或父母有因缘生人的身体，生命中投胎的中阴身也有区别，分出你我他等。如佛在前文说过，人心想美味，口水流涎；心想登高，腿脚打颤；如没有美味，也没有悬崖，心中无想，怎么会有身体的反应变化呢！由此，要知道人的色身，是第一坚固妄想；也由此产生色蕴。还以此悬崖与登高作比喻，心中有想而身体有反应变化，是因为身体感受不同作用于记忆，由记忆而联想，才产生身体的反应变化。这种身体的反应是，顺益违损；如饿了想食，饱后感受很好；饿了想食，而食不到，身体感受就不舒服；再如有人恭敬礼拜，心生欢喜；有人诽谤，心生怨恨等。人的身体为乐受与苦受所驱使而奔波劳碌。这种乐受与苦受却是暂时现象，人的身体是假躯壳；所以，感受也是虚假智慧的反映。这是第二坚固妄想；也由此产生受蕴。由于人的意识有分析思考能力，从而产生主意支配身体活动；但身体是有形有色，而主观意识与无形无色，不是同一范畴。那人有形的身体为什么受无形的念头控制驱使呢？是人体六根对外部事物的色想与色受而产生反应，形成印像，对有形有色的物品选择，是与人感受的念头相适应。在人心里的<a href=\"/remen/seyu.html\" class=\"keylink\" target=\"_blank\">色欲</a>和物欲印像，使人醒时思考对比，连睡觉在梦里也会有联想的妄情妄贪。这样的色受印像已经刻骨铭心，融化到血液里。这是第三种坚固妄想；也由此产生想蕴。人的身体变化，谁的主观意识也不能使其停止下来，指甲要长，头发要长，年少血气随年龄增长要日益销减，使容颜出现皱纹，日夜不停的变化，而这些生理变化还发生在人无觉知的情况下。如说身体是真我，为什么日夜的生理变化发生在不知不觉之中；如说思维心是真我，为什么念生念落想停都停不住。这是第四种坚固妄想；也由此产生行蕴。如人的身心是真我，就会充满智慧，清净无染，不受外面的事物所动摇，这才是永恒常住之体。这样的真我之体，于身不会出现见闻觉知这些生理现象，于心不能容下诸多贪婪的妄习。所以，这个身心不是真我，才有见闻觉知和妄习存在。如人于过去的时间里，见到一件新奇物品；经过多少年之后，记忆中已经忘记；可是突然某一天，又重新见到此物，立刻就回忆起当初的情景，每个细节都历历在目。这说明，人的念念入脑，大脑受念念的影响，又去筹划算计。这些大脑中清楚的记忆，不是真我。这种现象，如远望江水，清静恬息；近见有流，而水下更急。人的意识也是这样，表面似平静和缓，而内心并非安宁，妄想纷飞，汹涌澎湃。这些现象不光是人体的六根，功能相互作用产生的，而是对见闻觉知存储于记忆中的信息，经过加工筛选，抽象综合，有机串联起来的反应。有些事内心记忆了然，外属客尘虚妄不实。这是第五种存储于心识里颠倒的妄想；也由此产生识蕴。</p><p>　　色受想行识这五蕴，都是六根接受六尘有入产生；所以，也称五受蕴。产生五受蕴的根本，是由上面五种妄想生成。如想知道五蕴产生原因的界限与程度，还是离不开五蕴。色蕴是事物占有空间而产生，受蕴是有形体之触与无形之触感入而生，想蕴是对信息的记忆和忘失而产生，行蕴是一切生与灭而产生，识蕴是清静与混杂入而累积产生。</p><p>　　佛接着说，五蕴产生的根本，是内根外尘相互作用下，重复叠累由心受而生；生成的五蕴又因为人有识别功能而有。如从人的身心中灭除五蕴，首先要从灭除色蕴开始；然后再按顺序逐个灭除；即色蕴灭后，才能再灭受蕴；灭受蕴后，才能再灭想蕴；灭想蕴后，才能再灭行蕴；灭行蕴后，才能灭识蕴。五蕴的灭除，不是理论说灭除就能灭除，而是要在静坐禅行定空中观察诸法空相后，才能逐渐突破，逐渐舍弃；胜境生而无贪，天乐现而无求；心念起而舍，因习立而弃。</p><p>　　理可顿悟，道可渐修。如一念顿悟，就锲而不舍，依唯一佛乘修持下去，一定会有五蕴灭除的那一天。但是，又不能急于求成；无量劫来所积尘垢，哪有一时就还清；次第清洗依禅理，定能恢复自性身。晴空万里似空无，一旦雷起云涌处；暴水狂风有灾成，劝君莫毁菩提行。</p><p>　　佛接着说，已将一巾六结的法理开示明白，五蕴都是由妄想生，一旦心开得性圆通之理，就可次第灭除。要将今日所说法理，流传后世，开示末法时代的修行人；让他们明白，五蕴虚妄，不要执著色身五蕴；法界中真实存在出世间的清净佛国土，也真实的存在有佛道可以成就，也真实的存在常乐我净的佛体。不要认为佛法僧三宝是空虚的精神存在，或是不实的理论；不贪恋三界诸有，逃离火宅可安生。</p><p>　　佛接着说，佛问阿难你，如有人以七宝遍满十方虚空，供养无量诸佛，所得福报有多少呢？阿难回答说，往昔有一人供养佛七枚铜钱，命终后生为转轮圣王；何况如此供养佛，可得福无有边际。</p><p>　　佛说，诸佛语无虚妄，真实可信；如有人身犯杀盗淫妄四种根本重罪；同时，还犯有菩萨十重戒；即杀戒、盗戒、淫戒、妄语戒、酤酒戒、说四众过戒、自赞毁他戒、悭惜加毁戒、嗔心不受悔戒、谤三宝戒。在即将落入阿鼻地狱之前，有一念愿将此经佛说修行法门，于末法之中开示有学众生；这人无有尽期的地狱罪障应念销灭，苦报之因立即转变为往生佛净土之因。这人所得福报是前面有人以七宝供养佛福报的千万亿倍。如有人能诵持楞严咒，所得福报，穷劫不尽。如有人依此经法门修行，心不起执著，放下贪求，可以直至证得出世间圣果，不会遇有诸魔事。佛说完此经，法会大众，皆大欢喜，作礼而去。</p><p>　　有人问，弘法利生有多大功德？准确的说，没有功德。就如遇见一个问路人，顺手指了指方向。问路人找对了方向，到达了目的地。指路人不违良知，尽人本分。有人问，佛怎么说弘法利生的功德大呢？佛说弘法利生的功德大，是出世间的无为功德；弘法者在唤醒自性，恢复自性具足的无量功德；同时让众生也回归自性。有人问，您讲法的原则中有一句“愿将心滴之血，供众生饮浆”，怎么理解？此心滴之血非一人之感，无量弘法者各自有点滴。汇集入江河，虹炫贯古今；世代有承传，周留遍法界。再用一首偈语供养同仁，也作为浅释此经的结束语，与诸位共勉：一字一滴血，字字血染成；劫满流不止，愿遍虚空刹。一句一甘露，句句甘泉涌；捧献众生前，为遵佛累嘱。感谢诸位拥护道场！</p><p>　　回向： 天仙不坠，国主清宁。世界和平，人民安康。法界有情，念佛同音。智心圆成，同证佛境。</p></div>"
}]